{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Base",
      "DisplayName": "Rawr.Base"
    },
    "ClosedComment": "Old issue.",
    "ClosedDate": "2009-08-08T06:55:23.493-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "Hey,\n \nSo I've been playing with the optimizer, various gear mixes, and the Character Profiler feature that loads entire inventories.\n \nOne thing that I've noticed is that you can \"lock\" an encant on an optimizable item, which gives it the little red dot, but there's no obvious visual cue as to whether the locked enchant matches the enchant that you currently have selected.  This means that if you choose an item equip it, you may not necessarily be equipping what you have selected for optimization.\n \nThere are two potential changes here, and I feel more strongly about the first, the second is optional in my mind.\n \nThe first change is the little dot should be one of two colors.  The existence of the little dot tells the user whether there's a locked enchant for that item.  The color of the little dot tells the user whether the enchant matches their current enchant for that slot.  (green dot = matches, red dot = doesn't match?)\n \nThe other change that I'm unsure about is whether equipping an item from the list that has a locked enchant should automatically cause that enchant to be selected.  It's a tradeoff between \"Equip this item exactly as it's configured,\" or \"Equip this item as my character is configured.\"  Currently the UI is a bit inconsistent -- since gear items are broken down by gem combination, selecting from the right list selects a specific gemming, but there's no way to select a specific enchant of something too.\n \nChar",
    "LastUpdatedDate": "2013-05-16T05:27:03.19-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2008-08-15T18:10:28.58-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Base] Locked enchant for a slot \"dot\" should be different colors",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 11029
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Incidentally, I don't mind implementing this, it's just a question of whether someone has an objection.",
      "PostedDate": "2008-08-16T11:06:25.12-07:00",
      "Id": -2147483648
    },
    {
      "Message": "First one sounds fine, the 2nd one not.",
      "PostedDate": "2008-08-16T11:23:50.837-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2008-08-16T13:46:43.697-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-08-08T06:55:23.493-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-03-17T20:44:23.38-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:36:34.297-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:27:03.19-07:00",
      "Id": -2147483648
    }
  ]
}