{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Moonkin",
      "DisplayName": "Rawr.Moonkin"
    },
    "ClosedComment": "4.1.05 Released. If this is still an issue, please reopen with exact steps to reproduce and any necessary character files",
    "ClosedDate": "2011-05-08T21:37:15.8-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "Current gemming templates contains quite few duplicates and some weird ones like  Red/Yellow/Red.   Also, there are only Int/Hit gems and no Int/Spirit gems which are preferred for those with a resto off-set.\n \nThe templates should probably be :-\n \nRed_____Yellow_______Blue______Prismatic_______Meta\n Int________Int__________Int__________Int_________Burning\n Int______Int/Haste_____Int/Spi________Int_________Burning\n Int______Int/Mastery___Int/Spi________Int_________Burning\n Int______Int/Crit_______Int/Spi________Int_________Burning\n \nYou could add templates for Int/Hit blue gems for those who prefer Hit to Spi for a possible increase in Treant damage (not sure about this)  or possibly Int/Stam blue gems.    I personally feel the 4 I have listed would be fine for the vast majority of users.",
    "LastUpdatedDate": "2013-05-16T05:18:04.997-07:00",
    "PlannedForRelease": "Rawr 4.1.04",
    "ReleaseVisibleToPublic": true,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2011-05-02T01:29:32.99-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Moonkin] Default gemmings could do with some work",
    "Type": {
      "Name": "Feature",
      "Id": 1
    },
    "VoteCount": 1,
    "Id": 20614
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Nothing weird with red/yellow/red...  Sometimes blue sockets are not worth filling.  Actually, they are usually the ones _least_ worth filling because, if you can get hit capped outside of gems, there is no blue stat worth giving up 20 int for.  Duplicates are probably because the epic gem templates are currently using the rare gems (because epic gems aren't in game yet); check and see if that's the case.  Int/Spirit should be in there, but I will double check that later.  I might've removed that back when I believed that Treants didn't inherit hit from Spirit, which they do.",
      "PostedDate": "2011-05-02T11:54:36.54-07:00",
      "Id": -2147483648
    },
    {
      "Message": "With regard to the duplicates, in the rare templates the first three RYB templates listed are all identical  Int, Int/haste, Int/Hit.   Then the next two are both Int, Int/Crit, Int/Hit.  Then the next three are Int, Int/mastery, Int/Hit.   These are all Rare templates so nothing to do with the lack of epic gems.\r\n\r\nWith regard to the RYR templates, you are either going to match for a socket bonus or not.   If you are not, then you will just go with RRR.   If you are going to match then you will use a RYB template.    You would never gem something RYR because that wouln't get you a socket bonus so you would be better going RRR.    \r\n\r\n\r\n\r\n",
      "PostedDate": "2011-05-03T17:35:32.873-07:00",
      "Id": -2147483648
    },
    {
      "Message": "The gemming templates likely have different metas, or did at some point in the past.  I'll take a look at it.\r\n\r\nAs far as RYR vs RYB goes, I see your point, but I'm probably going to leave it in for completeness' sake.  If, for example, you want to explicitly disallow matching all blue sockets, then you can enable RRR and RYR and it will match items that have red and yellow sockets (if it's worth it).",
      "PostedDate": "2011-05-04T05:32:49.26-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Fixed in latest source, as per my last comment.",
      "PostedDate": "2011-05-05T06:38:24.103-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-05-08T21:37:15.8-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:25:11.527-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:18:04.997-07:00",
      "Id": -2147483648
    }
  ]
}