{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.DPSWarr",
      "DisplayName": "Rawr.DPSWarr"
    },
    "ClosedComment": "Duplicate http&#58;&#47;&#47;rawr.codeplex.com&#47;WorkItem&#47;View.aspx&#63;WorkItemId&#61;17445",
    "ClosedDate": "2010-05-26T21:30:01.033-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "Please do not close this again without reading the below information and looking at the posted character!\nUsing 2.3.15: Setup - Load attached toon, verify buffs (drums wild/kings, toughness, Luck of Draw and STR food) and fight time of 240 secs (4 min); notice DPS is 4005, select Current Buffs for R side.\nGo to Options on L side and select Ability Maintenance. Check Battle Shout (4 min dur.), small changes on R side and DPS drops to 4004 (1 DPS average lost due to 1 lost GCD), no other changes.\nDeslect Battle Shout and select Commanding Shout (2 min dur.), small changes on R side, DPS goes back to 4005 then drops to 4003 (2 DPS average lost due to 2 lost GCD), no other changes.\nLeaving Current Buffs on R side, go to Buffs on L side and select Commanding Shout; Commanding Shout appears on R side but shows 0.00; notice Surv. was at 842 and stays there after buffing.\nDeselect Commanding Shout from the Ability Maintenance, notice DPS goes back to 4005 and Surv. goes up to 897 and shows in Current Buffs on R side as a 55.13 increase.\nDeselect Commanding Shout (Surv back to 842), Select Battle Shout, DPS goes from 4005 to 4278 and Battle Shout shows in Current Buffs on R side as a 273.19 increase.\nSelect Battle Shout under Ability Maintenance Tab, Battle Shout on R side drops to 0.00 and DPS drops back down to the aforementioned 4004 DPS.\n \nConclusion: The Warrior character ONLY gains from Battle Shout and Commanding Shout IF they are maintained by someone else in the party and not by themselves.\n \nSunder Armor shows similiar effects but is only a 48 DPS increase when applied and maintained by the character (and does not show up on R side under Current Buffs) versus a whopping 326.79 Buff when applied and maintained by a party member (which does show up on the R side under Current Buffs);\ntherefore maintaining Sunder Armor costs me ~279 Damage Per Second and costing the warrior almost 67K (~66960) damage over a single 4 minute fight. (WOW, thats a big loss ~7% of Boss HP).",
    "LastUpdatedDate": "2013-05-16T05:20:49.893-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2010-05-01T15:30:04.213-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[DPSWarr] Buffs and Abilities",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 17511
  },
  "FileAttachments": [
    {
      "FileId": 3482,
      "FileName": "Turambar Fury.xml",
      "DownloadUrl": ".\\3482"
    }
  ],
  "Comments": [
    {
      "Message": "Just an update for version 2.3.17. Maintaining Battle Shout costs my character 284 DPS (6.4% of my total) and Sunder Armor cost 294 DPS (6.6 of my total) for a combined 578 DPS loss (13% of my total). So during a 4 minute fight I am supposedly losing almost 139k damage by maintaining these two abilities.",
      "PostedDate": "2010-05-17T21:03:26.287-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-05-26T21:30:01.033-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-07-09T12:30:42.78-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-09-08T16:08:54.537-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:28:35.53-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:20:49.893-07:00",
      "Id": -2147483648
    }
  ]
}