{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Retribution",
      "DisplayName": "Rawr.Retribution"
    },
    "ClosedComment": "Feature already present.  No further comment from poster if this solved the issue or not.",
    "ClosedDate": "2010-04-18T07:00:38.35-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "(ripped out from http://rawr.codeplex.com/WorkItem/View.aspx?WorkItemId=16041  to keep one topic for one matter)\n \nI found some different FCFS-rotations for a retribution paladin  here http://elitistjerks.com/f76/t68951-retribution_updated_3_3_a/#The_Basic_Rotation__\ndepending on which setboni you are using.\n \nI imagine that to cause problems the other way round.\nLets say i have the 4p t9 rotation marked, and let rawr calculate upgrades, why should it think of t10 full/half boni? \n \nTherefore i think we should have another toggle to optimise for rotation as well. I already have those three in the options tab under FCFS rotation, its just not being used in the optimisation process .\nI know Jothay said, it would be hard to create an option like this globally for all models , but i still think it would be worth a lot if you did it for retribution paladins.",
    "LastUpdatedDate": "2013-05-16T05:21:12.78-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2010-03-31T00:46:28.587-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Retribution] Add Option to optimise rotation as well",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 17041
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "It's there already.\r\nYou have to define the possible rotations you want to evaluate first.  Then the calculations will try all of your defined rotations and will pick the best of those.\r\n\r\nDue to performance reasons if's not viable to have rawr try each and every of the possible 720 permutations of the rotation on every calculation, which is why you need to tell rawr which few it does need to consider.\r\n\r\nThere is a chart available that will give you the DPS for each possible permutation using your current gear, but be aware this can give some strange results that just happen to be edge cases that somehow align right in the \"perfect\" world of simulation but would be horrible in the real world.  Additionally, rawr.retribution doesn't model mana management, so any rotation with judgement near the end will not be sustainable.",
      "PostedDate": "2010-03-31T00:55:47.34-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-03-31T03:53:37.693-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-04-18T07:00:38.35-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:29:02.5-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:21:12.78-07:00",
      "Id": -2147483648
    }
  ]
}