{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.DPSWarr",
      "DisplayName": "Rawr.DPSWarr"
    },
    "ClosedComment": "You either deactivate&#47;deleted your gemming templates or your turned off all your filters",
    "ClosedDate": "2010-12-20T04:43:42.79-08:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "Hello guys, I used the search engine and I have been clicking around in rawr alot, but I can't find any more items. It seems like the warrior module doesn't contain any more items than those that get automatecially imported via your character (basically the items you have equipted). Hence I can use it to search for better ways of reforging and gemming and I can add new items manually too, but I am stuck with a very limited list.",
    "LastUpdatedDate": "2013-05-16T05:19:32.503-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2010-12-20T04:02:10.707-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[DPSWarr] Empty Itemlist",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 19360
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Excuse me if I am bugging you, but I atleast tripplechecked the filters now. They are fine. The gem templates indeed seem to be a bit off, they are still the WotLK ones. When I add a new template with current gems, that doesn't make the other items appear either. If I manually look into the item database it appears to be empty too, although I reseted the filters now too, except for the items from my character. I have the strong feeling it's not just me using the wrong filter or gemming template. There is no gemming template that is making sense in my build of rawr and the filters are on default. I am using the webbased one at elitejerks ofcourse, btw.",
      "PostedDate": "2010-12-20T05:32:45.033-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Sorry for the double post. I just tried it for the elemental shaman char of my girlfriend. Same issue there, except rawr says all her items are worth zero dps. Weird.",
      "PostedDate": "2010-12-20T05:35:49.263-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Hm, if I hit \"Install offline\" nothing happens at all. I just updated Silverlight, I really don't know what I could have done wrong.",
      "PostedDate": "2010-12-20T05:38:05.263-08:00",
      "Id": -2147483648
    },
    {
      "Message": "If you are still seeing WotLK templates you need to reset all your caches from the Options menu",
      "PostedDate": "2010-12-20T06:30:00.987-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Thanks, that fixed it all for me - I am 99,9% sure tho that I didn't edit any crazy WotLK things in. Is the cache reseted on every new release, or did I maybe have a messed up cache from a long while ago?\r\n\r\nOne problem is still there tho: the gemming templates of the defwarrior, atleast, seem to be out of date, they are still back at WotLK, after resetting the cache multible times. That's no big thing tho, I got all the items listed there and access to all gems to add them by hand, so it's all fine.",
      "PostedDate": "2010-12-20T07:02:30.3-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Yep, it's working fine with dps warrior and druid builds, it's only the protwarrior that seems out of date there.\r\n",
      "PostedDate": "2010-12-20T11:58:00.48-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-03-17T19:11:26.157-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:27:02.923-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:19:32.503-07:00",
      "Id": -2147483648
    }
  ]
}