{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.ProtPaladin",
      "DisplayName": "Rawr.ProtPaladin"
    },
    "ClosedComment": "New Talents file for 2.2.20 already created, if this issue remains after 2.2.20 release, please re-open or resubmit with new relevant data",
    "ClosedDate": "2009-10-01T08:52:13.35-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "In Rawr 2.2.19, the talents are not updated to the latest WoW revisions.",
    "LastUpdatedDate": "2013-05-16T05:24:06.64-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2009-09-26T10:52:35.75-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[ProtPaladin] Talents not updated to latest",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 2,
    "Id": 14270
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Post what's no longer correct and I'll drop the info in. Would be great if you can submit a patch to that effect as well.",
      "PostedDate": "2009-09-26T22:39:07.47-07:00",
      "Id": -2147483648
    },
    {
      "Message": "If you're referring to just the text on the talents, I noticed that the file that handles the text did not get updated when Rawr released for 3.2.2.  I've fixed them and should be in for 2.2.20.\r\n\r\nIf you're referring to the actual effects themselves, do let us know exactly what's wrong.  Thanks!",
      "PostedDate": "2009-09-28T13:05:16.107-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Touched by the Light continues to give a bonus for Stamina.",
      "PostedDate": "2009-09-28T22:41:11.38-07:00",
      "Id": -2147483648
    },
    {
      "Message": "I don't know if this is just tool tip or deeper in the code.  Here are the problems I found comparing the tooltips for rank 1 of each talent with the associated values in wowhead.\r\n\r\nWhat is listed is the correct text from Wowhead.\r\n\r\nHoly Tree:\r\nLooks Good\r\n\r\nProtection Tree:\r\nTier 5: Blessing of Sanctuary\r\nPlaces a Blessing on the friendly target, reducing damage taken from all sources by 3% for 10 min and increasing strength and stamina by 10%.  In addition, when the target blocks, parries, or dodges a melee attack the target will gain 2% of maximum displayed mana.  Players may only have one Blessing on them per Paladin at any one time.\r\n\r\nTier 7: Ardent Defender\r\nDamage that takes you below 35% health is reduced by 7%.  In addition, attacks which would otherwise kill you cause you to be healed by up to 10% of your maximum health (amount healed based on defense).  This healing effect cannot occur more often than once every 2 min.\r\n\r\nTier 9: Touched by the Light\r\nIncreases your spell power by an amount equal to 20% of your Strength and increases the amount healed by your critical heals by 10%.\r\n\r\nTier 10: Judgements of the Just\r\nReduces the cooldown of your Hammer of Justice by 5 sec, increases the duration of your Seal of Justice effect by 0.5 sec and your Judgement spells also reduce the melee attack speed of the target by 10%.\r\n\r\nRetribution Tree:\r\nTier 3: Seal of Command\r\nAll melee attacks deal [0.36 * mw] to [0.36 * MW] additional Holy damage.  When used with attacks or abilities that strike a single target, this additional Holy damage will strike up to 2 additional targets.  Lasts 30 min.\r\nUnleashing this Seal's energy will judge an enemy, instantly causing [0.19 * mw + 0.08 * AP + 0.13 * SPH] to [0.19 * MW + 0.08 * AP + 0.13 * SPH] Holy damage.\r\n\r\nTier 7: The Art of War\r\nIncreases the damage of your Judgement, Crusader Strike and Divine Storm abilities by 5% and when your melee attacks critically hit the cast time of your next Flash of Light or Exorcism is reduced by 0.75 sec.\r\n\r\n----\r\nI do not know how to attach a patch.\r\n\r\nThank you.",
      "PostedDate": "2009-09-29T11:37:36.573-07:00",
      "Id": -2147483648
    },
    {
      "Message": "patches: go to Source Code Tab, just below the bar up top click Upload Patch. Include the files you want to change in a zip file, if possible, create a .patch file that summarizes the changes and include that as well. TortoiseSVN is a good Windows SVN client to create patches with.",
      "PostedDate": "2009-09-29T14:46:21.227-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-09-30T10:53:35.323-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-10-01T08:52:13.35-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-09-05T16:19:40.58-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-09-05T16:19:43.33-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-03-17T21:30:24.073-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:32:44.487-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:24:06.64-07:00",
      "Id": -2147483648
    }
  ]
}