{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.DPSWarr",
      "DisplayName": "Rawr.DPSWarr"
    },
    "ClosedComment": "",
    "ClosedDate": "2009-09-04T16:49:10.64-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "Just downloaded 2.2.14 and loaded my character from the armory.\n1st problem = Crit value is off by over 1.8% (armory isn't showing my zerker 3% increase) so total discrepency is 4.8%\n2nd problem = the listing of items as being optimized for upgrades has to be beyond wrong\n===it's showing my valorous dreadnaught leggings as being better than wrynn's t9 leggings, by over 100pts\n===same stat distribution yet it's showing older gear as being the best I can use.\n===makes no sense whatsoever\n3rd problem = clicking any buff does not change the main screen stats\n===clicking to have horn of winter does not increase my str or agi and there is no benefit showing\n \nI'm going back to 2.2.13 to see if the same issues pop up.\n \ncharacter = Alastrionia\nrealm = Uldaman",
    "LastUpdatedDate": "2013-05-16T05:24:34.187-07:00",
    "PlannedForRelease": "Rawr 2.2.14",
    "ReleaseVisibleToPublic": true,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2009-09-03T05:08:52.05-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[DPSWarr] It's completely off",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 14040
  },
  "FileAttachments": [
    {
      "FileId": 2169,
      "FileName": "Alastrionia.xml",
      "DownloadUrl": ".\\2169"
    }
  ],
  "Comments": [
    {
      "Message": "Post your character file if you want us to have a look. By default, it shows combat against lvl83s, which you have a lower chance to crit against.  Set bonuses and metagem requirements can make seemingly inferior items actually superior.",
      "PostedDate": "2009-09-03T08:01:41.247-07:00",
      "Id": -2147483648
    },
    {
      "Message": "1) ~4.8% difference is CORRECT if your target level is 83\r\n2) You probably need specific pieces of gear for specific stats like Hit and Expertise. The other factor is what Astrylian mentioned with set bonuses and Metagem requirements\r\n3) Check your Buff Comparison list, if there's any value besides ZERO in there for the buffs, they are working. Some SELF-APPLIED buffs do not count however if you have the matching talent. This information is in the FAQ on the Options panel and in the patch notes (also listed on the options panel).\r\n\r\nLooks like there most likely isn't anything wrong except a Keyboard-Seat error.",
      "PostedDate": "2009-09-03T09:41:15.537-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-09-03T10:35:43.487-07:00",
      "Id": -2147483648
    },
    {
      "Message": "okay, now I feel like a complete idiot\r\nthough the keyboard-seat error.....bah!!\r\ndelicate way of putting it, haha\r\n\r\nso, crit is correct (didn't realize that much difference came from the lvl of boss fights).....wish I had known that ages ago.....\r\nstill showing oddness with the itemization.  even with identical gems.  so i guess according to it I should keep my valorous unless I get more set pieces...\r\nand in that buff menu, I didn't see an option to uncheck said set bonuses....\r\n\r\nlastly, now clicking horn of winter or blessing of kings works (not sure why it didn't before)\r\nbut the crit increases don't work?  i click either \"Leader of the Pack\" or \"rampage\" and neither shows the 5% buff??\r\n\r\nthis time I've got my toon attached",
      "PostedDate": "2009-09-03T13:33:26.52-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-09-03T13:33:29.027-07:00",
      "Id": -2147483648
    },
    {
      "Message": "You can't turn off the set bonuses.\r\n\r\nPlease read #3 again",
      "PostedDate": "2009-09-03T13:45:55.303-07:00",
      "Id": -2147483648
    },
    {
      "Message": "No, I understand you can't.  I'm just wishing ya could so it would let me see what is going to be a better fit.\r\nIf I remove a piece that gives said bonus, the system re-itemizes everything and now shows T9/equivalent gear to be better,\r\nbut I have to change something, even if I put a crappy item in just to remove the bonus.   just a thought.\r\n\r\nbut self applied bonus like rampage which gives 5% crit should show when I click it.  it does make a difference in dps output.\r\nwhile it is a talent point you spend, the actual bonus is off critical hits, it's not static.  so if I can never have it applied (in this program)\r\nthen it will never output correct numbers, or appx. (will always be lower than what I would push in game)\r\n\r\nmore so with \"leader of the pack\", a druid buff that is static if there is one the group and they have it active\r\nchecking that off should give me a 5% to my crit value, again changing my dps output.\r\n\r\nI love the work you guys have done.  but either I'm missing something or a buff isn't being applied like it should.\r\nif I have 27% crit against a lvl 83 boss.....rampage procs....then I'm at 32% crit......this changes overall dps output.",
      "PostedDate": "2009-09-03T14:40:19.44-07:00",
      "Id": -2147483648
    },
    {
      "Message": "/facepalm\r\n\r\nThe BUFF Blood Frenzy/LotP won't be applied but the TALENT Blood Frenzy will, in the background. Look at your Talent Comparison Chart and you will see Blood Frenzy has a value. We disable BUFF versions in DPSWarr in favor of TALENT versions because it's more accurate and we don't want double-dipping (Getting both 5% crit from BUFF and another 5% from TALENT).\r\n\r\nWe've explained this multiple times since the inception of this process and it is explained on the options panel.",
      "PostedDate": "2009-09-03T14:47:39.863-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Yeah, just to put it more...nicely...\r\n\r\nClicking Rampage on/off or LotP on/off doesn't have any affect, because you have the rampage talent.  We are treating it as being up 100% of the time right now if you have the talent.  Probably could be updated to be a special effect if you have the talent, and then to permit LotP to give you 5% and overwrite the special effect (since you bring up a good point: LotP is better since it won't fall off unless the druid dies).\r\n\r\nFor now, however, we're keeping Rampage at 100% uptime.\r\n\r\nAnd Jothay just realized that somewhere along the line, it looks like the Rampage talent broke, so you're right there is a bug :)  I blame him entirely, as he's the one who broke it in the first place :P  Jothay, apologize to the man!",
      "PostedDate": "2009-09-03T15:06:06.98-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Rampage Talent wasn't being handled correctly in the back-end, it is now and will be in the next release.",
      "PostedDate": "2009-09-03T15:10:27.12-07:00",
      "Id": -2147483648
    },
    {
      "Message": "well I haven't been around since the inception so didn't know/realize that.\r\nit does makes sense, double dipping and all would screw numbers just as badly.\r\n\r\nand since it isn't correctly showing at the moment, I found a work around for the time being.\r\njust go into the talent tree and remove the talent point in rampage under fury.\r\n\r\nonce I did that, I could click either LotP or Rampage from the buff menu and then it applies the 5%, showing a more accurate picture.",
      "PostedDate": "2009-09-03T15:53:57.003-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-09-04T16:49:10.64-07:00",
      "Id": -2147483648
    },
    {
      "Message": "It's not \"more accurate\" to use it as a buff - it's actually MORE accurate to use it as a talent, because partial (1/3, 2/5, whatever the talent is) can be counted, as opposed to just an on/off switch of all or nothing.\r\n\r\nIt is still confusing, and I would still recommend some method of hooking the talents into the buffs, to alert that it is being handled elsewhere in the program.  I constantly have to concentraqte and think if I'm Fury or Arms, and if I still need to toggle on buffs accordingly.",
      "PostedDate": "2009-09-04T17:36:58.54-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-07-09T12:30:42.78-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-09-08T16:08:54.537-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-03-17T20:06:03.233-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:33:16.797-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:24:34.187-07:00",
      "Id": -2147483648
    }
  ]
}