{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Cat",
      "DisplayName": "Rawr.Cat"
    },
    "ClosedComment": "Your intent is exactly what the Progressive Optimize feature of the Batch Tools is for. We do not need to add another option that would only confuse the other 70-80&#37; of Cat end users that don&#39;t care about this.",
    "ClosedDate": "2011-10-03T19:44:34.63-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "I'm mainspec bear, with offspec cat.  Often as I get new items, even if they're reforged to dodge for bear-duty,  they're higher dps when in cat form than the previous tier item.  EG. 384 Choker of the Firelord reforged to dodge, is better for cats than the 372 Necklace of Strife.\nIn rawr, is there an option to enable me, as Cat,  to set the reforge on items to dodge?",
    "LastUpdatedDate": "2013-05-16T05:17:34.38-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2011-07-27T12:52:53.543-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "Can cats reforge to dodge in rawr?",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 3,
    "Id": 21244
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "The way I've done it for my DK is to use the Batch Optimizer and set the Tank character XML as the primary character and then do a progressive optimization.  \r\n\r\nThe other way would be to import via the Rawr addon via bear.  Optimize your bear.  Blue star anything that you don't want to change for cat.  Then save that character XML.  Make a copy of that XML, and then open that new file as a cat.  Change the model to cat via the Character Basics accordion thingie. Then the dodge reforges will be marked and will not be changed by the optimizer.",
      "PostedDate": "2011-07-28T07:20:08.53-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Thanks for the comment. Currently I'm logging out in bear gear with cat talents and importing from armory, then adjusting the relevant items.  I was just wondering if it would be possible to enable these negative reforge and gemming options in a future release?\r\nThanks, kit",
      "PostedDate": "2011-07-28T16:27:02.303-07:00",
      "Id": -2147483648
    },
    {
      "Message": "I'm in exactly the same situation (albiet my gear choices are a little lower down the scale!), so I'd be happy with this option.\r\nWhat I do now as a work around is edit the item and \"manually\" reforge it to dodge, then blue star it unforged.",
      "PostedDate": "2011-08-23T07:09:38.237-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-08-23T07:09:48.52-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-09-07T14:39:48.41-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-10-01T16:45:53.953-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-10-03T19:44:34.63-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:24:31.41-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:17:34.38-07:00",
      "Id": -2147483648
    }
  ]
}