{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Base",
      "DisplayName": "Rawr.Base"
    },
    "ClosedComment": "Fixed by adding new templates for v2.2.25 that ignore socket colour.",
    "ClosedDate": "2009-10-28T06:51:55.523-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "Rawr doesn't display gems that don't match the socket even when I have \"enforce gem requirments\" unselected. Some of the gems not displayed should be superior to the ones matching the socket. This is for enhance shaman. I am not expertise capped so an red 20 expertise gem should be better than a 15 stamina, 10 expertise purple gem for a blue socket with a negligible socket bonus. I have more than enough blue gems for the meta gem requirment. It seems the 20 expertise gem is already enabled in gemming templates but it doesn't show up in Comparios> Gems > All Normal.",
    "LastUpdatedDate": "2013-05-16T05:23:38.317-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2009-10-27T17:45:17.263-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Base] Rawr doesn't display gems that don't match the socket",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 14556
  },
  "FileAttachments": [
    {
      "FileId": 2412,
      "FileName": "azngreenie.xml",
      "DownloadUrl": ".\\2412"
    }
  ],
  "Comments": [
    {
      "Message": "Ok, to clarify before we start (again), there isn't an actual issue here. You are just incorrect assumptions.\r\n\r\nThe Comparisons Lists show the items with the top (1-5 based on settings) gem values based solely on the Gemming Templates. If you don't have a template that is all Precise Cardinal Rubies, you won't see that combination in the Comparison Lists.\r\n\r\nTo activate the gems for the Optimizer *beyond* the Gemming Templates you have to mark them as available in the Gems > Normal list. And yes, it is listed, try sorting by Alphabetical and find \"Precise\".",
      "PostedDate": "2009-10-27T17:56:34.413-07:00",
      "Id": -2147483648
    },
    {
      "Message": "I'm talking about the Comparisons section. That is where the gems are not showing up.",
      "PostedDate": "2009-10-27T19:39:05.84-07:00",
      "Id": -2147483648
    },
    {
      "Message": "So is he. Please read the responses.",
      "PostedDate": "2009-10-27T19:42:47.93-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Ok, I marked the gems in Gems > Normal list. Then, I used the optimizer (Is this the right process?) but I am not seeing any sockets with gems of non-matching color on any piece of gear on the comparisons section.",
      "PostedDate": "2009-10-27T19:54:36.263-07:00",
      "Id": -2147483648
    },
    {
      "Message": "No, really, we mean it. Read the responses. Read the documentation on gemming templates. Read the documentation on the optimizer. You're just misunderstanding, and we're telling you what you're misunderstanding.",
      "PostedDate": "2009-10-27T20:13:38.63-07:00",
      "Id": -2147483648
    },
    {
      "Message": "I must admit I'd not got the gemming templates entirely understood. I'd provided only gemming templates that matched socket colour. For v2.2.25 I've added gemming templates that don't respect socket colour for Enhance Shaman. This should fix the issue. In the mean time as Jothay and Astrylian both said simply mark the gems as available in addition to the existing templates.",
      "PostedDate": "2009-10-28T06:51:32.42-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-10-28T06:51:55.523-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-09-05T19:55:13.24-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:32:08.837-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:23:38.317-07:00",
      "Id": -2147483648
    }
  ]
}