{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Base",
      "DisplayName": "Rawr.Base"
    },
    "ClosedComment": "",
    "ClosedDate": "2010-05-10T13:00:11.663-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "It appears that issue #12695 was closed in error, on the assumption that Windows XP includes The Arial Narrow font, and that the poster must have deleted it.\n \nWindows XP does not include Arial Narrow. The font is included in several Microsoft products, including Micrsoft Office. It is also available for purchase separately:\n \nhttp://www.microsoft.com/typography/fonts/family.aspx?FID=22\n \nIt would be wonderful if RAWR was fully legible for all Windows XP users.\n \nI added this information as a comment on that issue, and only then realized that the issue is closed, and so I couldn't request to be notified of replies or status changes.\n \nSo I've opened this issue. Feel free to merge, close, swap, whatever. :-)",
    "LastUpdatedDate": "2013-05-16T05:20:48.79-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2010-05-05T06:43:29.92-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "Font 'Arial Narrow' does not support style 'Regular'",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 17547
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "I can confirm that Arial Narrow is NOT a Windows default font on Windows XP, Windows Vista nor Windows 7.",
      "PostedDate": "2010-05-05T08:33:21.17-07:00",
      "Id": -2147483648
    },
    {
      "Message": "You don't have to buy that font... there's plenty of resources out there to download and install it. Usually it gets installed when you add something like Microsoft Office to the OS.",
      "PostedDate": "2010-05-05T09:03:40.3-07:00",
      "Id": -2147483648
    },
    {
      "Message": "...or .NET.",
      "PostedDate": "2010-05-05T10:47:02.42-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Jothay: Do you really want to go to the point where you force users into illegality by telling them to go pirating a font from somewhere? Countrary to popular belief, fonts are NOT free resources (the fact they're called 'open fonts' doesn't change that).  You get some fonts shipped as part of the OS, but pretty much every other font you may have currently installed most likely got payed for somehow. Again, under the assumption the user didn't pirate a copy of the software installing the font.\r\nAnd no, there are not \"plenty of resources out there\" where you can get it legally.  Yes, Office is one, but not everyone has MS Office installed. And Office isn't free last time I checked.\r\n\r\nFrom what I can tell, the .NET installation does not install Arial Narrow.  I have a machine with Win7 and .NET but it doesn't have Arial Narrow. Although that may be because it was an embedded .NET installer MSI that came with another product.\r\n\r\nFrom what I can tell, it's only being used in the startup splash screen.  I'd just get rid of it there and use regular arial.\r\n\r\nAdditionally:\r\nDPSDK uses calibri, a font only available in Vista & 7 (and office 2007 and up).\r\nVerdana is used in several places (safe since that font is available for free for any system supporting TrueType and has been installed since Win98.\r\n",
      "PostedDate": "2010-05-06T03:43:10.553-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Stop the silly attitude people. It's a frelling font that 95% of the userbase has, that we thought 100% would have when we chose it, and we've already made clear that we won't be using it again.",
      "PostedDate": "2010-05-06T08:24:25.23-07:00",
      "Id": -2147483648
    },
    {
      "Message": "And for the dozen of you...\r\nhttp://www.microsoft.com/downloads/details.aspx?FamilyID=3657CE88-7CFA-457A-9AEC-F4F827F20CAC&DisplayLang=en\r\n\r\nTry that.",
      "PostedDate": "2010-05-06T08:27:41.46-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-05-10T13:00:11.663-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:28:34.08-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:20:48.79-07:00",
      "Id": -2147483648
    }
  ]
}