{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "Old issue.",
    "ClosedDate": "2009-08-08T06:55:34.67-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "It appears that the tool does not properly list the one handed weapons that it has in its database. I do see the 2h weapons but in viewing the Main Hand list and the Off Hand list items such as the Breeching Comet do not show up at all.",
    "LastUpdatedDate": "2013-05-16T05:27:01.533-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2008-09-06T12:36:38.9-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "One handed weapons",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 11181
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "For which model? If you're sure an item is in the item cache, but isn't showing up in the lists, then it's being filtered out for some reason. First thing to try is deleting it from your itemcache, and re-adding it, to re-download the latest info about it from the Armory. It's possible that its data is incomplete (perhaps from a PTR) or something. Beyond that, it's being filtered out by the model, because it doesn't think that item is relevant. If it should be, that's a bug, just let us know which items, and which model(s).",
      "PostedDate": "2008-09-06T21:30:29.56-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Model: DPSWarr\r\nItems affected: Any one handed item (whether set to force to main hand or off hand).\r\n\r\nTrying to delete and reinsert every one handed weapon in the game would be tedious.... Is there a way that I can turn off the filter? Or at the very least, change it's paramters to include one handed weapons?\r\n\r\nAlso, I know this modle is really for Arms warriors but it seems to produce a reasonable expectation for Fury warriors which is why i'm using it. iF you can send me the source code on the Fury model that has been done so far, I can see what I can do about getting it moved along in it's completion process. (I'm experienced in 7 different programming languages)",
      "PostedDate": "2008-09-09T09:39:04.63-07:00",
      "Id": -2147483648
    },
    {
      "Message": "The DPS Warrior model isn't currently set up to show 1-h weapons. ",
      "PostedDate": "2008-09-10T23:50:40.173-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-08-08T06:55:34.67-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:36:31.913-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:27:01.533-07:00",
      "Id": -2147483648
    }
  ]
}