{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "",
    "ClosedDate": "2010-08-16T14:42:39.04-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "The way I currently use Rawr is to go through each item slot and create my own upgrade list in a spreadsheet that includes, among other things, the source of the item. I use three columns: Source, B#, Location. For most items, Source is the name of the Boss (including \"(Heroic)\" if appropriate) that drops the item, B# is the number of the boss in the appropriate dungeon, and Location is the name of the dungeon, (again, including \"(Heroic)\" if appropriate). If it's a purchased item, then Source is the vendor name and Location is the location of the vendor.\n \nThen I either sort by Slot and descending Rawr score (which of course changes all the time but still stays approximately the same relative to each item slot, but see next paragraph), or when I'm in raid, I can sort by Location and B# to see what to watch for.\n \nIt's very time-consuming to enter all of this information in the spreadsheet, and of course, and the upgrade list changes every time I get a new piece of gear. It's bad enough for my mage, for which the Rawr score changes based on whether my new item has haste or not. For my pally, I'm trying to gear up all three specs, and the idea of making and maintaining three spreadsheets is horrendous. I'd really like to be able to sort by Source and Location, so when I'm in ICC on my mage, I can easily figure out if Festergut drops something worth bidding dkp on, or when I'm in Halls of Reflection on my pally, I can figure out what drops in there that I could use (obviously this requires three different Rawr character files anyway).\n \nSo, any chance of adding the ability to sort the upgrade list by source and location?",
    "LastUpdatedDate": "2013-05-16T05:20:08.187-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2010-08-10T17:42:43.85-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "Sort Upgrade List by Source",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 18456
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Are you not using the export for upgrade lists? o.O\r\n\r\nWhat you describe shouldn't be time-consuming at all.",
      "PostedDate": "2010-08-10T18:58:54.75-07:00",
      "Id": -2147483648
    },
    {
      "Message": "What you are asking for is similar to what i do on my toons (4 diff 80's each w/ MS & OS so 8 files). The quickest method I found was to use either the Upgrade list (from Optimizer) or even the Direct Upgrades then go to Export (upper right) and select \"Copy to Clipboard\". I then open Excel (or whatever spreadsheet you use) and \"Paste\" then select data to columns and use commas as a divider. You can then arrange any column by slot, source, or overall gain.",
      "PostedDate": "2010-08-10T23:07:53.467-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-08-16T14:42:39.04-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:27:45.3-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:20:08.187-07:00",
      "Id": -2147483648
    }
  ]
}