{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "Week and no response. The User can make gemming templates for PvP items if they want and Rawr2 can make custom gemmings. Rawr3 can take the equipped item&#39;s gems and swap them out.",
    "ClosedDate": "2010-09-05T13:45:24.75-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "I am trying to get together a set for pvp through rawr, I know that rawr wont recommend pvp items, as they are not the best items, but I have managed to do all  the item finding manually.  The only problem that I have found is trying to do custom gems, as most people know, the best gems for pve are not the best for pvp.  I have tried to create custom gemming templates but frankly they're very confusing.  I don't understand why you can't just click on the item and select \"Add Custom Gemming..\" and then it will give you a drop down list with the gems that you can choose, and you can click on each gem slot and choose which gem you want where.  They had this feature before Rawr was taken over by the company that owns it now and I dont know why they don't implement that again, as it is much simpler than their current method.  I may be wrong and this may work, but for me, it doesn't work so please inform me if I am just messing it up somehow, I have EVERY gem checked off on optomizer list so, that's not the issue.",
    "LastUpdatedDate": "2013-05-16T05:19:58.59-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2010-08-30T01:35:46.333-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "Custom Gemming",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 18620
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "What are you talking about? Rawr hasn't been 'sold' to anyone...",
      "PostedDate": "2010-08-30T09:04:48.343-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Yeah, no clue what you're talking about. No company has taken over Rawr, it's still the same team it's always been and this feature is still there, exactly as you describe it. Right click an item, choose add custom gemming. You don't need gemming templates for that.\r\n\r\n...Not that that's going to help you in any way, because Rawr won't help you optimize for PvP.",
      "PostedDate": "2010-08-30T09:59:06.85-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-09-05T13:45:24.75-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:27:34.413-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:19:58.59-07:00",
      "Id": -2147483648
    }
  ]
}