{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.TankDK",
      "DisplayName": "Rawr.TankDK"
    },
    "ClosedComment": "Fixed, and in the field.",
    "ClosedDate": "2009-07-02T09:42:42.633-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "Just got my DK to 80 and wanted to pick up some tanking gear from the Ice Crown & StormPeaks quests I am still doing.  I made a new DK in Rawr, entered my spec, buffs and all the best crafted gear which i am in the process of making for him.\n \nNow I just want to use that evil PAWN mod to help keep an eye out for quest rewards that would be tanking upgrades.  Unfortunately,  defense does not appear in the RelativeStatValues table.  Not sure if there is a reason for this or it is just an oversight.     I did try and work it out from the gem values but this gave me inconsistent results - an 8 Def gem & a 9 stam gem had a significantly different value to an 8Def/9Stam gem.\n \n \n \nBefore anyone says I should use the optimiser instead - yes I will - once I get to raiding/instances.  This is my 5th 80 and Tanking will be his off-spec - i really don't have the time to be running optimiser every few quests.   I just need a quick & dirty value which will get  me a half decent set to start heroics.",
    "LastUpdatedDate": "2013-05-16T05:25:33.17-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Medium",
      "Severity": 100,
      "Id": 2
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2009-05-14T18:13:21.33-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[TankDK] Defense Value to RelativeStats Table",
    "Type": {
      "Name": "Task",
      "Id": 2
    },
    "VoteCount": 1,
    "Id": 13248
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Ok... some of my initial work of changes has a wider range of stats including Def rating on the RelativeStat graph.  But I'm no where near ready to check the module in it's current form. I esp. don't like how much weight is put on Sta when there are other mitigation stats that I believe to be a higher value, esp. based on some of the EJ numbers I've seen.\r\n\r\nMight end up being an all-in-one type check in.  Not sure yet.  I'll have a better idea probably over the weekend.",
      "PostedDate": "2009-05-14T19:01:06.893-07:00",
      "Id": -2147483648
    },
    {
      "Message": "From personal experience with Rawr and tanking on my DK, I'd say that the relative values of the stats NOT including defense are fairly accurate (from a Frost DK POV). Rawr seems to think that an ilvl 239 plate DPS helm is one of the best tanking helms (due to threat generation/stamina gain), even though it'd drop me well below the defense soft-cap of 540. When above 540, the values seem pretty well off though.",
      "PostedDate": "2009-05-15T08:18:26.053-07:00",
      "Id": -2147483648
    },
    {
      "Message": "rev. 34074\r\nYou should see Def on the Relative Stats Chart as well as a number of other values.  Please verify if this meets your needs.  \r\nMarking fixed. \r\nReply w/ verified if it works for you on the next release.",
      "PostedDate": "2009-05-20T18:00:09.777-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-05-20T18:01:17.543-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-07-02T09:42:42.633-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-09-08T14:39:31.72-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-03-17T19:40:14.677-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:34:29.69-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:25:33.17-07:00",
      "Id": -2147483648
    }
  ]
}