{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Retribution",
      "DisplayName": "Rawr.Retribution"
    },
    "ClosedComment": "Fixed in commit 49510",
    "ClosedDate": "2010-04-14T09:22:42.64-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "Every time i try to load a retri-paladin, Rawr 2.3.12 crashes.\nI can load other classes, it only happens at the retributions.\nAlso if i create a new paladin and select any T10-item of retribution.",
    "LastUpdatedDate": "2013-05-16T05:21:31.26-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2010-03-15T05:02:45.08-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Retribution] Can't load any toons",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 17,
    "Id": 16780
  },
  "FileAttachments": [
    {
      "FileId": 3168,
      "FileName": "wontload.xml",
      "DownloadUrl": ".\\3168"
    },
    {
      "FileId": 3170,
      "FileName": "willload-wontoptimize.xml",
      "DownloadUrl": ".\\3170"
    },
    {
      "FileId": 3171,
      "FileName": "failure.JPG",
      "DownloadUrl": ".\\3171"
    },
    {
      "FileId": 3172,
      "FileName": "rawr-crash.JPG",
      "DownloadUrl": ".\\3172"
    },
    {
      "FileId": 3173,
      "FileName": "pal.xml",
      "DownloadUrl": ".\\3173"
    },
    {
      "FileId": 3177,
      "FileName": "Lea2.xml",
      "DownloadUrl": ".\\3177"
    },
    {
      "FileId": 3179,
      "FileName": "Testretri.xml",
      "DownloadUrl": ".\\3179"
    },
    {
      "FileId": 3180,
      "FileName": "CelRetri.xml",
      "DownloadUrl": ".\\3180"
    },
    {
      "FileId": 3184,
      "FileName": "SomethingWentWrong.jpg",
      "DownloadUrl": ".\\3184"
    }
  ],
  "Comments": [
    {
      "Message": "Hey, i got the same problem with my retri-paladin. And like you i can load any other characters.",
      "PostedDate": "2010-03-15T10:24:40.03-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-03-15T10:30:26.79-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Same problem here.  I attached my char data for reference.",
      "PostedDate": "2010-03-15T10:34:02.113-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-03-15T10:34:02.797-07:00",
      "Id": -2147483648
    },
    {
      "Message": "When it crashes, what happens? Saying ist crashes doesn't tell us much as there's a ton of ways it can crash.\r\n- Do you get an error message?\r\n- Do you get a notice to \"copy this error message and post it...\"\r\n- Does Rawr just hang?\r\n- Does the running program completely disappear from your active processes?",
      "PostedDate": "2010-03-15T11:09:02.7-07:00",
      "Id": -2147483648
    },
    {
      "Message": "I cannot reproduce this issue in either the Dev copy or the 2.3.12 release. File loads and the Buffs > Set Bonuses charts work.",
      "PostedDate": "2010-03-15T11:12:46.607-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-03-15T11:13:33.863-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Here is a pick of the failure.  I've also attached a new char. XML i am using.  This one will load, but as soon as I try to optimize, i get the same error listed in the jpg.",
      "PostedDate": "2010-03-15T11:18:00.867-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-03-15T11:18:01.63-07:00",
      "Id": -2147483648
    },
    {
      "Message": "here is the error ",
      "PostedDate": "2010-03-15T11:18:51.9-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-03-15T11:18:52.48-07:00",
      "Id": -2147483648
    },
    {
      "Message": "The file you gave 'willload-wontoptimize' did sort of load, in that I do see talents, settings and items marked as available to the optimizer, but nothing is equipped (this may have been intentional by you).\r\n\r\nI ran an optimize at the default settings. No Issues.\r\n\r\nI duplicated the file, equipped the gear, then assigned enchants (then had to assign those enchants as available). Then ran an optimize at the default settings. No Issues.",
      "PostedDate": "2010-03-15T11:40:19.77-07:00",
      "Id": -2147483648
    },
    {
      "Message": "I attached a pic.\r\n\r\nAnd some answers:\r\n-Yes, i get a error message.\r\n-It says,: \"Rawr does not work anymore\" (my translate from german to english)\r\n-You can see the \"rawrcrash.jpg\".\r\n-Rawr does not completely disappear, it´s still shown up. But as you can see at the pic an error message is shown, only with 2 options.\r\nfirst: research online to solve the problem and close rawr\r\nsecond: close rawr.\r\n\r\nSame comes up, if i create a new toon with a T10-item.\r\n\r\nI hope this will more exactly .\r\n\r\n",
      "PostedDate": "2010-03-15T12:41:40.403-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-03-15T12:41:41.047-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Concerning the willload-wontoptimize.xml, i just created a new profile from scratch and set the available items for the optimizer.  I did not equip any gear or set available enchants.  \r\n\r\nIs there any logging i can enable or data I can collect to tell why it's crashing?  The error I'm getting seems pretty generic.  I dont mind providing logging since I can reproduce everytime.  I even tried redownloading 2.3.12 and loading with default settings but I'm still unable to load/optimize.   I also tried updating my Item cache from Wowhead, but it did not seem to have an effect.  \r\n\r\nI'd also like to note that I tried this on another comp(Win7) and didnt have any issues.  The host that has these issues is running WinXP.",
      "PostedDate": "2010-03-15T12:41:59.627-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Both of you seem to be having the same issue and I can't reproduce it on my end, it sounds like there is a function call or something that is new with Retribution, but when your systems try to make that call it breaks. This tells me while the issue is systemic to multiple systems, it's some kind of corruption or versioning issue with the .NET or something that is on your systems.\r\n\r\nTry reinstalling the latest .NET on the affected boxes.",
      "PostedDate": "2010-03-15T13:31:59.923-07:00",
      "Id": -2147483648
    },
    {
      "Message": "I had this problem at some point during the 2.3.11 to 2.3.12 dev cycle with Healadin.  If you remove the section of the XML file from <Boss> ... </Boss> (in wontload.xml this is removing lines 169 through 210), it should load alright.",
      "PostedDate": "2010-03-15T17:01:35.74-07:00",
      "Id": -2147483648
    },
    {
      "Message": "And, if I remember, the specific problem was this line:\r\n\r\n<Version>V_10</Version>\r\n\r\nI don't think V_10 exists anymore.",
      "PostedDate": "2010-03-15T17:02:37.007-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Hie again.\r\n\r\n- Error message of windows 7, like Leandaria : \"Rawr does not work anymore\" with 2 options, close or look for solutions online.\r\n- So i don't get a notice \"copy this error message and post it...\"\r\n\r\nI load the program, then it crashes when i load my character profil (.xml) file of my retribuate paladin, right after loading 3/3.\r\nI load the program, then it crashes when i load my retribuate paladin from the armory (i am a french player, so eu-armory) file of my retribuate paladin, right after loading 3/3.\r\nBut, i won't crash with a .xml fil from my priest or if i load my war tank from the armory.\r\n\r\nI test the 'willload-wontoptimize' file, it loads, no items equipped. So maybe it has something to do with the items ? (i have 4/5 t10 : 3 251, 1 264, and items from 251 to 264 from icc, and some others from the raids before)\r\n\r\nI also have the latest framework.\r\n\r\nI tried with the lines <boss>....</boss> deleted, the only thing that changed is that rawr crashed more quickly.",
      "PostedDate": "2010-03-15T17:32:51.823-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Rawr crashes during the window of loading, it did'nt return on the main screen (it crashes before)\r\n\r\nI added my xml profile, maybe you will find something usefull, i made it with the 2.3.11 release with my paladin as he is right now.",
      "PostedDate": "2010-03-15T17:36:13.513-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-03-15T17:36:14.567-07:00",
      "Id": -2147483648
    },
    {
      "Message": "I can´t reinstall latest .NET Framework.\r\nWindows 7 includes the .NET Framework 2.0, 3.0 and 3.5 as OS components.  There is no way to uninstall or re-install the .NET Framework on this OS.\r\n\r\nI also tested this on a XP OS, same error message and rawr must be closed.\r\n\r\nAttached my Paladin-File \"Lea2.xml\"\r\n",
      "PostedDate": "2010-03-16T00:39:39.92-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-03-16T00:39:40.757-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-03-16T02:21:09.65-07:00",
      "Id": -2147483648
    },
    {
      "Message": "I have the same problem with my Windows XP Machine and Rawr 2.3.12.\r\nI can reproduce the error with the attached Testretri.xml\r\n\r\nI can change any \"non-set-slot\" without problems, but it seems that every time I select a slot that has a T10 item in, besides the helm (which already has the T10-264 selected) the program crashes. So to me it seems like the error lies in the module when it calculates the 2pc T10 bonus for retri.",
      "PostedDate": "2010-03-16T04:45:17.563-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-03-16T04:45:22.02-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-03-16T04:46:36.96-07:00",
      "Id": -2147483648
    },
    {
      "Message": "One added note: since the spell selection logic of the retribution model was changed with 2.3.12 (the Rawr.Retribution.dll lost nearly 60KB in size) and 2pc T10 changes spell use to favor DS maybe that's the reason for crashing? Using the new Rawr but the old 2.3.11 Rawr.Retribution.dll causes no crashes. Using Old Rawr but new 2.3.12 Rawr.Retribution.dll causes crashes.",
      "PostedDate": "2010-03-16T05:18:54.153-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-03-16T06:58:17.403-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-03-16T07:07:22.387-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Same problem. My retri will not load neither from the .xml nor from armory and it has 2 T10 pieces equiped in shoulder and chest slots.\r\nCreating a new retribution toon works up to the point where i select a T10 piece for a slot which causes rawr to crash.\r\n\r\nAttached my xml",
      "PostedDate": "2010-03-16T07:10:51.91-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-03-16T07:10:54.047-07:00",
      "Id": -2147483648
    },
    {
      "Message": "I updated my XP machine with the latest .NET framework (3.5 SP1) and it did not resolve this issue.  I am still unable to load/optimize ret characters that have T10 equipped or set in the optimizer.",
      "PostedDate": "2010-03-16T08:23:59.64-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-03-16T08:53:47.99-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Seeing the same issue here just loading my character from the Armory.  He has one piece of T10.  WinXP SP3 with .NET 2.0 SP2, 3.0 SP2 and 3.5 SP1.  Replacing the DLL mentioned earlier works for me as well.  With the 2.3.12 DLL and a blank slate I select one piece of T10 and it crashes.",
      "PostedDate": "2010-03-16T09:01:10.023-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-03-16T10:10:30.72-07:00",
      "Id": -2147483648
    },
    {
      "Message": "I have installed .NET Framework 3.5 Sp1 and the problem still exists loading a Ret Pali from Armory, the only information presented is the 'something went wrong' dialog so I am unable to provide any useful information.",
      "PostedDate": "2010-03-16T10:54:18.793-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-03-16T10:54:19.323-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Count me among the people having problems with ret pally. Cannot load characters from my existing xml file or from armory. Specifically, this is what happens:\r\n\r\n1. Rawr starts up fine.\r\n2. Attempt to load xml or from armory. Dialog box showing progress goes through steps 1 thru 3.\r\n3. At step 3/3, Rawr hangs. DIalog box is still open at 3/3 (caching icons). Icons do NOT load, but some character info does fill in (see below).\r\n4. After a couple of seconds, the contents of the Rawr window goes white. The loading dialog is still visible however.\r\n5. Rawr is completely unresponsive, and I get an hour glass when I'm in the window. Right-clicking \"Close\" from the task bar shuts it down.\r\n6. I get a prompt that says \"Rawr has encountered a problem and needs to close. We are sorry for the inconvenience\".\r\n\r\nAt the time that it hangs, and just before the screen goes white, I can see that the character is at least partially loading. My name, race, professions all fill in the their fields. Blacksmithing checkboxes properly appear below my gloves and bracers.\r\nI did notice that it shows \"Healadin\" in the model field just before it hangs. Don't know if this is normal, but thought I'd throw it out there.\r\n\r\nI'm running XP Home SP3. I checked Windows Update and found a couple of .NET updates under \"Optional Software\", installed them, but no joy.",
      "PostedDate": "2010-03-16T12:08:17.21-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-03-16T12:47:37.237-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Same problem for me.\r\n\r\nAll other modules load without a problem (even my profiles for healing and tanking), but no chance with any retribution file I load.",
      "PostedDate": "2010-03-16T17:33:28.927-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-03-16T18:27:40.997-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-03-16T22:31:28.51-07:00",
      "Id": -2147483648
    },
    {
      "Message": "I've been able to get a ret pally loaded, but optimisation took a long time.  The build upgrade list option has been running for over 24 hours now, but is slowly progressing so I'll let it continue and see what happens.  Currently at 70%.  At a guess I'd say that this and the inability to work with T10 gear may be related somehow.\r\nSame toon, but in prot spec still works as expected.",
      "PostedDate": "2010-03-16T22:35:00.82-07:00",
      "Id": -2147483648
    },
    {
      "Message": "As far as I can tell it's GetT10DivineStormCooldownProbability that keeps calling itself (because of some funky floating point comparisons) and gets stuck in a loop eventually crashing Rawr due to a stack overflow.",
      "PostedDate": "2010-03-17T00:15:55.98-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-03-17T13:42:22.54-07:00",
      "Id": -2147483648
    },
    {
      "Message": "I have similar problems loading my RET character from armory and from my 2.3.11 presaved RET toon.\r\nI loaded other guildee RET's no problem, I have some old saved files, it would load fine with just 1-T10 but would crash as soon as my 2-T10 pc file was loaded.\r\nNaturally my armory has 4-T10 so cause the crash as well.\r\n\r\nError Signature:\r\nEventType : clr20r3     P1 : rawr.exe     P2 : 2.3.12.0     P3 : 4b9dfa64     \r\nP4 : rawr.retribution     P5 : 2.3.12.0     P6 : 4b9dfa61     P7 : 126     \r\nP8 : c     P9 : system.stackoverflowexception  ",
      "PostedDate": "2010-03-17T13:43:40.607-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Oops, I made comment mistake. NO T-10 pieces loads fine.\r\nSoon as my 1st T-10 is loaded, manually or from a pre-saved old file with 1-T10 the RAWR would crash.",
      "PostedDate": "2010-03-17T13:46:50.663-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Similar issue trying to load a saved version of my paladin in his ret gear (main set is holy) from a file saved in 2.3.10.  Get a message in a mini \"Microsoft .NET Framework\" window with the following msg:\r\n\"Unhandled exception has occurred in your application.  If you click Continue, ... [blah blah]\"\r\n\"The type Rawr.DoT was not expected. Use the XmlInclude or SoapInclude attribute to specify types that are not known statically.\"\r\nHope this helps shed some light.\r\nAlso, in a possibly related issue, after update to 2.3.12 I am unable to save my dk in his tank gear (again an offset) without Rawr crashing.  Doesn't matter if I load from the armory or a saved file in this case.  Everything is fine unless I try to save.  Similar message:\r\n\"There was an error generating the XML document. ---> System.InvalidOperationException: The type Rawr.DoT was not expected. Use the XmlInclude or SoapInclude attribute to specify types that are not known statically.\"",
      "PostedDate": "2010-03-17T18:06:36.227-07:00",
      "Id": -2147483648
    },
    {
      "Message": "RAWR is continuosly crashing for ret pallys.\r\nIt started happening for my character mostly and the end of an optomise but now wont even let me import another ret pally from my guild.\r\n\r\nA test for this that crashes everytime is to try importing the following character. Char=Voltronn, Realm=Thunderhorn (EU). Give it a try and see if it works for you ... \r\n\r\nAfter reading other peoples comments it does seem relevant regarding the T10 as I have only just got my first peice.\r\n\r\nSo, to recap producing the error.\r\nSelect load character from armnoury\r\nChar=Voltronn, Realm=Thunderhorn (EU)\r\n\r\nCrashes with the usual microsoft error that allows you to send the error report to microsoft and then closes RAWR down.\r\n\r\nThis is the error signiture when I look at what it will send to microsoft\r\n\r\nEventType : clr20r3     P1 : rawr.exe     P2 : 2.3.12.0     P3 : 4b9dfa64     \r\nP4 : rawr.retribution     P5 : 2.3.12.0     P6 : 4b9dfa61     P7 : 126     \r\nP8 : c     P9 : system.stackoverflowexception  \r\n\r\nUnfortunatly the microsoft error does not allow you to cut and past anymore information, but if there is something specific you need to know thenI could try scanning trhough the report myself foir the answer.\r\n\r\nAt the moment, RAWR is unusable for retribution paladin and T10.",
      "PostedDate": "2010-03-18T02:04:29.077-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Facing the same issues since the new version came out.  Can load my prot spec, but not my RET gear set.  Also having no issues with other toons loading.",
      "PostedDate": "2010-03-19T06:39:22.94-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-03-19T07:32:13.893-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Is there any feedback on this problem ?",
      "PostedDate": "2010-03-19T07:33:18.327-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-03-19T09:23:28.473-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Well, it's a bug... Ret devs, can you have it fixed by this weekend?",
      "PostedDate": "2010-03-19T10:46:08.393-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Is this ONLY happening on foreign language installs of Windows?",
      "PostedDate": "2010-03-19T11:31:37.76-07:00",
      "Id": -2147483648
    },
    {
      "Message": "No this is also happening on English installations.",
      "PostedDate": "2010-03-19T12:09:51.49-07:00",
      "Id": -2147483648
    },
    {
      "Message": "It does not work for me at work but does at home, at work I am 32bit at home I am running 64bit.  Are people having this issue on a 64bit platform or just 32bit?",
      "PostedDate": "2010-03-19T12:11:28.203-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Just thought I'd post my fix:\r\nIn Rotation.cs, in the function GetT10DivineStormCooldownProbability, replace the line\r\n    if ((minCooldown < integerSwingCountTime) && (integerSwingCountTime < maxCooldown))\r\nwith\r\n    if ((minCooldown < (float)integerSwingCountTime) && ((float)integerSwingCountTime < maxCooldown))\r\n",
      "PostedDate": "2010-03-19T16:03:17.87-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Start -> Blood elf -> paladin -> ret -> select shoulder T10 -> crash\r\nNo problems with ver .11. This in on win 7 32 bit\r\n\r\n",
      "PostedDate": "2010-03-20T08:11:24.57-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Libbnor,\r\n\r\nYou're casting float to float?  That shouldn't change a thing.",
      "PostedDate": "2010-03-20T13:26:52.86-07:00",
      "Id": -2147483648
    },
    {
      "Message": "I can consistently get it to crash by building the release version of change set 47954 in Visual Studio, and then navigating to the release directory and running Rawr.exe from there, loading US-Korialstrasz-Skidhouse from the Armory.\r\n\r\nI cannot get it to crash by running the release version of change set 47954 in Visual Studio and loading US-Korialstrasz-Skidhouse from the Armory.\r\n\r\nWeird.",
      "PostedDate": "2010-03-20T14:10:05.36-07:00",
      "Id": -2147483648
    },
    {
      "Message": "If possible, I'd try to rewrite the function GetT10DivineStormCooldownProbability so as to not recurse.",
      "PostedDate": "2010-03-20T14:13:15.557-07:00",
      "Id": -2147483648
    },
    {
      "Message": "roncli,\r\n\r\nYou would be surprised, floating points are tricky to work with because of the way they work. Floating points are precise for 7 digits, and have a single representation for each (7 digit) number, however, when you work with them, the \"trash\" decimals are preserved and so two numbers which are the same (in their first 7 digits) might not be equal.\r\nTry the following program, both x and y should be \"equal\" to 1.005000f:\r\nfloat x = 1.005f;\r\nfloat y = 0.00500001f;\r\ny += 1f;\r\nif(x==y) Console.WriteLine(\"a\");\r\nif (x == (float)y) Console.WriteLine(\"b\");\r\nThis outputs \"b\", but not \"a\".\r\n(I build with VC# 2008 EE in Release mode, Debug mode behaves \"as expected\" and outputs both \"a\" and \"b\").\r\n\r\nAs for,\r\n\"I cannot get it to crash by running the release version of change set 47954 in Visual Studio and loading US-Korialstrasz-Skidhouse from the Armory.\"\r\nare you sure you are running the release version without debugging (ctrl+f5)?",
      "PostedDate": "2010-03-20T14:51:03.097-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Libbnor, where is the file rotation.cs ?\r\nHow to do do the change please ?",
      "PostedDate": "2010-03-21T06:34:14.973-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Djidam, it's in the source code so one of the devs would have to do the fix.",
      "PostedDate": "2010-03-21T09:55:39.63-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-03-22T00:51:07.303-07:00",
      "Id": -2147483648
    },
    {
      "Message": "1° I'm one of the devs on Rawr.retribution, but that part of the model is fairly new, and I honestly don't really know what it's actually doing. The function name is obvious enough but how it does what it does... no idea. (that part of the code is from Orlangur).\r\n\r\n2° it is not a problem \"every\" paladin is having, or making rawr \"useless for everyone\".  I'm working on another part of Rawr.Ret atm and in the last few days I have literally loaded several hundred different ret paladin profiles from the armory from both EU and US without problem. I have done so using a more recent dev build than 2.3.12 at home on my development machine, as well as 2.3.12 on my mobile (via Terminal Server) and laptop.\r\n\r\n3° it is not windows related.  I have XP 64 US, on the terminal server, XP 32 BE/NL on the laptop, Vista 32 Home (BE) and Win 7 64 ultimate on my dev machine at home.\r\n\r\n\r\nI've not been able to get anything to crash. So I can't confirm any of the crashes or try to debug what's actually going wrong or in what circumstances it's failing.\r\nIt seems to me a \"small number of people\" (although again, it's hard to say how many, people having problems tend to be voicier than those having none) are having this issue.\r\nAstrylian suggested \"just ripping out that code and replacing it with a dummy for now\", but then the thing is... what's better?  Leaving things as is \"for now\" until Orlangur can fix it properly.  Or getting it to stop crashing for the \"small number of people\" but at the same time getting the results to be useless for everyone.  I'm inclined to go for the 1st approach. Particularlty since it seems nobody in the dev team can reproduce the crashes (?) from inside a debug session.",
      "PostedDate": "2010-03-22T03:14:35.967-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Libbnor's solution works fine for me. Tnx!",
      "PostedDate": "2010-03-22T04:51:59.327-07:00",
      "Id": -2147483648
    },
    {
      "Message": "2.3.13 Works properly for me loading from file & Armory.",
      "PostedDate": "2010-03-22T08:54:18.28-07:00",
      "Id": -2147483648
    },
    {
      "Message": "If libnor's solution actually works for you. then there's something REALLY REALLY funky going on inside .NET as the integerSwingCountTime variable is float to begin with, casting a float to a float shouldn't do anything.\r\n\r\nThe only thing I can think of in that case is that the compiler thinks it can do better performance wise by using an internal FPU stack variable (10byte IEEE floating point var). and casting it is preventing it from using the FPU stack based variable.",
      "PostedDate": "2010-03-22T10:14:46.613-07:00",
      "Id": -2147483648
    },
    {
      "Message": "(float)ing a float truncates the number to 7 decimal places if I understand what I'm reading from Libbnor.\r\n\r\nI would think that the ideal solution is to figure out how to arrive at the desired number without using recursion at all.  However, putting in Libbnor's fix may be the way to go for the short term.\r\n\r\nWould there be any serious performance issues changing everything in there into doubles instead of floats, where rounding errors will not occur?",
      "PostedDate": "2010-03-22T13:31:44.44-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Well, after experimentation, I don't think \"truncates\" is the right word... but it's certainly not normal math.\r\n\r\nAs such, I don't think (float)ing the floats will fix every case, and may actually break currently working cases.  So, my best guess is to either refactor for no recursion or use doubles.  Up to you guys. :)",
      "PostedDate": "2010-03-22T14:13:31.96-07:00",
      "Id": -2147483648
    },
    {
      "Message": "I have to agree something funky is going on, but looking at the function I don't think \"(float)ing the floats\" will break anything.\r\n\r\nJust out of curiosity, was it crashing for anyone using an Intel cpu? The only machines I tried it on were AMD...",
      "PostedDate": "2010-03-22T15:12:13.61-07:00",
      "Id": -2147483648
    },
    {
      "Message": "No more issues with rawr 2.3.13 :) armory nor file :)\r\nAnd i try rawr 2.3.12 on my laptop with seven and an intell core : it crashes too.",
      "PostedDate": "2010-03-22T18:40:28.7-07:00",
      "Id": -2147483648
    },
    {
      "Message": "All works fine on 2.3.13.\r\n\r\nNo crash :-)",
      "PostedDate": "2010-03-22T22:46:55.833-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Works fine now.\r\nAnd Libbnor yes, it was crashing for me on my Intel Core2 Quad Q6600",
      "PostedDate": "2010-03-26T06:39:28.733-07:00",
      "Id": -2147483648
    },
    {
      "Message": "From Kavan:\r\n\r\n\"There is an infinite loop in Rawr.Retribution.Simulator.GetT10DivineStormCooldownProbability because the passed in parameter swingSpeed has value 0. I'm not sure exactly when this happens, but it seems to be related with items still loading at which point MainHand.Item.Speed is 0.\"",
      "PostedDate": "2010-03-29T04:47:18.037-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-04-01T15:57:15.03-07:00",
      "Id": -2147483648
    },
    {
      "Message": "The Rawr3 issue when items are still downloading should be resolved for next release.",
      "PostedDate": "2010-04-09T20:04:43.693-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Other than the fact that a forked recursion is a \"rly bad thing\" that should get fixed/cleaned up \"sometime\".  \r\n\r\nDoes that change mean this bit of code can't actually cause the crash anymore ?",
      "PostedDate": "2010-04-12T06:03:45.54-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-04-14T09:22:42.64-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-03-17T21:40:45.093-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:29:26.31-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:21:31.26-07:00",
      "Id": -2147483648
    }
  ]
}