{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.AddOn",
      "DisplayName": "Rawr.AddOn"
    },
    "ClosedComment": "4.0.20 Released",
    "ClosedDate": "2011-02-20T19:11:07.02-08:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "When viewing the Rawr Character sheet. If you hover over an item in this dialog, the item comparison does not update to what is currently equipped.\n \nIn the image provided, I currently have the Gale of Shadows equipped. However when I hover over the Gale of Shadows in Rawr,it shows me currently equipped with Anhuur's Hymal which is an item that I was using a few weeks ago that I switched out.",
    "LastUpdatedDate": "2013-05-16T05:18:44.893-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2011-02-07T23:58:04.347-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Addon] Item Comparison not updating",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 19945
  },
  "FileAttachments": [
    {
      "FileId": 4586,
      "FileName": "WoWScrnShot_020811_025654.jpg",
      "DownloadUrl": ".\\4586"
    }
  ],
  "Comments": [
    {
      "Message": "This is NOT an issue. The this is a misunderstanding. \r\n\r\nThe addon does not and CANNOT update to what is equipped. This is for the very very simple reason that it cannot possibly calculate the dps/healing/tanking stuff that Rawr does. So when you change gear you MUST export - re-run Rawr and then import back in in order to update the in game data.\r\n\r\nI did plan to add a warning feature that disables the output or warns or something if you have changed gear. However there are lots of issues around switching specs etc and switching back to same as imported data, where the warning would not be appropriate.\r\n\r\nSolution: When you change gear you MUST re-run Rawr otherwise all the numbers will be potentially very wrong. eg: you change one item now your haste is different and you dropped 252 hit rating. That would make a dramatic difference in how you would reforge, re-enchant or re-gem in order to get back to being hit capped. Therefore the old comparisons are wrong.\r\n\r\nThe addon only ever shows you what is imported vs what is an upgrade, NOT what you have equipped, as the prospect of error is way to high.",
      "PostedDate": "2011-02-08T05:23:28.927-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-02-08T05:23:47.923-08:00",
      "Id": -2147483648
    },
    {
      "Message": "In order to make this clearer I need to find a way of alerting users that the imported data doesn't match the equipped data. I have yet to implement that feature.",
      "PostedDate": "2011-02-08T05:24:55.89-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-02-20T19:11:07.02-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:26:01.767-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:18:44.893-07:00",
      "Id": -2147483648
    }
  ]
}