{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "",
    "ClosedDate": "2012-10-20T19:31:42.16-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "When I try to load a character from the battle.net armory I get an error on both the web version and the downloadable version.  The suggested fix is to use the in game add on.  When I try to export a character with the in game add on I get an error there as well.\n \nYour help system is the worst help system I have ever used.  It is completely unintuitive and unwieldy.",
    "LastUpdatedDate": "2013-05-16T05:16:59.967-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2012-09-01T09:41:02.15-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "Unable to load character",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 23286
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "You will have to manually enter characters and equipment manually for the next few weeks until the expansion comes out.    Modifying Rawr for the 5.04 patch would be a massive amount of work for just a few weeks usage.  The Rawr devs are instead working on getting Rawr and the addon ready for Mists and level 90 content.\r\n",
      "PostedDate": "2012-09-01T16:31:23.96-07:00",
      "Id": -2147483648
    },
    {
      "Message": "How do you manually add a character?  Why is that not listed among the possible solutions?\r\n\r\nAgain it falls to the horrible help system.",
      "PostedDate": "2012-09-02T08:28:26.377-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Open a blank character, set the Name, spec and professions by clicking on the \"Expand to edit basic information\" line on the stats tab.\r\n\r\nThen you need set your talents and other buffs and options.   Finally add all the gear you have.\r\n\r\nAlso, if you wish to join the team to improve the help system then send a message to the devs.",
      "PostedDate": "2012-09-02T16:04:00.523-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Having the same problem but even the Rawr Addon doesn't work in game. It won't give the code which may be due to what you said it's not up to date. When you say to add all this manually how do you suggest doing that when the talent system doesn't seem to par up with the way Rawr is set up?",
      "PostedDate": "2012-09-04T08:27:55.69-07:00",
      "Id": -2147483648
    },
    {
      "Message": "You can't really.   Just wait a few more weeks for the new version when MoP hits.\r\n\r\nSorry bout the talents confusion, I was busy at work when I typed it and didn't think it through too well :)\r\n\r\n",
      "PostedDate": "2012-09-04T15:56:23.907-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2012-10-20T19:31:42.16-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:23:40.46-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:16:59.967-07:00",
      "Id": -2147483648
    }
  ]
}