{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Base.Optimizer",
      "DisplayName": "Rawr.Base.Optimizer"
    },
    "ClosedComment": "",
    "ClosedDate": "2009-10-28T10:18:34.63-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "It would be nice to have the ability to merge multiple upgrade lists for purposes of having one list of stuff to look out for (multiple specs, for example...currently playing a druid). Currently I do this by exporting to csv then importing into a spreadsheet and working some magic.\n \nSo, some sort of interface to facilitate opening multiple upgrade lists and giving a few options for sorting (alphabetical, spec A score, spec B score, etc...) would be awesome.",
    "LastUpdatedDate": "2013-05-16T05:23:39.323-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2009-10-27T12:04:38.62-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Feature Request.Optimizer.UL] Ability to merge multiple upgrade lists",
    "Type": {
      "Name": "Feature",
      "Id": 1
    },
    "VoteCount": 1,
    "Id": 14550
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "This is available under Batch Tools.",
      "PostedDate": "2009-10-27T12:53:58.147-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Indeed, it does appear to be. Thank you for pointing this out. My apologies.",
      "PostedDate": "2009-10-27T13:16:51.543-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Having these lists external to the game is one thing.  But the Devs have given you the ability to \"export to LootPlan\" as one of the options available in the upgrade list. \r\n\r\nI have installed the addon LootPlan and it is the next best thing to having the Devs here create an addon.  Now when I roll ove an item if it is in my upgrade list, rainbow colored text is added to the tooltip.  I immediately know if I should spend my DKP or not.\r\n\r\nI have found there is a trick to importing into LootPlan.  This is what I must do.  select import.  select the section you want it to go under (ranged on my lock) (tank or healer on my druid).  Put cursor in box.  Control V to paste list in.  Click on button directly blow text box.  Click on import.  \r\n\r\nNow this does not import anything because the list is so long.  Put your cursor back in the text box. control A to select all.  Delete to erase.  Control V to paste back in.  Now directly click the import button and you should see spam in game indicating the import has occurred.\r\n\r\nIt is very sweet!\r\n\r\nOne annoying thing is that there is no way to \"delete all\" in loot plan.  So if you rerun your upgrade list, you have to delete the existing items in loot plan one at a time before you re-import.\r\n\r\nhope that helps!",
      "PostedDate": "2009-10-28T07:49:36.93-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-10-28T10:18:34.63-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-09-08T16:33:21.307-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:32:09.843-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:23:39.323-07:00",
      "Id": -2147483648
    }
  ]
}