{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Base.Optimizer",
      "DisplayName": "Rawr.Base.Optimizer"
    },
    "ClosedComment": "READ THE DOCUMENTATIONYou have to mark them as available to the optimizer with Green Gems, not just put in on your gear",
    "ClosedDate": "2010-01-20T11:10:03.533-08:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "When I go to optimize my cat I'm told I don't have enchants selected on various pieces, like my shoulders and my weapon for example.  However, I do.  On my shoulders I had Greater Inscription of the Axe and on my weapon I have Berserking, both were showing in the slot too.  I think this is a bug.  This also happens with my Bear sometimes, usually with the weapon.  You should be able to load in Lindalcron from Bladefist.  I don't know if you'll get the bear or the cat, but both seem to show this odd behavior.\n \nI am able to go on through with the optimization, but this hurts my confidence in the result.",
    "LastUpdatedDate": "2017-11-27T11:01:57.643-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2010-01-20T10:23:23.39-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Optimizer] Telling me I don't have enchants selected, like for shoulder or weapon, but, I do",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 16007
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "I have actually noticed an issue crop up when running Rawr for my mage guildie. One of his professions is inscription, and it'll occasionally state that no shoulder enchant is available (when it clearly is under available enchants). It probably only pops up 1 in 20 optimizer runs, so I'm not entirely sure what could cause it.",
      "PostedDate": "2010-01-20T11:41:54.907-08:00",
      "Id": -2147483648
    },
    {
      "Message": "I have had the same issue with profession enchants occaisionally.    I hit optimise and it says I have no wrist or ring enchants selected (LW/enchanter).   I close the optimiser, go to the main pane and reselect my professions (which already appear to be set perfectly fine) and then it works as intended.     As Devwar says, it is only occaisional - the 1 in 20 sounds close to right but I have not been able to consistantly reproduce it.\r\n\r\n",
      "PostedDate": "2010-01-20T13:58:11.38-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Please re-open this issue, Jothay.  This is an active issue.  This occurs on profession-specific item enhancements every so often that have been marked as available, but for whatever reason, the profession is ignored.  It is easily solved by reselecting the profession in question, but it shouldn't be happening in the first place.",
      "PostedDate": "2010-01-21T11:22:16.637-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Bumping this to the top, as it still needs to be re-opened.",
      "PostedDate": "2010-01-22T04:32:12.553-08:00",
      "Id": -2147483648
    },
    {
      "Message": "I'm sorry, but this closer makes no sense.  As I stated, the items (as in the ones I'm wearing and were loaded in from the armory and therefore automatically tagged with a green gem) have the enchants on them.  And they have what most of us would consider quite normal enchants, like Mongoose and Berserking for weapons.\r\n\r\nSo, unless you are saying that I have to roll through some list of enchants (where?) to make them available to the optimizer, I would expect that these enchants would behave the same as all the other enchants on all my other pieces.  You have a bug, period.  And, it isn't just enchants that \"I\" can do.  Mongoose and Berzerking are not specific to the profession wielder.\r\n\r\nAnd, I have read the documenation that's available and watched the video.  So, while I'll apologize if I missed anything, this isn't an RTFM issue.  And it seems to have started with newer releases of RAWR (I have not checked with the very latest just yet as I get a bit tired of having to retell RAWR what I have available in my inventory.)",
      "PostedDate": "2010-03-05T10:38:00.967-08:00",
      "Id": -2147483648
    },
    {
      "Message": "\"You have a bug, period.\"\r\n\r\nNo, you do. We really do mean what we say, and we're not wrong in this case. You literally do not have those enchants marked available. Seriously. No, really, go look. Look at the enchants chart; they are not marked available. Mark them available, and you won't have a problem. Really. Yes, really.",
      "PostedDate": "2010-03-05T15:41:44.99-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Lindalcron actually noted that the enchants were marked with a green diamond.  *IF* this is the case, then this is further confirmation of a bug.  I can independently verify the behavior I noted earlier as a rarely-occurring, random bug.  I stand by my original insistence that there is an issue here, though I am not sure that what Lindalcron is referring to in his report is the same issue I'm discussing.  I will say that I've not observed the same thing happening for non-profession-specific item enhancements, so this potentially a completely separate issue, or a more recent development.\r\n\r\nNotes: It is not profile specific - it can happen on any given profile that utilizes profession-specific item enhancements.  It is not Optimizer-specific - when looking at the rings enchants list, for example, there really will be no enchants listed until you deselect and reselect Enchanting as a profession.",
      "PostedDate": "2010-03-05T22:48:08.26-08:00",
      "Id": -2147483648
    },
    {
      "Message": "No, he specifically states that the items that are enchanted have green diamonds. The enchants themselves do not.",
      "PostedDate": "2010-03-05T23:17:28.113-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Okay, I agree, I have never had to mark any enchants or gems as being available before, so when encountering the error it was bizarre to me.\r\n\r\nSo, since I've never had to mark any enchants before, and therefore never marked any of them, why isn't the tool generating an error every time for every single item?\r\n\r\nSo, when looking at my toon's back for example, the enchant that is on it already (Major Agility) is marked as green, but it wasn't done by me.\r\n\r\nLogically, I would expect that if a toon is read in from the Armory it would get it's enchants set up for the optimizer already, since it would be a little sadistic to make the user have to go and pick possible enchants for every piece when the enchant was already on the piece and therefore obviously available.\r\n\r\nSo, is it possible that if I manually changed the enchant on a given item to reflect something newer than the saved toon; that this is what's triggering the error?  The answer to this is \"yes\" by the way, I tried it out, I manually switched the cloak's enchant to Major Speed and got an error that Major Speed wasn't available to the optimizer.\r\n\r\nThe issue can be closed for me now.\r\n\r\nThank you for your help.",
      "PostedDate": "2010-03-11T14:02:53.527-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-09-09T16:03:17.383-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-03-17T20:24:09.227-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-05-20T22:45:43.24-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:30:22.69-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:22:15.45-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2017-11-27T11:01:57.643-08:00",
      "Id": -2147483648
    }
  ]
}