{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "",
    "ClosedDate": "2011-05-27T12:56:26.68-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "On certain combinations of gear, the stat values for Arcane seem to be all messed up, to get back to normal after reforging a single item. In this example, the value of haste suddenly went all the way up, while I can't give any explanation for this myself, as there are no dots and therefore no haste plateaus. Is this a bug or just something I'm not aware of?\n \nedit: quitting the program and reloading the file, the values went back to normal. Since it gets a bit hard to check what's causing it, this ticket can be closed/deleted. There are some strange things happening though, such as Crit getting a negative value, or Rawr suggesting that reforging mastery to hit is better than crit to hit even though mastery's value is higher. Again, not really reproducable, so never mind I guess.",
    "LastUpdatedDate": "2013-05-16T05:17:55.163-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2011-05-23T03:10:48.237-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Mage] Strange relative stat values",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 20819
  },
  "FileAttachments": [
    {
      "FileId": 4973,
      "FileName": "pent.xml",
      "DownloadUrl": ".\\4973"
    }
  ],
  "Comments": [
    {
      "Message": "It's possible you're near some numerically unstable region that is causing this. I've been making some improvements to the stability so it'll be interesting to see if you notice any difference in the next version. In any case if you're able to find a reproducible case I'd be very interested in getting the xml for it.",
      "PostedDate": "2011-05-23T13:48:00.62-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-05-27T12:56:26.68-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:24:58.703-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:17:55.163-07:00",
      "Id": -2147483648
    }
  ]
}