{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Base",
      "DisplayName": "Rawr.Base"
    },
    "ClosedComment": "not an issue.",
    "ClosedDate": "2009-11-17T06:52:57.41-08:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "I am unable to changes my gems on any of my equipment.   I can select the gem and hit ok, but then it won't show up on the equipment.  I have tried reloading Rawr and deleting all associated files.  I have tried loading different characters with the same results.  I have tried all the other Rawrs and they are fine.  I'm just having this issue with enhance.  Btw- I'm using 2.2.24",
    "LastUpdatedDate": "2013-05-16T05:23:33.807-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2009-11-01T15:28:42.15-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Base] Problem with Gemming",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 14592
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "How are you attempting to do so? Shift-right click on the item? Something else?",
      "PostedDate": "2009-11-01T16:26:50.83-08:00",
      "Id": -2147483648
    },
    {
      "Message": "I can use shift right click or right click and select add custom gem.  I select the new gem I want, then hit OK.  It seems to process, but when I look at the piece of equipment and the stats nothing has changed.",
      "PostedDate": "2009-11-01T17:13:54.423-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Instead of right clicking on the item an selecting \"Add Custom Gemming\", try either shift-right clicking or right clicking an select \"Equip Custom Gemming\".\r\nEquip Custom Gemming will equip the selected gems in the equipped gear.\r\nAdd Custom Gemming - Not actually sure what this one does.",
      "PostedDate": "2009-11-01T19:58:00.167-08:00",
      "Id": -2147483648
    },
    {
      "Message": "If you are trying to do use the \"Add Custom Gemming\" option, I believe it will not be shown in the comparisons for selection unless it is above the 'Top Gemmings Shown: X' threshold (Tools > Edit Gemming Templates, \"Top Gemmings Shown\" at the bottom).\r\n\r\nTo accomplish what you're trying to do (I presume to equip a piece of gear with gems other than the ones the computer sees as the optimal X number of gemmings), simply use the \"Equip Custom Gemming\" as opposed to the \"Create Custom Gemming\".\r\n\r\nIf what you're really after is to see the custom gemming template compared alongside the dynamically generated ones, then A) we should have some method for forcing all custom gemmings to show in the Comparisons charts regardless of the the number of other templates shown, and B) a quick fix MAY be to increase the value in the box on the Custom Gemmings window.  I'm not sure it will work, haven't tested it, but it very well might.\r\n\r\nBTW, this is not an Enhance model Issue, it's a Base-level one.",
      "PostedDate": "2009-11-01T19:58:01.01-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-11-02T09:28:37.46-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-11-17T06:52:57.41-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-09-05T19:56:58.43-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-09-05T19:57:00.623-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-03-17T21:30:15.273-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:32:03.837-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:23:33.807-07:00",
      "Id": -2147483648
    }
  ]
}