{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Warlock",
      "DisplayName": "Rawr.Warlock"
    },
    "ClosedComment": "This issue has been open for 30&#43; days without response. If it is still an issue, please resubmit against current versions and provide current files.",
    "ClosedDate": "2009-09-16T18:46:38.427-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "I play a destro lock (0/13/58). Therefore I don't use the lifetap glyph and the only support I get from spirit is from the skilled fel armor (and the few lifetaps of course). Therefore spirit should be worth around 40% of spell power. Rawr shows instead relative stat values for spirit = 2.05, for spell power 1.80. Therefore items with spirit will be favored from the optimizer which results in bad gear sets.\n \nOn the other hand haste is shown with an relative stat value of 0.43 (behind intellect and far behind crit - not speaking of spell power and spirit...), which is way below where it should be.",
    "LastUpdatedDate": "2013-05-16T05:25:13-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2009-06-20T05:00:00.103-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Warlock] Haste Issues",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 3,
    "Id": 13515
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Affliction lock seconding the weird behavior of Spirit.\r\nAt 807 spirit, it shows a relative value of .17.\r\nAt 818 spirit, it shows a relative value of 1.17.\r\nBoth VS 1.00 spellpower.\r\n\r\nUsing v2.2.10",
      "PostedDate": "2009-07-19T03:05:48.847-07:00",
      "Id": -2147483648
    },
    {
      "Message": "There will be a bunch of changes in the next minor release that should affect this. The effect of spirit shows itself through more ways than you pointed out, though:\r\n1. Increases spellpower via Fel Armor\r\n2. Decreases Lifetap frequency (and thus more damage spells)\r\n3. Increases LT Glyph bonus\r\n4. Increases 4T7 bonus",
      "PostedDate": "2009-07-30T12:01:06.337-07:00",
      "Id": -2147483648
    },
    {
      "Message": "From my own testing the relative stat value is extremly unreliable (as said in the huge red disclaimer). As I understand it it is calculated by taking the current gear / buffs and then adding some value to a stat and then running the simulation again to get the new \"dps\". I have also ran into occurences where relative stat values claim spirit to be better than spellpower, but there is nowhere in the code that would allow for this. My assumption was simply that its quite unreliable.\r\n\r\nI havent had time to go deep in the rawr algorithms for how it checks relative stat values, but something is weird, and I dont think its isolated to the warlock module.",
      "PostedDate": "2009-08-01T00:48:22.757-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Think of Relative Stat values in the terms of:\r\n\"If i had an empty prismatic gem slot, and I were to put a gem with 1 pt of ____, how would that change my dps/heals/surv/whatever\"\r\nSo a value for Spirit of 1.17 means you are 1.17 better off than you were with that 1 extra pt of Spirit.\r\nMany, many things can affect every single stat, and these values change drastically with varying points of gear. One of the points the warning labels tries to make is that if you run into a cap, it may be your top stat for that last point, but the next point after that one is worth zero. Eg- You are 155/156 Expertise Rating, that last point may be a 3.4, but the point after that is 0 so another gem which gives 8 exp would have 1 completely useful one and 7 completely useless points.",
      "PostedDate": "2009-08-01T03:31:25.053-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-08-25T12:41:49.123-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-09-16T18:46:38.427-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-09-05T15:07:01.163-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:34:05.66-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:25:13-07:00",
      "Id": -2147483648
    }
  ]
}