{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Moonkin",
      "DisplayName": "Rawr.Moonkin"
    },
    "ClosedComment": "This issue has reached the 90 day marker without responses.If this is still an issue please resubmit with the Character file in question and related Version where the issue is still present.",
    "ClosedDate": "2009-08-19T13:57:44.643-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "First off, an awesome product, I have found it very useful - thanks.\n \nThere are two errors that I have noted in building a Moonkin talent tree.\n \nEclips - My Overall without any points on this talent is: 2996, I add 1 point, it decreases to 2933 (down 63 points), I add a second point it goes upto 3030 (up 97 from the 1st point and up 34 from original). I then add 3rd and it goes to 3085 (up and additional 55). I understand that these values are specific to my character/gear/build, however I do not think it's right that 1 point would decrease the overall score.\n \nMaster shape shifter has no impact on the overall, I would have expected a 4% increase in dmg to have increased the burst dmg and overall score.\n \nIn both of the above I have check to see that there are available talent points, however this has no impact as the talent builder does not restrict the number of points.\n \n \nLastly, more of a Suggestion than a gremlin, is there a way to:\n (a) compare character's gear through the item set compare, i.e. populate the item set from a character, or alternatively be able to generate the list from a character, saved and then loaded into the item set. This will greatly assist in comparing 2 characters - a feature I feel would greatly assist in forming raids.\n \n(b) have and over all gear score that is indexed of the highest value. My Boomkin has an overall score of 3010 and my bear has an overall score of 3684 in their respective gear/talent builds. My bear's gear is better, but I was surpised that the value is suggesting its 674 points (22%) better and how comparative are the scores accross the talent builds/classes. My boomkin spec'd has a heal overall value of 4902 - wow, that is almost 2000 points higher than in boomkin form, so clearly there are different scales. \n \nMy think here is that if I am putting a raid together I would love to have an index where I could pull up a character and without having to know each \"benchmark\" for each build/class immediately tell if the character is geared/spec'd adequately. If Rawr could take Current Overall Score divided by the Maxium Overall Score (autoselect best of the best) it would give me an index in which to compare, that way I am not trying to compare my 4902 badly spec'd restokin vs my 3684 better geared bear. Even better, I could say, must have Rawr Score of minimun 75% (or what ever it is), it would encourage people to use Rawr as a benchmark (free marketing) - Rawr benefits, I benefit.",
    "LastUpdatedDate": "2017-11-27T11:00:13.283-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2009-05-07T14:33:29.23-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Moonkin] Talent spec anomolies & Suggestions",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 13187
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "First of all, it's entirely possible that 1 point in Eclipse could cause your DPS to go down.  This is because the changes in the rotation and your current gear status may make it such that it's not worth attempting to force the proc, i.e. your DPS would decrease from forcing Eclipse.  Rawr doesn't model the case where you continue a rotation and just \"happen\" to hit an Eclipse proc, which would probably be a DPS increase.\r\n\r\nAs for Master Shapeshifter, since the bonus is only applied in Moonkin form, you must have the Moonkin Form buff checked in order for it to be effective.  This is true for numerous other selfish effects in the Moonkin model, and it is put in place this way to allow Moonkin to view results when they are not in form.",
      "PostedDate": "2009-05-07T22:09:47.077-07:00",
      "Id": -2147483648
    },
    {
      "Message": "I'm hoping your bear numbers are closer to 200000, instead of just 3000.  I'm guessing you mean cat dps numbers?\r\n\r\nDps models measure dps, tanking models measure surviving incoming damage and healer models healing done. So putting those 3 on similar scales would just be confusing. In principle models of the same class should give comparative numbers:\r\ndps is dps, but most mana based models consider both a burst situation and a mana limited sustained dps (longer fights mean your dps drops). Compare that to a cat model, that benefits from longer fights, since the first few seconds of stacking your dots, become less important, the longer the fight continuous. Some dps models also have a small bonus for stamina. So if you want to compare dps numbers, treat that consistantly across all models, by only using the dps number or manually calculating a consistent stamina bonus.\r\n\r\nRemember though that a warrior doing 3k dps, is never identical to a mage doing 3k dps. From a fight mechanics point of view or even just from group buffs they can provide.\r\n\r\nHaving said all that, this and other comments I have read suggest that we do need to look at the diffierences in the answers provided by the different models and try to get them more comparable/consistent in their reporting (atleast for models in the same category: tanks, healers, melee dps, ranged dps).\r\n\r\n\r\n\r\n\r\n\r\n",
      "PostedDate": "2009-05-15T12:59:33.94-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-08-19T12:52:52.09-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-08-19T13:57:12.103-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-08-19T13:57:44.643-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-09-08T15:10:35.043-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-03-17T20:15:00.62-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-05-20T23:03:27.03-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:34:36.213-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:25:38.86-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2017-11-27T11:00:13.283-08:00",
      "Id": -2147483648
    }
  ]
}