{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Base.ItemFilters",
      "DisplayName": "Rawr.Base.ItemFilters"
    },
    "ClosedComment": "Fixed in commit 49502",
    "ClosedDate": "2010-04-14T07:29:38.1-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "I have big problems with filters, i disable all heroic icc raid items and they are still showing, i disable 258 items and same. Listed items are correctly recognised where they drop (heroic something). but they are still showing in lists?",
    "LastUpdatedDate": "2013-05-16T05:21:34.263-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2010-03-07T09:12:01.74-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[ItemFilters] Broken filters",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 2,
    "Id": 16675
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Redownload Rawr, something is not right with your system as it does work for just about everyone else",
      "PostedDate": "2010-03-07T11:24:05.557-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Are you still having the issue?",
      "PostedDate": "2010-03-09T11:03:49.863-08:00",
      "Id": -2147483648
    },
    {
      "Message": "i have newset version and got some same problems with my alt: ony 10 only still shows everything from ony 25 (but not the other way around)... disabling armor tokkens still shows triumph 245 setitems isntead of only the 232 versions, etc. makes it kinda hard to build a real upgrade list for an alt :/",
      "PostedDate": "2010-03-11T02:26:46.753-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-03-11T02:26:50.843-08:00",
      "Id": -2147483648
    },
    {
      "Message": "The reasom in does that is because the iLvl 245 ite,s require Emblems of Triumph as well as Armor tokens. I create a sub-filter for the Triumph with just the Armor token name then deselect it. I only have 1 toon out of 4 that is here raid ready so when I'm on that toon I elect it then deselect before going to another toon.\r\n",
      "PostedDate": "2010-03-11T07:41:15.33-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Teach me to type while only half-awake. Sorry for the typos in previous post.\r\n\r\nTo clarify, select Tools--> Edit Item Filters--> Select Special Currency --> Select Emblem of Frost, then Click on Create Subfilter.\r\n\r\nAt this point I simply make the name 'Trophy of the Crusade' and put 'Trophy of the Crusade' in the Pattern box. (no marks just the phrase)\r\n\r\nBy deselecting this new filter while Emblem of Frost is selected, you will now see just the 'Emblem only' purchasable items that require no Armor tokens.\r\n\r\nBTW it would be nice if something along this line could be incorporated into the default filters. I think lots of people would benefit from it, I know I would.",
      "PostedDate": "2010-03-11T09:41:15.853-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Sorry for late response, i kind forgot about this. \r\n\r\nI have my alt resto shaman Ergon | Moonglade | EU that im interested in checking gear for. \r\nAt filters i go and untick icc25 (both) and icc10 heroic. \r\n\r\nAt heads it still shows 264 head you get from token but ok, that might apply to post made here, but at necks, best neck it lists is 264 Soulcleave pedant, at cloaks it shows 264 Frostbinder's Shredded Cape also. After i do manual refresh from armory, they seem to go away. So it seems problem with something else not actual filters. ",
      "PostedDate": "2010-03-13T07:09:17.567-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Also how would be easiest way to filter out all items that have \"Sanctified\" in name (ie all tier items that require token)?",
      "PostedDate": "2010-03-13T07:13:25.707-08:00",
      "Id": -2147483648
    },
    {
      "Message": "The items going away indicates that the filters are working right but onlt after the items get the right source data. Each release has a lot of wrong source info that is easily corrected with refreshing item or even better refreshing relevants.\r\nAs for the \"Sanctified\" items, make sure they have correct sources then deselect Armor Tokens under Special Currencies, they should be hidden now.\r\n",
      "PostedDate": "2010-03-13T10:16:34.037-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-03-31T21:57:21.787-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-04-14T07:29:38.1-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-09-08T16:19:37.49-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-03-17T19:05:05.29-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:29:33.057-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:21:34.263-07:00",
      "Id": -2147483648
    }
  ]
}