{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "",
    "ClosedDate": "2010-01-29T01:55:57.66-08:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "I am having a issue with using RAWR. I can't seem to see all of the gear details. It seems the mousover box is too small for alll of the gear details and is cut off. Can you tell me how I can fix this or is their a option to change the font size. I am pretty sure there are many people with high-end video cards with large monitors to play WOW. I use a resolution of 1920x1200 for maximum awareness with a high fps. Having a large screen to play WOW is a benefit and since RAWR is a tool that maximizes your toons output then it makes sense to have a adjustable font size or a mode for larger DPI settings for people like me. If I was switch to the regular DPI just to use RAWR I would have to reboot the PC to use it and vice versa to go back to my regular DPI for normal use. If I was to stick to the regular DPS I would have to squint and it hurts my eyes. If theirs a font/DPI size option please advice me.\n \nYours Truly,\nFacejob",
    "LastUpdatedDate": "2013-05-16T05:22:03.287-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2010-01-29T01:22:54.577-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "Vista64 DPI on a 1920x1200 makes RAWR font too large to use",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 16159
  },
  "FileAttachments": [
    {
      "FileId": 2869,
      "FileName": "DPI FONT size issue proof.jpg",
      "DownloadUrl": ".\\2869"
    },
    {
      "FileId": 2871,
      "FileName": "New Bitmap Image.jpg",
      "DownloadUrl": ".\\2871"
    }
  ],
  "Comments": [
    {
      "Message": "This is not a bug. Please search for the existing issues on the topic. You should fix your DPI setting to 'Normal', as that is the only one that is fully supported by most software. You do not need to set it to a different value, nor do you have to reboot to change it. Regardless, this is obsolete in Rawr3. See the other issues about this for further info.",
      "PostedDate": "2010-01-29T01:50:53.847-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-01-29T01:55:57.66-08:00",
      "Id": -2147483648
    },
    {
      "Message": "WRONG. Refer to the attached screen shot its clear as day \"This change will take effect after restart\"",
      "PostedDate": "2010-01-29T17:08:02.923-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-01-29T17:08:07.717-08:00",
      "Id": -2147483648
    },
    {
      "Message": "The JPEG file attachment called \"New Bitmap Image.jpg\" shows that you do in fact need to reboot for changes to the DPI setting from \"NORMAL to LARGE\" and vice-versa \"LARGE to NORMAL\".",
      "PostedDate": "2010-01-29T17:14:01.093-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:30:09.667-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:22:03.287-07:00",
      "Id": -2147483648
    }
  ]
}