{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "Closing this because of all the BS in it. tyler517, please repost with more information about what you think is wrong. We need you to follow the posting guidelines and provide a character file where it occurs and details on what you see in Rawr.",
    "ClosedDate": "2011-02-07T10:36:17.04-08:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "This trinket is still VERY VERY LOW on the upgrade list and should drastically either re worked or fixed in some way...",
    "LastUpdatedDate": "2013-05-16T05:18:46.71-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2011-02-04T22:17:13.71-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "Could Heart of Ignacious be fixed? Please",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 19913
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Please follow the Posting Guidelines. This isn't near enough info to actually help you.",
      "PostedDate": "2011-02-04T22:23:15.7-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Ya know Jothay, your helpfulness on issues and discussions leaves a lot to be desired from a dev. Whether you're volunteering your time or not, your quippy responses and sometimes all out rude statements are rather irritating. A simple opening of rawr and loading up boomkin or any caster for that matter, will show you exactly what he's talking about. I appreciate your work, don't get me wrong....but your attitude at times just sucks. But hey, just an opinion of a \"luser\".",
      "PostedDate": "2011-02-05T15:40:15.323-08:00",
      "Id": -2147483648
    },
    {
      "Message": "He is referring to what module you are referring to? The trinket is modeled correctly. The issue is that the modules that you want info on need to make the trinket relevent.",
      "PostedDate": "2011-02-05T16:00:17.587-08:00",
      "Id": -2147483648
    },
    {
      "Message": "We don't say these 'rude' statements to be rude (usually, and for the most part we're pretty damn polite, saying things like \"please\", and pointing you in the right direction), it's because we're tired of asking the same question a bajillion times. We're not in the wrong; you are. Stop being dumb, and we'll stop asking you (politely, if I might point out) to stop being dumb.",
      "PostedDate": "2011-02-05T17:03:35.37-08:00",
      "Id": -2147483648
    },
    {
      "Message": "I'm really trying to understand where \"luser\" is being polite. This is just one of many instances where Jothay has decided to answer rudely or not completely read the question. But there's something you have to consider when you are putting out a utility like this. Most end-game raiders who are the 'elistists' if i may refer to them as that...really don't need rawr to calculate their gear. It's the lower tiered players that you are attracting. The layout of this site is honestly very very bad for getting input and tracking issues. Microsoft was never known for their \"easy to use\" forums. But when you say you are trying to do something great for the community, I don't think being crass with the users is the way to go. \r\n\r\nI've said this many times in the past, love the work you all put into this and I would never take that from you. It's just a pattern I've seen lately where the 'canned' responses are triggered before a dev truly reads the post. Posting guidelines are almost never read on any forum you go to. It's something that every forum goes through. This site isn't special in that regard. I think a more simplistic or orderly forum would help soothe your ire for those asking the same questions over and over. Either way, love the addon and appreciate all your hard work. I know you all volunteer your time for this and i thank you for it.",
      "PostedDate": "2011-02-05T18:12:14.817-08:00",
      "Id": -2147483648
    },
    {
      "Message": "The idea that the highest tier of raiders don't need Rawr to calculate their gear is utter bullshit and couldn't be further from the truth.\r\n\r\nYeah, CodePlex's usability is rather poor in this regard, no disagreement from us, and we're working with CodePlex to improve things.\r\n\r\nI don't see the canned responses being used anywhere where they aren't warranted, though I'm sure it happens occasionally, with all the huge volume of rubbish that gets thrown our way. If you see any, please politely respond that the dev may have misunderstood something and that they should reread the OP.\r\n\r\nIt's pretty damn rare that we're impolite at all, and I stand by the behavior of all of us devs. You're posting this in an issue where the OP posted an obviously stupidly useless issue, and got politely told to follow the posting guidelines, and pointed in the right direction. And you're bitching about Jothay having said something *he never even said* (Dopefish called someone a \"luser\", not Jothay). Get your facts straight before hopping on the 'wahh Rawr devs are mean to me' bandwagon. ",
      "PostedDate": "2011-02-05T19:47:00.11-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Actually you are right, it was Dopefish and i apologize for quoting the wrong person...but it makes it right that a dev talks like that and you stand behind it eh? Very nice coming from the original author of rawr. Your fans are behind you 100% im sure. Thx for your time though, its been most appreciated.",
      "PostedDate": "2011-02-05T22:47:43.543-08:00",
      "Id": -2147483648
    },
    {
      "Message": "I certainly do. He certainly could have been politer, but calling someone a 'luser' is hardly very offensive. Given his frustration with repeated stupid posts, I perfectly understand where Dopefish was coming from.\r\n\r\nI'm sure that the majority of our users are behind the devs, especially against the idiots who waste our time when we could be helping the userbase out more.\r\n\r\nDone wasting our time yet?",
      "PostedDate": "2011-02-06T00:17:49.193-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Trying to figure out what exactly is the problem here.\r\n\r\nLooking at http://www.wowhead.com/item=59514/heart-of-ignacious it shows that Heart of Ignacious has the following properties:\r\n\r\nEquip: Your damage spells grant Heart's Revelation, increasing spell power by 77 for 15 sec and stacking up to 5 times.\r\nUse: Consumes all applications of Heart's Revelation, increasing your haste rating by 321 (2.51% @ L85) per application consumed.  Lasts 20 sec. (2 Min Cooldown)\r\n\r\nThe effects are currently modeled in the ItemCache as:\r\n<SpecialEffect>\r\n                    <Trigger>Use</Trigger>\r\n                    <Stats>\r\n                        <HasteRating>1605</HasteRating>\r\n                    </Stats>\r\n                    <Duration>20</Duration>\r\n                    <Cooldown>120</Cooldown>\r\n                    <Chance>1</Chance>\r\n                    <MaxStack>1</MaxStack>\r\n                    <LimitedToExecutePhase>false</LimitedToExecutePhase>\r\n                </SpecialEffect>\r\n                <SpecialEffect>\r\n                    <Trigger>DamageSpellHit</Trigger>\r\n                    <Stats>\r\n                        <SpecialEffects>\r\n                            <SpecialEffect>\r\n                                <Trigger>DamageSpellHit</Trigger>\r\n                                <Stats>\r\n                                    <SpellPower>77</SpellPower>\r\n                                </Stats>\r\n                                <Duration>15</Duration>\r\n                                <Cooldown>0</Cooldown>\r\n                                <Chance>1</Chance>\r\n                                <MaxStack>5</MaxStack>\r\n                                <LimitedToExecutePhase>false</LimitedToExecutePhase>\r\n                            </SpecialEffect>\r\n                        </SpecialEffects>\r\n                        <SpecialEffectCount>1</SpecialEffectCount>\r\n                    </Stats>\r\n                    <Duration>120</Duration>\r\n                    <Cooldown>120</Cooldown>\r\n                    <Chance>1</Chance>\r\n                    <MaxStack>1</MaxStack>\r\n                    <LimitedToExecutePhase>false</LimitedToExecutePhase>\r\n                </SpecialEffect>\r\n            </SpecialEffects>\r\n\r\nSo this seems correct (same for the heroic versions).\r\n\r\nIs the relation between the on use effect and the stacking effect modeled? (since the use effect consumes all the stacks?) Or does the SpecialEffectCount 1 part in the DamageSpellHit SpecialEffect handle this?\r\n\r\nSo looking at the data, it seems to be modeled correctly? So if this is still wrong then it might be somewhere else (and possibly happening for other trinkets?)",
      "PostedDate": "2011-02-06T01:19:27.767-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Ok, apparently apart from the items being modeled in the ItemCache, there is actually a SpecialEffects.cs that models behaviour in code.\r\n\r\nI have set 2 breakpoints: line 941: ProcessEquipLine handling, line 2014: ProcessUseLine handling\r\n\r\nNext I start Rawr in the debugger, load a character (shadow priest) from Battle Net, select Tier11/The Bastion of Twilight from the item filter and look at the trinkets.\r\n\r\nI would have expected the 2 breakpoints to be hit, but they are not.\r\n\r\nI can see the Heart Of Ignacious having a calculated rating improvement of 0 which results it being very low in the equipment upgrade list.\r\n\r\nI also tried making a saved profile with the trinket equipped, and loading it in a newly started Rawr instance, but again the code is not triggered.",
      "PostedDate": "2011-02-06T02:29:07.827-08:00",
      "Id": -2147483648
    },
    {
      "Message": "You have some serious issues if you dont think 'luser' is offensive. Really need to get back to reality man. I guess internet anonymity really does things to some people. If you think my posts are wasting your precious dev time maybe you should go back and look at your signature on elitist jerks. Create something great for the community? Or create something great for the 'non-lusers'? It's sad man, i actually had respect for what you did for the community. Now, not so much. I was never offended personally on this site. Still i'm not, just not so impressed to tell the truth. Either way, the work put into rawr is a huge undertaking and I understand that. But if your really to the point where you need to be derogatory to your users/posters, don't ya think ya need a lil break?\r\n\r\nAll this aside, Hinalover answered this original post quite well and didn't have to offend anyone in the process. ",
      "PostedDate": "2011-02-06T02:41:31.99-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Wow, I can't believe one silly little word that was meant to be equal parts amusing and harsh has caused such a ruckus.  I'm sorry for offending anyone, because I certainly didn't mean it that way, but I also meant every word that I said.  I took a tough tone with that post because I had to answer a *discussion* (which we've repeatedly asked users not to use to report issues) at least once a week on that topic.  While I am a contributing member at Elitist Jerks and all that implies, I like to think I'm respectful to people who correctly follow the process.  I hardly feel the \"need\" to be derogatory to our users, and in fact it's pretty rare that I do so.",
      "PostedDate": "2011-02-06T07:44:52.52-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-02-07T10:36:17.04-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:26:03.88-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:18:46.71-07:00",
      "Id": -2147483648
    }
  ]
}