{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.ProtPaladin",
      "DisplayName": "Rawr.ProtPaladin"
    },
    "ClosedComment": "Old issue.",
    "ClosedDate": "2009-08-09T17:32:05.403-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "Since I made my last post, I spoke with a few people and decided that various changed should be made in order for the Protection Paladin Rawr to be more usefull.  Below are a list of things I could think of as needing updates.  Some of these things are being worked on and some of them need to be worked on.\nSoleiu has been working on a great deal of these and should be nearing completion of some.  I figure I will start here and people can give their opinions.  If you would like to add something to the list and or develop some changes, feel free to reply.  Looking for suggestions from everybody. \nA very large portion of Rawr.Tankadin may need to be rewritten/reorganized.  Rawr.Mage is very well done and impressively close to simulating the game.  I am not expecting for Rawr.Tankadin to be anywhere as good as Rawr.Mage anytime soon, but it could definitely use some improvements.\n \n \nBuffs\nResistance auras to be used for EH with\nSet bonuses.  2 piece prot set bonus.\n \nGear scores corrected for Mitigation, Survivability, and Threat.\n \nOptions\n \n    * Seals: Seal of Righteousness, Seal of Vengeance/Corruption, Seal of the Martyr/Blood, and even Seal of Command. \n \n    * Major Glyphs: Glyph of Seal of Vengeance, Glyph of Concencration, Glyph of judgement, Glyph of Seal of the Martyr, Glyph of Spiritual Attunement.\n    * Minor Glyphs: Glyph of Sense Undead.\n    * Number of targets being tanked. and attack speed.\n    * Magic attacks added to incorporate current content boss fights.  Include magic damage, frequency and type (fire, arcane, frost, etc.,)\n    * Sacred shield (self).  Use own spell power.\n    * Sacred shield (holy). Assume 2200 spell power.\n \nThreat stats\n    * Change to reflect options for Seals\n    * Change concencration to reflect Glyphs.\n    * Change HS to reflect a realistic number of charges expended.  (based on number of targets being tanked.)\n    * Change HotR to reflect number of targets being tanked.\nBlock value reflecting threat increases.\n \n \nItems\nLibram of Obstruction\nLibram of Resurgence\n \nResilience being to be updated for WotlK.\nCrit avoidance added to optimize.\n \nAgain these are a list of things currently being worked on and or need to be worked on.  If  are working on them, or you would like to be, please reply so we can organize and split the labor.",
    "LastUpdatedDate": "2013-05-16T05:26:10.707-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Medium",
      "Severity": 100,
      "Id": 2
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2009-02-24T03:08:03.473-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[ProtPaladin] Task List",
    "Type": {
      "Name": "Task",
      "Id": 2
    },
    "VoteCount": 3,
    "Id": 12671
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "\"Gear scores change from Mitigation, Survivibility, and Threat to EH, Avoidance, and Threat\"\r\n\r\nI think that this would be the biggest enhancement out of the entire list of things that you have here. \r\n",
      "PostedDate": "2009-02-25T11:38:58.613-08:00",
      "Id": -2147483648
    },
    {
      "Message": "No, Effective Health is not a good way to rate gear.  Mitigation, Survivability, and Threat are the correct ways to rate gear for a tank, in Rawr.",
      "PostedDate": "2009-02-25T12:24:40.373-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Jenovadin and I were originally talking about this change, and I haven't had a chance to talk to him about it since.\r\n\r\nI think we'll be sticking with Mitigation Survival and Threat, and I'll just try to define it better for prot paladins as well as make sure the formulas are correct.\r\n\r\nTo restate what Astrylian says.. it's the way Rawr does it for Bears, Warriors, and Tank DKs, and it works for them. If it is confusing anyone, I'll look into the tooltip, and see about it in the upcoming Rawr Help stuff that's coming up.",
      "PostedDate": "2009-02-25T17:28:37.05-08:00",
      "Id": -2147483648
    },
    {
      "Message": "````````````````````````````````````````````````````````````````````````",
      "PostedDate": "2009-02-26T06:44:00.9-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-02-26T06:44:03.837-08:00",
      "Id": -2147483648
    },
    {
      "Message": "I agree it would be too much work to change and it would be more confusing.  We know what it means as it is now, although it is a bit confusing at first look.",
      "PostedDate": "2009-02-26T06:45:53.477-08:00",
      "Id": -2147483648
    },
    {
      "Message": "I was applauding the \"Avoidance\" idea more than the others. EH is a thrown about term, and it means something different to everyone, it seems.\r\nThat being said, it would be nice to be able to tell the optimizer to hit the block cap before the optimizing for one of the other options.\r\nIs that something we can expect to see? Maybe on the Optimizer window itself, as an additional requirement?\r\n\r\nThanks for your time and hard work, folks.",
      "PostedDate": "2009-02-26T08:52:51.457-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Adding items to the optimizer is probably one of the more simple tasks. My only concern is adding *too many* things to the optimizer and requirements.\r\n\r\nCurrently I have: health, chance to be crit, chance to be hit, block value, defense, raw TPS, chance to hit, and expertise.\r\n\r\nI can add \"Avoidance\" which ignores Block chance, and I can even break it down into Dodge and Parry, that's no problem. ",
      "PostedDate": "2009-02-26T11:13:11.097-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Some character stats seem to be inaccurate (too low), especially dodge and expertise.",
      "PostedDate": "2009-03-02T18:24:10.96-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-03-02T18:24:13.15-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Dodge is where it should be, given the default Boss Attack and Mitigation Scale values.\r\n\r\nExpertise only applies to threat from White Attacks and Hammer of the Righteous, so it has a *very* low threat value. Once add a detail for multiple threat targets, or using seal of righteousness, it might jump up in value, but otherwise Expertise has very little value in a \"middle of the fight\" calculation style like this one.",
      "PostedDate": "2009-03-02T19:39:11.077-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-03-02T19:54:24.86-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-03-02T19:54:25.797-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Hey Solieu, thanks for your reply and cheers for the effort you put into the Tankadin module.\r\nThe threat model for expertise is just fine, it's the rating conversion I was refering to being incorrect.\r\n\r\ncopy-pasting my post from the Maintankadin foum:\r\n\r\nFeedback on 2.2.03b:\r\n\r\n- Expertise Skill gained from Expertise rating is off.\r\n\r\nCreate a new untalented character, select dwarf paladin, equip [url=http://www.wowhead.com/?item=34472]Shard of Contempt[/url], and gain 1 expertise (should be 5.37, which is 1.25% parry/dodge neglect).\r\nBoth the warrior and DK modules calculate the correct values (the dk module even requires you to equip a weapon before it shows parry chance)\r\nNote: This is also true for 2.1.9\r\n\r\n\r\n-Dodge chance too low. \r\n\r\nI set the target level to 80 to have the avoidance values match with the in game chararacter screen.\r\nThe boss combat table of Rawr 2.2.03b lists my dodge: 19.35% and parry: 17.97%.\r\n\r\nGetDodgeChance() should retun the dodge value for a lvl 80 attacker after DR. \r\nThe value returned from the game is 20.984....%\r\n\r\nMy dwarfs stats naked: 400def, 9.92% dodge, 10% parry, 86 agility.\r\nHe equips gear that grants: 140 defense skill (689 rating), 239 dodge rating, 176 parry rating, 22 agility.\r\n\r\nDodge: 140*0.04+176/39.35+22*0.0192 = 12.096% before DR and 11.064% after DR.\r\nParry: 140*0.04+176/49.18 = 9.178% before DR and 7.972 after DR.\r\n\r\nAdding the base values results in 20.98% dodge and 17.97% parry and those numbers match the character screen.\r\n\r\n\r\n-Chance to be missed is too high.\r\n\r\n540 defense skill grants me 9.288% chance to be missed for a lvl 80 attacker after DR.\r\n\r\nThe tankadin module lists my chance to be missed as 9.60% for a lvl 80 attacker and 9% for a lvl 83.\r\n\r\nAccording to Whitetooths [url=http://elitistjerks.com/f31/t29453-combat_ratings_level_80_a/]formulas[/url] the the caps and calculations for DR on chance to be missed are the same for Paladin, warrior and deathknights.\r\n\r\nThe ProtWarr module calculates these numbers correctly, while the TankDK module returns even higher chance to be missed (10.21% for lvl 80 and 9.61% for lvl 83)",
      "PostedDate": "2009-03-03T09:45:26.957-08:00",
      "Id": -2147483648
    },
    {
      "Message": "I've figured out the expertise problem. The common number that is out there to convert \"Expertise Rating to 1% Parry/Dodge Reduction\" is of course, four times the value of \"Expertise Rating to Expertise\"\r\n\r\nAdmittedly, in my earlier response, I had said \"Expertise only applies to threat from White Attacks and Hammer of the Righteous, so it has a *very* low threat value.\" and now I realize it was my own internal excuse for why the value was nearly four times lower than it should be.",
      "PostedDate": "2009-03-03T11:12:55.81-08:00",
      "Id": -2147483648
    },
    {
      "Message": "One easy fix that'd be nice to see sorted out - the base stats for a blood elf paladin are off in a couple of places. Stamina is 1 too high for some reason (should be 191, currently 192), and strength is off by 22, or more accurately, by 15% - the base value of 170 currently is actually the value when specced into divine strength, it should be 148.\r\n\r\nAlso, the naked (untalented/unbuffed/etc) block value is slightly off - in-game it's 64, in Rawr it's 85. Not entirely sure what might be causing the disparity - it's at least partly due to the str being incorrect, but that doesn't fully explain it (170/2 == 85, but 148/2 != 64), so there's something else going on. 64 is 10 below what you'd expect from 148 str, and the base strength at level 1 for a blood elf paladin is 19, so that not being counted, combined with some rounding, might explain it. That's a total shot in the dark, though, and would need to be tested by other races to get any kind of confirmation.\r\n\r\nI'm also seeing the discrepancies in dodge/parry/block/miss chances that Negarine noted (even when completely naked and untalented, the game has my dodge chance at 5.03%, while Rawr says 5%). \r\n\r\nMiss is particularly odd - right now. the tankadin module seems to have not implemented DR on it, *but* base miss chance is for some reason set to 4% (naked/untalented, level 80 mob miss says 4%, add gear with exactly 689 def rating for +140 def, miss jumps to 9.6%)",
      "PostedDate": "2009-03-14T14:11:00.847-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Damn, no edit function - the base stamina values i listed were 50 too high, forgot i had Toughness enabled (i don't mind dropping a few gold on respec fees to test something, but i'll be damned if i'm going to drop mining and level it up from scratch again...). So they should be 141 in-game, 142 in Rawr.",
      "PostedDate": "2009-03-14T14:12:53.08-07:00",
      "Id": -2147483648
    },
    {
      "Message": "All of the things you have talked about, Arhra, have been addressed in the latest svn versions more than a week ago, and will show up in the next beta.",
      "PostedDate": "2009-03-14T18:00:41.497-07:00",
      "Id": -2147483648
    },
    {
      "Message": "By the way, Sacred Shield doesn't stack. The ICD on the proc is shared between all of the buffs.",
      "PostedDate": "2009-03-15T08:51:43.17-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-03-16T12:36:32.997-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-04-22T05:02:29.257-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-08-09T17:32:05.403-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-07-09T12:30:06.793-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-09-05T16:37:35.2-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-09-05T16:37:40.84-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:35:24.873-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:26:10.707-07:00",
      "Id": -2147483648
    }
  ]
}