{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "",
    "ClosedDate": null,
    "CommentCount": 0,
    "Custom": null,
    "Description": "I picked up several new upgrades, so after running them through the optimizer and getting my new results, I built a new upgrade list.  You can imagine my surprise when I saw Wrath of Unchaining in LFR and normal varieties listed as 12000 and 14000 point upgrades.\n \nWhen I looked further, the optimizer was pairing ilvl 390 WoU with Fluid Death to arrive at those numbers.  When I looked at the Calculations tab in the optimizer, it was showing my crit rating dropping from 950 to 805, but my listed Crit Chance increasing from 31.25% to a whopping 66.52%.\n \nNeither trinket has any raw crit, and even if both of those trinkets were stacked to their maximum agility (78x10 and 35x10), that'd still only be 1160 agility or ~3.75% crit.  The only other changes to my gear involved swapping a ring and my cloak, but clearly those changes wouldn't account for the remaining 30-some percent crit chance.\n \nRemoving the Fluid Death from my list of possibilities and rerunning the upgrade list returned the result that the LFR trinket was no longer an upgrade at all, and the normal 403 ilvl trinket was a much more reasonable ~300 point upgrade.\n \nNot sure how those two trinkets were interacting to produce wacky numbers, and it may not even be relevant any longer since FD is so old, but I thought I'd pass it along anyhow, so you could make the call about whether to investigate it or not.  In the meantime, I'm just taking FD off my equipment list and proceeding as normal.",
    "LastUpdatedDate": "2013-02-21T18:24:01.31-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2011-12-14T19:20:28.307-08:00",
    "Status": {
      "Name": "Proposed",
      "Id": 1
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Rogue] Wrath of Unchaining wacky interaction with Fluid Death",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 21913
  },
  "FileAttachments": [
    {
      "FileId": 5493,
      "FileName": "pennet with FD.xml",
      "DownloadUrl": ".\\5493"
    },
    {
      "FileId": 5494,
      "FileName": "penn crazy upgrade.xml",
      "DownloadUrl": ".\\5494"
    },
    {
      "FileId": 5495,
      "FileName": "pennet upgrade.xml",
      "DownloadUrl": ".\\5495"
    },
    {
      "FileId": 5497,
      "FileName": "BIS Kitty.xml",
      "DownloadUrl": ".\\5497"
    }
  ],
  "Comments": [
    {
      "Message": "Added upgrade list with wacky numbers",
      "PostedDate": "2011-12-14T19:21:32.53-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-12-14T19:22:50.163-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Added normal upgrade list (no Fluid Death)",
      "PostedDate": "2011-12-14T19:22:51.43-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-12-15T16:46:43.53-08:00",
      "Id": -2147483648
    },
    {
      "Message": "This is happening for my Druid as well, at least as fat as the Fluid Death being ranked as a massive DPs increase. This seems to have happened with almost all trinkets. The Stats for the Fluid Death trinket do appear correct, 321 hit rating and 10x38 agility for 15s stacking 10 times. This is happening for me on both 4.3.1 and 4.3.2, but not in 4.3.0",
      "PostedDate": "2011-12-15T16:46:45.043-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:24:01.31-08:00",
      "Id": -2147483648
    }
  ]
}