{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Hunter",
      "DisplayName": "Rawr.Hunter"
    },
    "ClosedComment": "",
    "ClosedDate": "2010-07-06T10:13:46.777-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "I found out that in Rawr armor penetration is not considered as highly priced as it should be. Rogues, feral cats, and MM hunters are gemming straight armor penetration because of the high increase in DPS. Ive been checking formulas about armor pen and there's a rule that goes as follows:\n \n0-400 arm pen u gem agility\n400-1400 u gem armor penetration (this has exceptions like for example if u using needle encrusted trinket that gives extra arm pen, ur cap should be at 700+ approx)\n \nI link a page with some formulas regarding arm pen, i just think rawr is not considering the high dps arm pen can give once u reach the cap \n \nhttp://brigwyn.com/2010/01/20/hunter-101-punching-through-armor-penetration/\n \nThank you for your time :), i just want to make Rawr better and if I'm wrong and arm pen not that good just wanna know",
    "LastUpdatedDate": "2013-05-16T05:20:22.843-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2010-07-02T11:35:49.42-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Hunter] Armor Penetration",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 18125
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Uhhh, if you have a specific issue to address with a certain model we can take a look but ArP Rating should have the values it's supposed to have at the right levels. We don't do it on a chart of 0-400 rating or whatnot.",
      "PostedDate": "2010-07-02T12:05:02.473-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-07-02T12:05:39.793-07:00",
      "Id": -2147483648
    },
    {
      "Message": "So rawr doesnt recommend to have arm pen cap? thats 1400 armor penetration, just want to know what gems are better straight armor pen, or the ones rawr suggest",
      "PostedDate": "2010-07-05T09:56:10.97-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Rawr will definitely recommend you push to the Armor Penetration cap *if it yields the highest DPS for you at your current gear level*. Like I said, if you have a specific character that it's telling you *not* to gem ArP and you think that's incorrect, you need to follow the Posting Guidelines and attach the character file, then we can tell you what you are most likely doing wrong.",
      "PostedDate": "2010-07-05T10:04:17.01-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Valdi, here's how you think it works:\r\n\r\nIf you can get 400 or more ArP, then the program recommends ArP.  If no, then it recommends Agility.  In other words, we just assign a stat a value at certain thresholds.\r\n\r\nHere's how it actually works:\r\n\r\nThe program takes what each point of each stat actually does for you based on a series of calculations to determine which piece of gear will do the most for you.  That is, we don't tell the program what to do with each stat, we just say \"this is how the character works\", \"here's what this stat does for this character\", then throw a bunch of gear at it and see what happens.  And, for Arms Warriors, Fury Warrior, Feral Druids, MM Hunters, certain Rogues, and potentially Blood DKs, ArP is in fact the stat of choice.  There is nothing wrong with ArP within Rawr - it's capping at the right point, and is contributing the right amount of ArP per point of ArP.  If it's not optimal for you particular character to be going for ArP, then it's not - simple as that.  Any time you see a \"\"\"rule\"\"\" that says \"at x level of stat y, go for stat y above all else\" is a GUIDELINE and a BAD THING TO FOLLOW BLINDLY (that is, ignoring your character as a whole).\r\n\r\nRawr is functioning correctly.",
      "PostedDate": "2010-07-05T10:09:04.9-07:00",
      "Id": -2147483648
    },
    {
      "Message": "tyvm ",
      "PostedDate": "2010-07-06T09:13:25.133-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-07-06T10:13:46.777-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-09-05T18:55:28.777-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:28:04.45-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:20:22.843-07:00",
      "Id": -2147483648
    }
  ]
}