{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Hunter",
      "DisplayName": "Rawr.Hunter"
    },
    "ClosedComment": "Don&#39;t Optimize with &#39;Talents&#39; in Hunter module, you&#39;ll never get a good result. You can use &#39;Talent Specs&#39; instead if you create several Specs in the Talents Pane. Don&#39;t use &#39;Talent Specs&#39; and &#39;Talents&#39; at the same time in ANY module",
    "ClosedDate": "2009-10-28T10:34:43.677-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "I have played around with the optimizer, and have got a questionable result.\nIt suggests that using the same Gear, Gems and Enchants, that by changing some talents that my dps would increase from 6419 to 6439 dps. I am very surprised that it recommends removing 2 points from Resourcefulness, as this looses 4 seconds of 6% extra damage and 4 seconds for Lock and Load to proc, together with the extra 4 seconds of Shadow Damage. Instead it suggests putting a point into Hunting Party, increasing the points in that talent to 3/3 and putting the other point in Improved Hunter's Mark.\n(I have not included the use of Viper Sting in the options, as I don't run out of Mana with the buffs).\nI really feel that the calculations with this may be somewhat flawed. Please could you confirm. I will send you the .xml file if you require",
    "LastUpdatedDate": "2013-05-16T05:23:38.443-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2009-10-27T15:02:17.95-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Hunter] Optimiser suggesting 1/3 Resourcefulness for SV",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 14555
  },
  "FileAttachments": [
    {
      "FileId": 2415,
      "FileName": "BeerOptSame.xml",
      "DownloadUrl": ".\\2415"
    }
  ],
  "Comments": [
    {
      "Message": "Yes, we always require the character file to debug character-specific issues.",
      "PostedDate": "2009-10-27T15:19:48.99-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Optimizing of Talents is generally unsupported in most models, unless it is specifically stated to be a model feature (the Mage model comes to mind, if I'm not mistaken).  I would personally recommend you create a few fully fleshed-out Talent Specs (that include a few variations of the same base spec, simply moving the last few \"extra\" talents around between your various options), and selected \"Talent Spec\" (as opposed to \"Talents\") as an additional property to optimize, on the Optimize window.\r\n\r\nYou can attach your character XML directly to this Issue, using the \"Attach File\" on this page.",
      "PostedDate": "2009-10-27T15:31:12.283-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Hi, thank-you for the reply. Here is the xml file. If you optimize with the talent spec and talent options, that is all that will change. I am hoping that by the end of the day, I will be wearing 4pce Triumph gear, (as I have 2 Trophies in my bags), I will send you the updated xml when this is so. Thanks again,\r\nJay",
      "PostedDate": "2009-10-28T04:19:09.867-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-10-28T04:19:11.643-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Please also note that the hunter model is in the process of having a major overhaul. Its calculations are not fully up-to-date with current patch info.",
      "PostedDate": "2009-10-28T04:21:18.59-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-10-28T10:34:43.677-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-09-05T18:37:46.52-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:32:09.003-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:23:38.443-07:00",
      "Id": -2147483648
    }
  ]
}