{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Moonkin",
      "DisplayName": "Rawr.Moonkin"
    },
    "ClosedComment": "Operating as Intended. Mastery doesn&#39;t actually have value until it hits a breakpoint. The Stat Graph shows this better than RSV&#39;s ever will. There is no fixing this unless he breaks the model to improperly show value for partial mastery.",
    "ClosedDate": "2011-03-02T19:49:40.717-08:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "When viewing the relative stat values, mastery does not appear",
    "LastUpdatedDate": "2017-11-27T11:00:20.517-08:00",
    "PlannedForRelease": "Rawr 4.0.20 Beta",
    "ReleaseVisibleToPublic": true,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2011-02-24T11:22:57.523-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Moonkin] Mastery missing from relative stat values",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 20082
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Working as intended.  Check the release notes; mastery only works in whole increments of Eclipse % (per the Elitist Jerks thread), and I put this \"flooring\" functionality into Rawr.  It broke the relative stat values graph, but I added a new graph to the Moonkin options panel so you could visually see the effect.",
      "PostedDate": "2011-02-24T11:31:30.06-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Is this implemented in the 4.0.20b release? If so -- I'm apparently a bone head since I can't spot it. If it is implemented in the code but not the release, then please disregard :)",
      "PostedDate": "2011-02-24T12:02:49.067-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Dopefish, could you tell me where that graph is?  I'm looking in 4.0.20.0b, and I couldn't find it.\r\n\r\nAll I see in the \"moonkin specific\" menu is Damage per Cast Time and Mana Gains By Source...\r\n\r\nThanks.\r\n",
      "PostedDate": "2011-02-25T12:18:20.55-08:00",
      "Id": -2147483648
    },
    {
      "Message": "I looked at the source code and found it.  It in the \"options\" tab of the character pane (between buffs and boss handler),\r\nunder the button labeled \"Display Stats Graph\"\r\n\r\nI still believe that the relative stat values chart is wrong.\r\n\r\nI have 3.2% extra mastery (720 rating).  It says I need 86.76 rating to the next breakpoint in the mouseover tooltip.\r\nThere should be some value to that 3% mastery.  But I guess that's a question as to what this chart should display:\r\nthe incremental value of one more mastery (which makes sense for hit, esp hit capped) or the avg value of \"a few more\r\nmastery\", such that hitting the next % would yield.\r\n\r\nFor my use case (feeding this into pawn, for a quick and dirty valuation of a piece of gear) I would need the avg\r\nvalue, so that I could get a quick feel of the relative value of my secondary stats.\r\n",
      "PostedDate": "2011-03-01T20:45:17.54-08:00",
      "Id": -2147483648
    },
    {
      "Message": "That's just the thing: It's been demonstrated that there is _no_ value unless you can get enough to hit the breakpoint.  Also, why can't you just use Rawr for a quick and dirty valuation of a piece of gear?",
      "PostedDate": "2011-03-02T04:30:18.15-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-03-02T19:49:40.717-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-05-20T23:03:27.03-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:25:48.833-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:18:35.37-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2017-11-27T11:00:20.517-08:00",
      "Id": -2147483648
    }
  ]
}