{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Warlock",
      "DisplayName": "Rawr.Warlock"
    },
    "ClosedComment": "Not even going to dignify this with a response.Read open issues before posting a new one for the same thing",
    "ClosedDate": "2009-10-27T12:09:50.167-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "As far as i know, for a destro lock haste > crit.  I was surprised when Rawr! chose a 12SP/10Crit gem for my pants over a 12SP/10 haste gem when I optimized my gear yesterday.  Looking at the relative Stat Values for Haste and Crit in the enclosed file, I see that Haste = 1.62 and Crit = .74.  Those seem reasonable.   But items that are haste related seem very much off kilter.\n \nIf you load the enclosed .xml file you will see the following:\n \n1) Haste Food buff = -63.2\n2) All gems that have to do with Haste are valued in the negative.\n3) All haste related enchants in the negative\n \nCreate a custom gemming of the pants I have equipped and put a Reckless Ametrine (12SP/10Haste) in place of the potent Ametrine (12SP/10crit).  Now look at the Relative Stat Values.  Swapping from a 10 crit gem where haste = 1.62 and crit = .74 to a 10 haste gem now gives haste = 24.62 and crit = .73.  That seems to me to be incorrect.\n \nOne last thing.  There is a difference in the calculated value for the food buff \"Spell Food\" and \"Fish Feast\".  Both increase SP by 46 and Stamina by 40.  The Feast also gives 80 AP.  Because of the 80 AP, I would assume there may be a differenc in the calculated calues and that fish feast will be worth more.  However, in my .xml file, the spell power food is worth 91.15 and the feast is worth 64.50.  Note that the amount attributed to the caster is the same in both cases (60.36).  The difference is in the amount that the pet gets buffed.  It makes no sense to me that 46SP/40Sta/80AP is worth 4.14 points to a pet when 46SP/40Sta is worth 30.79 to the same pet.\n \nI hope this info helps you determine what is happening.  Thanks for all the hard work on this program!",
    "LastUpdatedDate": "2013-05-16T05:23:39.6-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2009-10-27T11:54:24.793-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Warlock] Haste Issues",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 14548
  },
  "FileAttachments": [
    {
      "FileId": 2411,
      "FileName": "iso-2009-10-22-raid-optimized-with-legs.xml",
      "DownloadUrl": ".\\2411"
    }
  ],
  "Comments": []
}