{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Bear",
      "DisplayName": "Rawr.Bear"
    },
    "ClosedComment": "",
    "ClosedDate": "2010-09-10T09:24:02.99-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "This is the character file I have saved and work with.",
    "LastUpdatedDate": "2013-05-16T05:19:53.333-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2010-09-08T16:43:55.18-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Bear] Hotaharn Character File",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 18716
  },
  "FileAttachments": [
    {
      "FileId": 4020,
      "FileName": "Hot OT Tank.xml",
      "DownloadUrl": ".\\4020"
    }
  ],
  "Comments": [
    {
      "Message": "Ok, great, but why are you showing us?",
      "PostedDate": "2010-09-08T16:46:31.997-07:00",
      "Id": -2147483648
    },
    {
      "Message": "oh, oops, missed the discussion",
      "PostedDate": "2010-09-08T17:15:20.443-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-09-08T17:24:27.8-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Holy shit.\r\n\r\n\r\n\r\nYou've got a survival soft cap set of 160k. That's like... Pre-Ulduar. Set that to something appropriate.\r\n\r\nThat alone has led to Rawr suggesting a gearing style that is terribly wrong for any current content, in a ton of different ways.\r\n\r\nThe other gigantic mistake in that file is not having Chill of the Throne checked. If you're doing ICC, you must check that. And Hellscream's Warsong (6).\r\n\r\nAdditionally, your spec doesn't have Imp Mangle, which is a big deal in all but a few encounters (and only then when you offset it by getting Master Shapeshifter, which you don't have either). You have glyphs set to Growl/Maul/FR. I'm hoping you actually use SI, which you should be. You're also missing several other key buffs which I'd be shocked if you aren't getting: Imp Fort, Imp MotW, Full Kings, Infected Wounds.\r\n\r\nYour Target Damage is set way low too (Ulduar-ish, again). Target Parry Hastes should be off for ICC, on for Halion.\r\n\r\nI'd drop threat down to MT. If you have threat issues (you shouldn't), you can bump it back up a bit.\r\n\r\nAs far as gear, make those changes and optimize and it should fix a ton of it, but there also are a few things not marked available which should be. The tanking shoulder enchant, 240armor to gloves, Tuskarr's (and UNmark available Greater Fortitude. Bears should *always* have Tuskarr's on their normal boots). Mongoose (and unmark Berserking; you were actually tanking with *Berserking*?). Sentinel's Winter Cloak (from frost badges). The tanking Ashen ring, if you primarily tank. Glyph of Indomitability (from Triumph badges). \r\n\r\n\r\n\r\nI'm absolutely shocked that you've been tanking in what is basically full DPS gear, and you say healers haven't been complaining about it. I'm sorry that your confusion about how to configure Rawr has led you to gear like this, but you must change it; it's utterly horrible for tanking. (Sorry if any of this comes off rude, it's not my intention. There's just so much very very wrong, I'm trying to impress upon you how vital it is that you fix it asap)",
      "PostedDate": "2010-09-08T17:49:44.833-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Thanks for the assistance on this, on one hand I feel pretty stupid, on the other I simply missed a lot of the tuning I needed to get right and didn't even notice the other controls.   Or had at one point then forgotten about.  Either way I have done as suggested and it came up with the stam gems...  I have tanked up to the LK on 10 man and up to putricide & the vamp queen with the gear that was indicated...  but obviously suspected something was wrong.  Anyway i get to try out the new gear & settings tomorrow in ICC.  Ill look into respeccing too however I had read, at least at one point that improves mangle was not that critical, Ill take your word for it on this and look into a slightly different spec.\r\n\r\nI fixed everything as suggested including the buffs, I will get the cloak when i can, and changed the ring to the tanking ring.  RAWR suggested Armsman on my gloves but according to what you have said i should simply get more armor.  \r\n\r\nAnyhow,like I said despite my obvious mis-use of the RAWR tool, I had been tanking quite decently...   This should however improve things considerably.",
      "PostedDate": "2010-09-08T22:08:04.247-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Great. I genuinely just want to help, really hope nothing came off rude.",
      "PostedDate": "2010-09-08T23:47:52.88-07:00",
      "Id": -2147483648
    },
    {
      "Message": "No, you came off as more shocked I think than rude, You let me know what settings i needed to fix and explained why my results were so far off base.   And btw yes I use SI for a glyph but that isn't an option in that list.  It is hard to find other bear tanks that I can rely on for good advice, Since we tank in pretty much rogue leather anyway it is hard to find the distinction.  Even looking at the many forums it is sometimes hard to determine what is the current logic and what we should be looking for.  I know at one time I had seen the discussion about improved mangle and had determined from that discussion that it was not that important.  Apparently I was looking at the wrong  discussion.  Anyhow thanks again and if I have any more questions about RAWR and odd results I will let you know.  ",
      "PostedDate": "2010-09-09T09:16:08.993-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Yeah, I know exactly what you mean. The WoW community comes up with all kinds of great theorycraft, but does a terrible job of consolidating it and summarizing it for users. There's so much out there, from so many different sources, most users don't know where to look, or who to trust.  That's a fight I struggle against every day, trying to consolidate all of the active theorycraft into one trustworthy package: Rawr. That's an unachievable goal, but we try our best. ",
      "PostedDate": "2010-09-09T14:05:24.71-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Out of date info is a real issue in the community as well.  I've read plenty of guides only to discover they were last updated 2 years ago.",
      "PostedDate": "2010-09-09T18:01:05.36-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Btw, tanked ICC 10 man last night with the new setup, had no problem holding aggro and had an extra 10K health ~71K total, all the way around I am very happy with the results, now playing around with a slightly different spec...Imp Mangle + Master Shapeshifter, one I found on tankspots web site, it includes feral aggression as well since we don't have a war with improved demo shout.  now just figuring out the nuts and bolts of how that will effect my rotation (not so much the mechanics, just how it will effect where my buttons need to be and what indicators i need to be looking at to know when to push what lol.)   Yes I also agree about the guides...   its frustrating to see a guide and start reading it only to figure out its over a year old and no longer applies.  Also thank you for keeping up with RAWR, for the most part it has been my one stop guide for gearing since Naxx...   I just need to pay closer attention to some of the options that constantly change as we get new gear options and tiers.   I currently use it along with Lootlist to help me know when something I might want drops... I use the loot plan export, then put it in notepad to insert cr after each semicolon then copy again and import, it takes a little work but I hate having to look at lists while the loot drops to figure out if its an upgrade or not.   Take Care and thanks again for getting me straightened out lol  ",
      "PostedDate": "2010-09-10T05:23:48.78-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-09-10T09:24:02.99-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:27:26.937-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:19:53.333-07:00",
      "Id": -2147483648
    }
  ]
}