{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.TankDK",
      "DisplayName": "Rawr.TankDK"
    },
    "ClosedComment": "",
    "ClosedDate": "2010-02-22T15:09:02.137-08:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "Can you check how DKTank is using this sigil.  It rates its value REALLY high and in my experience with the rotation that I have in there (which is a standard trash tanking rotation right now) I think it is way over valued vs other sigils for tanking.  The rotation I have in there right now is DND->IT->PS->Pest->HS->DS.  In that rotation there is no way to keep the Sigil's buff up above 1 stack, so it can't be valued as highly by Rawr.  Something is not right.",
    "LastUpdatedDate": "2017-11-27T11:04:34.887-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2010-01-22T15:55:11.943-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[TankDK] Value of Sigil of the Hanged Man",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 16056
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "When you mouse-over the sigil, does it have the list of procs listed 2x?  if so, try refreshing the data from wowhead or armory and let me know if you still think it's over-valued.\r\nAlso, are you just using Rawr to determine how to best deal w/ trash or how to deal with a boss?  Why use pest on a single target boss?",
      "PostedDate": "2010-01-22T16:50:26.283-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-01-22T16:53:05.783-08:00",
      "Id": -2147483648
    },
    {
      "Message": "I'd previously noticed that the procs were listed 2x so that was already sorted.  I still believe it is way over valued, especially when you compare it to Sigil of Virulence.  There is just no way with a tank rotation to keep that proc up above one (maybe 2) stacks, which should rate it under Virulence (which you can maintain up nearly all the time and is 200str vs 219str (if you could keep all 3 stacks up all the time)).  Unless I'm missing something of course.  Right now Rawr is rating SOHM as 1193 rating and SOV as 626, which just makes no sense whatsoever.  Hell, it wouldn't even make sense for them to be that different if you could keep it up at 3 stacks all the time.\r\n\r\nAs for the rotation, I vary it periodically depending on what I'm testing for, I just happened to have that in there when I noticed the issue.  The issue that I'm raising is specifically that with that rotation it is way over valuing the SOHM.\r\n\r\nInterestingly changing it to a single target boss rotation (e.g. IT->PS->DS->HS->HS->DS->HS->HS->HS->HS->HS->HS) actually lowers its value to be under the Sigil of Isolence but still values it higher than SOV which I still don't think makes sense (in the above rotation I still don't think you can get to 3 stacks and hold it), though I'd have to either try it out or do the math a little more.  Ironically, the score gap between it and the SOV is smaller with this rotation when I would have expected it to be larger than in the original rotation I'd indicated (because there are more DS in  it).",
      "PostedDate": "2010-01-30T05:22:51.24-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-01-30T22:49:35.057-08:00",
      "Id": -2147483648
    },
    {
      "Message": "I believe the valueation to be correct for what it offers.  I acknowledge that there may need to be better integration between rotation and proc-rate based items.  Currently that is still something on the road-map, but isn't yet ready for integration into the released code.",
      "PostedDate": "2010-02-22T15:09:02.137-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-09-08T14:43:00.09-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:30:18.137-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:22:10.54-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2017-11-27T11:04:34.887-08:00",
      "Id": -2147483648
    }
  ]
}