{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.ProtWarrior",
      "DisplayName": "Rawr.ProtWarrior"
    },
    "ClosedComment": "",
    "ClosedDate": null,
    "CommentCount": 0,
    "Custom": null,
    "Description": "It seems there is an issue with the way Rawr displays ProtWarr defensive values. After loading my character (see the attached file) I noticed that my dodge, parry, and block values were not displaying correctly. Checking from my in-game client the unbuffed correct values should be 1717 dodge rating, 1929 parry rating, and 55.44% block. After a short discussion on the board I discovered that the Vial of Stolen Memories and the Windwalk enchant on my weapon were throwing off the dodge values by averaging the dodge procs of those items. I still do not know the cause for the scewed parry and block values.\n \nI would appreciate it if a fix could be found for this because it is preventing me from testing out gear pieces for my toon, as I need to know the precise, correct avoidance and mitigation values. I did this with the latent 4.2 rawr client I downloaded just the other day and as I said, I'm working with the ProtWarr model. I have double checked my talent and buff settings. Nothing on that front should interfere with the values.",
    "LastUpdatedDate": "2013-02-21T18:24:39.98-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2011-07-09T03:51:28.263-07:00",
    "Status": {
      "Name": "Proposed",
      "Id": 1
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[ProtWarr] Ambiguous Stat Values",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 21126
  },
  "FileAttachments": [
    {
      "FileId": 5125,
      "FileName": "Hogi.xml",
      "DownloadUrl": ".\\5125"
    }
  ],
  "Comments": [
    {
      "Message": "I don't know offhand what parry/block special effects you may have (well, Shield Block and Hold the Line at least for Block), but this fundamentally isn't a bug. While 'averaged out' isn't technically accurate (it's more complex/accurate than that), the general idea is sound, and is intentional, so as to value these procs.",
      "PostedDate": "2011-07-10T17:24:10.56-07:00",
      "Id": -2147483648
    },
    {
      "Message": "You mean rawr averages out shield block and hold the line procs? I did not think it was specifically a bug, per say, but it certainly gets in the way when ex-changing gear, reforging and altering gems to find better combinations of gear, or just simply planning ahead on your stat evolution as you expect to gain new gear. At the very least, I think this should be an optional feature. How is one to read and interpret gear the stats that rawr is reporting without having a clue where those values are coming from? If nothing else, maybe add something that allows you to see those stats broken down, so the reader can see exactly what the values are made out of.",
      "PostedDate": "2011-07-11T06:11:25.417-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-10-01T17:13:02.217-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:24:39.98-08:00",
      "Id": -2147483648
    }
  ]
}