{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Moonkin",
      "DisplayName": "Rawr.Moonkin"
    },
    "ClosedComment": "",
    "ClosedDate": "2011-06-13T02:28:13.71-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "I just checked my character with 4.1.5.1 and the hit was about 59 rating low. Took awhile but I found that it's not showing the reforging on my belt - the 359 Belt of Withered Dreams. When I try to reforge it in Rawr it's not giving me the option to reforge Haste to Hit for some reason. Note: this is a fresh battle.net import as well. Not a saved character.\n \nAm I missing something? Is there an option to edit reforging choices that I'm not seeing?\n \nEither way, it should be possible to reforge the belt for hit.\n \nArmory Link:\nhttp://us.battle.net/wow/en/character/nagrand/carnacki/simple",
    "LastUpdatedDate": "2013-05-16T05:17:57.12-07:00",
    "PlannedForRelease": "Rawr 4.1.05.1",
    "ReleaseVisibleToPublic": true,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2011-05-17T06:47:44.333-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Moonkin] Spirit and hit reforging issues",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 20787
  },
  "FileAttachments": [
    {
      "FileId": 4959,
      "FileName": "carnacki_boom.xml",
      "DownloadUrl": ".\\4959"
    }
  ],
  "Comments": [
    {
      "Message": "I just checked with the latest source, and it allowed me to reforge the haste to hit, although it was not displayed that way by default.  I did exactly like you said - loaded it from Armory, hit the reforging options, and the top one was reforge 59 haste rating to hit rating.",
      "PostedDate": "2011-05-17T07:30:28.77-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-05-17T10:03:34.553-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Operating as designed, you have to change the option to allow hit reforges on the options pane in Moonkin.\r\n\r\n\n\n** Closed by Jothay 5/17/2011 10:03 AM",
      "PostedDate": "2011-05-17T12:55:51.027-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Jothay, it's not quite like that.  You have to enable reforging of SPIRIT to hit, but not other stats.  There may still be an issue here, it deserves some investigation.",
      "PostedDate": "2011-05-17T12:55:51.603-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-05-17T15:02:52.627-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Ok, I already have Allow Spirit -> Hit ticked. No luck. Reforge Priority is set to Spirit over Hit... when I changed that to Hit over spirit I got the option... but I gotta say that's really counter-intuitive. The way that's worded I'd have expected to see both reforge XXX -> spirit and reforge XXX -> Hit listed (in that order).\r\n\r\nAlso, I'm seeing duplicate entries in the Reforge Priority dropdown - two spirit over hit and two hit over spirit (only just noticed this).\r\n\r\nAnyway, solved the immediate problem. Thanks",
      "PostedDate": "2011-05-18T01:55:33.043-07:00",
      "Id": -2147483648
    },
    {
      "Message": "It should list both, and I'm guessing that's also the cause of the duplicated reforge options.  I will take a quick look at it.",
      "PostedDate": "2011-05-18T05:25:33.26-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-05-18T05:26:12.94-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Found and fixed the original issue, that some reforging options were not showing up.  Am unsure if it will fix the issue where two were showing up at once, please retest.",
      "PostedDate": "2011-05-18T06:47:00.423-07:00",
      "Id": -2147483648
    },
    {
      "Message": "So how exactly do you expect this to behave, and should it be available in the Silverlight version yet?\r\n\r\nI'm not seeing four items in the Reforge Priority dropdown anymore, but the reforging on the belt still seems to be the same. ie: The hit reforge doesn't show up unless I select Hit over Spirit, or I pick Spirit over Hit and uncheck Allow Spirit -> Hit. I guess I might just be a bit confused and thats how you expect it to work (or it may not have gone live yet).",
      "PostedDate": "2011-05-18T17:11:05.577-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Here's what you should see.  For all combinations of the dropdown and the checkbox, Haste->Hit should be an option.  If the checkbox is checked, Spirit->Hit should also be an option.  It will not go live until the next release, I'm afraid to say.",
      "PostedDate": "2011-05-18T19:15:13.233-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Cool, that sounds perfect. Sorry I misinterpreted your earlier post thinking that it must be up on the silverlight version already.\r\n\r\nThanks",
      "PostedDate": "2011-05-18T22:31:24.947-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-06-13T02:28:13.71-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:25:00.933-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:17:57.12-07:00",
      "Id": -2147483648
    }
  ]
}