{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Retribution",
      "DisplayName": "Rawr.Retribution"
    },
    "ClosedComment": "User misconception",
    "ClosedDate": "2010-04-14T09:16:19.023-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "We need support for Potion of Speed modelling (including double potion trick). It will affect rotation so we cannot reuse Buffs section which will just increase average haste.",
    "LastUpdatedDate": "2013-05-16T05:21:46.157-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2010-02-22T06:06:16.17-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Retribution] Add support for Potion of Speed",
    "Type": {
      "Name": "Task",
      "Id": 2
    },
    "VoteCount": 2,
    "Id": 16475
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Actually we can, in your rotation code, check the character's Active Buffs for anything in the Pot section and have it take 1 GCD out for the pot. (Double pot trick involves using a GCD before the fight starts so it doesn't count).",
      "PostedDate": "2010-02-22T11:14:31.21-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-02-25T03:14:37.35-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Rotation changes are not limited to 1 GCD loss. For the duration of the potion we will get shorter GCD on Consecration and Exorcism that will modify the rotation sequence for that time. The effect is non-linear and will be different from the effect of dividing that amount of haste for the whole fight length.",
      "PostedDate": "2010-02-25T14:23:53.153-08:00",
      "Id": -2147483648
    },
    {
      "Message": "There has been a trend in Rawr.Retribution to move away from a static model and towards a dynamic model using the FCFS system. This is being done by 'improving' on the built in simulation behaviour and while it may have a seemingly positive effect on the \"DPS\" number calculated, better accuracy is actually causing more and more problems in what Rawr is supposed to do... which is to compare gear.\r\n\r\nFor gear comparisons the curve for each stat needs to be fairly smooth.  Simulation causes erratic changes for specific values of haste and that makes reliable gear comparisons impossible.\r\n\r\nThe way the speed pot is handled now is correct.  Average the haste into your overall haste. Expect to see more of this approach and less of the \"improving the simulation\" type approach.\r\n\r\nRawr is a tool to compare gear.  Rawr.Ret currently does this by estimating DPS.  It could just as well calculate a \"RawrScore\" number and rank gear based on that.  The fact that Rawr.ret uses \"DPS\" as a ranking, does not mean rawr is supposed to give accurate numbers for it, it's supposed to give reliable and stable numbers so you can compare gear. \"Close\" is in this respect better than \"Accurate\".\r\n\r\nIf you want a simulation for actual DPS measurement, there are other tools for that.  \r\n\r\nFor the purpose of comparing gear, \"prepotting\" isn't going to make any difference.",
      "PostedDate": "2010-02-26T06:31:10.403-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-04-14T09:16:19.023-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-09-05T17:21:19.29-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-03-17T19:44:00.98-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:29:48.823-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:21:46.157-07:00",
      "Id": -2147483648
    }
  ]
}