{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "",
    "ClosedDate": "2009-09-15T20:47:46.077-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "see title",
    "LastUpdatedDate": "2013-05-16T05:24:36-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2009-09-01T14:49:03.297-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "Blessing Of Sanctuary should add 10% STM now",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 14024
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Yes.  Don't forget that Kings' and Sanc's 10% Stam do not stack, though - one 10% Stam buff excludes the other.",
      "PostedDate": "2009-09-01T14:56:00.443-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Yes... I am aware, but I use Sanctuary as a tank... so I would like to have my health represented correctly on my guaranteed buffs (my own)",
      "PostedDate": "2009-09-01T15:22:59.067-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Indeed, we will make this adjustment soon.",
      "PostedDate": "2009-09-01T19:46:07.367-07:00",
      "Id": -2147483648
    },
    {
      "Message": "In updating ProtPaladin for 3.2.2, I included this in patch 3833.\r\n\r\nTo get just Blessing of Sanctuary: Check Blessing of Sanctuary under Damage Reduction (Minor %).\r\nTo get just Blessing of Kings: Check Blessing of Kings under Stat Multipliers.\r\nTo get both Blessing of Sanctuary and Blessing of Kings: Check Blessing of Sanctuary AND Blessing of Kings, both under Damage Reduction (Minor %).\r\n",
      "PostedDate": "2009-09-11T11:15:16.843-07:00",
      "Id": -2147483648
    },
    {
      "Message": "I've applied the patch (3833) just not in the way that you made it in the patch. I broke the Stam bonus out of Kings and Sanctuary and made those two parts as \"improvements\" on the primary buff (like Double-Pot Trick is an improvement on Potion of Speed) conflict with each other, you can only select one or other.\r\n\r\nIt's also got the code ready in there for 3.2.2 when Sanc adds Strength to it's bonus and then conflicts with King's Strength, but this isn't active until we do a fully live 3.2.2",
      "PostedDate": "2009-09-13T15:03:49.397-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Side-note, I also added the 2% Mana or Equivalent Restore specialeffect to Sanctuary, models need to add code to support the new Trigger.DamageAvoided which is any time player blocks, dodges, or parries an attack.",
      "PostedDate": "2009-09-13T15:05:31.567-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Ideally, the two buffs would get their own version of BonusStaminaMultiplier (and BonusStrengthMultiplier) that doesn't stack so that all you would have is Blessing of Kings and Blessing of Sanctuary with none of the improvements, but then all the models would have to be updated to use that... I didn't think that would have been a good idea to do.\r\n\r\nMy only concern with this method is that it isn't going to be immediately obvious to the user how to apply either blessing, or both for that matter.  To get the full effect of one blessing, you have to have two checkmarks...",
      "PostedDate": "2009-09-13T16:00:11.213-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Gah, forgot about the 2% part.  Thanks for that. :)",
      "PostedDate": "2009-09-13T16:04:10.843-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Unfortunately, it's the only real way to show it. There's going to have to be 2 checkboxes for each, where one on each cancels the other out OR 4 total separate buffs: full sanc vs half sanc and full kings vs partial kings, which would probably be even more confusing to users. This way, the person can have Sanc all the way in and Partial Kings or Full Kings and sanc only damage mit/mana restore and the stam values can't overlap and it's not as counter-intuitive as it might otherwise be.",
      "PostedDate": "2009-09-13T16:06:50.403-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-09-15T20:47:46.077-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:33:19.123-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:24:36-07:00",
      "Id": -2147483648
    }
  ]
}