{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Base",
      "DisplayName": "Rawr.Base"
    },
    "ClosedComment": "Declining this. The nearest thing we do to what you describe is to look at the Direct Upgrades charts &#40;there are more coming in the 4.1.1&#41; to see where some of your immediate shortfalls are. An actual Character Auditor will not be made for now. Maybe in Rawr5.",
    "ClosedDate": "2011-03-18T14:53:56.46-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "Anyone that uses the popular character auditing website \"Be Imba!\" (http://be.imba.hu) will be familiar with its list of audit checks, \n \ni.e.:\n- Enchants\n- Sockets & Gems\n- Combat (hit rating analysis)\n- Talents (which is actually not available)\n \nI think Rawr can provide a much better character auditing service because it can calculate the potential dps that is gained/lost within each category, and in fact it already does via comparison charts for enchants / gems / talents / glyphs and so on.\n \nAnyway, the main idea here is to have all this info represented on a single tab (named \"Audit\" or whatever) which evaluates the respective cateogries, and linking to the appropriate comparison charts.\n \nAs a bonus, Rawr could also throw in the \"Gear-o-Meter\" instance comparison and Raiding History.",
    "LastUpdatedDate": "2013-05-16T05:20:17.207-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2010-07-16T00:43:29.69-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Feature Request] Character Auditor",
    "Type": {
      "Name": "Feature",
      "Id": 1
    },
    "VoteCount": 1,
    "Id": 18232
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "A cool idea, but it should also incorporate the same kind of checks that ElitistGroup does when it comes to those checks, in that the gear is relevant to the character's role (tank/DPS/heal). For example:\r\nhttp://elitistarmory.com/us/Steamwheedle%20Cartel/Cryptwidget\r\nIt does a check to ensure that the gear/gems/enchants are actually relevant to my Blood DK tanking spec, and should I be wearing gear that doesn't fit the role (i.e. wearing something with Resilience on it, making it a PvP item) , it will call me out on it.\r\n\r\nOf course, for 'that' to happen, all of the Rawr modules need to properly filter out 'bad' gear first so that users can utilize the Optimizer and Find Upgrade tools correctly...I like the Healadin way of doing it...by offering checks to filter out gear that has Hit and Spirit on it.  Things like this for ProtPaladin and TankDK (filter out gear that doesn't at least have Dodge, Parry or Defense on it) would be nice :)",
      "PostedDate": "2010-07-16T04:38:53.29-07:00",
      "Id": -2147483648
    },
    {
      "Message": "It really boils down to what our Big Bear (Astrylian) wants to achieve with Rawr, and more importantly the online version of Rawr.\r\n\r\nSites like Be imba offer a niche service (entry level advice for the casual player).  Rawr equally offers a niche service (a gearing and theorycrafting tool for the advanced player).  Both 'Be Imba' and 'Rawr' could expand their target domain to fill more niches.  But do we really want to go there ?  Offering the kind of advice like be Imba does is on a totally different level than what Rawr currently does.  Someone that puts some time in it, will get to the same conclusions as be Imba.  As in, needing more hit, or replacing some gems or gear, but rawr doesn't actively \"advice\". It passively calculates numbers and presents these, any conclusion being drawn is the responsability of the user.\r\n\r\nRawr could be a made a lot user friendly even if it strictly stuck to it's current usage niches.  It could also be changed into a tool that is simple to use for the casual wow player that just needs to be told how to spec and how to gem and enchant his gear without all the theorycrafting, optimising and all the boxes to fill out.  Do we really want to go there?  That's another matter entirely.",
      "PostedDate": "2010-07-16T05:19:39.26-07:00",
      "Id": -2147483648
    },
    {
      "Message": "\"...Rawr doesn't actively \"advice\". It passively calculates...\"\r\nActually, that would be, \"Rawr doesn't passively advise based on a preset list of what \"should\" be.  It actively calculates...\"  Therein lies the difference.  Rawr already recommends how to outfit your toon optimally, and in a significantly more powerful and dynamic method than Be Imba et al.",
      "PostedDate": "2010-07-18T21:20:35.54-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Relevant to Rawr4... in that more discussion should be had on it",
      "PostedDate": "2010-11-22T15:34:42.257-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-03-18T14:53:56.46-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:27:57.087-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:20:17.207-07:00",
      "Id": -2147483648
    }
  ]
}