{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "",
    "ClosedDate": "2011-12-12T11:51:02.897-08:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "Please bear with me as I try to explain this as clearly as possible.\n \nI recently received a trinket, Insignia of the Corrupted Mind, which according to a recent Upgrades List is supposed to add ~927 DPS. I did the following:\n \n1. Import my character into Rawr (including items in bags) using the Rawr addon.\n2. For some reason it doesn't include 10 points from my spec, so I change it to the default Fire spec (3/35/3).\n3. I go into buffs and add Dark Intent.\n4. It also doesn't include gloves tinker, so I make it available in Tinkerings > Hands > Synapse Springs and add it to gloves by clicking where it says \"No Tinkering\" just below the enchant.\n5. Lastly, I go into Options > Gemming Templates and uncheck Epic Jewelcrafter.\n6. To optimize, I bring the Thoroughness slider to about halfway and Ctrl+Click Optimize in the lower left to get 10x the thoroughness.\n \nThe result I got was significantly less than 927 DPS. Rawr wanted me to give up the 37.5% haste tick value to Living Bomb and Pyroblast. I thought it feasible since the trinket does have a haste proc, but odd nonetheless. So I ran the optimizer again, replacing Necromantic Focus (former trinket) with Insignia of the Corrupted Mind and keeping the rest of my gear the same, using the \"Equipped Only\" option when uploading from the Rawr addon. The result was spot on, it kept the 37.5% haste and added ~927 DPS. There is roughly a 400 DPS difference between the two; The question is, which one is correct?\n \nWhy does Rawr give a different, lower value, when it is allowed to utilize all of my gear, including my bags, than when I restrict it to using only what I've currently equipped? The values should be the same, if I'm already optimized, or lower for the latter.",
    "LastUpdatedDate": "2013-05-16T05:17:14.23-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2011-12-10T13:11:50.17-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "Inconsistent Results (Mage)",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 21894
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "First, there is an error in the preset talents in the current version that will make it not load glyphs, so check that. Beyond that I'm afraid I can't help you without having the character file where you're having this problem. Try uploading that and possibly also the Rawr addon export so we can check why it's not marking those things for you.",
      "PostedDate": "2011-12-11T16:01:58.75-08:00",
      "Id": -2147483648
    },
    {
      "Message": "I didn't realize that it wasn't loading the glyphs, it seems to have accounted for the issue I was having. Thanks for the fix and the speedy reply, keep up the great work! :)",
      "PostedDate": "2011-12-12T07:31:47.21-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-12-12T11:51:02.897-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:24:03.237-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:17:14.23-07:00",
      "Id": -2147483648
    }
  ]
}