{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "Old issue.",
    "ClosedDate": "2009-08-09T17:30:52.28-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "Hi Dev's, many thanks first of all for your great work on Rawr. Its a brilliant tool! and best in class.  While working with Rawr I infrequently realize that the information available on some of the items is either incomplete or missing. E.g. the socket bonus information is not set for some of the gear, the information where the items are dropping is missing and/or associate flag (raid item, pvp, etc.) are incorrect. I understand that maintaining this large volume of data is impossible for the dev's to keep updated I wonder if Rawr can get modified in such a way that the user community can help keeping the item quality high. so here comes my suggestions:\n \n1. Can you implement a way to update the item source information from within Rawr ? I'm aware that this can be done manually within ItemSource.xml, but I successfully crashed the file twice on a single day by editing it while Rawr is open :-(. I guess a controlled way within the tool with make this a viable option for all users.\n \n2. Can you implement a feature to track such change users make to the items (via \"Edit items...\" ) and the items source information (see 1.) and allow those changes to be reported back to a central repository ? this way we all can contribute to keep the information on the highest possible quality and increase the accuracy. Just like it's done with tools like MobMap and it's uploader.\n \nCheers,\nAndro",
    "LastUpdatedDate": "2013-05-16T05:26:03.247-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2009-03-13T00:17:12.8-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "Suggestion: Item Information Quality",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 12804
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "The big problem with tracking changes and reporting back is you assume a large user base = good thing. There are far too many of malicious intent out there that would decrease its accuracy by posting rubbish such as embedding spam advertising, etc Do you really want viagra ads or ones telling you your sword could be bigger inside Rawr tooltips? \r\n\r\nIt would also open it up to those of a childish mentality who would think it amazingly cool fun to update it with childish rubbish \"for a laugh\". not realising that it was destructive vandalism.",
      "PostedDate": "2009-03-13T02:58:23.38-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Forgot to say the socket bonus thing is because the information is not present in the armory. Please bug report this to blizzard, if we get more people bugging them on their forums that the armory is broken they might fix it.",
      "PostedDate": "2009-03-13T03:00:28.707-07:00",
      "Id": -2147483648
    },
    {
      "Message": "I find that the armory usually has more accurate drop location info, and wowhead has more accurate item stat info. So what I do to update my cache is first update from armory to get the drop location, then update from wowhead to get the correct stats (bonus armor and socket bonuses). If you look at where you add items you'll notice it does pretty much the same thing, has checkboxes for both update locations.",
      "PostedDate": "2009-03-13T06:19:38.38-07:00",
      "Id": -2147483648
    },
    {
      "Message": "@Leva - fully understand your concerns and share them, too. There might be conceptsand ways to limit such misuse in the backend by e.g. having at least a certain number of the same changes reported before its committed into the db, or other approaches. I still feel that opening it up to the community can make a big help and bring it to another level - but agree, needs to be done thoughtfully.\r\n\r\nHowever, maybe in the meantime it can be implemented to allow editing the location information in the local cache files, so I (and anyone who like to improves his data) can do those updates ?\r\n\r\n@holymist - I wasn't aware that the two methodes of updating the item cache are complementary. I was under the impressing whatever you execute the last overwrite any previous information in the cache. So I'll give this a try and see how much this improves it for me. thanks for pointing this out. ",
      "PostedDate": "2009-03-14T05:32:21.62-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Rawr does not get its data from a central store that it's possible for users to contribute to. We are not in the business of managing our own item database. Rawr gets its data from Wowhead and Armory. Also, I *believe* that the Armory just fixed that socket bonus bug.\r\n\r\nI'd like for the Item Source property to be more editable, but as is, it's not, because it's not a simple field; it's an object of various types.",
      "PostedDate": "2009-03-14T11:05:05.24-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-08-09T17:30:52.28-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:35:13.173-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:26:03.247-07:00",
      "Id": -2147483648
    }
  ]
}