{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Base",
      "DisplayName": "Rawr.Base"
    },
    "ClosedComment": "Closing this due to no further information. If anyone still experiences this with the latest version open a new ticket.",
    "ClosedDate": "2010-01-15T15:30:34.943-08:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "I have been using Rawr for quite a while now, this is my first time experiencing this problem.\n \nI have Rawr 2.2.27 downloaded and that is the .exe that I am launching from.\nThe problem is, when I try launching the program I will get the Hourglass pointer which would make me assume all is going well and the program will be loading shortly. However, after a few moments that hourglass goes away and Rawr will never load. \n \nIf I take a look at my Task Manager when this happens I will see Rawr.exe, under the processes tab, taking up 5,246k Mem usage and 50 CPU.\nRawr.exe will not be in the Applications tab though, and I can not see it actually see it anywhere.\n \nI never see the splash screen or anything happening after the initial hourglass pointer that I get after trying to launch the program.\n \n \nI have run multiple Anti-Virus programs all have shown up clean. \nI have done a System Restore to an earlier date that I remember Rawr working.\nI have tried using older versions of Rawr.\nI have re-downloaded Rawr from this website about 10-15 times, in both Firefox and Internet Explorer.\nI have unzipped the file with both WinRAR and WinZip.\n \nNow I am at a loss for what would be causing this and getting quite frustrated.",
    "LastUpdatedDate": "2013-05-16T05:23:18.09-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2009-11-19T21:41:48.083-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Launch] Rawr hangs during launch",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 3,
    "Id": 14934
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Did you uninstall and reinstall .NET Framework?",
      "PostedDate": "2009-11-19T21:45:27.3-08:00",
      "Id": -2147483648
    },
    {
      "Message": "(Latest version, 3.5sp1)",
      "PostedDate": "2009-11-19T21:45:38.53-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Yes.\r\nAt first I tried the repair function on .NET Framework, that didn't change anything.\r\nWhen that did not work I uninstalled it then reinstalled.",
      "PostedDate": "2009-11-19T21:58:50.657-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Just an update; I uninstalled 3.5sp1 again and have tried running Rawr without NET Framework.\r\nIt is doing the same exact thing and giving me zero errors, just not loading properly.",
      "PostedDate": "2009-11-19T22:11:50.133-08:00",
      "Id": -2147483648
    },
    {
      "Message": "I have exactly the same problem as Kund. One day it was working and the next it wasn't.\r\nI'm not sure if I installed a windows update between the days it was working and wasn't.\r\nI have also tried reinstalling .NET Framework, but still get the result.\r\nWould really appreciate a solution to the problem.",
      "PostedDate": "2009-11-26T04:35:51.923-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Most likely cause is Armoury down. When this happens please check in your browser if armoury is available and let us know.",
      "PostedDate": "2009-11-26T07:39:30.19-08:00",
      "Id": -2147483648
    },
    {
      "Message": "I'm also having this issue as of Wednesday (11/25).  Not sure what changed on my system between then and the previous time that I had Rawr working.  Armory is definitely up.",
      "PostedDate": "2009-11-27T10:23:29.463-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-11-27T10:23:38.24-08:00",
      "Id": -2147483648
    },
    {
      "Message": "I've noticed a lot of updates coming in that require restarts on my XP box, and to a lesser extent my 7 box. Perhaps one of these updates is causing the problem",
      "PostedDate": "2009-11-27T10:41:41.12-08:00",
      "Id": -2147483648
    },
    {
      "Message": "I forgot to mention that I am also running XP. In \"Add or Remove Programs\" I could only find 2 updates since 11/20 and both were on 11/25 as Saniel said in his post.\r\nKB973687 (has something to do with XML)\r\nKB976098-v2 (apparently has something to do with daylight saving in certain countries)\r\nI uninstalled KB973687 and tried running Rawr, but it still didn't work. Same thing, in processes using 50% CPU, but no splash screen.\r\nArmory was up and running.",
      "PostedDate": "2009-11-27T23:32:16.48-08:00",
      "Id": -2147483648
    },
    {
      "Message": "I actually did just find another update:\r\nUpdate for Microsoft XML Core Services 4.0 Service Pack 2 (KB973688)\r\n(11/23 as stated on the Microsoft site) There is no date in the \"Add or Remove Programs\" list.\r\nI have no idea if this is helpful at all, I'm just trying to figure it out.",
      "PostedDate": "2009-11-27T23:48:24.22-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-12-02T21:45:12.19-08:00",
      "Id": -2147483648
    },
    {
      "Message": "bump.. exact same issue here.",
      "PostedDate": "2009-12-02T21:45:42.223-08:00",
      "Id": -2147483648
    },
    {
      "Message": "I still haven't been able to fix the problem and have given up. Nothing I tried worked.\r\nI'm hoping that someone figures it out or that the next Rawr version will work.\r\n",
      "PostedDate": "2009-12-03T19:31:52.59-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Honestly, if nothing we've said has worked, your OS is most likely bugged out. The only feasible fix then is to reinstall Windows, sorry.",
      "PostedDate": "2009-12-03T19:56:41.59-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-12-14T12:20:25.273-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Another option to explore would be installing Visual C# Express (http://www.microsoft.com/express/vcsharp/) and running from source in debug mode to figure out what is going on. Let me know if you need any assistance in trying this.",
      "PostedDate": "2009-12-14T15:36:17.537-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Thanks for the effort Kavan. I won't be able to try this though, because I now have Windows7 running and everything is fine.",
      "PostedDate": "2009-12-15T19:31:01.107-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-01-15T15:30:34.943-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:31:45.007-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:23:18.09-07:00",
      "Id": -2147483648
    }
  ]
}