{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "Fury isn&#39;t operational enough for this yet, but it may be in the next couple of versions &#40;.21 or .22&#41;.Don&#39;t ever try to optimize talents, ever, ever, ever. It will screw things up each time. If you want it to try and decide between SMF and TG, create and save additional specs for each, then use Optimize Talent Spec, that is far more reliable.",
    "ClosedDate": "2011-03-07T10:21:45.42-08:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "Hi, ok so i have been using the new addon to import all my gear from bags/bank and import to rawr, (i do this specced as fury titan grip)\n \nNow the issue is the optimiser has no sense that titans grip is used in the talents so insists on equipping 1 handers either from my tank gear or 1 hander dps weapons i have picked up. i am aware i can delesect those items and ofc i will do but i just thought its worth pointing out as this will clearly effect how the optimiser will work when you are asking it to decide on a spec, for example i have 2 x 1 hander dps weapons and 2 x 2 hander weapons, now as i see it right now there is no way that the optimiser will break down and evaluate what would be optimal, which is what it is, i believe, ment to be able to do.\n \nThis is not criticism i happy to see it being worked on but none else have posted a issue regarding this and it may even be a simple fix im not sure but thought i would just mention.\n \nThanks Droppy, for doing what you done so far mate keep up the good work.",
    "LastUpdatedDate": "2013-05-16T05:18:30.92-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2011-03-07T10:00:30.567-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "Some notes of errors found with fury warrior optimiser",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 20161
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "yes im aware its not ready yet but i would have posted this comment in warrior section (comments) but then it would have got deleted so its just a heads up there is a issue there, if im posting in worng place to help droppy then soz for that.  \r\n\r\nDoes this also mean prot warrior will be finalised at .21 or .22 ",
      "PostedDate": "2011-03-07T10:28:16.423-08:00",
      "Id": -2147483648
    },
    {
      "Message": "ProtWarr and DPSWarr and handled by different people. AFAIK, ProtWarr is already done for now",
      "PostedDate": "2011-03-07T11:15:51.97-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:25:43.707-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:18:30.92-07:00",
      "Id": -2147483648
    }
  ]
}