{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Base.ItemFilters",
      "DisplayName": "Rawr.Base.ItemFilters"
    },
    "ClosedComment": "Out of Date",
    "ClosedDate": "2010-11-21T10:54:38.42-08:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "I am trying to work on new filters for PVP Items. Problem I am having is the lack of a filterable string. Filtering by vendor and area is not the problem, but not having information such as cost and currency is a nightmare.\n \nSold by Doris Volanthius at Orgrimmar os not as useful as say \"Sold by Doris Volanthius at Orgrimmar for 52200 Honor Points\"\n \nKey thing here is that if a player does not have the currency or Arena Points then they would want to filter that out.\n \nHere is my sugestion for pulling info from wowhead or armory.\nDoes the item have Resilience? If yes then it is \"PVP Item\".\nIs it a Drop from a mob or boss? If yes then \"(Mob/Boss name)\".\nIs it sold by vendor? If yes then \"(Cost) (Currency)\".\nDoes it require Arena Rating? If it does then \"RAR (Rating)\". <--- RAR=Required Arena Rating. There are also Team Arena Ratings that could be singled out as \"TAR\".\n \nNow put it all together and you get filterable things like:\n\"PVP Item for 52200 Honor Points\"\n\"PVP Item for 60 Emblems of Frost\"\n\"PVP Item dropped from Toravon the Ice Watcher or for 52200 Honor Points\"\n\"PVP Item dropped from Toravon the Ice Watcher or for 68200 Honor Points and RAR 1300\"\n \nAlso as it is including location for vendors as it goes for ICC messes with the ICC filters. I have a work around for this issue that I will submit after further testing, but the location of the vendor is not needed, all vendors have unique names.",
    "LastUpdatedDate": "2013-05-16T05:20:57.91-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2010-04-21T11:38:44.507-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[ItemFilters] PVP Items and Filters",
    "Type": {
      "Name": "Task",
      "Id": 2
    },
    "VoteCount": 2,
    "Id": 17345
  },
  "FileAttachments": [],
  "Comments": []
}