{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Base.LoadCharacter",
      "DisplayName": "Rawr.Base.LoadCharacter"
    },
    "ClosedComment": "",
    "ClosedDate": "2010-02-22T13:05:56.203-08:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "Since installing v. 2.3.5 I've been unable to load any character from the Armory.  I get a message telling me that no character was loaded, which then asks if the Armory is down.  The Armory is not down when I attempt this.  Running the .exe as admin gives the same result.",
    "LastUpdatedDate": "2013-05-16T05:22:27.013-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2010-01-11T18:08:57.843-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[LoadCharacter] Unable to Load from Armory",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 4,
    "Id": 15859
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Well, something's stopping Rawr from communicating with the Armory. Check firewalls, proxies, antivirus, etc.",
      "PostedDate": "2010-01-13T10:58:21.687-08:00",
      "Id": -2147483648
    },
    {
      "Message": "It would be pretty cool if Rawr could accept a copy/paste of the armory XML via some option in case this kind of thing happens. Perhaps a \"Manually enter Armory XML\" button on the error dialog or something?\r\n",
      "PostedDate": "2010-01-13T14:30:28.817-08:00",
      "Id": -2147483648
    },
    {
      "Message": "That'd actually probably be worse, due to the difficulty in getting the actual XML for most people.",
      "PostedDate": "2010-01-13T14:39:57.043-08:00",
      "Id": -2147483648
    },
    {
      "Message": "I'm getting the same thing - I thought it might be the armory updates done recently.\r\n\r\nStep Name: Get Character\r\nDescription: Rawr encountered an error retrieving the Character - Gelmaark@US-Shadow Council from the armory\r\nObject reference not set to an instance of an object.\r\n   at Rawr.Armory.GetCharacter(CharacterRegion region, String realm, String name, String[]& itemsOnCharacter)\r\n",
      "PostedDate": "2010-01-14T11:50:30.5-08:00",
      "Id": -2147483648
    },
    {
      "Message": "(nevermind, armory is currently down - it wasnt a short while ago)",
      "PostedDate": "2010-01-14T11:51:22.07-08:00",
      "Id": -2147483648
    },
    {
      "Message": "The problem still continues.  Nothing has changed with my system since prior to 2.3.5, not firewalls, proxies, antivirus or anything else.  I've deleted the program and files re-extracting them several times to no avail.  ",
      "PostedDate": "2010-01-14T19:00:29.66-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Blizzard changed the layout of the armory, they added a lot of stuff so i guess thats why the armoryimport doesnt work.\r\nhttp://eu.wowarmory.com/character-sheet.xml?r=Thrall&cn=Samirâ\r\nyou can see my loot, recent bosskills, and you have my character in 3d ;)",
      "PostedDate": "2010-01-15T07:43:44.7-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-01-15T16:02:07.373-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Im getting a error also \r\n\"Get character: No character returned from the armory\" \r\nand yes there is a character that matches the name that I'm searching ",
      "PostedDate": "2010-01-15T16:05:21.68-08:00",
      "Id": -2147483648
    },
    {
      "Message": "The armory import does indeed still work, the changes did not break armory support. Those of you who are getting \"Get character: No character returned from the armory\", the problem really is on your side (unless you can demonstrate that most characters load, while some in particular have some error). As I said, something's stopping Rawr from communicating with the Armory. Check firewalls, proxies, antivirus, etc.",
      "PostedDate": "2010-01-15T16:12:23.433-08:00",
      "Id": -2147483648
    },
    {
      "Message": "I'm receiving the same error as these others. There have been no changes to my laptop or desktop in the 24 between going from 2.3.4 and 2.3.5. This includes no changes to firewalls, proxies, anti-virus, etc on either machine. if you feel this is being caused by some kind of com error on the client machine, is there a way to get a more pertinent error then the \"Get character: No character returned from the armory\" , ie com port, etc that rawr is using to communicate to wow armory.\r\n",
      "PostedDate": "2010-01-16T12:09:41.21-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Does import in 2.3.4 still work if you download old version? What character/realm is the problem?",
      "PostedDate": "2010-01-16T14:03:19.38-08:00",
      "Id": -2147483648
    },
    {
      "Message": "yes, just unzupped 2.3.4 and verified, I can load any of my toons, but I can not with 2.3.5.....all my toons are on misha (well the ones that are 80s). I can load artrow, behoveu, magdahla, unwhorley, and lashiva with 2.3.4, but cant with 2.3.5 .",
      "PostedDate": "2010-01-17T12:44:22.07-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Try what is stated on this discussion:\r\nhttp://rawr.codeplex.com/Thread/View.aspx?ThreadId=80820",
      "PostedDate": "2010-01-17T13:28:01.287-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Did that help at all?",
      "PostedDate": "2010-01-18T20:19:48.19-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-01-18T20:20:01.353-08:00",
      "Id": -2147483648
    },
    {
      "Message": "I am experiencing this same problem.  I have both 2.3.4 and 2.3.8 folders on my desktop.  When I launch 2.3.8 and try to load from armory it tells me character does not exist.  I close 2.3.8 and launch 2.3.4 then do a load from armory with success.  None of my characters can be located using a version greater than 2.3.5.  I have tried each one (except 2.3.7 since 2.3.8 came out so quickly).  What I have to do is open 2.3.4, load from armory and save the profile.  Then close 2.3.4 and launch 2.3.8 and open from file.",
      "PostedDate": "2010-01-24T14:19:36.843-08:00",
      "Id": -2147483648
    },
    {
      "Message": "@Jothay -- no the information in that other thread did not help me.  Changing the user agent did not work.",
      "PostedDate": "2010-01-24T14:21:31.24-08:00",
      "Id": -2147483648
    },
    {
      "Message": "dont know, when i went to run rawr that day and attempt it, I got a message that a new client was available (2.3.6). I downloaded that and it worked fine.",
      "PostedDate": "2010-01-26T11:32:50.627-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Ok so I figured out why i was not able to update character from armory.  At one time in the recent past I had a trial of a norton product on my computer and uninstalled it.. However it would appear that not all of it was removed so there is a tool you can download from symantec that is called norton removal tool.  I ran that and rebooted and i was able to use rawr to import from armory again.",
      "PostedDate": "2010-02-02T16:53:50.57-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-02-22T13:05:56.203-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-09-08T16:02:29.5-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-09-08T16:19:37.49-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:30:36.803-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:22:27.013-07:00",
      "Id": -2147483648
    }
  ]
}