{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Base.Items",
      "DisplayName": "Rawr.Base.Items"
    },
    "ClosedComment": "Duplicate to http&#58;&#47;&#47;rawr.codeplex.com&#47;workitem&#47;19378 continue posts there",
    "ClosedDate": "2011-01-07T12:41:29.357-08:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "Now, I've read the previous tickets and it was said that the trinkets should have had their procs fixed, added, and parsed with the 12 beta from last year.  I'm wondering if this was oversighted or what?\n \nBoth the normal and heroic versions of it only state the mastery on it, and not the 1512 or 1710 proc that it gives at 35% health of the target.\nItems:\nhttp://www.wowhead.com/item=56400\nhttp://www.wowhead.com/item=55879\n \nProcs:\nhttp://www.wowhead.com/spell=90998\nhttp://www.wowhead.com/spell=91003",
    "LastUpdatedDate": "2013-05-16T05:19:13.13-07:00",
    "PlannedForRelease": "Rawr 4.0.14 Beta",
    "ReleaseVisibleToPublic": true,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2011-01-04T12:00:45.427-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Items] Sorrowsong still not showing proc",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 19558
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "As I have said before, we don't have any support for this trinket yet due to the fact that the proc triggering system has yet to be applied to the Boss handler. Once that happens, then sure, I'll model it. Unfortunately at this time we cannot.\r\n\r\nIf you want to put SOME value to the trinket, give it a 15% chance to proc on DamageSpellHit with a 10 second duration and a 20 second cooldown. The reasoning for this generally, you spend 30% of the boss fight in the 35% execution range. Since it is up for half the time (100% chance to proc) total uptime is about 15% of the boss fight. ",
      "PostedDate": "2011-01-04T12:24:55.37-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-01-04T12:25:55.16-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Maybe 30% is correct since like I said, the proc is 100% chance and you spend it all in execution range. I would have to do some testing on this.",
      "PostedDate": "2011-01-04T12:34:18.157-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-01-04T13:18:23.743-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Just a thought I had. The mage talent Molten Fury uses the same mechanics on boss health at 35%. Would there be anyway to use that towards getting this trinket modeled? I have both the heroic and non heroic version. Assuming that the above settings for it are remotely close to the dps it gives do you think the actual proc for it would be more or less dps for fire mages considering it would sync well with Molten Fury.",
      "PostedDate": "2011-01-05T15:53:24.807-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Also under Boss Handler you can change the amount of time that the boss is under both 35% and 20% health. Assuming you change nothing the 10%+15% on each part would suggest that you spend 25% of your time on th boss in the 35% range. You can always adjust this to model what you have but if you don't change that under boss handler then you want the trinket to have a 12.5% chance to proc versus the 15%. Under these circumstances it is still better than any other heroic trinket drop I can find... I still hesitate to use it.",
      "PostedDate": "2011-01-06T06:22:11.26-08:00",
      "Id": -2147483648
    },
    {
      "Message": "What's interesting is that now it doesn't want me to get rid of it; it's telling me to opt out my Darkmmoon Card: Volcano for the new Bell of Enraging Resonance I got last night. ",
      "PostedDate": "2011-01-06T06:46:28.32-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Yea I was testing my thought process in Rawr, and yea it was valuing it well over any 372 ilvl (both 333 version and 346 version). I'll have to do some thinking on how best to evaluate the trinket before we implement the execute trigger.",
      "PostedDate": "2011-01-06T09:15:29.757-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-01-07T12:41:29.357-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:26:37.763-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:19:13.13-07:00",
      "Id": -2147483648
    }
  ]
}