{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Mage",
      "DisplayName": "Rawr.Mage"
    },
    "ClosedComment": "",
    "ClosedDate": "2011-07-20T19:31:32.27-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "I have been experiencing odd behavior for many revisions while utilizing the arcane module. Relative stats are erratic, and this causes unpredictable results. I have not noticed anyone bring this up, so I figure the problem is on my end, but I have reviewed my settings on numerous occasions and have not noticed any irregularities. Note that this issue does not always occur (particularly at this level seen in the screenshot), but I would estimate that it occurs to some degree >90% of the time.  It was recommended to me to ensure that the setting for \"Incremental optimization\" was enabled.  It was, but I decided to switch it off to see if that would change things.  I am attaching a screenshot of the stats graph with \"Incremental optimization\" enabled.  This is an issue I have experienced across numerous revisions of the arcane module.",
    "LastUpdatedDate": "2013-05-16T05:17:37.51-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2011-07-13T14:11:04.497-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Mage] Erratic stat values",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 21161
  },
  "FileAttachments": [
    {
      "FileId": 5151,
      "FileName": "incrementalsOn.JPG",
      "DownloadUrl": ".\\5151"
    },
    {
      "FileId": 5152,
      "FileName": "incrementalsOff.JPG",
      "DownloadUrl": ".\\5152"
    },
    {
      "FileId": 5153,
      "FileName": "Moonfaxx.xml",
      "DownloadUrl": ".\\5153"
    },
    {
      "FileId": 5155,
      "FileName": "moonfaxx.png",
      "DownloadUrl": ".\\5155"
    }
  ],
  "Comments": [
    {
      "Message": "You'll need to attach character xml where this happens.",
      "PostedDate": "2011-07-13T14:13:25.127-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-07-13T14:13:36.63-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Attached here is the stats graph upon disabling the \"Incremental optimization\" setting.",
      "PostedDate": "2011-07-13T14:13:37.817-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-07-13T14:14:58.943-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Here is the xml file.",
      "PostedDate": "2011-07-13T14:15:02.113-07:00",
      "Id": -2147483648
    },
    {
      "Message": "This picture looks different than the one you posted on EJ. It seems you're saying both were taken with incremental optimization enabled. Is that the case?",
      "PostedDate": "2011-07-13T14:15:38.443-07:00",
      "Id": -2147483648
    },
    {
      "Message": "That's very interesting that the one with off looks more smooth. I've never seen that before.",
      "PostedDate": "2011-07-13T14:17:58.183-07:00",
      "Id": -2147483648
    },
    {
      "Message": "The only difference for the one posted on EJ was that I altered the Boss Handler to simulate an average 25N T12 encounter (EJ setting was for Lord Rhyolith).  As you'd imagine, the two attached screenshots are for the \"Incremental optimization\" on and off.",
      "PostedDate": "2011-07-13T14:19:45.597-07:00",
      "Id": -2147483648
    },
    {
      "Message": "With as much as you deal with issues for the arcane module, if this isn't something you've seen before, I would imagine that the problem is on my side somewhere.  I certainly haven't found any abnormalities in the settings.",
      "PostedDate": "2011-07-13T14:22:30.43-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-07-13T14:25:17.217-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Well this is interesting. When I loaded your xml the stats graph looks very smooth on my machine. I've attached a screenshot. Can you try opening it in both wpf and silverlight and see if you notice any difference?",
      "PostedDate": "2011-07-13T14:25:18.46-07:00",
      "Id": -2147483648
    },
    {
      "Message": "I did see things like that before actually. It's just very transient and hard to track and in most cases not fixable, but I'd like to get my hands on some example that I can dig into more in details.",
      "PostedDate": "2011-07-13T14:26:57.083-07:00",
      "Id": -2147483648
    },
    {
      "Message": "My graph looks as yours while on Silverlight.  Offline, I have the same issue as before.",
      "PostedDate": "2011-07-13T14:29:15.97-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Well, I'm happy to provide examples as needed.  :)  Anxious to get this resolved as it's pushed me into being more reliant on SimC.  I'm headed out at the moment, but I will check back here in a few hours.",
      "PostedDate": "2011-07-13T14:32:23.857-07:00",
      "Id": -2147483648
    },
    {
      "Message": "When you say offline, do you mean out of browser mode in Silverlight version or the downloadable WPF version?",
      "PostedDate": "2011-07-13T14:35:44.78-07:00",
      "Id": -2147483648
    },
    {
      "Message": "One thing I noticed is that you're using a relatively long fight in the settings. If you're using a shorter fight the effects you're seeing should be a lot less common without having any significant change on optimum gear.",
      "PostedDate": "2011-07-13T14:41:16.697-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Another thing not related to this, but in general you shouldn't have average cooldowns checked.",
      "PostedDate": "2011-07-13T14:50:45.887-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-07-13T14:56:05.817-07:00",
      "Id": -2147483648
    },
    {
      "Message": "I've made a few adjustments including your recommendations.  One thing I ignored, however, is the fight duration adjustment; it was set for 300 seconds (your recommendation was to lower it).  I find that five-minute encounters are relatively common, particularly in hard modes.  I did attempt to change it to a longer duration (420), and oddly this seemed to smooth the graph out.  I am uploading now a file to the Rawr4 repository for you to look at; pay note to the stats graphs.  It can be found under the name \"ErraticStats\".",
      "PostedDate": "2011-07-13T22:05:30.393-07:00",
      "Id": -2147483648
    },
    {
      "Message": "No, it wasn't 300 because you had Boss Handler enabled. In fact I find 300 to work very nicely. In that xml the Boss Handler is set to about 10 minutes if I remember correctly.",
      "PostedDate": "2011-07-14T14:17:52.593-07:00",
      "Id": -2147483648
    },
    {
      "Message": "If that is the case, why would changing the fight duration from 300 to 420 have any effect?  Additionally, do I have to edit the XML itself in order to change the 10-minute setting used by the Boss Handler?",
      "PostedDate": "2011-07-15T10:56:44.81-07:00",
      "Id": -2147483648
    },
    {
      "Message": "The change from 300 to 420 I'm not really sure, would be good to double check if you had boss handler enabled or disabled.\r\n\r\nTo change the duration in boss handler you have to modify the berserk time on the boss handler tab.",
      "PostedDate": "2011-07-15T12:09:34.493-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Yes, the Boss Handler has always been enabled.  I seem to recall that in earlier revisions of Rawr there was an actual field to enter a fight duration in the Boss Handler tab; one suggestion I would make is to make the fight duration obvious in the Boss Handler (if you intend to keep it set as the berserk timer), but I imagine that's outside the bounds of the mage modules.  At any rate, I will adjust the fight durations within the Boss Handler and let you know the results after I've had some time to fiddle with things.",
      "PostedDate": "2011-07-15T16:51:54.047-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Mage offhand items appear to all have the same dps value, either 0 in the item panel or 237 in the Upgrade List panel.",
      "PostedDate": "2011-07-15T20:29:28.193-07:00",
      "Id": -2147483648
    },
    {
      "Message": "I altered the \"Berserk timer\" setting in the Boss Handler from 607 (default) to 420, and this greatly smoothed out the values in the graph.  There are still a few peculiarities, but nothing too alarming.  I will continue to mess with it in the future, but for now I feel this is probably safe to consider resolved.  Thanks for your help.",
      "PostedDate": "2011-07-19T23:35:18.833-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-07-20T19:31:32.27-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:24:36.85-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:17:37.51-07:00",
      "Id": -2147483648
    }
  ]
}