{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "Resolved.",
    "ClosedDate": "2011-08-30T18:38:31.983-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "Hey guys this may be the strangest thing Ive experienced on RAWR.\n \nIve looked around on here to no avail and re-checked all my options and I still cant figure it out. I have all the cata enchants and gems clicked as available. I also optimized spell hit <0 and chance to dodge <0 as expected for enhance shaman.\n \nMy gear is terrible atm but I just started again and wanted to get re-familiarized with rawr/enhism so I did an optimization. Long story short it keeps giving me Heartsong as my optimum enchant for both weapons, and occasionally will tell me to reforge a piece of gear to spirit. Am I doing something wrong that I dont know about? Im am expecting landslide X2 but keep getting the stupid Heartsong enchant. I double-checked on elitistjerks to make sure I wasnt missing anything drastic that changed and it verified Landslide X2.\n \nAny input is helpful. I am completely lost.\n \nThanks Wartdog (Magtheridon-US)\n \n* Attached is my file",
    "LastUpdatedDate": "2013-05-16T05:17:28.733-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2011-08-24T02:14:02.217-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "Heartsong and my Weapons? (Enhance)",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 21385
  },
  "FileAttachments": [
    {
      "FileId": 5273,
      "FileName": "Wartdog.xml",
      "DownloadUrl": ".\\5273"
    }
  ],
  "Comments": [
    {
      "Message": "Basically,  the problem you are having is to do with your optimise requirement that you are spell hit and expertise capped.   Your gear really can't support it.   The only way the optimiser can manage to get there is to count the spirit from the heartsong proc. \r\n\r\nUntil you have more gear with more gem slots and bigger reforges, you are better off not aiming for the spell hit cap.       While the spell hit -cap is a priority for Enhancement Shaman, it should not come at the cost of Agility which is by far your best stat.   By trying to force Rawr to hit the cap with your gear, you are forcing it to gem hit instead of Agi.\r\n\r\nBasically, just run the optimise without the hit conditions and you will get your best result.    Rawr will maximise your expertise and hit as much as possible without hurting your DPS by losing Agi or using dodgy enchants.   As your gear improves, Rawr will automatically aim for the caps without you having to specify, as the shaman model recognises that it is the best way to maximise your DPS.  \r\n",
      "PostedDate": "2011-08-24T16:43:40.397-07:00",
      "Id": -2147483648
    },
    {
      "Message": "What RareBeast has said is completely correct.  With all the less than ilvl 333 items you have, there are simply not enough stat points to reach the spell cap and the expertise cap.  At your gear level, I recommend not using the optimizer constraints.  Once you get into Heroic Dungeon gear (ilvl346+) feel free to start using them again (I personally don't even in raid gear as the program tends to reach those caps searching for the best gear set by itself).\r\nAlso, another note: your optimisations will tend to be quicker if you reduce the number of enchants that you have marked as available (the green diamond).",
      "PostedDate": "2011-08-26T02:55:06.733-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Thanks guys. I actually did have some sort of gut feeling that because of my crappy gear, RAWR was trying to use spirit in some way to boost a necessary stat. Much appreciated.",
      "PostedDate": "2011-08-30T12:11:03.25-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-08-30T18:38:31.983-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:24:21.65-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:17:28.733-07:00",
      "Id": -2147483648
    }
  ]
}