{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "",
    "ClosedDate": "2009-05-16T02:47:24.167-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "I just did a fresh install of windows xp over the weekend. I previously was using vista. Rawr was working fine in vista, but when i tried to run it in xp , it runs very slow and i get the program not responding message constantly. It will take about 5 minutes for the program to load completely. Am i the only person that is having that kind of issue, and i did reinstall the latest .net.",
    "LastUpdatedDate": "2013-05-16T05:25:40.28-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2009-05-05T12:53:33.48-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "Rawr fresh install of xp",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 13171
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Did you also ensure that your Rawr was fresh install from latest version? Is your XP set up with internet connection? Rawr on first load will do some internet checking and may simply be timing out. I know I had similar issues on my development laptop when WiFi switched off or during 3.1 patch when armoury was a nightmare slow. ",
      "PostedDate": "2009-05-05T16:23:17.887-07:00",
      "Id": -2147483648
    },
    {
      "Message": "i just downloaded the most recent version when i tried. My cpu usage skyrockets too. Goes to 100% then my computer becomes unusable :-(",
      "PostedDate": "2009-05-05T17:33:41.07-07:00",
      "Id": -2147483648
    },
    {
      "Message": "That doesn't sound like a Rawr problem, that sounds like some issue with your computer being configured correctly.",
      "PostedDate": "2009-05-05T19:56:24.91-07:00",
      "Id": -2147483648
    },
    {
      "Message": "If you just installed \"the latest .Net\" (btw PLEASE never ever use \"the latest\" always SAY the version number - what you think is the latest might not be what we think is the latest) did you then run windows update until it gave you no more updates. \r\n\r\nEspecially on a fresh XP install you will have at least 3 reboots worth of windows updates to install. I wouldn't even consider running ANY programs before you patch a fresh install to death.",
      "PostedDate": "2009-05-06T06:02:29.43-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-05-16T02:47:24.167-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:34:38.107-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:25:40.28-07:00",
      "Id": -2147483648
    }
  ]
}