{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Rogue",
      "DisplayName": "Rawr.Rogue"
    },
    "ClosedComment": "Modeled in the next release.",
    "ClosedDate": "2010-06-11T06:28:01.92-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "I am seeing confusing info for the Tiny Abomination in a Jar on my rogue. I have tried loading from a new file (as opposed to opening my existing .xml) and on the Beta Rawr3. Unlike other trinkets with procs, TAJ's proc does not appear in the tooltip, only the 85 hit rating. I'm looking at the ilvl 264 version, though the 277 is doing the same thing. The proc does show up in Special Effects if I edit the item. No matter how I edit the item's Special Effect, it never shows up in the tooltip, and never changes the EP value of the item in my Trinkets list. This has led me to believe Rawr is only valuing the hit rating, and that the proc is either modeled incorrectly or the modeling is not being respected. \n \nThe most current ElitistJerks spreadsheets (available in the first post at http://elitistjerks.com/f78/t39136-combat_mutilate_spreadsheets_updated_3_3_a/) both value this trinket very highly (moreso for Mutilate, of course). Rawr, however, puts it below ilvl 200 blue trinkets. EJ's sheet may not be 100% perfect in its modeling, but it is surely better than what Rawr makes of it.\n \nI've searched discussions and open issues, and while I have seen small points made about TAJ (i.e. MeleeHit vs. MeleeAttack trigger), I haven't seen anyone else posting on such a large, apparent discrepancy. \n \nMy character name is Akvavit on Bloodhoof, and I'm seeing the same behavior in both 2.3.18 and the online Beta.",
    "LastUpdatedDate": "2013-05-16T05:20:31.663-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2010-06-03T09:00:45.87-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Rogue] Tiny Abomination in a Jar not modelled",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 17893
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "TAiaJ has not been modeled for Rogue.",
      "PostedDate": "2010-06-03T09:29:03.017-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-06-03T09:30:08.817-07:00",
      "Id": -2147483648
    },
    {
      "Message": "If you were searching EJ for info on it you'd also have seen this in the OP of the Rawr.Rogue thread there :P",
      "PostedDate": "2010-06-03T09:30:15.803-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Sorry, it looks like they've taken that thread off of the main rogue page (http://elitistjerks.com/f78/). I've found it through a Google search though. Thanks.",
      "PostedDate": "2010-06-03T12:52:02.543-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Yeah, I should bump it again.\r\nAs I have some time now and am not allowed to game at work anymore (:P) I am going to look into modeling this.",
      "PostedDate": "2010-06-04T01:07:01.757-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Currently only Rawr.Retribution has modelling for the MoteOfAnger effect.  It's BiS for ret mainly because we use a 2H, and the Manifest Anger effect procs a full damage seal on top of the 50% weapon swing.  Additionally it procs of a lot of things more than just MeleeHit (which is why I put it on a new trigger).\r\n\r\nIf you want this supported in Rawr.Rogue:\r\nYou need to support the new MeleeAttack trigger.   And you need to figure out what can cause a triggering.  TAJ has been nerfed a couple times (for DK's, warriors and rogues, oddly enough not for paladins) to reduce what abilities it can proc off.  There's several forumposts out there still perpetuating the old original working of TaJ for rogues.  From what I know...\r\n- It no longer procs of Combo Point acquisition or from CP usage.\r\n- it no longer procs of poison application/refresh nor poison ticks.\r\n- The 50% extra swing it causes can either be a MH swing or an OH swing (depending on which weapon caused the stack to fill up).",
      "PostedDate": "2010-06-04T07:21:00.86-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-06-11T06:28:01.92-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-09-05T19:30:41.44-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:28:15.847-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:20:31.663-07:00",
      "Id": -2147483648
    }
  ]
}