{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Bear",
      "DisplayName": "Rawr.Bear"
    },
    "ClosedComment": "",
    "ClosedDate": "2012-10-09T08:33:56.937-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "I downloaded the new version of Rawr 4.2.6 today and have discovered that when I loaded my Feral Bear, it tells me I need to switch out all of my stam gems and stam enchants for agility. I mean everything... both gems and enchants. I have checked everything numerous times, the buffs and ect. and I am not quite figuring out what is going on, and only to believe its a glitch, thinking my char should be a feral cat or something.. Please look into this, I really love this program. My realm is Balnazzar, Char name is Quasimodo. US Server.  Thank you.",
    "LastUpdatedDate": "2017-11-27T11:01:22.267-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2011-10-18T13:33:39.07-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Feral Bear] Problem with gem/enchants with new 4.2.6?",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 21657
  },
  "FileAttachments": [
    {
      "FileId": 5396,
      "FileName": "Quasimodo_US-Balnazzar.xml",
      "DownloadUrl": ".\\5396"
    }
  ],
  "Comments": [
    {
      "Message": "That is correct actually. Unlike Wrath where Stam was king, Cata, we are looking at more avoidance than stamina. It's not uncommon for a Bear tank to have less health than say a pally tank, yet Bears are taking 80-90% less damage than said tank. This is even more so with the nerf to Firelands. Normal was nerfed by 25% so the entrance numbers needed for the instance is a lot lower than what it was at the start of the patch. As for the different numbers your seeing, I did a massive update to the boss handler which is what is generating the amount of total damage you are taking. If you think your reforging is off (not reforging to dodge), trying changing the boss type from \"Average Boss\" to \"An Impossible Boss\". If that doesn't work, trying a different difficulty, such as 25 man normal, 10 man Heroic, or 25 man Heroic.\r\n\r\nI'm supplying an example of what I mean",
      "PostedDate": "2011-10-18T15:57:42.78-07:00",
      "Id": -2147483648
    },
    {
      "Message": "I'm going to keep this issue open since I did find an issue where the module was not selecting enough stamina gems/enchants for a undergeared toons trying to fight bosses well above where they should.",
      "PostedDate": "2011-10-21T09:41:29.95-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Your example and what you have said has worked out great so far. I completely understand now. I have been tanking very well. I lost 12k health, however, I gained about 2-3% more dodge for avoidance and doing more threat/dmg. Thank you.  I see your comment today with the module, hope all goes well with it.",
      "PostedDate": "2011-10-21T15:58:13.093-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-11-07T11:26:34.937-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-11-07T11:40:32.12-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2012-10-09T08:33:56.937-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:24:10.743-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:17:20.873-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2017-11-27T11:01:22.267-08:00",
      "Id": -2147483648
    }
  ]
}