{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "Not a Rawr issue",
    "ClosedDate": "2010-03-31T21:42:05.147-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "I'm probably the only person this will ever happen to, and this probably rates at the very bottom of the things-to-do list, if it even makes it on at all, and if it's even a rawr issue and not a windows issue.\n \nI have a two-monitor set up.  Rawr was on the monitor to the right.  I switched the physical arrangement of my monitors and changed the windows settings accordingly.  I expected Rawr would just open on the former left / now right screen.  Nope.  Windows must do something screwy with the coordinates.  Rawr opened up \"to the right\" of the right monitor, and I say that because when I right clicked rawr on the taskbar to \"move\" it, the mouse moved offscreen to the right.  Not really an issue but thought I'd throw it out there and let you decide.\n \nMrDruid",
    "LastUpdatedDate": "2013-05-16T05:21:28.143-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2010-03-17T17:39:36.62-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "Dual Monitor Issue",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 16827
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Yeah, must be something in Windows; Rawr isn't doing anything funky with its window location.",
      "PostedDate": "2010-03-17T17:45:08.697-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Alt+Space, select Move from the menu that appears, use arrow keys to move it back on the screen.",
      "PostedDate": "2010-03-17T21:55:26.28-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Your primary monitor will usually have it's 0,0 coordinates in it's upper left corner.  If your \"right\" monitor was secondary (M1 - M2), it would have it's coordinates of upper left at say 1280,0.  Changing the around the positioning so your secondary monitor is to the left of your primary monitor (M2 - M1), it will have it's upper left at -1280,0\r\nIf rawr was positioned at coordinates larger than the right of your primary monitor, then the new setup has now caused those coordinates to still be to the right of your primary monitor (as they were before), but not having a monitor there, you can't see it anymore.\r\n\r\nThis is all normal Windows behaviour.  It's debatable if Windows should allow top level windows to be entirely outside the visual area.  And it's even more debatable if applications themselves (all several billion of them) should catch this happening by repositioning themselves.",
      "PostedDate": "2010-03-18T03:03:04.587-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-03-31T21:42:05.147-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:29:21.917-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:21:28.143-07:00",
      "Id": -2147483648
    }
  ]
}