{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.ProtPaladin",
      "DisplayName": "Rawr.ProtPaladin"
    },
    "ClosedComment": "",
    "ClosedDate": "2010-01-09T10:23:58.833-08:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "The Juggernaut Band and Unidentifiable Organ are not in the list of gear.",
    "LastUpdatedDate": "2013-05-16T05:22:32.67-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2010-01-07T16:56:14.633-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[ProtPaladin] Missing items",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 15772
  },
  "FileAttachments": [
    {
      "FileId": 2750,
      "FileName": "Screamin-BiS.xml",
      "DownloadUrl": ".\\2750"
    }
  ],
  "Comments": [
    {
      "Message": "Please read the documentation. No items are missing from Rawr\r\n\r\n\n\n** Closed by Jothay 1/7/2010 5:19 PM",
      "PostedDate": "2010-01-07T17:21:53.05-08:00",
      "Id": -2147483648
    },
    {
      "Message": "They were NOT in the list of gear while having them equipped on my character. Just noticed that after running an optimization and it gave me different pieces. Haven't seen them happen with any of my other equipped pieces, they're always in the list whether I have them equipped or not.",
      "PostedDate": "2010-01-07T17:21:53.8-08:00",
      "Id": -2147483648
    },
    {
      "Message": "And Jonthay, I would appreciate it if you would ask questions instead of assuming people have no idea what they are talking about and close the issue. Please show me where exactly it says in documentation that if your profile has the item equipped, it won't show up in the item list because I must have failed to see it. ",
      "PostedDate": "2010-01-07T17:31:49.323-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Now it's not showing the Corpse Tongue Coin, but is now showing the Unidentifiable Organ and I have them both equipped in my profile.",
      "PostedDate": "2010-01-07T17:34:57.56-08:00",
      "Id": -2147483648
    },
    {
      "Message": "You stated the items were missing, nothing more. If it REALLY wasn't in the database then on character load from the Armory they would have been added automatically. If they still REALLY weren't in the database, you could have gone to the Item Editor and added them manually, takes all of 30 seconds. The documentation says this.\r\n\r\nIf you meant to say more information, like you did in the following comments, I might not have closed it. However, with just what you said, we get that same statement a LOT and it's 90% user misconception.",
      "PostedDate": "2010-01-07T18:00:33.65-08:00",
      "Id": -2147483648
    },
    {
      "Message": "I did attempt to add it manually and it does not show. It is in the database because I've seen it there before, but there is something causing certain items to not show up. I have no filters set at all. ",
      "PostedDate": "2010-01-07T21:13:52.567-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Please attach your character .xml file.\r\n\r\nThe ring has all kinds of tank stats, the Coin has dodge, and the Organ has armor.  All of these items should be showing up in an unfiltered list, even if the trinkets aren't fully modeled yet.",
      "PostedDate": "2010-01-07T22:58:40.883-08:00",
      "Id": -2147483648
    },
    {
      "Message": "It does it at random. If I remove the piece of armor form my character it will show up sometimes and other times I can see it. ",
      "PostedDate": "2010-01-07T23:41:54.82-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-01-07T23:41:56.55-08:00",
      "Id": -2147483648
    },
    {
      "Message": "If you equip a ring into slot 1, it won't show up on the list for slot 2 if it's unique, and vice versa.  Ditto for trinkets.  That sounds like that may be what's happening here.  I'll still check out the file.",
      "PostedDate": "2010-01-08T08:25:03.533-08:00",
      "Id": -2147483648
    },
    {
      "Message": "These three items are showing up in the lists as expected.",
      "PostedDate": "2010-01-08T09:19:42.15-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Thx, that seems to be what's happening, but does it really need to do that? I imported my character with a new ring and I was unable to tell Rawr that I had it for that reason. I think it should still show the items in the list if they are equipped or not.",
      "PostedDate": "2010-01-08T09:54:41.363-08:00",
      "Id": -2147483648
    },
    {
      "Message": "If the item is equipped you just have to go to the other slot to select it.",
      "PostedDate": "2010-01-08T09:58:44.587-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Or go to the 'Current Gear/Enchants/Buffs' Chart",
      "PostedDate": "2010-01-08T09:59:16.36-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-01-09T10:23:58.833-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-09-05T16:21:51.517-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:30:45.237-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:22:32.67-07:00",
      "Id": -2147483648
    }
  ]
}