{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Cat",
      "DisplayName": "Rawr.Cat"
    },
    "ClosedComment": "Adjusted the default gemming templates for next version. Should be much better.",
    "ClosedDate": "2010-08-22T11:59:16.127-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "The latest version seems to have some strange templates.  Having 20 haste gems and haste/stam gems I would have though a little strange.    Maybe possibly at the extreme BiS where you are ArPen & Crit capped I suppose, but then those templates still have Agi gems or ArPen gems as well.   I would have thought you would use: -\n \n1) ArP, ArP, ArP\n2) ArP, Agi/Hit, ArP/Sta\n3) ArP, Agi/Crit, ArP/Sta\n4) ArP, Agi/Haste, ArP/Sta\n5) Agi, Agi, Agi\n6) Agi, Agi/Hit, Agi/Sta\n7) Agi, Agi/Crit, Agi/Sta\n8) Agi, Agi/Haste, Agi/Sta\n \nAlso, perhaps with templates replacing the Agi/Stam & ArPen/Stam with Nightmare Tears.   Oh, and maybe Str templates for when crit & ArPen capped - although I myself would stick with the above and just mark the Str, Str/Hit, Str/Crit, Str/Haste as available in the menus if I was close to getting capped on Crit & ArPen (still a way to go yet) - oh and the Nightmare Tear.\n \nI may be wrong in this as it has been some time since I played around with absolute BiS, but certainly for my gear level, the new templates are a bit strange.",
    "LastUpdatedDate": "2013-05-16T05:21:03.29-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2010-04-14T16:54:49.137-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Cat] Gemming templates",
    "Type": {
      "Name": "Task",
      "Id": 2
    },
    "VoteCount": 1,
    "Id": 17247
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "1) These \"new templates\" have been around for several versions. I wrote them at least a couple of months ago, if not longer, under Astry's direction.\r\n2) STR? What? When would a Cat ever want to gem STR over AGI?\r\n3) Yes, the Haste is for near BiS toons that are hitting both ArP and Crit Caps. That's normal behavior.\r\n4) There are a whole bunch of Nightmare Tear templates mixed in there",
      "PostedDate": "2010-04-15T08:57:11.057-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-04-15T08:57:37.417-07:00",
      "Id": -2147483648
    },
    {
      "Message": "1)  I only noticed this version.  Certainly the most recent previous version didn't, but then it came out with the very old gemming templates & filters for some reason\r\n2)  Str would only ever be if you are ArPen & Crit capped.   Even then I haven't really looked heavily into those cases\r\n3)  I know haste is very good, but I still was surprised to see straight Haste gems rather than Agi/Haste\r\n4) Yep, wasn't questioning this.\r\n\r\nAs it stands, the templates there are perhaps correct if you are close to BiS and have crit & ArPen caps covered.  If you don't then in most cases, then Agi/Haste gem will be better than the straight Haste gem.   Same with the blue gem using Haste/Stam instead of Agi/Stam or ArPen Stam.    I would think that  for the bulk of RawrKitty users the current gemming templates are not ideal.\r\n\r\nAll in all, it is a small issue as I always use the Optimiser & Upgrade Lists, just something I noticed that to me didn't seem quite right.\r\n\r\n",
      "PostedDate": "2010-04-15T17:55:02.54-07:00",
      "Id": -2147483648
    },
    {
      "Message": "I don't get it. The ones that are ideal are still there, right?",
      "PostedDate": "2010-04-15T18:56:28.687-07:00",
      "Id": -2147483648
    },
    {
      "Message": "There are no Agi/Haste gems in any of the current templates and it is certainly the \"go to\" yellow/orange gem at my gear level - mainly 10  ICC + some 25man (no hard modes).    I'm not yet ArPen/Crit or Hit capped.   \r\n\r\n",
      "PostedDate": "2010-04-16T01:09:04.747-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-04-18T07:53:51.72-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-07-02T15:41:53.63-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-07-06T20:39:14.917-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Don't want to be annoying, but I really think that the straight Haste gems in the templates should really be Agi/Haste gems.   I haven't seen a profile yet where the Agi/Haste wasn't the better DPS gem.   \r\n\r\n",
      "PostedDate": "2010-07-23T20:59:57.4-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-08-22T11:59:16.127-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:28:51.13-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:21:03.29-07:00",
      "Id": -2147483648
    }
  ]
}