{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Elemental",
      "DisplayName": "Rawr.Elemental"
    },
    "ClosedComment": "I added the SpecialEffects. That means procs and on use trinkets should be evalueted now.Now this module is considered up to date.Please create new issues for other problems.",
    "ClosedDate": "2009-07-30T05:10:57.45-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "The shaman model is currently out of date, and so I thought it would be a good idea to compile a list of features that need to be added or edited.\n \nSo far I've found;\n \nLightning Overload - Needs increasing to 33% chance, currently at the old 20%.\nGlyphs - The ones in the Talents tab do nothing, and while the ones in the Options|Fight tab do work there is no Glyph of Totem of Wrath.",
    "LastUpdatedDate": "2013-05-16T05:25:25.107-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2009-05-26T23:58:54.327-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Elemental] Model Out of Date",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 4,
    "Id": 13347
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Once I finish the Hunter update I will be looking into the shaman modules since I also play a resto/ele shaman who will become my main raiding toon.",
      "PostedDate": "2009-06-01T10:36:06.767-07:00",
      "Id": -2147483648
    },
    {
      "Message": "I made a few changes here and there and uploaded a patch id 2993. http://rawr.codeplex.com/Project/Download/FileDownload.aspx?DownloadId=70380\r\n\r\nquote:\r\nAdded T8 bonuses.\r\nThe calculations now use the glyphs from the talents instead of the ones specified in the options.\r\nUpdated spells and talents up to 3.1.3.\r\n\r\nIt might be that I mixed up how the additive and multiplicative stats work. And I did not touch the SpecialEffects. So they probably still need some polishing.",
      "PostedDate": "2009-06-03T10:38:53.86-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Oh, I patched against revision 34351.",
      "PostedDate": "2009-06-03T10:40:31.763-07:00",
      "Id": -2147483648
    },
    {
      "Message": "I looked at your patch Lord Helmchen, but I'm relatively new to Rawr. Does it change the gcd for just shocks or does it change it for everything?",
      "PostedDate": "2009-06-03T16:56:18.203-07:00",
      "Id": -2147483648
    },
    {
      "Message": "It should be just for shocks, when when the Glyph of Shocking is applied. Each Spell has a seperate global cooldown.",
      "PostedDate": "2009-06-03T19:43:59.507-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Please clarify. There is no such thing as a Shaman model. There is an Enhance module, and Elemental model and a RestoSham model. I am guessing its the Elemental model that you are saying is wrong? I'm the developer for the Enhance model so want to clarify if you are referring to my stuff or not.",
      "PostedDate": "2009-06-05T05:53:59.1-07:00",
      "Id": -2147483648
    },
    {
      "Message": "He is clearly referring to the Elemental model, which is indeed quite out of date.",
      "PostedDate": "2009-06-05T08:43:51.96-07:00",
      "Id": -2147483648
    },
    {
      "Message": "I've been using Rawr for several weeks now, but I can't figure out how to apply that patch to my progam. Any advice?",
      "PostedDate": "2009-06-05T12:35:46.463-07:00",
      "Id": -2147483648
    },
    {
      "Message": "brahmabull754, you'll need to be building Rawr from the source files to apply the patch.  if you're doing that then you need to get a program like patch.exe and then apply it to the source code then rebuild.",
      "PostedDate": "2009-06-05T13:51:58.793-07:00",
      "Id": -2147483648
    },
    {
      "Message": "My apologies Levva, as Lord_Helmchen says I am referring to the Elemental Model - at the time of posting I was unaware of the distinction between the separate models.",
      "PostedDate": "2009-06-05T15:11:47.077-07:00",
      "Id": -2147483648
    },
    {
      "Message": "It seems (value for haste in enh model gems is postive) that the enh model is the only one to code haste as an improvement.",
      "PostedDate": "2009-06-05T22:49:02.11-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-06-10T03:58:41.93-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-06-16T02:20:10.863-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-06-19T07:15:36.553-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-07-10T21:51:36.437-07:00",
      "Id": -2147483648
    },
    {
      "Message": "As far as I know. It is just the SpecialEffects (Procs) that are missing at the moment.",
      "PostedDate": "2009-07-11T15:43:50.01-07:00",
      "Id": -2147483648
    },
    {
      "Message": "With 2.2.10 elemental has become much better - Thanks Lord Helmchen or whoever is responsible for this. There are still a few things I find puzzling. Trinkets for one: (I’m not sure if this is the \"SpecialEffects\" mentioned earlier) Take Eye of the Broodmother, this is only considered a 87 crit increase - and it doesn’t look like its counting the Spell damage increase (I cant even find \"Illustration of the Dragon Soul\")? \"On use\" trinkets like Living Flame and Scale of Fates seems to ignore the \"on use\" -effect.\r\n\r\nAnother this is when I use the \"Optimize\" option, Rawr suggests Royal Twilight Opal (+9 Spell Power and +3 Mana every 5 seconds) in blue sockets over Runed Dragon's Eye (+32 Spell Power) - This seems wrong as well right? I know the prismatic gems get changed in the next patch, but that shouldn't change anything yet... or? In any case wouldn't Glowing Twilight Opal (+9 Spell Power and +12 Stamina) be a better choise over the MP5 one? I have no mana problems - and \"to many\" MP5 items in my gear as it is... and we all know MP5 is worthless as elemental.",
      "PostedDate": "2009-07-27T01:25:40.003-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-07-27T01:28:54.38-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Darcan : It might be because your settings are making you go out of mana in Rawr - try adjusting the fight length, buffs and replenishment uptime etc. You didn't say wether any JC only gems were being used at all, make sure they are ticked in the gemming \r\n\r\nIf you have done all this and it's still not working, my apologies. ;)\r\n\r\n\r\nAs for the trinkets - you're right, as far as I can tell they are working exactly how you say. Or not working rather.\r\n\r\nAnd yes, a great big thank you to Lord Helmchen for bringing elemental right up to date and fixing almost all of the issues!",
      "PostedDate": "2009-07-27T03:10:24.513-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Thanks Pretzle - I totally missed the JC gem option. But with that in mind, and I put the replenish to 100% uptime (and all the raid buffs of cause) its still suggests the Royal Twilight Opal over Glowing Twilight Opal. I even tried to set the fight duration to 2 mins. \r\n\r\nAnother thing - while testing the above I noticed that in one of the optimizations it suggests to of the same trinkets (it was an old quest reward hit trinket) - hinting at, rawr doesnt know they are uniqe equip.\r\n\r\nAnd to finish off; Rawr insist on useing my \"Pulsing Spellshield\" over \"Ice Layered Barrier\" - I guess its the lack of crit on the barrier, but the rest of the states are far supperior - can this be true?\r\n",
      "PostedDate": "2009-07-27T14:43:29.603-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Darcan did you add all the buffs you expect to have? mana spring or replenishment ?   It only recommends spellpower gems to me.   OOOOh.. do you have 'enforce gem requirements checked' ?   is it trying to fufil a meta ? \r\n\r\nMy first guess on why Pulsing Spellshield is ranked higher is the crit vs the mana / 5.  As elemental mana/5 shouldn't really be necessary  . i suspect in the comparison pane on the right hand side they're fairly close though. ",
      "PostedDate": "2009-07-27T15:51:27.81-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Perhaps it is the haste difference. On certain haste values the approximation prefers haste over nearly any other stat, because it would allow for another lightning bolt between the Lava Bursts.\r\nBut as this is only an approximation I'd still go with the Ice Layered Barrier.\r\nI usually set the Optimization setting to 100% Burst, because I never ever run into mana problems.",
      "PostedDate": "2009-07-27T16:52:42.007-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-07-30T05:10:57.45-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-09-08T14:10:40.29-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-09-08T14:15:57.597-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:34:19.5-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:25:25.107-07:00",
      "Id": -2147483648
    }
  ]
}