{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Base",
      "DisplayName": "Rawr.Base"
    },
    "ClosedComment": "This should be fixed now",
    "ClosedDate": "2010-07-05T19:04:51.857-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "I turned on some JC templates, with a character file that had 3 JC gems equipped and \"Enforce Gem Requirements\" checked.\n \nI don't have any dragons eye gems in my gloves.\n \nIf I click on my gloves to swap my gear, it's sorted properly (with no Dragons Eye gems). If I change the \"Comparisons\" pane to gloves, just about every glove piece it shows has the JC template utilized.",
    "LastUpdatedDate": "2013-05-16T05:24:01.49-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2009-10-06T22:53:09-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Base] Enforce Gem Requirements not working in Comparisons",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 14344
  },
  "FileAttachments": [
    {
      "FileId": 2822,
      "FileName": "Wain.xml",
      "DownloadUrl": ".\\2822"
    }
  ],
  "Comments": [
    {
      "Message": "I've sometimes noticed this behavior due to Item.OptimizerManagedVolatiliy left turned to true, but I've never been able to track it down completely when it happens. I know the way we're currently handling that is more of a hack than anything else and most likely needs better multithreading synchronization. I'm not sure if your problem is reproducible.",
      "PostedDate": "2009-10-07T00:54:55.7-07:00",
      "Id": -2147483648
    },
    {
      "Message": "FTR, it's not just my gloves, but every piece.  I'll play around with it some more to see if I can't nail it down...hopefully it repros on my dev box.",
      "PostedDate": "2009-10-07T07:32:04.033-07:00",
      "Id": -2147483648
    },
    {
      "Message": "I'm seeing this with my enhancement shaman in Rawr 2.3.6. For the \"waist\" slot, with \"Enforce Gem Requirements\" checked, most belts are presented with suitable gemming selections. Some, however, are shown with configurations that contain nothing but multiple Nightmare Tears. The stats for the tears are all greyed-out. For these belts, far better scoring gem options (created by manually editing the gemming for the item) are not suggested at all by default. Belts I've noticed this happening with include: Band of the Night Raven,  Nerub'ar Stalker's Cord, Blood-Drinker's Girdle, Belt of the Merciless Killer, Cauterized Cord, Belt of Arctic Life. There are more but the list is getting long. I'll attach the XML file for my character in case that helps.",
      "PostedDate": "2010-01-19T20:57:42.247-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-01-19T20:57:45.473-08:00",
      "Id": -2147483648
    },
    {
      "Message": "I should also add that this problem doesn't occur if \"Enforce Gem Requirements\" is unchecked.",
      "PostedDate": "2010-01-19T20:59:16.853-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-04-18T10:50:45.52-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-07-02T15:25:52.163-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-07-05T19:04:51.857-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:32:37.677-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:24:01.49-07:00",
      "Id": -2147483648
    }
  ]
}