{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.RestoSham",
      "DisplayName": "Rawr.RestoSham"
    },
    "ClosedComment": "Fixed in recent build per comments",
    "ClosedDate": "2009-02-14T10:17:36.497-08:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "There are a couple of places where the number Rawr is showing for Crit and the in-game paper doll Crit are showing different numbers.  While I think rawr is using the correct numbers for calculations, it would be nice if it was easier to see that rawr matches in-game (I've used this matching to track down things like mismatch between what enchant I told rawr to use and what enchant was actually used.  Same thing with gemming.)  It also helps to find errors in imported gear -- like where the socket bonus on gloves mysteriously dissapered.  At any rate here's the differences:\n  The in-game paper doll does not show \"Crit Chance\" due to the Tidal Force talent but Rawr does.\n  The in-game paper doll does not show \"Crit Chance\" due to the Tidal Mastery talent but Rawr does.\nAnd a very minor difference that might be hard to take into account and is likely not worth while to change (but I'll mention it anyhow :-)\n  The in-game paper doess only shows \"Crit Chance\" due to the Thundering Strikes talent if a main hand weapon is equipped but Rarw always shows it.",
    "LastUpdatedDate": "2013-05-16T05:26:14.823-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2009-02-07T12:31:22.827-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[RestoSham] Difference between Rawr and in-game for crit",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 12564
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "I can agree, and moved Tidal Force out of the generic crit area, however instead of forcing it to match paper-doll exactly I've added a note no the tooltip to the effect that Tidal Mastery and talents like it are included in \"Heal Spell Crit\".",
      "PostedDate": "2009-02-11T10:56:14.65-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-02-11T10:59:21.01-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-02-14T10:17:36.497-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-09-08T14:59:00.707-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:35:31.033-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:26:14.823-07:00",
      "Id": -2147483648
    }
  ]
}