{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Hunter",
      "DisplayName": "Rawr.Hunter"
    },
    "ClosedComment": "fixed in source - 2.2.14 will be out shortly",
    "ClosedDate": "2009-08-19T17:57:24.98-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "Hi, thank you for this great program,it is much appreciated. However this version 2.2.6 seems to have a problem with my Hunter, showing 0.0dps. I have tried my Warrior and this seems fine, I have rebooted the PC incase there was something wrong there, but everytime I import the Hunter, all the armor and weapons are ok, but all dps is 0.0 apart from my pet.",
    "LastUpdatedDate": "2013-05-16T05:25:18.813-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2009-06-05T01:45:48.66-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Hunter] Shows 0.0 DPS but Pet has 203 DPS",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 10,
    "Id": 13424
  },
  "FileAttachments": [
    {
      "FileId": 1974,
      "FileName": "226.jpg",
      "DownloadUrl": ".\\1974"
    }
  ],
  "Comments": [
    {
      "Message": "Same issue. 0 Hunter DPS. All the other modules i use (priests, paladins) seem to work fine.",
      "PostedDate": "2009-06-06T02:45:10.06-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Same issue confirmed on two other computers. Previous version worked OK.",
      "PostedDate": "2009-06-07T13:04:49.453-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-06-07T13:04:56.04-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-06-07T22:49:11.833-07:00",
      "Id": -2147483648
    },
    {
      "Message": "I'm having the same issue.",
      "PostedDate": "2009-06-07T22:53:57.21-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-06-07T22:53:59.917-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-06-07T23:53:55.79-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-06-08T04:07:03.73-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Same issue for me.\r\n NB: I have the same issue since I play myShamHeal. TillOOM( blue) is never shown, only healing (green) is shown.",
      "PostedDate": "2009-06-08T04:08:45.63-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Same here, which makes sense since it was known at the time it was released. I just don't understand why it was released with a completely broken Hunter module. I appreciate the time and effort that you put into this, but wouldn't it have been better to just not update the Hunter module just yet?\r\n\r\nAlso, is there a special section for the Hunter module? There are so many numbers nowhere near the actual values that I don't really want to browse through this entire site trying to find another post concerning the same issue.",
      "PostedDate": "2009-06-08T05:37:38.403-07:00",
      "Id": -2147483648
    },
    {
      "Message": "PS - in the Discussion you say \"Thanks but only the pet calculations are done...\", but my pet's DPS is still 202, just as it was in the previous version. Also I can't choose a pet or priorituse any of it's abilities.",
      "PostedDate": "2009-06-08T06:08:40.843-07:00",
      "Id": -2147483648
    },
    {
      "Message": "This is a known issue as the latest build was made before the update was finished. A 98% functional version is now available as source and will be in the next build. The module developers don't decide when a build will be made, the coordinator does all that. As for your pet doing 202dps that is correct, if you use recount and split your pet from your dps you will see it is around 10% of your total dps. The pet priorities do work, I tested them extensively. The values you will get from the latest source (and next build) are within ~50-100dps of actual depending on trinkets and such. Please read discussions before posting such a negative review, the Hunter Update discussion has been on page 1 or 2 for the past week and a half.",
      "PostedDate": "2009-06-08T09:48:29.187-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-06-08T12:15:03.777-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Oh, I read the Hunter Update discussion - that's how I knew \"...it was known at the time it was released\"\r\n\r\nYou may be under the impression that I'm attacking you personally, which is not the case. I am merely concluding that Rawr is currently not reliable enough for Hunters to use as a resource. And that's really all that people are interested in - reliability. And if the coordinator decided to release it anyway - spank him!\r\n\r\nPeople don't care why the numbers are wrong, or who programmed that version, or how much time and effort is being put in trying to get it right - all they care about is whether it's right or wrong. And literally all my 'Basic Stats' and 'Basic Calculated Stats' are wrong, and not even by a small margin - I have 1623 Agility, not 2062, for example.\r\n\r\nAnyway - in spite of your efforts, which I have no reason to belittle in the least, this version should not have been released like this.\r\n\r\nPS - \"As for your pet doing 202dps that is correct, if you use recount and split your pet from your dps you will see it is around 10% of your total dps.\" I do significantly more than 2020 DPS... ;-)",
      "PostedDate": "2009-06-08T13:13:59.247-07:00",
      "Id": -2147483648
    },
    {
      "Message": "I am sorry if you considered this a negative review, I was only trying to help as these are betas and you said that feedback would be appreciated. i did not know how to leave feedback and eventually found a way of leaving you info on problems to help you out. I certainly did not want to leave a negative review as I said in my opening statement that your program is very much appreciated.\r\nRegards,\r\nJay\r\n",
      "PostedDate": "2009-06-08T13:43:25-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-06-08T20:54:45.873-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Same issue, pet dps showing in gear sort, hunter dps not showing (although it is being used to rank items) 32bit Vista",
      "PostedDate": "2009-06-18T06:01:23.677-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-08-19T13:42:25.307-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-08-19T17:57:24.98-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-09-05T18:44:42.883-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:34:12.407-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:25:18.813-07:00",
      "Id": -2147483648
    }
  ]
}