{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Base.Optimizer",
      "DisplayName": "Rawr.Base.Optimizer"
    },
    "ClosedComment": "4.1.01 Released",
    "ClosedDate": "2011-03-27T17:48:55.577-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "I regularly use the Evaluate Upgrade option in Rawr as well as the Build Upgrade List. I would find it useful if the item was not an upgrade, just how close it is. Perhaps it is only a 0.1 DPS loss in which case I may consider using it anyway for various reasons (not all of them completely related to maximum performance - none of us like wearing a green trinket!). There are often items that I would have thought to be upgrades that do not show as upgrades when I evaluate them and it leaves me wondering.\n \nThis would definitely be nice for the Evaluate Upgrade option, but would still be useful in the Build Upgrade List feature. May not be feasible for the BUL as often there might be a massive number of items (although the better item filters such as ignoring SP or AP items in models helps this).",
    "LastUpdatedDate": "2013-05-16T05:19:50.787-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2010-09-15T17:08:55.157-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Feature Request.Optimizer.UL] Evaluate Upgrade to show negative values",
    "Type": {
      "Name": "Feature",
      "Id": 1
    },
    "VoteCount": 1,
    "Id": 18769
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "If there's a legitimate performance reason to consider a piece that would otherwise be subpar, then the model you're working in should include it.  Past that, the whole point of Rawr is optimizing ,not de-optimizing (Degenerating?  Breaking.)  Of course, you've been around long enough to know that by now, RB.  =D\r\n\r\nFor instance, say I have a 10 Str 10 Stam item, and a 9 Str 50 Stam item.  If I only care about the DPS that each item confers to my character, then I'll set the Survivability Scale within DPSWarr to 0, and go about my merry way.  The program will recommend the former item.  If, however, I'm setting even a minimal Survivability scale, then it will say the latter is better, due to the 40 Stam benefit at the cost of a mere 1 Str.\r\n\r\nIncluding all items in the Upgrade List kind of defeats the whole purpose of it being, well, a list of upgrades.  That introduces both confusion AND potential recommendation issues.  Past all of that, it would just make the Upgrade List get REALLY out of hand in terms of raw size, which would be a headache for anyone that might ever try to use it.",
      "PostedDate": "2010-09-15T18:16:17.283-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Yeah, no way we could do this in upgrade lists. It's feasible in Evaluate Upgrade, and I see how it could be somewhat useful in rare circumstances, but it'd be a really low priority. ",
      "PostedDate": "2010-09-15T19:14:00.193-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-09-15T19:49:10.89-07:00",
      "Id": -2147483648
    },
    {
      "Message": "All you say is of course true.    I guess it is just more for the info side of it.    I click on Evaluate Upgrade thinking an item may be an upgrade and when the list comes up blank and it bothers me a bit not knowing how close it was to being so.\r\n\r\nNot really much to do with the true function of Rawr and it would probably cause confusion with users thinking that downgrades are upgrades because they are showing in the list.\r\n\r\n",
      "PostedDate": "2010-09-15T23:39:49.24-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Relevant to Rawr4",
      "PostedDate": "2010-11-21T10:59:58.863-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-11-23T13:47:28.39-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-12-27T18:50:04.247-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-03-16T18:37:31.48-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Completed, see checkin 58857",
      "PostedDate": "2011-03-16T19:52:19.28-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-03-27T17:48:55.577-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:27:23.457-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:19:50.787-07:00",
      "Id": -2147483648
    }
  ]
}