{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "Old issue.",
    "ClosedDate": "2009-08-09T17:28:53.77-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "The item filters seem to occasionally screw up. At the moment, I've unselected all my filters (and thank you for using my filter suggestions, and fixing the Heroic filters!), but all or nearly all of the items are still selected.\n \nThe triggering event occurred while I was browsing gems. I unselected Jewelcrafting, and the BoP JC gems went away. Then I unselected 'Other' or 'Unknown' to eliminate the not-yet-implemented epics... and the BoP JC gems re-appeared. The Item filters appeared to have no functionality after that... selected or unselecting all of them did not appear to change what items were listed. Closing and re-opening Rawr appeared to fix this bug, but it has come back several times in the past few hours.",
    "LastUpdatedDate": "2013-05-16T05:26:29.127-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2009-01-08T14:57:49.863-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "Erratic issues with Item Filters",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 2,
    "Id": 12326
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Noticed similar effect trying to filter out PVP gear.  Had no effect on the gear list.",
      "PostedDate": "2009-01-09T09:24:03.9-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-01-26T10:11:05.07-08:00",
      "Id": -2147483648
    },
    {
      "Message": "I have noticed similar effects. I use this (fantastic) tool for non-raid ready toons. It's great for filtering out heroics/badges/raids etc to figure out what gear is available to a mid-70s toon from instances, quests, factions, etc. While this \"filtering\" exists in any number of websites/applications, nowhere are the results ranked for effectiveness for your specific character.\r\n\r\nIt's using it this way that I notice the filters aren't working. Probably missed in testing since most testers would be using for 80 toons (and 70s historically) so the flag selection would be almost opposite to what I am using it for in this case.",
      "PostedDate": "2009-01-26T10:11:10.587-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-08-09T17:28:53.77-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:35:50.157-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:26:29.127-07:00",
      "Id": -2147483648
    }
  ]
}