{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Mage",
      "DisplayName": "Rawr.Mage"
    },
    "ClosedComment": "",
    "ClosedDate": "2010-09-03T17:39:58.42-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "It looks like the Rawr 3 beta was updated as I see new gemming icons beside the equipment icons. The problem I'm having is ever since then, the item values seem really screwed up and are greatly skewed towards MP5 and Spirit, which as an Arcane mage is horrible. For instance, I have a Dislodged Foreign Object and Heroic Spyglass, yet it's now pushing the Talisman of Resurgence or Heroic Solace of the Defeated as my BiS? It's even suggesting I break my 4 piece T10 to put in items with a lot of Spirit or MP5.\n \nI checked my buffs section to make sure all my normal raid buffs are selected, but I just can't see why it has now started skewing all of my gear towards mana regen. This is on my Mac, so I have to run the browser version. Using the latest 2.x build on my PC exhibits no such problem. On my PC which runs the offline version, I have the same options selected and it puts my DPS at over 13K, yet on the browser version on my Mac, it lists me as 11.6K.\n \nI even tried to reset all caches, but that didn't revert it back to its normal behavior.\n \nThank you for any assistance in this matter :)",
    "LastUpdatedDate": "2017-11-27T11:02:03.38-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2010-09-02T13:04:27.39-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Mage] Values Spirit and MP5 too highly",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 18663
  },
  "FileAttachments": [
    {
      "FileId": 3980,
      "FileName": "sunmoonsweirdvalues.xml",
      "DownloadUrl": ".\\3980"
    }
  ],
  "Comments": [
    {
      "Message": "You're in an edge condition where you'd need to switch cycles to keep increasing dps without going out of mana. By default this is not considered because in majority of situations this doesn't happen for performance reasons. What you'll want to do until you get out of this edge condition is go to Advanced Options and uncheck Incremental Optimizations. It'll work a bit slower, but it should give you accurate results until you change some gear.",
      "PostedDate": "2010-09-02T14:08:50.807-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Kavan,\r\n\r\nThanks for the explanation. Unchecking Incremental Optimizations definitely got my gear selections back in line. It still doesn't match the DPS of the 2.x version, but at least now I can see my upgrade path more clearly.\r\n\r\nThank you for the information!",
      "PostedDate": "2010-09-02T21:40:49.563-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-09-03T17:39:58.42-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-09-08T15:25:35.78-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-03-17T21:30:24.073-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-05-21T00:00:21.103-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:27:31.73-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:19:56.837-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2017-11-27T11:02:03.38-08:00",
      "Id": -2147483648
    }
  ]
}