{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "User&#39;s system error",
    "ClosedDate": "2009-09-16T17:20:07.83-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "So yeah...about 2 versions ago, whenever I used Open...it would instantly close Rawr. (Manged to still use Rawr on saved files though through the use of the \"last documents\" tab thing...but the new version of Rawr got rid of those.\n \nRunning Windows XP at the moment (running under Windows 2000 compatibility because normally it just chugs along, or crashes randomly).\n \n \nSo yeah...anyone help with this problem?",
    "LastUpdatedDate": "2013-05-16T05:24:57.75-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2009-08-06T14:11:38.65-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "Rawr closes when I attempt to Open a File",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 13798
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Is it a warrior? If so, this is a known issue. There's another issue on the first page of issues with a temporary workaround",
      "PostedDate": "2009-08-06T14:45:52.08-07:00",
      "Id": -2147483648
    },
    {
      "Message": "this would not be the same issue, he says rawr instantly quits, not giving an error and if he could open it with the recent docs list that's an entirely different issue",
      "PostedDate": "2009-08-06T14:49:08.06-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Hmmm...yeah, when I try to Open a file normally (without changing the compatibility to another version), it just crashes (but doesn't instantly close like it normally does). Still..no idea what to do lol",
      "PostedDate": "2009-08-06T17:16:08.3-07:00",
      "Id": -2147483648
    },
    {
      "Message": "...huh? Compatibility? Crashes? Instantly closes?\r\n\r\nCan you please give us a specific report of what exactly your problem is? What steps do you take, and what happens when you take those steps? And make sure you include the files that are involved.",
      "PostedDate": "2009-08-06T23:09:04.807-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Mate, you NEED to tell us EXACTLY the steps you are taking and EXACTLY what the program says. ie: cut and paste any messages. Saying \"it crashes\" without any explanation is NOT helpful.  You also need to tell us what version of Rawr you are using and what character model you are trying to load (mage, warlock, Enh Shaman etc).\r\n\r\nIt's as if you posted \"my car won't start\" but give no further info. We can't tell from something so vague what's wrong. If it was a car it might be as basic as you ran out of fuel or didn't put the key in to start it. We can't tell if you don't tell us what you are doing to get the crash. Remember that over 80,000 people downloaded the latest version and it works for them so it must be something you are doing that's wrong.",
      "PostedDate": "2009-08-07T06:48:35.183-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Loading Enhance Shaman in latest version of Rawr.\r\n\r\n\r\nOK, these are my exact steps.\r\n\r\nRight click Rawr.exe, goto Properties, goto Compatiblity Tab, check off \"run this program in compatibility mode for: Windows 2000\" (running it normally causes horrible program lag, and most of the time I receive \"Status - Not Responding\" message).\r\n\r\nNext, I run Rawr.exe. I then goto File, and click Open. BAM...Rawr instantly closes. \r\n\r\nI tried remaking my character (or loading via WoWArmory..which still to this day Ive never managed to get it to work once >.>), but now whenever I save, it instantly closes as well. (the exact same way as opening. No error, nothing...just instantly shuts down)\r\n\r\nSo yeah, Im pretty screwed at the moment...lol\r\n",
      "PostedDate": "2009-08-07T18:56:00.507-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Honestly, if this is happening to you and based upon the references you made about it chugging along in Windows XP there are several *outside Rawr* factors causing this problem. These are in no particular order but each warrant checking.\r\n1) Bad Hardware (Proc or RAM)\r\n2) Bad install, redownload Rawr\r\n3) Bad install of what Rawr needs to run, reinstall .NET, maybe even do a full OS reinstall\r\n4) Malware on your system is interfering with program operation\r\n5) An Antivirus program is interfering with program operation\r\n6) Too many cooks in the kitchen, close some active programs that are running in the background, search for Windows XP Tweak guides to see how to get the best performance out of your OS.\r\n\r\nRawr normally does not *chug along* on it's own it would have to be caused by your system or something on it.",
      "PostedDate": "2009-08-07T22:10:34.573-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Agreed; you should never run Rawr in compatibility mode. If it's \"causes horrible program lag, and most of the time I receive \"Status - Not Responding\" message\", then that means some sort of serious system issue, or hardware issue. Bad copy of Rawr, bad install of .NET,  bad instal of the OS, or bad hardware... Just go down the list.",
      "PostedDate": "2009-08-08T01:20:56.68-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-09-16T17:20:07.83-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:33:47.49-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:24:57.75-07:00",
      "Id": -2147483648
    }
  ]
}