{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "Solved.",
    "ClosedDate": "2009-01-19T15:12:15.163-08:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "With current version (and also previous versions) of Rawr I got the problem that it totally freezes when I'm trying to use the Build Upgrade List from the Optimizer on Mage Model.\nAs far as I know, everything that needs to be filled in/ticked etc has been done, but what ever I try it keeps freezing.\nIt freezes after doing 1% and then it has to be closed through the Taskmanager of Windows.\n \nI tried it on my laptop with Win XP Pro and on my pc with Vista Ultimate, both with exactly the same problem. Also a girlfriend of mine on a total different pc has the same problem (she was the one that reported the problem to me and hoped I could fix it...).\n \nSearching both here and on other places didn't even gave a result from someone else with same problem, let alone the fix to the problem.\nSo I'm putting my hope on the IssueTracker.",
    "LastUpdatedDate": "2013-05-16T05:27:00.84-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2008-09-12T09:16:11.687-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "Rawr b16 freezes on \"build upgrade list\"",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 11227
  },
  "FileAttachments": [
    {
      "FileId": 1350,
      "FileName": "glinda.xml",
      "DownloadUrl": ".\\1350"
    }
  ],
  "Comments": [
    {
      "Message": "Please post your character file. First guess would be... Did you mark *everything* as available (or a ton of items at least)? The more items you mark available, the more inaccurate and slow it will be, especially right at the start.",
      "PostedDate": "2008-09-12T10:55:47.443-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Character file has been attached. But no, I didn't mark everything. I tried to limit the amount of items per section to 2 or 3. And the strange thing is it always tends to hang at a Soulcloth item for no obvious reason. I actually tried deleting the Soulcloth items from the database, but then it will hang on another item...",
      "PostedDate": "2008-09-13T02:16:40.96-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2008-09-13T02:16:42.053-07:00",
      "Id": -2147483648
    },
    {
      "Message": "You have too many things selected. Even on min thoroughness it's moving very very slowly, but it didn't get stuck. First thing you should limit your gem selection, that is probably hurting you most. For example you have 3 +dmg gems selected, you have both rare and epic versions. Just select the ones you will actually consider using.",
      "PostedDate": "2008-09-13T14:07:22.723-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Hmm. Not sure why those gems were even selected, tbh. But yes, deselecting as many gems as possible, did the trick but only on lowest thoroughness.  Not sure if that matters much for the Upgrade List...\r\nProblem was basically that I expected the function to do something differently than it does. I expected it to go through the list of selected gear and gems and show the possible upgrade combinations. In stead it uses the selected gems to go through all gear, if I got it correctly, which made it dependent on selected gems, not on other items. \r\nAnyways, thank you for pointing out the gem problem :-).",
      "PostedDate": "2008-09-14T16:17:09.48-07:00",
      "Id": -2147483648
    },
    {
      "Message": "What you wanted to achieve is actually done by the optimize function. That one will select the best gemming/enchants/items out of the ones you selected as available.",
      "PostedDate": "2008-09-14T18:44:28.643-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-01-19T15:12:15.163-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:36:31.067-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:27:00.84-07:00",
      "Id": -2147483648
    }
  ]
}