{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "Closing with the 4.3.8 release.  If there are still problems, create a new issue.",
    "ClosedDate": "2012-02-20T18:42:13.227-08:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "Check the the values in Gems -> All Normal.  Stam, Parry, and Dodge are worth 0, and Mastery is worth negative.  If I switch from H Morchok to An Impossible Boss, the value of Stam becomes positive, but parry and dodge are still 0, and mastery is still negative.",
    "LastUpdatedDate": "2013-05-16T05:17:05.47-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2012-01-26T03:33:44.867-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "ProtPaladin: Stam, avoidance, and mastery undervalued",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 22114
  },
  "FileAttachments": [
    {
      "FileId": 5574,
      "FileName": "Negative mitigation in prot paladin model.xml",
      "DownloadUrl": ".\\5574"
    }
  ],
  "Comments": [
    {
      "Message": "I'm already aware of this.  Mastery is worth negative because you're (presumably) beyond the block cap.  Beyond that, I don't have any more idea what's going on than you do, as I'm only just starting to look at and understand the model.  It could be some time before a fix comes.",
      "PostedDate": "2012-01-26T05:29:15.33-08:00",
      "Id": -2147483648
    },
    {
      "Message": "I think I have a good idea what is going on: your predecessor completely ruined the ProtPaladin model starting with 4.2.2.  In the 4.2.1 ProtPaladin model, mastery is worth 0 at the block cap, and stam, dodge, and parry have positive values.  That seems like a reasonable starting point for whatever improvements you want to make.",
      "PostedDate": "2012-01-26T11:54:42.997-08:00",
      "Id": -2147483648
    },
    {
      "Message": "the thing Is, that even past blockcap it is rather harsh to say mastery values 0.  mastery is still amazing, as evey point of mastery beyond blockcap gives you free itemization points.  so it could giving you more survivability by getting more stamina elsewhere. the same goes for avoidance, or if you like give you more hit/expertise.",
      "PostedDate": "2012-02-13T02:16:42.05-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Every point of mastery beyond the block cap is wasted.  No two ways about it.  In any event, this bug has been resolved in the latest source.",
      "PostedDate": "2012-02-13T05:09:52.06-08:00",
      "Id": -2147483648
    },
    {
      "Message": "I guess you didn't get what I mean by itemization points.  if you loot a new item with mastery that pushes you voer blockcap you can drop some mastery elsewhere, for let's say stamina.  So in an indirect way mastery items are still usefull.   so having mastery shown as 0 value is kind of annoying if I'm looking for an item with mastery or a gem with mastery, where I don't know the name.\r\nI'm using 4.3.7  bug is still there.",
      "PostedDate": "2012-02-13T07:23:43.79-08:00",
      "Id": -2147483648
    },
    {
      "Message": "@Schrom - That's just how rawr works.  It is not specific to the ProtPaladin model.",
      "PostedDate": "2012-02-13T09:48:03.94-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Come on, Dopefish.  How hard is it to roll back to the last ProtPaladin model that actually made any sense?  The model that you inherited is junk.  If you still want to try to understand it, more power to you.  But for the sake of prot paladins everywhere, please roll back to the 4.2.1 model so that we can get meaningful results again.",
      "PostedDate": "2012-02-20T10:37:20.317-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Wow, okay, trashing of my predecessor aside, the issue is just waiting for a new release to be put out and it'll be fixed.  As for your question, it's actually harder than you know.  Or would you like to try?",
      "PostedDate": "2012-02-20T13:42:50.81-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Biggus just give him a chance, I read the changes he already made (finnally found it btw) and it looks really promising.  Personnally I can't wait for the new release.  It seams like all the things (or a least the most) that sucked in the actual model will be fixed in the next release, or at least majorly improved.",
      "PostedDate": "2012-02-20T14:29:37.487-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2012-02-20T18:42:13.227-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:23:50-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:17:05.47-07:00",
      "Id": -2147483648
    }
  ]
}