{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "User Misconception",
    "ClosedDate": "2010-02-08T18:20:47.56-08:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "I've messed with this for hours.  Either I'm an idiot or there is a problem here ... the odds are in your favor :P\n \nI'm a Blacksmith and Jewelcrafter ... thus I have three prismatic slots and three dragon's eye gems.  I know this isnt optimal, but I like to only place my dragon's eye gems into my prismatic slots.  I have created a \"Custom\" gemming template (disabling all others) where the prismatic column only contains dragon's eye gems and dragon's eye gems are not added in any other columns.  The optimizer consistently chooses to place dragon's eye gems into non prismatic slots and normal gems into prismatic slots.\n \nPlease tell me I'm an idiot ... but at least tell me why ... :D\n \nThanks",
    "LastUpdatedDate": "2013-05-16T05:22:02.463-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2010-01-29T20:05:55.877-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "Gemming Template and Prismatics",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 16168
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Since there's absolutely no calculational reason to restrict Dragonseye's to the blacksmith sockets, the optimizer certainly won't do that. Marking them available at all (either via the comp charts or by putting them into templates) make the optimizer capable of putting them wherever they will benefit you the most.",
      "PostedDate": "2010-01-29T21:31:10.89-08:00",
      "Id": -2147483648
    },
    {
      "Message": "hmm ... that make sense, thank you for the reply.  I guess I misunderstood the purpose of the Gemming Templates.  I assumed that they were intended to specify which gems are available for which types of sockets.  Based upon your comments it seems that they are just a means to quickly configure which gems are available to the optimizer.  Since this is quite easy to do via the comp chart ... seems unnecessary ... am I still missing something here?",
      "PostedDate": "2010-01-30T11:15:45.17-08:00",
      "Id": -2147483648
    },
    {
      "Message": "See the help docs on Gemming Templates. Gemming Templates are for filling gems in items in the comparison charts. There's also an option (enabled by default) to count any gems in any enabled gemming templates as available to the optimizer.",
      "PostedDate": "2010-01-30T12:27:19.76-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-02-08T18:20:47.56-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:30:08.363-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:22:02.463-07:00",
      "Id": -2147483648
    }
  ]
}