{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.DPSWarr",
      "DisplayName": "Rawr.DPSWarr"
    },
    "ClosedComment": "Works in Arms, Fury won&#39;t have it worked on before Cata where things will change anyways",
    "ClosedDate": "2010-09-16T12:35:39.583-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "For the last little while (more than week or two, have not narrowed it down), toggling on Execute Spam has significantly lowered my DPS.  This is rather surprising.  Can provide any requested data (images, character profiles, etc.) for diagnostic purposes.",
    "LastUpdatedDate": "2013-05-16T05:23:34.49-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2009-10-30T16:47:53.657-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[DPSWarr] Enabling Execute Spam option lowers DPS",
    "Type": {
      "Name": "Task",
      "Id": 2
    },
    "VoteCount": 1,
    "Id": 14586
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "I know what the problem is, I just don't have a way to fix it yet.",
      "PostedDate": "2009-10-30T17:28:54.213-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Maybe that's because spamming execute (instead of working your normal rotation and just hitting execute when everything else is on cd) is a significant dps loss.",
      "PostedDate": "2009-10-31T00:33:49-07:00",
      "Id": -2147483648
    },
    {
      "Message": "umm, no?",
      "PostedDate": "2009-10-31T11:26:40.033-07:00",
      "Id": -2147483648
    },
    {
      "Message": "The \"Execute Spam\" option doesn't technically mean \"do nothing aside from Execute\", it means \"replace the normal rotation with an Execute-heavy one\".  If I remember correctly, the exact rotation should turn into\r\n    1) Keep up Rend\r\n    2) Use any OP that is available\r\n    3) Use Execute\r\nStill using a rage dump where it won't impede on the rage requirement of this new rotation, which is pretty significant (the rage requirement, that is).",
      "PostedDate": "2009-10-31T12:15:32.973-07:00",
      "Id": -2147483648
    },
    {
      "Message": "We stop hs/cl during exec spam to funnel all that rage to Exec (ensuring that it hits it's cap each time)",
      "PostedDate": "2009-10-31T13:32:13.577-07:00",
      "Id": -2147483648
    },
    {
      "Message": "or at least tries to",
      "PostedDate": "2009-10-31T13:32:26.557-07:00",
      "Id": -2147483648
    },
    {
      "Message": "I wouldn't force it to stop HS, I regularly HS during execute phase when I am above 75 or 80 rage, if I don't then I will lose a significant amount of rage in some situations (especially if that is when we heroism or in an AoE heavy encounter).",
      "PostedDate": "2009-11-02T07:37:38.633-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Yeah.  The rotation becomes more rage intensive, but this just lowers the HS:swing ratio, it doesn't exclude HS entirely.  If you would normally HS at 50 rage and above, you might only do so at 75 and above, for example (totally made-up numbers, used for descriptive purposes only).\r\n\r\nAs I understand it, the model currently takes the leftover rage after the rotation, and applies it to HS .  This works okay, but it's certainly not entirely accurate.  There WILL be more waste (overcapping) than the model accounts for (no overcapping is considered in the rage>HS calculation, if I'm not mistaken?).  Another method might be to try and model rage as it actually exists in-game, if that's at all possible.  Keeping track of a rage bar that can then consider rage caps and dynamic ability usage would, in my mind, be much more accurate.  I don't know if it's feasible, but it would be fantastic (and then open up a whole new \"HS only above X rage\" type options).  This is somewhat of a tangent to the Execute spam thing, though.  =D",
      "PostedDate": "2009-11-02T13:10:26.393-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Like I said, I know what the problem is, I just don't have a way to fix it yet.",
      "PostedDate": "2009-11-02T15:55:11.07-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-04-18T08:09:28.22-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-07-02T15:43:11.103-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Just brainstorming here: Create a new rotation, with Execute given as available every CD.  Combine the data from this rotation and the typical one with a weight based on the user-configurable \"x time spent in sub-20% range\" entry of the BossHandler.  Is the problem just that this solution would be extremely taxing on the performance?",
      "PostedDate": "2010-07-02T18:58:36.73-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Yes and No.\r\nWhile it does tax performance, the problem isn't just what you just explained as a fix. In fact, that's what we had done, but it didn't work as we expected it to. So we put it off to focus on more important things, like stability and ensuring other stuff was taken care of. We just never got around to putting it back.",
      "PostedDate": "2010-07-02T19:20:36.567-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-07-06T20:40:19.223-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-07-09T12:30:42.78-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-07-09T12:32:45.04-07:00",
      "Id": -2147483648
    },
    {
      "Message": "So I've got Execute Spam working again for Arms, however right now it's without Heroic Strikes/Cleaves during that phase. I'll get that worked in next.\r\nThere's also a new Custom Chart that shows your DPS difference between Having it and Not Having it active, which will highlight your current selection. I was using this chart to debug my work while I was writing the process and decided to leave it in there.",
      "PostedDate": "2010-07-31T14:25:16.75-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-09-16T12:35:39.583-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:32:04.673-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:23:34.49-07:00",
      "Id": -2147483648
    }
  ]
}