{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Base.BossHandler",
      "DisplayName": "Rawr.Base.BossHandler"
    },
    "ClosedComment": "",
    "ClosedDate": "2011-04-03T22:25:12.16-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "It is becoming more and more common for people to spend their wow time running 5 mans. In the next patch, Blizzard is adding even more 5 mans, and I wouldn't doubt that soon you'll be able to run every old dung and raid as a 5 man much like ZG and SFK. Many of simply don't get enough time to raid or have an inconsistant schedule that prevents getting to scheduled raids, so instead we run 5 mans etc. I believe Blizzard stated a while back that only roughly 30% of wow's population raids on a regular basis, so I think they are adding more and more 5 mans to appeal to that other 70% of us that have jobs and children, etc.\n \nWith that in mind, it would be nice if you could add a 'current content' tab that allows you to choose 5 man heroics, that way those of us who don't raid regularly can optimize our builds for instances. I tried changing the boss level to 87, but it still tries to optimize for 17% hit on my casters. What I want to find is the optimal build that has only 6% hit to maximize my dps vs 5 man heroic bosses.\n \nThe nice thing about playing the way I am forced to now, is I have abundant JP and drop chances to build multiple sets including 17% hit sets for if I ever get a chance to pug BH or something along those lines; however, it would be hugely beneficial to know my optimal build for 6% as well. With next patch, you will be able to reach the weekly cap on VP even running only heroics (or so I have been told), so this becomes even more beneficial once that is live.\n \nI realize the average dungeon runner probably doesn't download this app as frequently as the hard core raiders, so I imagine my request would be a low priority if it is even considered; but in the meantime, is there a way I can edit the Rawr files to set the desired spell hit to 6% rather than 17%? I searched the discussions and issue queue and could find no posts about how I might accomplish this?\n \nThanks in advance! :)",
    "LastUpdatedDate": "2013-05-16T05:18:19.157-07:00",
    "PlannedForRelease": "Rawr 4.1.01",
    "ReleaseVisibleToPublic": true,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2011-04-03T14:49:36.79-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[BossHandler] Optimizing for 5 mans",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 20393
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "You'll need to specify which models this applies to.",
      "PostedDate": "2011-04-03T14:56:18.813-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Well the specific optimization I am currently running is for my mage, but I'd like to apply it to all my Rawr optimizations.",
      "PostedDate": "2011-04-03T15:05:42.27-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Most (all?) models allow you to specify the boss level.   Change it down to level 82 and set a significantly shorter fight time and you are pretty good to go.\r\n\r\n",
      "PostedDate": "2011-04-03T16:26:20.657-07:00",
      "Id": -2147483648
    },
    {
      "Message": "If changing the target level is not lowering your hit requirements and such, that's a problem. Mage I believe is still using it's own selector for target level, please see it's Options pane instead of the Boss Handler. Everyone else should be using the Boss Handler for target level.\r\n\r\nIn either case, we have no need to create a whole other tab to set up Dungeon runs. The Boss Handler settings can be set up to mimick 5 man content. We will not be populating it with Dungeons data setups ourselves, only Raid data setups.",
      "PostedDate": "2011-04-03T17:10:22.537-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-04-03T17:13:07.757-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Thanks for all the replies. I had changed it in the boss handler; however, Jothay was correct and the boss level was also listed in the options panel, which aparently overwrites the Boss Handler setting. Once I changed this everything worked as expected. \r\n\r\nThanks!",
      "PostedDate": "2011-04-03T18:48:33.42-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-04-03T22:25:12.16-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:25:27.737-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:18:19.157-07:00",
      "Id": -2147483648
    }
  ]
}