{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Base.Items",
      "DisplayName": "Rawr.Base.Items"
    },
    "ClosedComment": "Functionality was recently added where if an item doesn&#39;t come off armory, it will check wowhead as well, will still error if it can&#39;t get it from either.Also, use Rawr when you are 80, not before then.",
    "ClosedDate": "2009-11-07T19:06:53.917-08:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "I use Rawr for both end game optimizing and evaluating upgrades during levelling.  I just wanted to load my 75 hunter and check out something, the file that worked in 2.2.13 now doesn't load.  After trying to load it from the armory I'm told that an item couldn't be found on the Armory.  I added it manually, un-ticking Armory firstand  it's found on WoWHead just fine.  Given that the toon has no endgame gear a lot of his stuff is not in the cache, and doing this manually for all items is tedious and lengthy.  Is it possible to add an option somewhere so that Rawr goes to WoWHead if Armory lookup fails, or even better, let the user specifiy the source for item lookups.",
    "LastUpdatedDate": "2013-05-16T05:24:36.56-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2009-09-01T10:35:47.53-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Feature Request.Items] Add an option to specify where items are loaded from",
    "Type": {
      "Name": "Feature",
      "Id": 1
    },
    "VoteCount": 1,
    "Id": 14020
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "No.  Rawr is a tool for endgame characters, not 79 or below.  You're using the tool incorrectly, and that's the issue.\r\n\r\nWhen looking up an item, you ALREADY have the option of specifying Wowhead or Armory, both on single item updates, and an entire cache update.\r\n\r\nYou cannot use Rawr for \"leveling upgrades\" with any degree of accuracy whatsoever - it IS NOT DESIGNED for this, and will be using ENTIRELY INCORRECT FORMULAE, both on assumptions about your character (and therefore stat conversions) and the target level (and therefore calculations based on the attack table).",
      "PostedDate": "2009-09-01T12:41:51.36-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Oh really.  Out of curiosity, where does it say it's only for end game?  The home page certainly doesn't say so.\r\n\r\nAnd you don't understand the issue I have.  I load a toon from the armory and after 5 minutes it tells me that item id xxxxx couldn't be resolved and therefore the Armory load fails.  I'm asking for an alternative, so that I can decide where item id's are loaded from if the Armory is borking out when Wowhead is not.",
      "PostedDate": "2009-09-01T14:37:58.933-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Yes, really.  I'm not trying to deceive you, here.  I suppose Astrylian could add a note on the main page saying THIS IS ONLY FOR LEVEL-CAPPED CHARACTERS, but I think the whole \"Theorycrafting\" part sort of covers that.  There's really no such thing as theorycrafting while leveling.\r\n\r\nThe item ID is an issue in the local Rawr cache.  This cache draws its data from BOTH the Armory and Wowhead.\r\n\r\nWhich item ID is it failing on?",
      "PostedDate": "2009-09-01T14:49:07.21-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Sometimes the Armory just acts screwy for me.  Maybe I'm alone with this, but when it happens Armory item lookups always fail (with a huge timeout) and Wowhead lookups go through just fine.  It would be immensely helpful if I could switch general item id resolution from the Armory to Wowhead when that happens.  But when I load a toon from the armory it seems item id resolution goes there as well (and fails in my case).",
      "PostedDate": "2009-09-01T14:59:01.91-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Rawr is designed for use by level capped characters. Its calculations are increasingly inaccurate, the lower level you use it for. So much so that you'd level faster by *not* using Rawr, and just spend that time actually questing. You certainly *can* use it at lower levels, just make sure you understand that it's going to be about as accurate as a hunch from some random dude in trade chat.\r\n\r\nCurrently, you can always pick whether you want to load an item from Wowhead or Armory, except when loading Armory characters. That's because since you're loading your character from the Armory, there usually isn't much reason not to load items from there too. That said, there are still occasional reasons to want this, and we hope to add the ability to choose that sometime in the future.",
      "PostedDate": "2009-09-01T19:44:50.777-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-09-17T12:24:20.383-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-11-07T19:06:53.917-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-09-08T16:13:40.12-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-09-08T16:14:52.43-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-03-17T19:30:00.123-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:33:19.863-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:24:36.56-07:00",
      "Id": -2147483648
    }
  ]
}