{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Base.Items",
      "DisplayName": "Rawr.Base.Items"
    },
    "ClosedComment": "",
    "ClosedDate": "2010-03-22T09:20:07.04-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "Exalted ICC rings not in item cache - not a big deal, I'm sure you'll update the item cache with new bosses and as soon as it goes open beta.\n \nWithout being able to load an old character file or load from Armory/Profiler I went ahead and manually equipped all the gear, talents etc. Optimizer didn't recognize any of the manually equipped stuff. Meh. Back to Mr. Robot.",
    "LastUpdatedDate": "2013-05-16T05:22:02.957-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2010-01-29T11:59:27.45-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Items] item missing, Optimizer not recognizing manually equipped gear",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 16164
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Manually equipped doesn't mean it is available to the optimizer, you still have to go mark it with green diamonds.",
      "PostedDate": "2010-01-29T12:43:32.933-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Tried to edit in the Exalted ICC rep ring, http://www.wowhead.com/?item=50402\r\nResult was hang fire, spinning beach ball of death. No choice but to Force Quit.\r\n\r\nMousing over items reveal all normal information except what gems are socketed. Which leads to interesting workarounds when trying to figure out what would be best and almost-best gemmings ...you have to select a bunch of gear that you don't have, then Optimize in order to find the names of the gems you should be using. Even more fun was being recommended dual ArPen trinkets + full Agi gemming and then trying to figure out how much of an upgrade that was over leaving quite a lot of gems as ArPen... ugh.\r\n\r\nHere's to hoping Blizz gets off their butt about the armory stuff.\r\n\r\n:)",
      "PostedDate": "2010-01-30T09:33:34.72-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Also guessing that the DBW that's in the current R3 item cache is not the current in-game procs etc, but that shouldn't require any action and take care of itself if/when this finally moves ahead into \"Load from Armory\" capability.",
      "PostedDate": "2010-01-30T09:43:25.587-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Filter drop-down menu on top right side is completely blank.",
      "PostedDate": "2010-01-30T21:21:10.27-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Was unable to load a recent Rawr2 character file. Would this have been due to it including items that are not included in the R3 item cache like the Exalted rings from ICC?",
      "PostedDate": "2010-02-03T12:25:43.3-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Can you post the character in question that you weren't able to load?",
      "PostedDate": "2010-02-03T16:46:18.243-08:00",
      "Id": -2147483648
    },
    {
      "Message": "d'uh. I just deleted all the crap I had in my trash on my computer.\r\n\r\nI can try to run R2 in Mono again (ugh...) and save a file and then re-open it in R3. got tons of stuff but I'll get around to it.\r\n\r\nAlso, unable to use mouse-scrollwheel on the item lists in R3. Workaround is to use left hand on up/down arrow keys or PageUp/Down buttons. Kinda funny but it works.",
      "PostedDate": "2010-02-05T07:51:46.327-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Ran R2 in mono, after a crash I managed to save a file. Opened the file in R3, ring doesn't show up (expected) and all gear lists bugged out - won't show in right side pane. I'm guessing it's not designed to receive  new item information from saved character files.",
      "PostedDate": "2010-02-05T09:33:25.02-08:00",
      "Id": -2147483648
    },
    {
      "Message": "No easy way to rank items in terms of Mitigation+Survival ONLY - without taking Threat into account.\r\n\r\nNo easy way to compare unenchanted/ungemmed items to stuff you've already enchanted/gemmed for another role (i.e. dps gear that might be good for the occasional tank job). I'm sure there's a way to \"lock\" an item or mess with gemming templates, but if it's in R3 closed beta it's not easy to find or simple to do.\r\n\r\nUgh. Can't wait for this to go open beta.",
      "PostedDate": "2010-02-07T08:41:52.353-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-03-22T09:20:07.04-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-09-08T16:19:37.49-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-03-17T21:30:24.073-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:30:09.1-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:22:02.957-07:00",
      "Id": -2147483648
    }
  ]
}