{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.ProtWarrior",
      "DisplayName": "Rawr.ProtWarrior"
    },
    "ClosedComment": "",
    "ClosedDate": "2011-02-09T03:14:30.91-08:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "Was playing around with my Offspec gearing and noticed that Rawr was suggesting reforging mastery to parry/dodge on some of my gear. IAW elitistjerks, mastery should be my best secondary stat (at least until I manage to hit the magical 102.4% of CTC). Looking at the RSV's, it seems to suggest Parry>Dodge>Mastery for my current gearing level vice the recommended Mastery>Parry>Dodge from forums.",
    "LastUpdatedDate": "2013-05-16T05:18:45.203-07:00",
    "PlannedForRelease": "Rawr 4.0.19 Beta",
    "ReleaseVisibleToPublic": true,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2011-02-07T17:59:05.25-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[ProtWarr] Mastery Undervalued",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 19942
  },
  "FileAttachments": [
    {
      "FileId": 4584,
      "FileName": "Turambar Tank.xml",
      "DownloadUrl": ".\\4584"
    }
  ],
  "Comments": [
    {
      "Message": "The values re: Mastery vs. Parry vs. Dodge are correct from a Mitigation perspective.\r\n\r\nStacking Mastery is something one can aim for to try to become unhittable, but it is not always something that will actually lower the damage you take.\r\n\r\nOne of the key points for this is that Mastery is non-linear. It scales in value with both itself and with other avoidance stats. When you have higher amounts, Mastery will likely outpace Parry and Dodge.\r\n\r\nI will check out your profile, but it's highly possible you are simply at a point where stacking Mastery is not the most optimal thing. The non-linear nature of Mastery makes this a much more complex answer than 'just always stack Mastery.'",
      "PostedDate": "2011-02-08T10:52:45.707-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Also, adding in Shield Block modeling has slightly dropped the value of Mastery, as you softcap when Shield Block is active quite easily.\r\n\r\nAdditionally, it is worth considering that if you have Hold the Line, Parry is actually increasing your Critical Block and therefore will scale based on the amount of Mastery you have. If you have a lot of Mastery and not a lot of Parry (e.g. before heavy Diminishing Returns) then Parry is going to be very efficient due to its increase of both avoidance and Critical Block (playing off your existing Mastery due to the two-roll nature of Critical Block.)\r\n\r\nThe more Mastery you have with Hold the Line, the more powerful Parry becomes.",
      "PostedDate": "2011-02-08T10:54:26.253-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Hmm.\r\n\r\nCan't say I was able to reproduce this.\r\n\r\nLoaded your character and optimized for mitigation, it swapped out the gems for Mastery/Parry and Mastery/Stamina and reforged most things to Mastery.",
      "PostedDate": "2011-02-08T15:11:21.767-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Note: When I loaded, Mastery was showing up lower on the RSV chart.. but don't put too much faith in the RSV chart being perfect all the time. The Optimizer is much better, because the values change quite dramatically when you start adding or removing avoidance/Mastery as I mentioned below. The value of Mastery is not static at all.",
      "PostedDate": "2011-02-08T15:12:52.523-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Sounds reasonable. So for the time being to ease the strain on my healer, I just need to optimize Mitigation vice Overall then I should be seeing more CTC as I understand it.",
      "PostedDate": "2011-02-08T17:11:01.047-08:00",
      "Id": -2147483648
    },
    {
      "Message": "As always with tanking, try to get your health to a level you feel comfortable with (probably around 150k in Heroics) then stack Mitigation beyond that. Higher ilevel items should provide enough health after that point forward realistically, although Stamina is never a terrible thing for a tank to have.\r\n\r\nOptimizing for Mitigation while setting a minimum Health requirement is probably a decent idea, and should help you select your gear easily. (Although, remember to turn on common buffs before doing this, as they will change things significantly.)\r\n\r\nFor instance, Optimizing for Mitigation and setting Health >= 150000 (while buffed) should be sufficient for Heroics. (And seems to recommend a balance of Mastery and Parry for you.)",
      "PostedDate": "2011-02-09T03:13:09.25-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-02-09T03:14:30.91-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:26:02.09-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:18:45.203-07:00",
      "Id": -2147483648
    }
  ]
}