{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "Old issue.",
    "ClosedDate": "2009-08-09T17:30:59.09-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "Now, I dunno if I did this properly, but.... (copypasta from Wowhead)\n \nWith a 45 sec cd, it is likely to have a proc once per minute. The dps from the proc is then:\n \n((1504+2256)/2)(1+0.5(spellcrit%/100))/60\n \nCalculated with 25% spellcrit, (since crit rating is now for melee and spells, melee classes will not have gimped spellcrit) gives:\n \n((1504+2256)/2)(1+0.5(25/100))/60 = 35.25 dps\n \n14 AP = 1 DPS for hunters, therefore 35.25 DPS = 493.5 AP, would this be a viable addition to the trinket's already impressive 190 AP for a cludgy equivilent to the damage proc? (as it doesn't exist in Rawr's database) Methinks that it wouldn't quite work properly because of the AP modifying our special shots... So how can we put in the damage proc (Your melee and ranged attacks have a chance to strike your enemy, dealing 1504 to 2256 arcane damage) without blortching up everything else?\n \nAs for the Meteoric Whetstone- calculated out the haste bonus of the proc which wasn't being added (Is it me or am I seeing that a lot of procs aren't being calculated?) 444 haste * 10 = 4440/60 (multiplied by duration, divided by proc rate, about 1PPM) = 74 haste rating average. This sound like a fair calculation? If so, then that makes a blue trinket better than most of the endgame trinkets... o.O",
    "LastUpdatedDate": "2013-05-16T05:26:02.567-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2009-03-17T05:19:25.517-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "Bandit's Insignia/Meteoric Whetstone",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 12822
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Well, dividing the AP gain from the equivilent DPS gain of the damage proc brings it about in line where it's supposed to be otherwise, about even with the fury of five flights... However, Meteoric still is ranking second of the trinkets in the potential upgrade list, and it's not that great of a trinket... Something seems fishy there.",
      "PostedDate": "2009-03-17T05:59:51.06-07:00",
      "Id": -2147483648
    },
    {
      "Message": "We just have to model each proc individually. Since there's no Hunter dev, that isn't happening for hunters.\r\n\r\nI'd suggest just editing the items to add stats equivalent to its value, in the mean time. Your estimation on the value of Bandit's Insignia is off though; multiply again by 1.13 for Curse of Elements or similar, and you can't translate DPS to AP like 14:1. You could goto your Relative Stat Values chart, and find the value of AP, and use that as the divisor though.",
      "PostedDate": "2009-03-17T08:51:37.527-07:00",
      "Id": -2147483648
    },
    {
      "Message": "That's the thin I asked about at the end there... I've looked and looked, and I must be blind because I don't see a relative stat value chart anywhere. Readme mentions it, but not where it is. >.>;",
      "PostedDate": "2009-03-17T14:09:30.42-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Oh, and sorry, but the 14:1 DPS:AP ratio is the hunter ratio of how much AP gives you 1 point of DPS. 14 AP = 1 DPS for us. I should have mentioned that above. I did forget to include things like curse of elements and such, however; I wanted to model it without factoring in raid buffs to see it's use solo, as well as with raid buffs.",
      "PostedDate": "2009-03-17T14:11:34.823-07:00",
      "Id": -2147483648
    },
    {
      "Message": "No, 14AP does not = 1 DPS for you. 14 AP only equal 1 autoshot DPS, ignoring haste, ignoring crit, ignoring miss, ignoring armor, etc.\r\n\r\n\"Relative Stat Values\" is one of the charts in the charts dropdown, which can tell you the total DPS provided by 1 AP.",
      "PostedDate": "2009-03-17T14:22:16.47-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Thank you for the location- it's all the way down at the bottom, didn't see it there before.  Then 14 AP = 3.78 DPS according to your chart.  35.25 / 3.78 = 9.33 x 14 = 130. 55 AP. dividing the AP gain i saw at first (493.5) by 4 gave 123.375 AP, nearly identical numbers, and ones that fit the proc in the trinket range where it should be. \r\n\r\nHowever, the chart measures that haste is (when I'm already at the 1.5 cast for steady) at 0.38, 0.11 higher than 1 AP (0.27). Once you've reached the 1.5 second cast time on steady shot, haste is basically useless, and while it certainly does continue to increase the rate of fire of auto shot, it definitely no longer beats out 1 AP.\r\n\r\nI'd also like to note that intellect is measured as a simple AP conversion, without thought to it's effect on our longevity. Any chance that'll be looked into, or is that supposed to be as such?",
      "PostedDate": "2009-03-27T13:26:07.55-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Those are wonderful examples of how the Hunter model has problems, and is in dire need of a dedicated developer. :(",
      "PostedDate": "2009-03-27T15:13:49.133-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-08-09T17:30:59.09-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:35:12.013-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:26:02.567-07:00",
      "Id": -2147483648
    }
  ]
}