{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "",
    "ClosedDate": "2012-03-05T15:40:29.417-08:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "Brutalmage/ Stormrage: I have the latest download of RAWR. I have 7.02 Spell Hit Rating. When I Optimise it tells me to reforge my Time Lords Mantle (385) from Crit to Haste to Crit to Hit, now giving me 17.67 Hit? The only new things I did was download the newest Version. I also highlite my gear to purple diamonds that have high gems so the optimiser doesn't regem to all high gems, I have done this with the other version with no problems. I have also transmoged my gear if that makes a difference, but it also was done when I had the older version. Any help?",
    "LastUpdatedDate": "2013-05-16T05:17:02.993-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2012-02-29T11:34:00.627-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "Hit Optimising bug?",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 22308
  },
  "FileAttachments": [
    {
      "FileId": 5688,
      "FileName": "Brutalgnomenow.xml",
      "DownloadUrl": ".\\5688"
    }
  ],
  "Comments": [
    {
      "Message": "Can you post your character xml before the optimize?",
      "PostedDate": "2012-02-29T12:16:35.52-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2012-02-29T12:39:43.097-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Here it is.",
      "PostedDate": "2012-02-29T12:39:44.767-08:00",
      "Id": -2147483648
    },
    {
      "Message": "I don't know if its possible, but I think there's one problem with that Time Lords Mantle (384) because it keeps telling me to change my crit to hit on that and now I have another trinket and it's gearing me for 17.42%.",
      "PostedDate": "2012-03-01T19:45:43.857-08:00",
      "Id": -2147483648
    },
    {
      "Message": "I'm not seeing what you're describing. The optimizer is having problem reaching optimum, but the results I've seen always had hit close to 17.\r\n\r\nUnrelated to this I would suggest to use the Simple Stacking option for Arcane to get more consistent results, although not sure if it'll have much effect in this case. It just seems to be a problematic case numerically for some reason.",
      "PostedDate": "2012-03-02T13:41:21.177-08:00",
      "Id": -2147483648
    },
    {
      "Message": "The problem is even though RAWR is saying it's 17% when I do my gear it comes out now to 17.42% in game. I am sending you a new attachment with the new trinket. Before I got this new trinket as per first attachment RAWR was showing 17% and when I did what it said, my hit was 17.67% in game. It keeps telling me to take off the crit to haste on my Time Lords Mantle and change it to crit to hit. Right now I am 17.02% hit when I do what RAWR says and change that reforge I am now getting 17.42% hit while RAWR is saying I should be 17%.",
      "PostedDate": "2012-03-02T19:16:56.467-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Well it is wierd. I didn't have this problem with the version previous to the latest. The easiest way to describe it is, I have 17.02% hit right now, RAWR is saying if I refrorge its Optimise result  I will get 17% hit, when I do the Optimise result to my gear in game it comes out to 17.42% hit in game.\r\nIt keeps telling me to change my Mantle that is reforged right now crit to haste, RAWR is telling me to reforge to crit to hit adding the extra hit making it go from 17.02% to 17.42% and RAWR Optimise is saying it my hit then should be 17%.\r\nP.S.\r\nOk, well now for some reason when I open RAWR, I am getting these error messages when trying to upload from Battlenet:\r\nError Message: The remote server returned an error: (503) Server Unavailable.\r\nNo Suggested Fix\r\nStack Trace:\r\n   at System.Net.HttpWebRequest.EndGetResponse(IAsyncResult asyncResult)\r\n   at System.Net.WebClient.GetWebResponse(WebRequest request, IAsyncResult result)\r\n   at System.Net.WebClient.DownloadBitsResponseCallback(IAsyncResult result)\r\n\r\n?",
      "PostedDate": "2012-03-03T01:45:04.423-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Make sure you have the right enchant on boots.",
      "PostedDate": "2012-03-03T19:19:12.897-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Ok, thank you for your time. I got another piece and now everything is Optimising correctly. Maybe it was just a math error or something, but it did gear me wrong before and as I said it kept tlling me to add hit when I already had 17.02% with the mantle reforge. All my enchants are correct.\r\nBTW great tool and thanks again.",
      "PostedDate": "2012-03-04T01:54:15.753-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2012-03-05T15:40:29.417-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:23:45.97-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:17:02.993-07:00",
      "Id": -2147483648
    }
  ]
}