{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Base.Items",
      "DisplayName": "Rawr.Base.Items"
    },
    "ClosedComment": "Rawr 4.0.15 Released 01&#47;09&#47;2011",
    "ClosedDate": "2011-01-09T19:54:05.09-08:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "I hope this doesn't turn out to be one of those \"you're doing it wrong\" things.  Three things, all kind of interrelated.  Reference the attached file.\n \nI enabled both Chaotic Shadowspirit and Chaotic Skyflare diamonds and ran the optimizer, and it returned the result in this file, with Chaotic Skyflare socketed in my helm.  Since the requirements for both gems are the same, I would think it would socket the Shadowspirit Diamond since it gives the same stats, but better than the Skyflare.  The rating for my hat with the Skyflare meta is 1330, but if I manually select the \"better\" Shadowspirit meta, the rating falls to 1099.\n \nAs I said, the requirements for both metas are the same (more blue gems than red gems), and the setup the optimizer kicked out has four purple gems, one orange gem, and four red gems.  If purples count as red/blue, and oranges count as red/orange, then by my count, I have four blues and nine reds, which wouldn't properly activate the meta.  This may be a misunderstanding on my part about how gems are counted; if so, please set me straight.  However, even if I am miscounting, since the requirements for both Chaotic metas are the same and the stats differ only in magnitude, there is no situation in which the Shadowspirit should ever indicate a lower value than the Skyflare.  As such, I think one of them (perhaps the Shadowspirit) is not modeled correctly.\n \nLastly, in the older versions of Rawr, if your meta was inactive due to not meeting the gem requirements, the head slot frame had a red outline, and the stats would be grayed out.  I forced my old meta inactive to test it in this version, and there is no obvious indication if your meta is not activated.  The stats changed properly, but that's not a terribly obvious \"you screwed up\" notification.  Is there any way this feature could be added back in?",
    "LastUpdatedDate": "2013-05-16T05:19:18.71-07:00",
    "PlannedForRelease": "Rawr 4.0.14 Beta",
    "ReleaseVisibleToPublic": true,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2010-12-31T02:03:44.383-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Items] Chaotic meta not modeled/not activated properly",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 19501
  },
  "FileAttachments": [
    {
      "FileId": 4319,
      "FileName": "averiy test.xml",
      "DownloadUrl": ".\\4319"
    }
  ],
  "Comments": [
    {
      "Message": "Chaotic Skyflare still used the old requirements.",
      "PostedDate": "2011-01-02T05:49:14.113-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-01-02T13:59:35.79-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-01-02T13:59:45.997-08:00",
      "Id": -2147483648
    },
    {
      "Message": "To be honest I don't see why the rating would change if neither were active to begin with. As of right now both the chaotic and ember meta gem are good choices. They will eventually return the chaotic to its origional two blue requirement, but until then they are fairly equal in heroic dungeon gear. Once you start to get more sockets it is harder to keep up a ratio of more blue to red. It's all user preference I personally use blue gems for hit so I went chaotic but I know a lot of casters use ember as well.",
      "PostedDate": "2011-01-05T16:05:54.563-08:00",
      "Id": -2147483648
    },
    {
      "Message": "I cant get Rawr to even let  me  use a Chaotic Shadowsprirt Diamond, it keep putting in  the \"Ember\" one and I don't even have that  selected. It  also  seems to  count  trinkets goofie,  claiming  that  the LK trinkets are better than Cat, but still equiping the cat trinkets.  Class Mage",
      "PostedDate": "2011-01-09T07:39:28.803-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-01-09T19:54:05.09-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:26:44.353-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:19:18.71-07:00",
      "Id": -2147483648
    }
  ]
}