{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Healadin",
      "DisplayName": "Rawr.Healadin"
    },
    "ClosedComment": "Fixed in r50073",
    "ClosedDate": "2010-05-02T15:01:48.15-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "After spending much time googling the web and checking here for the issue and experimenting with all the options regarding filters I am certain there is a bug that cannot be fixed by the user.\n \nI have included the save file, please note that I know how to operate this software and that I have made sure that every item was available through filter settings. Only Darkmoon card: illusion was available.\n \nAlso, I am using v2.3.14 because of the serious gemming template bug rendering that version broken for many Healadins.",
    "LastUpdatedDate": "2013-05-16T05:20:51.223-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2010-04-30T02:21:08.013-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Healadin] Module Will Not Show Darkmoon Card: Greatness In The Comparison Window.",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 17483
  },
  "FileAttachments": [
    {
      "FileId": 3469,
      "FileName": "Healadin.xml",
      "DownloadUrl": ".\\3469"
    }
  ],
  "Comments": [
    {
      "Message": "You can, indeed not solve this.\r\nDMC:G isn't available because currently Healadin doesn't model the DamageOrHealingDone trigger, nor does it model the proc effect (HighestStat).  In it's current incarnation, healadin removes any items that have special effects that end up doing nothing.\r\nTo Roncli: I suggest you give the \"uniformity\" discussion a read and consider adopting the system I proposed, it'll probably make your life easier :p\r\nBut even with that. the DMC:G proc is good for holy as it temporarily provides you with a lot more intel and thus more regen.  the static int is nice as well of course, movelling the proc and effect would be a good idea.",
      "PostedDate": "2010-04-30T02:52:43.99-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-04-30T02:53:09.8-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Yes its a serious loss in the healadin profile as that trinket is BiS pre raid.",
      "PostedDate": "2010-04-30T03:27:24.013-07:00",
      "Id": -2147483648
    },
    {
      "Message": "If I have time this weekend, I'll do what I did for ProtPaladin some time after I took it over and go over all of the available trinkets and add any Healadin ones that are missing.\r\n\r\nAs for relevancy/uniformity, the only thing that would change is whether DMC:G is missing or if it shows up with gimp'd stats.  I'd rather take a \"deny all except these\" policy and have issues like this one to implement specific trinkets than have people assuming a piece's gimp'd stats are correct.\r\n\r\nIdeally, we'd add the loot tables as soon as we learn what they are.  Unfortunately, Healadin was inactive through two patches, and it's bound to be missing stuff.",
      "PostedDate": "2010-04-30T12:26:09.69-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Thank you very much Roncli",
      "PostedDate": "2010-04-30T15:32:37.057-07:00",
      "Id": -2147483648
    },
    {
      "Message": "If healadin had been inactive through 2 patches, does that mean that it can get some attention now?",
      "PostedDate": "2010-04-30T15:34:01.393-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Check http://rawr.codeplex.com/wikipage?title=Rawr.Healadin&referringTitle=Models for a list of recent updates.",
      "PostedDate": "2010-05-02T13:02:41.557-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Interesting that the code to implement this trinket was half-done... it accumulates it in the stats properly (so not to be considered for a user's mana pool, but it is considered in calculations such as crit or spell power), but the trigger was never added.  Weird.  In any case, all set.",
      "PostedDate": "2010-05-02T15:01:28.897-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-05-02T15:01:48.15-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:28:36.83-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:20:51.223-07:00",
      "Id": -2147483648
    }
  ]
}