{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "",
    "ClosedDate": null,
    "CommentCount": 0,
    "Custom": null,
    "Description": "I have one epic [Veiled Shadow Spinel] equipped, but I have no others in my bank.  When I run an optimization, I'm cautioned that gem is not enabled, which is fine because I don't have any more of them.  However the result of the optimization recommends replacing this epic gem with the rare quality [Veiled Demonseye].\n \nMy attempted workaround was to enable this gem in the optimizer, but that was not successful as it then assumed all my purple gems should be of the epic quality.  As I do not have but the one, this was not acceptable.\n \nRecommended fix:  The optimizer should recognized when a gem is equipped but not enabled that it should not be replaced by a lesser quality gem.  The more powerful gem should prevail and be used in the calculations.",
    "LastUpdatedDate": "2013-02-21T18:23:49.013-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2012-01-29T23:31:10.41-08:00",
    "Status": {
      "Name": "Proposed",
      "Id": 1
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "Optimizer recommends downgrading gem",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 22132
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Shift click on that item to mark it with a blue diamond. That will let the optimizer know that you already have gem in that item and won't try to replace it unless it can get better with normal gems.",
      "PostedDate": "2012-01-30T00:28:18.94-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Shift-clicking the gem does not mark the item with a blue diamond. I'm getting the normal green diamond, which seems to indicate the optimizer is going to make full use of the selection.  Is this a feature in a different version?  I'm using the online Silverlight version.",
      "PostedDate": "2012-01-30T20:21:09.697-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Two things to check:\r\n\r\nFirst, how many versions of that item are shown on the list?  If there are two or more shown, make sure the only one with any diamonds marked is the one with the epic gem, and that it has a blue diamond.  If there is only one gemming shown, you might want to set the \"Show Gemmings\" to two or higher.  I had an issue a while back where it seemed like the Optimizer was ignoring my blue diamond, but I only had one gemming shown, and the green diamonds were \"hiding\" under the purple one.\r\n\r\nSecond, are you using the Optimizer, or the Batch Tools?  If you have \"override regem\" checked on the Optimizer when you save your character, the Batch Tools will obey that checkbox from the character file, even if you don't have it checked in Batch Tools.",
      "PostedDate": "2012-01-30T21:03:10.503-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Ok.  I understand now.  You don't put the blue diamond on the gem itself in the picker, you put the blue diamond on the item (belt, etc.) that has the gemming you want to keep, and then make sure all others are cleared.\r\n\r\nStill wish for a way to mark a gem as \"Allow this gem if already in the gear, but don't suggest it for any new gemming.\"",
      "PostedDate": "2012-01-30T23:22:54.343-08:00",
      "Id": -2147483648
    },
    {
      "Message": "I might consider adding an option that treats all equipped items as having blue diamonds, but that wouldn't really work for items that you have in bags.",
      "PostedDate": "2012-01-31T00:12:59.913-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:23:49.013-08:00",
      "Id": -2147483648
    }
  ]
}