{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Base.Optimizer",
      "DisplayName": "Rawr.Base.Optimizer"
    },
    "ClosedComment": "This is obsolete as Rawr3 has a completely different Optimizer Results dialog",
    "ClosedDate": "2009-08-26T09:25:37.957-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "When the optimizer outputs its results, it does it in a popup window and only gives you the ability to equip that gear or not.  While the window is open, you can't click on any other part of Rawr.  These optimization suggestions are some of the most useful points of information in Rawr, so it would be nice if it was a little more useable:\n \n- Maybe make it output into a window where you can select the text, to cut/paste it somewhere else.  After all, the suggested changes need to actually take place in WoW, so having them in that window doesn't do the user much good.  They need them out of it.\n- Maybe add a \"Copy to Clipboard\" button, also or instead.\n- Maybe add a \"Print\" button, or \"Printer friendly view\" button.\n \nI also lose track of what changes I allowed it to make, and have to reload my character from the Armory and re-optimize.  It might be helpful to:\n- I know this is a big one, but have a \"Changes\" or \"History\" log pane, that will show a play-by-play of what has happened, and maybe allow you to roll back.  Like Photoshop does, if you've used that.  For example: 1. Loaded character NAME from Armory.  2. Changed GEM_NAME in HELM_NAME to NEW_GEM_NAME.\n- Highlight things that have been changed in red, even if it doesn't tell me what the changes were.\n- Add \"Snapshot\" and \"Revert\" buttons, so that you can mark the current setup as snapshotted, make a bunch of proposed changes, then revert back and try other changes.",
    "LastUpdatedDate": "2013-05-16T05:25:38.727-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2009-05-07T15:10:04.687-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Feature Request.Optimizer] Make optimizer results output selectable, or more user-friendly",
    "Type": {
      "Name": "Feature",
      "Id": 1
    },
    "VoteCount": 2,
    "Id": 13188
  },
  "FileAttachments": [
    {
      "FileId": 1875,
      "FileName": "OptimizerResults.png",
      "DownloadUrl": ".\\1875"
    }
  ],
  "Comments": [
    {
      "Message": "There's definitely a much better form for this planned. We just had nothing before, so I did that quick and dirty message box so it's at least something. Also, note that you can actually copy/paste from it.",
      "PostedDate": "2009-05-07T20:03:57.673-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Can you tell me how to copy/paste from it?  I can't use the mouse to select any text in the alert dialog (that lists the changes to be made), and I tried the usual other stuff like CTRL+A (select all), etc.",
      "PostedDate": "2009-05-08T10:13:01.34-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Just do CTRL+C.",
      "PostedDate": "2009-05-08T13:42:16.1-07:00",
      "Id": -2147483648
    },
    {
      "Message": "You've tried this?  I just tried and it didn't do anything.  (I'm using Rawr in Windows XP, 32-bit.)",
      "PostedDate": "2009-05-08T13:53:03.623-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-05-08T13:53:05.423-07:00",
      "Id": -2147483648
    },
    {
      "Message": "I just tried it on Win XP and it worked. All you'll see is you'll hear a sound when you press CTRL+C, then open notepad or something and press CTRL+V to paste it.",
      "PostedDate": "2009-05-08T13:56:55.533-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Ok, I'll mess with it.  Thanks!",
      "PostedDate": "2009-05-08T14:01:21.36-07:00",
      "Id": -2147483648
    },
    {
      "Message": "---------------------------\r\nRawr Optimizer Results\r\n---------------------------\r\nThe Optimizer found a gearset with a score of 4707.459. (Your currently equipped gear has a score of 4825.933) Would you like to equip the optimized gear?\r\n\r\n\r\n\r\n\r\n\r\nHead: Changed Hood of Rationality with Chaotic Skyflare Diamond, Runed Scarlet Ruby, Arcanum of Burning Mysteries\r\n\r\n               to Hood of Rationality with Ember Skyflare Diamond, Runed Scarlet Ruby, Arcanum of Burning Mysteries\r\n\r\nNeck: Changed Wyrmrest Necklace of Power with Purified Twilight Opal, No Enchant\r\n\r\n               to Wyrmrest Necklace of Power with Veiled Monarch Topaz, No Enchant\r\n\r\nShoulders: Changed Valorous Plagueheart Shoulderpads with Runed Scarlet Ruby, Greater Inscription of the Storm\r\n\r\n               to Valorous Plagueheart Shoulderpads with Reckless Monarch Topaz, Greater Inscription of the Storm\r\n\r\nChest: Changed Valorous Plagueheart Robe with Runed Scarlet Ruby, Runed Scarlet Ruby, Powerful Stats\r\n\r\n               to Gown of the Spell-Weaver with Purified Twilight Opal, Powerful Stats\r\n\r\nWaist: Changed Plush Sash of Guzbah with Runed Scarlet Ruby, Purified Twilight Opal, No Enchant\r\n\r\n               to Plush Sash of Guzbah with Veiled Monarch Topaz, Runed Scarlet Ruby, No Enchant\r\n\r\nLegs: Changed Valorous Plagueheart Leggings with Runed Scarlet Ruby, Runed Scarlet Ruby, Brilliant Spellthread\r\n\r\n               to Leggings of Lost Love with Reckless Monarch Topaz, Purified Twilight Opal, Brilliant Spellthread\r\n\r\n\r\n\r\n\r\n---------------------------\r\nYes   No   \r\n---------------------------\r\n",
      "PostedDate": "2009-05-14T07:57:53.993-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Personally, I find the inability to resize the output window makes it difficult to see what changes are recommended.  When I cut/paste it is much easier to notice as there is nolonger a text wrapping forced at inconvenient positions.  This could be improved by having options for the display as well.  ie, View as Icons, View as Text, Preview on Character (reflected in the main window and have that made interactable so one can see all the changes in the tabs).\r\n\r\n",
      "PostedDate": "2009-05-14T08:06:58.617-07:00",
      "Id": -2147483648
    },
    {
      "Message": "I failed to mention that my operating system is Vista x64.",
      "PostedDate": "2009-05-14T08:08:30.627-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Yes, being able to resize the window, and see a visual representation would both be great additions.  From Astrylian's comment, it sounds like the current window was just a working placeholder, and that they have bigger and better things in store for it.  I look forward to seeing what they do with it.",
      "PostedDate": "2009-05-14T09:27:24.74-07:00",
      "Id": -2147483648
    },
    {
      "Message": "A simple print and/or log optimization changes to text file would be terrific and goes to the core use of Rawr.",
      "PostedDate": "2009-08-09T15:04:03.33-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-08-09T15:05:23.153-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-08-26T09:25:37.957-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-09-09T16:03:17.383-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-03-17T19:40:14.677-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:34:36.06-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:25:38.727-07:00",
      "Id": -2147483648
    }
  ]
}