{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Base",
      "DisplayName": "Rawr.Base"
    },
    "ClosedComment": "Rawr 4.1.0 Released",
    "ClosedDate": "2011-03-10T18:49:30.763-08:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "Every version now, my offline version does not update when there is a new version available.\nI start it via the desktop shortcut, and wait, ... 10 min, 20 min, nothing pops up about an available update.\nI start it via the desktop shortcut, and load a character,... and wait.... 10, 20 min.... nothing.\n \nfor a number of versions now (atleast since .13) I have tried this every time ... none of them ever identified that an update was available.\neventually, I just uninstall the Silverlight app, and re-install from the php page... (and get the \"your doing it wrong message\".... grrr)\n \nis there a proxy I need? I have tried this on 3 different pc's, .. XP, Vista, Window 7, all fully updated, and with IE8 and IE9 beta.",
    "LastUpdatedDate": "2013-05-16T05:18:46.88-07:00",
    "PlannedForRelease": "Rawr 4.0.18 Beta",
    "ReleaseVisibleToPublic": true,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2011-02-04T10:49:36.73-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Base] Silverlight Offline Version not Updating",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 2,
    "Id": 19909
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "no, you don't need a proxy.....\r\n\r\nSomething is preventing it from being able to reach the internet, which most likely means your internet settings are fubar'd somewhere on your system.",
      "PostedDate": "2011-02-04T11:46:24.857-08:00",
      "Id": -2147483648
    },
    {
      "Message": "and if it's happening on multiple systems, there's problably a firewall or some other setting that is common to all three",
      "PostedDate": "2011-02-04T11:47:32.183-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-02-04T11:47:48.057-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-02-04T16:47:30.41-08:00",
      "Id": -2147483648
    },
    {
      "Message": "I have the same problem as Fyre. I don't think this should be dismissed as a potential user-error issue.\r\n\r\nNotes: I have Kaspersky Antivirus 2010 (all defaults) as well as Windows (XP) Firewall (all defaults) running. No \"allow this program to access the internet\" prompt came up for either program however. All talent icons are loading fine from the web anyway.",
      "PostedDate": "2011-02-04T17:18:35.61-08:00",
      "Id": -2147483648
    },
    {
      "Message": "jothay, understood, and if these PC's were all at the same location, I would be glad to check corp firewalls, etc. \r\nHowever, 2 PC's are at work, and 2 of the pc's I tested were at home.  I have nothing special at home other than an out of the box Cable modem / netgear wireless, that are all at factory setteings, other than admin password.\r\n\r\nFriends of mine also have had this problem, using other internet providers as well. (AT&T vs Comcast)",
      "PostedDate": "2011-02-07T10:55:20.327-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Ugh, so I'm seeing that this is actually a Silverlight issue. Apps that require elevated permissions and are *not* also digitally signed, will always fail the built in version checking. So we've either got to find a way to drop the need for Elevated Permissions, or sign the app. Signing the app costs money, and I don't think we can do without the EP. I'm exploring both avenues now.",
      "PostedDate": "2011-02-24T18:33:22.443-08:00",
      "Id": -2147483648
    },
    {
      "Message": "I've turned off the Elevated Permissions requirement for now, lets see if .21 has any problems like that. It shouldn't",
      "PostedDate": "2011-02-24T18:47:18.053-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-02-24T18:47:25.973-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-03-10T18:49:30.763-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:26:04.057-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:18:46.88-07:00",
      "Id": -2147483648
    }
  ]
}