{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "",
    "ClosedDate": "2010-03-09T11:04:24.903-08:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "Is there any way to globally reset any changes made to the Filters to get back to the standard set when RAWR is first used...?\n \nI have 2 L80 characters at differing levels of progress through the game, so was wondering if there was a way to 'wipe the slate clean' before starting on a new character...?\n \nThank you, in advance, for any help offered.",
    "LastUpdatedDate": "2013-05-16T05:21:38.44-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2010-03-01T10:27:10.013-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "General usage query",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 16594
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "First, I must state that it only takes a minute to fully reset them manually, uncheck all filters, then check all the filters except the ones marked 'Disabled...' and you are back to default, far less trouble than the alternative.\r\n\r\nSecond, like many users, you are writing Rawr as RAWR, this is incorrect as we have not titled the program in CAPS.\r\n\r\nShould you REALLY need to do it by getting the default files, you can redownload Rawr, open the Zip file and extract the ItemFilters.xml to your Data subdirectory (with the program not running) then overwrite the existing ItemFilters.xml . Again, I stress that this action would be wholly unnecessary per the first paragraph.",
      "PostedDate": "2010-03-01T10:35:58.943-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Err, Jothay, I think he means he has actually edited the filters, not just enabled/disabled them. In which case, just replacing the ItemFilters.xml with the original is what he wants. ",
      "PostedDate": "2010-03-01T10:42:25.667-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-03-09T11:04:24.903-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:29:38.36-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:21:38.44-07:00",
      "Id": -2147483648
    }
  ]
}