{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Base.Items",
      "DisplayName": "Rawr.Base.Items"
    },
    "ClosedComment": "",
    "ClosedDate": "2011-03-10T09:33:09.647-08:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "The below items selected by the the indicated filters need to be updated. This list only considers location and ilvl of items (it does not consider if the items have the correct stats):\n \n \n59340 \"Breastplate of Avenging Flame\" is listed as dropping from Chimaeron but should show as dropping from Magmaw\n59329 \"Parasitic Bands\" is listed as dropping from Chimaeron but should show as dropping from Magmaw\n59313 \"Brackish Gloves\" is listed as dropping from Toxitron but should show as dropping from Chimaeron\n \nAll the various tier 11.0 helms should show as Nefarian instead of their current varied locations.\n \n59466 \"Ironstar's Impenetrable Cover\" shows as a world drop but should be a Blackwing Descent trash drop\n59467 \"Hide of Chromaggus\" shows as a world drop but should be a Blackwing Descent trash drop\n59465 \"Corehammer's Riveted Girdle\" shows as a world drop but should be a Blackwing Descent trash drop\n59464 \"Treads of Savage Beatings\" shows as a world drop but should be a Blackwing Descent trash drop\n59462 \"Maimgor's Bite\" shows as a world drop but should be a Blackwing Descent trash drop\n \n65045 \"Schorched Wormling Vest\" shows as \"Not found on wowhead\" but should drop from Heroic Magmaw\n65050 \"Parasitic Bands\" shows as \"Not found on wowhead\" but should drop from Heroic Magmaw\n65046 \"Lifecycle Waistguard\" shows as \"Not found on wowhead\" but should drop from Heroic Magmaw\n65049 \"Leggings of Lethal Force\" shows as \"Not found on wowhead\" but should drop from Heroic Magmaw\n65042 \"Breastplate of Avenging Flame\" shows as \"Not found on wowhead\" but should drop from Heroic Magmaw\n65051 \"Motlen Tantrum Boots\" shows as \"Not found on wowhead\" but should drop from Heroic Magmaw\n65047 \"Lava Spine\" shows as \"Not found on wowhead\" but should drop from Heroic Magmaw\n65007 \"Akirus the Worm-Breaker\" shows as \"Not found on wowhead\" but should drop from Heroic Magmaw\nAll the various tier 11.5 gloves should show as Heroic Magmaw instead of their current varied locations.\n \nHeroic Omnitron Defense System looks good\n \nAll the various tier 11.5 legs should show as Heroic Maloriak instead of their current varied locations.\n \n65056 \"Bracers of the Burningeye\" show as dropping from regular Atramedes but drop from heroic Atramedes\n65060 \"Sark of the Unwatched\" shows as \"Not found on wowhead\" but drops from Heroic Atramedes\n65058 \"themios the Darkbringer\" shows as \"Not found on wowhead\" but drops from Heroic Atramedes\n \nHeroic Chimaeron looks good\n \n65057 \"Belt of the Nightmare\" shows as \"Not found on wowhead\" but drops from Heroic Nefarian\n65003 \"Reclaimed Ashkandi, Greatsword of the Brotherhood\" shows as \"Not found on wowhead\" but drops from Heroic Nefaian\nAll the various tier 11.5 helms should show as Heroic Nefarian instead of their current varied locations.\n \nThe following 372 version of trash drops are in the itemcache with varied locations but to not exist in game:\n65009, 65010, 65011, 65012, 65014,",
    "LastUpdatedDate": "2017-11-27T11:01:18.237-08:00",
    "PlannedForRelease": "Rawr 4.0.20 Beta",
    "ReleaseVisibleToPublic": true,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2011-03-02T11:41:11.2-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Items] Blackwing Descent",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 20126
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Are these same issues occurring after Reset Item Cache?",
      "PostedDate": "2011-03-02T12:44:57.503-08:00",
      "Id": -2147483648
    },
    {
      "Message": "These are with a fresh SVN co and build of the WPF version of Rawr  I.E. with the latest version of ItemCache.xml as of snv rev 58411.",
      "PostedDate": "2011-03-02T13:07:55.293-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-03-02T19:32:47.02-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Resolved with changeset 58632.",
      "PostedDate": "2011-03-10T09:33:09.647-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:25:44.93-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:18:31.903-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2017-11-27T11:01:18.237-08:00",
      "Id": -2147483648
    }
  ]
}