{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Base.LoadCharacter",
      "DisplayName": "Rawr.Base.LoadCharacter"
    },
    "ClosedComment": "Declined",
    "ClosedDate": "2011-03-04T19:20:04.65-08:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "I think it would be useful for Rawr to track a character's reputations and then present an option to have the optimizer automatically consider rep rewards the character is eligible for. So, for example, if my rep with Therazane goes to exalted, I just tell Rawr that my rep went up, and the next time I run the optimizer, it suggests that I go buy the purple shoulder enchant.\n \nI can see at least one problem with this (having too many items available for the optimizer to run in a reasonable time), but there may be some way around it (say, automatically disabling the items again if they're X percentage worse than the equipped item).",
    "LastUpdatedDate": "2013-05-16T05:19:22.837-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2010-12-28T11:48:34.693-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Feature Request.LoadCharacter] Automatically make rep rewards available for optimizer",
    "Type": {
      "Name": "Feature",
      "Id": 1
    },
    "VoteCount": 2,
    "Id": 19465
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "\"I just tell Rawr that my rep went up, and the next time I run the optimizer, it suggests that I go buy the purple shoulder enchant.\"\r\nonce the armory provides the xml feed again, you can just import it from there, like you do with other character data.",
      "PostedDate": "2010-12-29T06:38:10.873-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Bamina: I agree - it would be really slick to just do an armory refresh on the character and have Rawr automatically factor in all the rep rewards I could be using.",
      "PostedDate": "2010-12-29T10:09:40.95-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-01-03T09:49:04.083-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Ok, what happens when you are wearing 372's and those blue level rep rewards keep getting marked available when they are way underpowered for what you are wearing? The additional items clutter up your Optimizer processing and make it take a lot longer.\r\n\r\nIt would be better to just filter down to the Rep Rewards and look at the Direct Upgrades List and Build Upgrades List values for those. This has the same concept of All enchants are available, but you only mark the ones you would use because they would make Optimization take loads longer.",
      "PostedDate": "2011-01-03T13:46:23.977-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-01-15T18:28:04.867-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-03-04T19:20:04.65-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:26:49.787-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:19:22.837-07:00",
      "Id": -2147483648
    }
  ]
}