{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Tree",
      "DisplayName": "Rawr.Tree"
    },
    "ClosedComment": "As it states on the model status page, models in Partially status should not be trusted solely without other resources to back it up. If you look at spreadsheets and other theorycrafting as seen on EJ or elsewhere and they say different, they are probably right. Partially means it was only barely touched on for Cataclysm yet so a &#42;lot&#42; may be wrong in the model. That&#39;s why we&#39;ve been putting these warning signs in the documentation and the UI.",
    "ClosedDate": "2011-04-09T09:37:44.743-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "I did notice that the Tree Rawr model may not be Cataclysm-ready, but I just want to make sure that it isn't that much off the basic stat recommendations! I've been trying to tweak & reforge & upgrade my new Resto Druid, mainly with heroic and pre-heroic at this point, and Rawr basically recommends me to reforge everything into Haste and Crit, including reforging from Spirit to Haste! Is this normal or correct for a Resto Druid? \n \nThe same thing goes for item recommendations. Rawr is recommending me to use items with Haste and Crit over items with Spirit! \n \nI'm posting this here since it said on the other page that if I even [think] that my question is an issue with Rawr, then I should post here. I hope someone experienced can help. Many thanks in advance.",
    "LastUpdatedDate": "2017-11-27T11:05:42.32-08:00",
    "PlannedForRelease": "Rawr 4.1.03",
    "ReleaseVisibleToPublic": true,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2011-04-08T12:43:36.263-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Tree] Haste & Crit over Spirit",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 20468
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "OMG... someone that's actually paying attention! YAY!",
      "PostedDate": "2011-04-08T12:49:29.073-07:00",
      "Id": -2147483648
    },
    {
      "Message": "I am not the Dev but i have played withthe three model a bit, so this answer might not be perfect, but i think it is atleast 'on the right track';\r\nat some point in gear, you will have 'enough' spirit to not go OOM in a fight.  at this point, Spirit will not have 'much' advantage, and the model will likely reforge/gem toward a differnt stat.\r\n\r\nif you ARE still going OOM, then you can adjust the boss handler as needed to make the fight longer, so that the model is forced to build up a larger spirit pool for you.",
      "PostedDate": "2011-04-08T13:20:20.22-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Thank you for answering my question, Fyre. I see exactly what you mean, and it makes sense; my concern, however, is that I'm just starting to gear up this druid, so the only reason that I can think of for my spirit being enough is perhaps the spec? And I ain't using any experimental spec, but build number 2 on wowpopular, which used to be build number 1 not so long ago: 7/0/34. Other than that, I find myself a bit lost imagining that my spirit or MP5 is enough as it is. Unfortunately I haven't actually healed heroics just yet (always get tanking when I queue with the 3 roles), so I can't tell whether I get OOM or not in Cataclysm heroics...it's just that I'd rather have some solid info anyway before embarrassing myself as a healer! =)\r\n\r\nIn short, I'm just really surprised of these recommendations, and I doubt that my spirit is super good because I'm just starting to gear up this druid. Regarding the boss fight, I haven't really made changes to the default, but I know that if I make the fight longer, then that would make Rawr recommend a lot more spirit / MP5 than anything else....yet I'd rather use the default / general settings for the time being, because I assume that those settings are what will help me in Cataclysm heroics to start with.",
      "PostedDate": "2011-04-08T19:34:16.487-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-04-09T09:37:36.26-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-04-09T09:37:44.743-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Ok, thank you for clarifying. I understand that some stuff will surely not be accurate if it says only partially ready. It would be a little helpful if the authors who maintain each model would perhaps mention, at least briefly, which parts are fairly ready or accurate, and which ones may not be accurate just yet. In any case, thanks to everyone.",
      "PostedDate": "2011-04-09T11:56:15.057-07:00",
      "Id": -2147483648
    },
    {
      "Message": "The problem with that is, if there are 4 sections and 3 are perfect but 1 is totally off, the whole thing is totally off. All the scores you see in Rawr are based on one calculation occurrence per score. It's not like you can look at the Buffs chart and go \"oh, well that one is accurate\" where the \"Gear > Shoulder\" slot isn't.",
      "PostedDate": "2011-04-09T12:16:45.94-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Yes, I see what you mean; indeed when it's a whole big, linked network of maths & numbers, one inaccuracy can lead to overall wrong results every time. I guess we'll just have to wait until the folks maintaining the Tree model update Rawr for Cata! Meanwhile, perhaps I can try and figure out the spreadsheet thing...I work with Excel a lot, just find Rawr far too intuitive and user-friendly to force myself to use the spreadsheet(s)! =)",
      "PostedDate": "2011-04-09T19:02:20.127-07:00",
      "Id": -2147483648
    },
    {
      "Message": "I'm not sure if this is worth re-opening (or bumping) this issue for, but my intention, and message, are positive. Very recently, I've started to pay more attention to my Resto Shaman, and I was pleasantly surprised to find out that Rawr's Resto Shaman model is regularly updated and mostly Cataclysm-ready, and then I was neutrally surprised to see that Rawr is recommending reforges to Crit—literally—across the board! I didn't think something was wrong; I was just really surprised, because all my reforges were to Spirit or Haste before that. I followed all Rawr's recommendations, and I think that things are going well actually, and apparently I'm seeing a lot more Ancestral Awakening HoTs on my party members. But, of course, not to digress from the Resto [Druid] main issue; I just wanted to give an accurate picture of what happened. The same kind of surprise, and this time because I know the model is regularly updated and Cataclysm-ready, I didn't feel suspicious at all; I trust Rawr. And this whole Resto Shaman experience quickly reminded me of my experience with Rawr's recommendations for my Resto Druid. Maybe, just maybe, those recommendations were not that off at all, after all! If the Cataclysm-ready Resto Shaman model says spam Crit reforges, then perhaps the only partially ready Resto Druid model is right when it says reforge to Crit and Haste!\r\n\r\nMy message is that I feel that much more confident about just using Rawr's recommendations also for my Resto Druid, and only revising my faithful execution of its instructions if my practical experience feels too negative. If not, then the model isn't that bad at all in its current state then. ",
      "PostedDate": "2011-05-13T15:44:27.32-07:00",
      "Id": -2147483648
    },
    {
      "Message": "With that said, Rawr is now recommending me to reforge Crit and Spirit to Mastery and Haste all over the place! ^^\r\n\r\nBut I did change my spec from the one I was using weeks ago, and I also got several gear upgrades. Especially worth mentioning, I dropped the Living Seed x3 talent points (which are directly related to & benefiting from Crit rating), so it shouldn't be surprising that now I'm getting reforge recommendations away from Crit and into Mastery & Haste. The part that still surprises me is that I'm being recommended to reforge from Spirit, but hey, the same thing happened with my Resto Shaman on the Cataclysm-ready model. So yes, I still say the Resto Druid model is worth our trust in its current state.",
      "PostedDate": "2011-05-13T15:53:47.51-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-05-20T23:09:45.937-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:25:22.523-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:18:13.643-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2017-11-27T11:05:42.32-08:00",
      "Id": -2147483648
    }
  ]
}