{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "Sophine was correct, the problem is that you need 2 yellows to activate the meta and your current helm has the second yellow. If you try to switch to the 346 that doesn&#39;t have the yellow in it, you lose Meta. Change another gem somewhere else to a yellow &#40;or green or orange&#41; and you seill see your helms line up.",
    "ClosedDate": "2011-06-05T17:09:14.58-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "I did my best to try to understand this, but I just couldn't. In the attached XML file for one of my characters, Rawr recommends stamina gems in most of my gear pieces, or basically gives several pieces a higher score when they have a +60 stamina gem socketed, even if it is not a blue socket. However, I was literally shocked to see that the level-333 helmet already on my character with a stamina+mastery gem is being scored significantly higher than the Justice-Point level-346 helmet with a blue socket for a +60 stamina! The gemmed level-346 helmet would give me about 80 more stamina than the level-333 one, but the 333 is still scoring significantly higher! If it were about the extra Mastery coming from the 333 helmet, then why would Rawr in other places score blue gems higher even when the ignored socket bonus is Mastery? I'm just baffled, and because it just seems to me like this is an \"issue\", I'm posting the whole thing here in the hopes that someone can clarify to me what's happening, or the secret behind this phenomenon that looks very strange to me. \n \nFor the record, I only have my own buffs as a druid, and have \"Crazy About Threat\" setting chosen. Other than that, I don't think I changed much.",
    "LastUpdatedDate": "2013-05-16T05:17:53.973-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2011-05-24T16:38:04.43-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Bear] Level 333 helmet better than a +80 stamina level 346 one?",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 20839
  },
  "FileAttachments": [
    {
      "FileId": 4978,
      "FileName": "Bear_333_helm_better_than_346.xml",
      "DownloadUrl": ".\\4978"
    }
  ],
  "Comments": [
    {
      "Message": "I have no affiliation with Rawr and apologise if I shouldn't be posting here but the reason your current helm is rated higher than the 346 helm with blue stam gem is that you need the second yellow gem to activate your meta. What I don't understand is why Rawr isn't recommending the 346 helm with a green gem on the helm list (especially as it still activates the socket bonus on the helm). It does recommend this when you run the optimiser just not on the helm list. I have also noticed this problem on my feral main i.e. on the lists for each slot Rawr seems to evaluate each gemming separately rather than taking into account meta activation needs as it used to (just to reiterate the opitimiser DOES do this so you can tick each item that you either have or are thinking of buying, make sure the relevant gems for each colour are available and then run the optimiser)",
      "PostedDate": "2011-05-24T19:50:29.583-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Actually the problem is that he is using the Black Heart. The proc on that trinket is throwing everything off. Plus you REALLY should not be using that at 85. Unselect that trinket and everything starts working as it should.",
      "PostedDate": "2011-05-24T21:46:27.96-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Actually, when The Black Heart is being scored over your character's other trinket, Za'brox's Lucky Tooth, then WHEN you get access to any of the heroic 346 items over them both, you would probably replace Za'brox's Lucky Tooth first, then The Black Heart (that's unless someone from Rawr.Bear author's says here that The Black Heart is being miscalculated). Secondly, those specific two trinkets were being scored right under the BiS 372 items before I changed settings to \"Crazy About Threat\" and upgrading a few other pieces of gear, and they are already being scored significantly high on the list of many Cataclysm trinkets. Thirdly, I [have] replaced The Black Heart with the 316 Leaden Despair (which I don't own) just to test, then checked the head armor slot again, and nothing has worked as it should. So all in all, I'm not sure what you're on about, Hinalover.\r\n\r\nAnd thank you very much, Sophine. Indeed, that's exactly what the issue was...a second yellow gem is needed to activate the meta! And yes, now it also surprises me why Rawr simply didn't a Regal Dream Emerald or so in the 346 helmet. Because even without using the Optimizer, when I clicked on the gem itself, and chose a green gem, suddenly the 346 helmet goes all the way up in the list under some BiSs. So perhaps it is an isssue with Rawr why it was not recommending a green gem in the helmet. And thank you again for reminding me of the Optimizer, I used it; I'm guilty of ignoring that awesome feature for years now! =)",
      "PostedDate": "2011-05-25T03:03:06.37-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-06-05T17:09:14.58-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:24:57.347-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:17:53.973-07:00",
      "Id": -2147483648
    }
  ]
}