{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Hunter",
      "DisplayName": "Rawr.Hunter"
    },
    "ClosedComment": "",
    "ClosedDate": "2009-11-11T14:58:45.04-08:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "This is my first post here so forgive me if I missed a topic or if I'm posting in the wrong spot.\n \nHas there been a major update/change/bug for hunters between .24 and .27?\n \nI mostly use Rawr with default settings to quickly compare gear for upgrades and wish lists. I normally set epic gems with one gem option and turn on/off filters as needed per toon/raid.\n \nWhile using .24 for my hunter with Heroic TOC10/25 turned OFF - \"Crusader's Dragon Scale Breastplate (crafted)\" was BIS with an overall score of 112.49 and hunter 9.0 chest Windrunner's Tunic of Conquest had a score of 91.54.\n \nWhile using .27 will all default settings and exact same equipped gear the scores are now: 120.47 for 9.0 chest (i232) and 106.10 for the crafted i245 chest. \n \nHOW did a 9.0 chest suddenly get such a high overall score way above a TOC crafted chest? Is .27 finally taking set bonuses into account, have some default settings for hunters changed, did I do something wrong, or is the 9.0 chest REALLY better than the crafted i245 chest (which I was planning on getting made).\n \nAdditionally feel free to let me know what settings I should change from default. /wink",
    "LastUpdatedDate": "2013-05-16T05:23:27.457-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2009-11-11T07:49:10.477-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Hunter] Major Recode between 2.2.24 and 2.2.27",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 14761
  },
  "FileAttachments": [
    {
      "FileId": 2480,
      "FileName": "Treb New.xml",
      "DownloadUrl": ".\\2480"
    }
  ],
  "Comments": [
    {
      "Message": "There has been an entirely new Hunter model implemented. Jothay is the person with the details.\r\n\r\nOn default options. I note from your file that you have NO buffs active. This is a very big mistake. Buffs can make very dramatic differences to what gear is best. You really ought to make sure you indicate all buffs you anticipate having on your raids.",
      "PostedDate": "2009-11-11T08:08:04.61-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Thanks for the suggestion... But as an alt that occasionally raids, I can't count on any specific buff. However I will look into it.\r\n\r\nHopefully Jothay or others can/will comment on how 9.0 chest is suddenly WAY better than the crafted i245 chest - If it is simply the set bonuses now working that's cool.",
      "PostedDate": "2009-11-11T08:37:45.387-08:00",
      "Id": -2147483648
    },
    {
      "Message": "...if only there was a place where you could see the changes between releases... :)\r\n\r\n<Taken from ReadMe.txt>\r\nv2.2.25.0\r\n - ...\r\n - Rawr.Hunter: Chimera Shot's damage should now be calculated correctly, as should Wild Quiver. Fixed handleing of the 2pT9 bonus and various trinkets. Pets should regen focus at the correct rate now and their Kill Command should hit for the correct damage. Auto Shot should now be properly affected by haste. Steady Shot should now scale correctly. Cosmetic Work on the Options Panel made. Overall, there have been a large amount of changes to Rawr.Hunter, so please be sure to report any bugs you encounter on our site.\r\n - ...\r\n\r\nBefore the 2.2.25 release there had been no Hunter updates since 2.2.14 i believe. Which means for example that the old ArP value was still used, Serpent stings could not crit with the 2pT9 bonus, Piercing Shots did no damage... etc. There are still some fixes needed in e.g. how some talents apply (especially TrueShotAura and HuntersMark) but in general huge overall improvement.",
      "PostedDate": "2009-11-11T08:42:01.583-08:00",
      "Id": -2147483648
    },
    {
      "Message": "There has been an entirely new Hunter model implemented. Jothay is the person with the details.\r\n\r\nOn default options. I note from your file that you have NO buffs active. This is a very big mistake. Buffs can make very dramatic differences to what gear is best. You really ought to make sure you indicate all buffs you anticipate having on your raids.",
      "PostedDate": "2009-11-11T09:03:03.347-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Hmm my browser saw fit to post the same message twice an hour apart - we've been having internet connection issues here at work.",
      "PostedDate": "2009-11-11T09:26:46.077-08:00",
      "Id": -2147483648
    },
    {
      "Message": "That can happen sometimes :)",
      "PostedDate": "2009-11-11T10:28:39.503-08:00",
      "Id": -2147483648
    },
    {
      "Message": "That can happen sometimes :)",
      "PostedDate": "2009-11-11T10:28:50.937-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Drizz hit the nail on the head, that would probably explain part of the differences. The other parts are that all stuff that should have been handled by a special effect in Rawr, now IS, instead of using a lower-math calc that was from the spreadsheets. There's still plenty of work to do to make the model fully up to date but I took the first major leap forward.",
      "PostedDate": "2009-11-11T11:17:59.94-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-11-11T12:34:00.057-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-11-11T14:58:45.04-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Thanks for the helpful comments and pointing out the readme file I never noticed.\r\n\r\nTo partially answer my own question, if I equip 9.0 head for 4pc bonus the crafted chest once again jumps back to BIS. So the 2 and 4pc bonuses are now working better/properly :)\r\n",
      "PostedDate": "2009-11-12T08:07:53.253-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:31:53.197-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:23:27.457-07:00",
      "Id": -2147483648
    }
  ]
}