{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "Fixed.",
    "ClosedDate": "2009-01-19T15:31:37.403-08:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "This is kinda odd. I know you auto-gemmed a bunch of it, but perhaps you could find a way to limit it so that crappy gear isn't gemmed with T6 gems... one of which costs more than an entire set of green gear that it's gemmed in? Perhaps an itemlevel filter for gem quality... perhaps if the ilevel is below 110, put green gems in it... ilevels 110 to 140, put blues, and only slot purple T6 gems over ilevel 140? It makes it more difficult to compare equipment when your looking at 1000g gems socketed into a 17g PvP blue bought from a rep vendor.",
    "LastUpdatedDate": "2013-05-16T05:27:18.567-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2008-05-13T10:45:17.67-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "T6 Gems in sub-T4 Gear",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 10185
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "You can choose whatever gems you want. What's included in the default item cache is just there for convenience.",
      "PostedDate": "2008-05-13T11:04:35.637-07:00",
      "Id": -2147483648
    },
    {
      "Message": "That's true, but there's no way for me to gem excellent equipment with purple gems, moderate equipment with blue gems, and crappy equipment with green gems except manually, one by one.\r\n\r\nIt's not a convenience when an item with no gems is rated poorer than an item with gem slots... but only because the gemmed item has crazy-expensive purple gems socketed in it that no sane person would ever socket. However, I have to admit I haven't played with the re-gemming feature yet... I just wish I could re-gem based on the ilevel of the item (only regem items under ilevel 110, for example), or based on the rating of the item (gemming greens into anything on the bottom 25% of the list of chest items). The point being that the crappier the item is, the quicker I'll replace it, so it should be gemmed with greens for comparison. If the item is near the top of the rating list, I'd want to gem it with end-game gems because it's an end-game item for me... I may never replace it.\r\n\r\nGemming at a quality level significantly different from the items quality skews the results toward (or away from, if we're putting green gems in end-game equipment) gem slots, altering the placement of these items relative to items with no sockets.\r\n\r\nIt's not a high priority complaint... I know that there are more important things to fix or do, like getting more models in and making them more accurate. But it is something that could be improved on, so I thought it worth posting.",
      "PostedDate": "2008-05-13T11:45:17.53-07:00",
      "Id": -2147483648
    },
    {
      "Message": "But how does that make sense? What items you have doesn't change what gems you have available. Swap the gems to what you have available. If items way higher than your current progression level are using rare gems instead of epic gems, what does it matter?",
      "PostedDate": "2008-05-13T12:06:12.17-07:00",
      "Id": -2147483648
    },
    {
      "Message": "It's related to the investment related to the time you expect to have the item. Let's say you had a newly minted mage who just ran Magister's for the first time. You have this pretty purple gem that you can put anywhere you want. Are you going to socket your green wrist... or are you going to save it for your first piece of T4?\r\n\r\nMost people would not put a purple in a green item, even if they had it, because the gem would be destroyed soon when you replace that piece. That's a valuable gem, why would you waste it on a crappy item? So it's not just about 'what you have', it's also about what kind of investment you want to make into a piece of equipment. Why would you invest literally thousands of gold socketing a T4 chestpiece with 3 epic gems, even if you had them... you're gonna be replacing the chestpiece soon with T5 or T6 anyway (if your guild has that many epics to waste on T4, you're certaingly going to be in T5 soon).\r\n\r\nOr here's another way to look at it... the typical sub-110 ilevel item that you see if you browse 500 characters in the armory will not have epics in it. In fact, most will probably have greens. The typical ilevel 130 will have blues. Many ilevel 145 items will probably STILL have blues, since most people can't fully socket in epics, but at least epics are worth shooting for. As the quality of the item rises, the quality of the gems that are worth putting in it rises.\r\n\r\nPeople that put $2000 tires on a Honda Civic get mocked... and you won't see cheap tires on a Ferarri. The amount you invest in upgrading something is directly related to how valuable the item itself is. And I just think that, given some extra time to code, it would be nice if the re-gemming system could accomodate only regemming sub-sets of the entire list so that the reality of how people actually gem items would match the gems that get modeled by Rawr.",
      "PostedDate": "2008-05-13T14:03:25.66-07:00",
      "Id": -2147483648
    },
    {
      "Message": "While again, we've got features coming that will solve the need for that in the first place...\r\n\r\n...if you get one epic gem from the Magister's quest, I wouldn't say that you've got the gem 'available'. You have blue gems available, so that's what you should use. Tossing the epic in a good item is the manual step, not the automatic.",
      "PostedDate": "2008-05-13T14:54:18.833-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-01-19T15:31:37.403-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:36:53.737-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:27:18.567-07:00",
      "Id": -2147483648
    }
  ]
}