{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.MultipleModels",
      "DisplayName": "Rawr.MultipleModels"
    },
    "ClosedComment": "Closing this again&#58;1&#41; Don&#39;t reopen it2&#41; If you want specific enchants on specific models, please open new tickets for each one. Please also include an outside source if you can that shows what abilities proc that enchant.3&#41; Note that even if you do open new tickets, they probably wont be worked until Cata is out.... where this stuff will be changing again anyway so this is a low priority either way",
    "ClosedDate": "2010-09-26T12:05:04.647-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "The equipment effects -> Fire Damage, Nature Damage, Frost Damage that are on items or you can add with item editor dont work! Only thing that works is Shadow Damage. This makes items like \"Gnomish Lightning Generator\" and enchants like \"Hand-mounted pyro rocket\" totally not working (calculated) correctly.\n \n(Workaround for Gnomish Lightning Generator was to change the damage to shadow damage, but I cant find where to change the effect for enchants...)\n \n* Hand-Mounted Pyro Rocket is not 0.00 DPS for either rogues or feral druids. (although it may not be top dps enchant, I still want to know how much dps I actually lose vs Hyperspeed Accelerator for the ability to do some ranged damage)\n* Gnomish Lightning Generator is not only +crit rating. (on this case, why is \"Darkmoon Card: Death\" treated better? Just because it does shadow damage and not nature? use the same model for nature, fire and whatever damage also, as you do for shadow damage)",
    "LastUpdatedDate": "2013-05-16T05:20:14.413-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2010-07-23T00:33:39.277-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "equipment effects -> Fire Damage / Nature Damage / Frost Damage (probably)",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 18278
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "haven't tested for other classes as feral druid and rogue... not sure it makes any difference tho.",
      "PostedDate": "2010-07-23T00:36:00.25-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Magic damage procs is something that needs to be provided for in a model specifically.  Melee models tend to not support them because there are not a lot of (good/viable) items and/or enchants using these.\r\n\r\nIf it's just a proof of concept thing on items you're editting.  Then I wouldn't worry about it.\r\n\r\nIf it's about actual items, then you should mention which items and which models you have issues with. Don't expect changes in the models unless the items/enchants are even remotely close to being viable though :p",
      "PostedDate": "2010-07-23T01:29:40.207-07:00",
      "Id": -2147483648
    },
    {
      "Message": "We made a push at some point that handled this in a couple models, but we need you to be more specific about which effects in which models like OReubens said and we can look at implementing it.",
      "PostedDate": "2010-07-23T02:00:43.657-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Rogue and Cat models. (shadow damage works, so just copy the code for other types spell damage also?)\r\n\r\nAbout items... well this hand-mounted pyro rockets enchant for sure. But if you already make the item use/proc spell damage thing work for all spell damage types (shadow/frost/fire/holy/nature/arcane) it should pretty much make all the future such items work correctly, yes? So why think small and ask about specific items and argue about current items viability (besides, if an item isn't viable, I would like it to be proven, not find out that your program sucks and cant handle the item in question), just make the thing work for possible future items...\r\n",
      "PostedDate": "2010-07-23T03:39:41.04-07:00",
      "Id": -2147483648
    },
    {
      "Message": "We ask about specific items/enchants, not because we're \"thinking small\", but because there actually are sometimes quite different mechanics involved in different sources of damage, and we need to know what examples you're looking at that we should use as a test case.",
      "PostedDate": "2010-07-23T09:44:27.257-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-09-08T13:28:31.2-07:00",
      "Id": -2147483648
    },
    {
      "Message": "\r\n\r\n\n\n** Closed by Jothay 9/8/2010 1:28 PM",
      "PostedDate": "2010-09-09T02:42:20.797-07:00",
      "Id": -2147483648
    },
    {
      "Message": "In Rawr 2.3.22 it's still broken. Why you closed it?",
      "PostedDate": "2010-09-09T02:42:21.553-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-09-09T02:56:23.24-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-09-09T02:59:55.9-07:00",
      "Id": -2147483648
    },
    {
      "Message": "I do know that this item (Gnomish Lightning Generator) works correctly on the Shadow Priest model.  I had submitted a simular requst a while ago, and the model was updated back then (that was about 4-6 months ago).",
      "PostedDate": "2010-09-09T09:45:54.923-07:00",
      "Id": -2147483648
    },
    {
      "Message": "2.3.23 still broken",
      "PostedDate": "2010-09-13T07:45:25.353-07:00",
      "Id": -2147483648
    },
    {
      "Message": "As long as you see no updates here it won't be fixed in Rogue at least, no need to bump it for each release.",
      "PostedDate": "2010-09-13T08:27:08.317-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Jothay had closed it because it had been dead since July.  To the original poster, if you have specific items that you want fixed in one or more specific modules, open a bug referencing specifically what it is that isn't showing any value (you talk about the engineering pyro rockets a lot) so that the developers have something concrete to go on.  It's impossible to implement generic \"elemental/spell damage proc\" handling mechanisms, because these sources of damage often need to be handled differently depending on exactly what item is being modeled.",
      "PostedDate": "2010-09-13T08:45:34.16-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-09-14T19:03:29.147-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-09-26T12:05:04.647-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Nvm then. Good luck with developement and I personally can't be arsed to try to be useful again for this particular program. And just take\r\nRawr \"as is\" piece of unreliable randomness.",
      "PostedDate": "2010-09-27T00:30:44.417-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:27:53.43-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:20:14.413-07:00",
      "Id": -2147483648
    }
  ]
}