{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Base",
      "DisplayName": "Rawr.Base"
    },
    "ClosedComment": "Rawr 4.0.15 Released 01&#47;09&#47;2011",
    "ClosedDate": "2011-01-09T19:54:28.86-08:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "An issue which may be specific to the Silverlight version (don't ever remember it in the past) is that tooltips seem to disappear very quickly now. \n \nUnfortunatly, a lot of models use tooltips--especially on the character pane--for displaying large amounts of information. e.g. in the Mage model showing the entire rotation breakdown. It makes it pretty hard to read any of this information with the tooltips only showing up for a few seconds, and I can imagine it's a bit annoying to novice users. Not sure if anything can be done about it or if it is just system behaviour.",
    "LastUpdatedDate": "2013-05-16T05:19:16.663-07:00",
    "PlannedForRelease": "Rawr 4.0.15 Beta",
    "ReleaseVisibleToPublic": true,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2011-01-02T09:00:25.02-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "Tooltips with Large Amounts of Text Disappear",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 19519
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "This is indeed an issue. As a workaround in mage model you can use Copy Character Stats under Tools page in options.",
      "PostedDate": "2011-01-02T09:39:04.963-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Implementing a tooltip class for that is on my todo list. Just haven't gotten to it yet",
      "PostedDate": "2011-01-02T09:49:10.27-08:00",
      "Id": -2147483648
    },
    {
      "Message": "I'd actually like to get away from the current style we have of shoving tons and tons of stuff into tooltips. In the mage model in particular, this is a significant usability issue. I'd like to look into models being able to provide custom stats panels, so that they can present the important result data in a manner appropriate to their model.",
      "PostedDate": "2011-01-02T10:24:20.373-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Astry do you mean only when there is a giant chunk of info like rotation data or any tooltip that's more than a couple lines? Im windering where the line is as my basic stats tooltips are extensive to show sources of the stat and porc v unprocd states. giant tooltips like whats on my total dps i agree about.",
      "PostedDate": "2011-01-02T11:42:19.64-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Tooltips should be used to show extra additional detail that you won't usually need or don't really matter. Things like... \"Crit Chance: 37%*5% base\\r\\n10% from talents\\r\\n22% from 1234 Crit Rating\".",
      "PostedDate": "2011-01-02T12:36:32.53-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Marking this as fixed for .15, the audit to stop using giant chunks of info in tooltips beyond what Astry just stated should be listed as a separate Task.",
      "PostedDate": "2011-01-03T13:40:04.07-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Note to all devs, the new implementation will work just like it always has but you now have an option to add in a header line in the tooltip:\r\n\r\n\"Crit Chance: 37%*5% base\\r\\n10% from talents\\r\\n22% from 1234 Crit Rating\" <-- works normally\r\n\"Crit Chance: 37%*The Pane Shows Averaged Values*5% base\\r\\n10% from talents\\r\\n22% from 1234 Crit Rating\" <-- \"The Pane Shows Averaged Values\" becomes bold in the tooltip",
      "PostedDate": "2011-01-03T13:41:59.503-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-01-09T19:54:28.86-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:26:42.043-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:19:16.663-07:00",
      "Id": -2147483648
    }
  ]
}