{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Base.ItemFilters",
      "DisplayName": "Rawr.Base.ItemFilters"
    },
    "ClosedComment": "",
    "ClosedDate": "2011-01-04T22:57:09.87-08:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "I cannot get the Filter to show ID#62386 Cord of Raven Queen\nThe item does exist in the item database.\nI have tried specific and general filters but cannot get this item to ever show in the available gear list.\n \nSteps to Reproduce:\nLaunch Rawr\nSelect Gear > Waist in the Gear List\nSearch for the item in the search box - doesn't exist\nVerify that your Filter is all inclusive (Reset)\nTry a filter by Item Level (359)\nTry a filter by Faction (Guardians of Hyjal)\n \nAdditional Information:\nRawr Version: Unfortunately I cannot tell you which version this is as there is no Help > About in the app.  I clicked on a link that said v4.0.14b (on this page http://rawr.codeplex.com/)  but when I clicked that link the top of the new page (http://rawr.codeplex.com/Thread/View.aspx?ThreadId=237262) says v4.0.9b.  I am running the current in-browser version linked from the Rawr home page.\nWindows Vista32\nChrome browser\n \nHope this helps.  Thank you.",
    "LastUpdatedDate": "2013-05-16T05:19:12.597-07:00",
    "PlannedForRelease": "Rawr 4.0.14 Beta",
    "ReleaseVisibleToPublic": true,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2011-01-04T19:25:45.297-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[ItemFilters] Filter won't show a specific item",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 19564
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "1) Version is in the bottom left corner of Rawr\r\n2) You didn't say what model (Healadin, DPSWarr, etc).\r\n3) You didn't add a character file where this issue occurs.\r\n4) Chrome is nasty about caching older versions of Rawr, use Shift+F5 to make sure it caches a new version if you don't see the current one (.14).\r\n5) In the Filters Side-bar, did you check to see that Cloth was enabled in Filter by Item Type?",
      "PostedDate": "2011-01-04T19:43:51.037-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-01-04T19:44:24.36-08:00",
      "Id": -2147483648
    },
    {
      "Message": "1) Bottom *right*",
      "PostedDate": "2011-01-04T20:14:54.88-08:00",
      "Id": -2147483648
    },
    {
      "Message": "1) v4.0.14.0b\r\n2) Model was Healadin - however I do see that it does show up in Holy Priest - this was a question I originally asked on the Discussions but my post was deleted and I was referred to the documentation - in the filter section in the Documentation there is no indication that the item list has already been filtered by the model that is being used - please point out where I can find this info (the effect that model has on the item list - I would expect all items to be visible and the only filtering to be done by the filter functions).  The reason I was comparing with Healadin was to find out if this rather significant upgrade was worth giving up my 5% Plate bonus but I could not assess this via Rawr.\r\n3) I tested with and without a character loaded - doesn't seem character dependent, however it does seem model dependent.\r\n4) This was the first time I've ever used Rawr in the browser (the last time I tried Rawr must have been 2 years ago).  I've now hit Shift-F5 and receive the same result.\r\n5) Yes, Cloth was enabled, all armors were enabled under Filter Items By Type > Armor\r\n\r\nThank you.",
      "PostedDate": "2011-01-04T22:35:26.67-08:00",
      "Id": -2147483648
    },
    {
      "Message": "* Healadin is only just started in being set up for Cataclysm, the calcs are not reliable in this time. I don't think the plate specialization (5% Intellect) is modeled yet at all.\r\n* Read the Options Pane on Healadin, see at the bottom where it says \"Ignore Spirit Items\" and \"Ignore Hit Items\" Those are probably both checked, and Cord of Raven Queen has Spirit on it.\r\n* Even turning off the Spirit check, it still didn't show up, which tells me that Mastery isn't set up as a Relevant Stat yet and since it's not on the Stat Pane either... Without any stat to be relevant other than Intellect, I'm guessing there's nothing telling it to show up at all.\r\n\r\nBottom line, Healadin isn't ready yet, don't bother until we make a release that says Healadin is ready. Closing this as not an issue of filtering, but because Healadin doesn't work yet",
      "PostedDate": "2011-01-04T22:57:01-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-01-04T22:57:09.87-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:26:37.027-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:19:12.597-07:00",
      "Id": -2147483648
    }
  ]
}