{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.RestoSham",
      "DisplayName": "Rawr.RestoSham"
    },
    "ClosedComment": "End user did not select buffs, hence incorrect values on gear.  If you do not have buffs properly selected, haste will have a negative value, as it should.",
    "ClosedDate": "2010-09-11T02:17:23.917-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "Yes, I searched the site, and while it seems other people have encountered the problem of gear being reported with a \"negative effect\", I have not seen anything conclusive. It seems to always be related to haste as most of the gear at the bottom that has negative values ﻿﻿usually has haste on them.\n \nI'm using the latest Rawr 2.3.22. I tried loading my resto shaman character in rawr 3 online but I'm getting errors. Just load my character file below and inspect gear for the Head, Neck, Back, Wrists, Feet, Fingers, Trinkets, Main Hand slots. Even if there are no negative values, sometimes haste gets messed up. For example, add a custom gemming to the gloves on this character and pick 2x +20 Haste Quick King's Amber. You'll notice that the resulting gloves gemming will be waaay below in the list. At my level of gear, haste is very good, yet Rawr miscalculates something with haste.\n \nYou can download my XML character file from Skydrive at ﻿﻿﻿﻿﻿http://cid-a112ef1ae07a4d8a.office.live.com/self.aspx/Public%20Files/Shaloxay%20%5E5Resto%20-%20Current%5E6.xml. I also attached it to the issue. Let me know if you need more information.\n \nThanks for your insights.",
    "LastUpdatedDate": "2013-05-16T05:19:54.217-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2010-09-07T12:05:57.87-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[RestoSham] Negative values on items (esp. with haste)",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 18705
  },
  "FileAttachments": [
    {
      "FileId": 4016,
      "FileName": "Shaloxay (Resto - Current).xml",
      "DownloadUrl": ".\\4016"
    }
  ],
  "Comments": [
    {
      "Message": "You have no buffs in that XML file.  Please enable your raid buffs and check again.  Note, if you do not have your raid buffs selected, then yes, much gear will have negative value because you have no potions, intellect buffs, replenishment, earthliving, or extra crit from other players chosen, all of which while they might individually impact your mana regen to a small amount, as a whole are a massive amount of mana, and without them haste is indeed negative to your character.",
      "PostedDate": "2010-09-08T23:32:49.973-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-09-08T23:33:08.79-07:00",
      "Id": -2147483648
    },
    {
      "Message": "If I don't receive a response by end of day, I'll be closing the issue.  ",
      "PostedDate": "2010-09-10T14:40:16.33-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-09-11T02:17:23.917-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-03-17T21:40:45.093-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:27:28.15-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:19:54.217-07:00",
      "Id": -2147483648
    }
  ]
}