{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Base.Optimizer",
      "DisplayName": "Rawr.Base.Optimizer"
    },
    "ClosedComment": "",
    "ClosedDate": null,
    "CommentCount": 0,
    "Custom": null,
    "Description": "I see, I'll just keep doing it manually.\n\nHowever, the optmizer doesn't seem to work for me, I tried on two different computers with the same character. When I click optimize nothing happens. the app is using 100% of one cores cpu-power (25% on a quad core) but nothing happens, no progress bar. I'm using the last stable 5.2.0 build.\n\nEdit: Pressing Cancel doesn't do anything. It just keeps running.",
    "LastUpdatedDate": "2013-05-18T02:49:15.45-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2013-05-15T05:45:52.31-07:00",
    "Status": {
      "Name": "Active",
      "Id": 2
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "Optimizer doesn't seem to work",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 24309
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "If you can let me know what your character and realm is, I can take a look at it.",
      "PostedDate": "2013-05-15T05:46:41.9-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Yepp, it's European realm, Moonglade, character is Moofoo",
      "PostedDate": "2013-05-15T05:58:16.94-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Okay.  Since the character appears to be a Guardian druid, and I'm not entirely certain what the status of the Bear module is, I'm going to have to say that I'm not sure if I can fix it.  I'll keep this issue open and see if maybe we can get someone to look at it, but we're a bit short-handed on programmers at this time.  I'm sorry I don't have better news for you.",
      "PostedDate": "2013-05-17T13:06:34.287-07:00",
      "Id": -2147483648
    },
    {
      "Message": "It's totally understandable, these are people doing this for the love of doing it. If the passion isn't there, well...\r\n\r\nAnyway.\nI found another bit if strange thing. You know I said that the reforging keeps on changing, ofc it recalculates every time I reforging an item telling me to go in another direction. However. I just went over the gear I have equiped, going item for item checking what it wanted me to do without really doing it. and here's the tally:\r\n\r\nIt wanted me to remove:\nhit on two items\nexpertise on five items\nhaste on two items\ncrit on one item\nmastery on three items\r\n\r\nit wanted me to add:\nmastery four times\ncrit five times\nhaste four times.\r\n\r\nI just think it seems odd that it want me to remove stats several times and still add the same stat on another item. It wouldn't have been strange if I actually did the reforging on an item and then checked again, but this was just looking at the top ranked item in the list.\r\n\r\naccording to this the safe stats to decrease is hit and expertise.",
      "PostedDate": "2013-05-17T15:07:25.24-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Just noticed that the same problem can be with the gemming. Look at my boots for instance, the best gem it exp/crit gem but on the same item rawr wants me to reforge from crit to dodge. Why isn't it suggesting dodge gem?",
      "PostedDate": "2013-05-18T02:49:15.45-07:00",
      "Id": -2147483648
    }
  ]
}