{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "More Cat gemmings added",
    "ClosedDate": "2010-02-01T16:13:28.873-08:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "Having to add over 50 new gemming templates for Feral Kitties everytime there's a program update, is really starting to wear out my mouse and my patience. Is there any way that there could be an option added into rawr to either export your gemming templates to another file, or having the templates saved to your character's .xml file so that they can persist through version upgrades? If that's not possible, then can the default gemming templates for Feral Kitties be increased from the default THREE? Hunters have every single gemming possibility that I can see added into their default profile, but kitties only get agi, agi/stam, and agi/hit by default. For those of us kitties who have high-end gear, having to add in nightmare tears, strength gems, haste gems, and armor pen in every conceivable configuration.. it's very frustrating to have to keep doing it, to say the least. I would almost consider PAYING for this feature to be added in, I think it's sorely needed!",
    "LastUpdatedDate": "2013-05-16T05:22:26.323-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2010-01-13T12:53:52.043-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "Export option for Gemming Templates or an increase in default gems for Kitties",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 15889
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Gems are available for selection in the optimizer, much like enchants/gear. Some models (Hunter/TankDK) have templates for every possible gem one might use, some just leave the templates short, and rely on the user to select the gems they wish to optimize for. Personally, I find that just selecting the 2-3 templates I normally use, and then selecting additionally gems via the gear selection to optimize around, gets the best performance. I'm not sure if this is a possibility for the Feral module, but I suspect it should be.",
      "PostedDate": "2010-01-13T13:25:39.85-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Same here - I leave the default gemming templates then mark any other gems as available.  This is saved in your character file anyway so it is a once only thing.  Pretty sure I only need to mark the ArPen, Agi/Haste & Nightmare Tear as available as the others are already in the templates.\r\n\r\nFailing that you should just be able to copy the GemmingTemplates.xml file from your old Rawr versions data folder into the data folder of the new version.\r\n\r\n",
      "PostedDate": "2010-01-13T14:15:22.063-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Tying gemming templates to character files is definitely something we want to do in the future, and has already been noted many times. You can copy your GemmingTemplates.xml file to copy gemming templates between versions.\r\n\r\nThat said, you're *definitely* doing something massively wrong if you're making 50+ gemming templates. Seriously. Cats have some of the simplest gemming rules of any class/spec.",
      "PostedDate": "2010-01-13T14:42:48.63-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Ah ha, I was hoping there would be some file that could be copied, thanks for the heads up on that. I'll be sure to copy over that file from the /data/ folder just in case, in the future.\r\n\r\nAs for the 50+ gemming templates, personally I like to have every option covered, so I don't ever need to add another gem in. I've got one template with only ArP in all the slots along with a meta, the next template is all ArP plus a Puissant Dreadstone and a meta, the next one is Arp in red/blue, with a yellow being one of the available ones, and so on down the line until I get all of the ArP gems covered. Then, I move on to Agility, and lastly, Strength. Usually at least 10 different templates for each red gem, and then a whole new complete set with Nightmare Tear's set up as the blue gem. I was hoping that I was doing something wrong, but my method was working for getting me the right gems, so I wasn't in *too* big of a hurry to find an alternate way of finding what gems would be best in what.\r\n\r\nI had completely forgotten that you can go into the enchants/gear selector on the right side of the program, and select gems, so I'm definately going to be using that in the future. I'm guessing that the gems selected in this way only become available to be listed when you use the Optimizer (which, to be honest I rarely use.) If not, then I'm really, REALLY going to be embarassed if by selecting the green diamond next to the gems, those gem combos appear in the gear listings..",
      "PostedDate": "2010-01-13T14:53:34.87-08:00",
      "Id": -2147483648
    },
    {
      "Message": "It's only available for optimizer. But you should definitely be using the optimizer for selecting which gems are best put where. Is there any particular reason why you're not using the optimizer for this?",
      "PostedDate": "2010-01-13T16:52:44.013-08:00",
      "Id": -2147483648
    },
    {
      "Message": "There's no downside to including a ton of useless gemming templates like you describe, other than poor chart calculation performance, and a waste of your time.\r\n(ArPen | Agi | Str) > (Haste | Crit | Hit) > (Sta | Nightmare)\r\nThat's the possible stat priorities for a Cat.\r\nThat's 3 gemming templates for ignoring socket bonuses, and 3*3*2 = 18 for matching socket bonuses, for a total of 21. Any more than that, and you've got some that are certainly a waste. It sounds like you may not fully understand what Gemming Templates are, and may want to read the help topic on it.\r\n\r\nAgain, though, all it's costing you is poor comparison chart performance; it's not reducing accuracy or anything.\r\n",
      "PostedDate": "2010-01-13T17:13:57.467-08:00",
      "Id": -2147483648
    },
    {
      "Message": "It's just how I've always used rawr's gemming template system, because I didn't know (noticed at one point, but then forgot about it later) about being able to select the gems from the right side of the screen. My computer is also one huge pile of crap, so if I were to run the optimizer everytime a piece of loot dropped, I would miss my opportunity to get said piece of loot. I also have a memory like a goldfish, so I always have rawr open while I'm raiding, and if something drops I can use, I alt+tab over to rawr to see how much of an upgrade they would be for me. Having agility/stam/etc being the default gemming templates, when I need to use ArP it doesn't show up on the graph listing by default, so I go through when I get a moment, and added in all the templates for armor pen that I could think of. From then on, I can use rawr and look on the graph to see which item is an upgrade.\r\nKnowing about the gemming selection for the optimizer, I may start changing how I use rawr in the future, as well as checking into the helpfile on the gemming templates as suggested. Probably will use rawr's optimizer to make a list of gear that would be upgrades, and then writing those upgrades down somewhere or using atlasloot's wishlist feature for it, so that I can REMEMBER what loot I want. Also, to be completely honest, I've never looked at the helpfile online and just figured out how rawr works on my own. Which explains why I apparantly know very little about how the program really works! Thanks for the input on everything everybody :) Sorry to have taken up an issue thread with this discussion",
      "PostedDate": "2010-01-14T01:51:13.143-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-02-01T16:13:28.873-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:30:35.243-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:22:26.323-07:00",
      "Id": -2147483648
    }
  ]
}