{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Warlock",
      "DisplayName": "Rawr.Warlock"
    },
    "ClosedComment": "",
    "ClosedDate": "2010-02-08T17:23:10.123-08:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "First off i love Rawr and and appreciate the work gone into it. Been using it for awhile now and it has been working pretty awesome.\n \nCurrently as a warlock I am getting upgrade lists that contain a lot of items it didn't before since i upgraded to 2.3.8, it even gives me items I currently own and have checked as well as really old heroic and reg dugneon gear and I am in ICC and TOC gear, this might be a bug of some sort, right now my gear lists don't really work cause they include most everything.\n \nalso lightweave embroider disappeared from rawr\n \nanyway was just making sure you knew about this issue, i did a search and didn't find anything but it might have been to broad, anyway thanks for the awesome work I greatly appreciate it.",
    "LastUpdatedDate": "2013-05-16T05:22:03.743-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2010-01-27T22:51:47.01-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Warlock] Upgrade List showing old and currently check items",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 2,
    "Id": 16154
  },
  "FileAttachments": [
    {
      "FileId": 2868,
      "FileName": "malidia.xml",
      "DownloadUrl": ".\\2868"
    }
  ],
  "Comments": [
    {
      "Message": "Please read and follow the Posting Guidelines:\r\n* Did not include Char file",
      "PostedDate": "2010-01-28T09:13:10.687-08:00",
      "Id": -2147483648
    },
    {
      "Message": "If there are better gemmings for your current gear then they will show up as upgrades.  For instance, if you have the gemming templates using epic gems but all your gear has the rare gems in them, then all your items will appear in the direct upgrade list with epic gems.\r\n\r\n",
      "PostedDate": "2010-01-28T14:46:36.357-08:00",
      "Id": -2147483648
    },
    {
      "Message": "If your current gear is not optimized, the Build Upgrade list will recommend a different setup using your available gear, and list the DPS difference as an upgrade.  Make sure to Optimize (2-3 times, preferably) before running a Build Upgrade List.",
      "PostedDate": "2010-01-28T15:32:04.5-08:00",
      "Id": -2147483648
    },
    {
      "Message": "sorry forgot to upload my profile so here it is, but yea tried optimizing a lot I am still getting upgrade lists that seem crazy, I also have epic gems so no luck there. I might start a new profile and see if it helps it will take me awhile but if it might help i might try it.",
      "PostedDate": "2010-01-28T16:53:53.877-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-01-28T16:53:56.267-08:00",
      "Id": -2147483648
    },
    {
      "Message": "I went through and selected most of the buffs you would have while raiding and most of these issues resolve themselves (the few of your current items that appear as upgrades are only a small increase of about 5 dps).    Keep in mind though that the warlock module is still a work in progress so things may change once pets etc are added in.\r\n\r\n",
      "PostedDate": "2010-01-28T23:23:13.8-08:00",
      "Id": -2147483648
    },
    {
      "Message": "sweet thanks, this sounds good, i guess i was just thrown off because it just did it all of a sudden, it's prolly just a domino from the warlock model work, so it's probably a good thing. thanks for the help.",
      "PostedDate": "2010-01-29T08:07:38.403-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-01-29T13:56:40.24-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-02-08T17:23:10.123-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-09-05T15:34:07.723-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:30:10.33-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:22:03.743-07:00",
      "Id": -2147483648
    }
  ]
}