{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Base.Items",
      "DisplayName": "Rawr.Base.Items"
    },
    "ClosedComment": "We&#39;re now solely using Wowhead as a datasource for both simplicity of maintenance and ease of use for end users",
    "ClosedDate": "2011-02-06T19:29:40.743-08:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "I  get my wownews often from mmo-champion.com \nBlizzard published the new items for 3.2 accidentally once again so they were available for a very limited amount of time on the official armory but were removed.\nwowhead didnt get the data yet, but they are available on the mmochampion database.\nI therefore suggest to add http://db.mmo-champion.com/i/47066/  as a third source to get items from, so we can play around with them ;)",
    "LastUpdatedDate": "2013-05-16T05:24:57.483-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2009-08-06T16:47:55.867-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Feature Request.Items] Add mmo-champion as source for items",
    "Type": {
      "Name": "Feature",
      "Id": 1
    },
    "VoteCount": 2,
    "Id": 13800
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "That's a huge undertaking, that we're not likely to do anytime soon, unless there's a really good reason (and this isn't it, since Wowhead will have that data soon enough, and all of that data I parsed from the armory, and is included in 2.2.12 anyway).",
      "PostedDate": "2009-08-06T23:07:16.733-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Whilst its a decent idea it fails because the MMO-Champion DB has only got the item ids so there is nothing to search on to produce a list of possible upgrades. The only thing you could do is to trawl the entire database of 40k items which would take several hours to run. Thus it is not a viable thing to add to Rawr.\r\n\r\nWe can't even add it to the Edit Items | Add button as the page generated by mmo-champion is just a raw text lines of tooltip. Wowhead and the armoury have XML files that we can easily extract data from. MMO-Champion has none of this and I'm fairly sure Boubouille has no plans to add this to the database. Thus as Astrylian says we can just as easily take the data from the Armoury or wowhead when wowhead gets updated. Or you can manually add the items yourself its very easy to do and means you only need to add the items that interest you.\r\n\r\nTo Astrylian : Please note that the data noted on the armoury NOW was released today ie: after v2.2.12 went live. It may disappear later if Blizzard follow the pattern of patch 3.1 as the OP said.",
      "PostedDate": "2009-08-07T06:40:44.34-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Levva, example? ",
      "PostedDate": "2009-08-07T15:40:46.713-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Hi, I'm the dev behind Sigrie, the MMO-Champion database.\r\nJust a FYI, there is a JSON feed for every item/quest/itemset/etc. Just append /json to the url:\r\nhttp://db.mmo-champion.com/item/12345/json\r\n\r\nFor more info on urls, see the second post on here: http://www.mmo-champion.com/index.php?topic=96074.0\r\n\r\nFeel free to contact me if you guys need some special features, I'll be glad to give it some of my time. (This week I'll be away, but any time after that =P)\r\n\r\nAdys",
      "PostedDate": "2009-08-18T03:52:14.077-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Hey Adys. Thanks for stopping by; that certainly helps, and I think someone was working on the import process as well. Horde vs Alliance-only is the one big thing we're missing data for at the moment.",
      "PostedDate": "2009-08-18T09:17:55.587-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-09-17T11:53:47.44-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-11-30T05:23:55.377-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-04-18T11:08:03.17-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-07-02T14:56:04.157-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-07-02T15:01:13.427-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-07-02T15:30:15.387-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Well since there hasn't been any new development on this, I thought I would take a crack at this. I'll be trying to get in contact with Adys if I need anything.",
      "PostedDate": "2010-07-13T09:26:03.327-07:00",
      "Id": -2147483648
    },
    {
      "Message": "I was originally planning on working on a MMO-Champion item import feature since this seems to be a semi-common request. However, with the new information that MMO-C is being bought out by Curse, I'm putting that project on hold for the time being. I'm not sure at this time whether Curse is going to continue with MMO-Champion's database or if they will be integrating the MMO-Champion's database with WowDB (Curse's Database site). Until further information is given, I'm holding off on this project.",
      "PostedDate": "2010-07-20T12:20:46.233-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Hinalover,\r\n\r\nWe have full intentions to keep db.mmo-champion.com alive in its current format. Curse is here to help add more improvements.\r\n\r\nCheers",
      "PostedDate": "2010-07-20T19:15:09.643-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Adys, would it be possible to import spells (damage range, damage type, coefficients) from the mmo-db as well?",
      "PostedDate": "2010-09-18T14:25:06.327-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-11-22T19:55:44.693-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-11-22T19:59:02.92-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-02-06T19:29:40.743-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:33:47.11-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:24:57.483-07:00",
      "Id": -2147483648
    }
  ]
}