{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Mage",
      "DisplayName": "Rawr.Mage"
    },
    "ClosedComment": "",
    "ClosedDate": "2011-06-13T02:29:24.873-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "JC's iLvl 346 Figurine - Jeweled Serpent considered as BIS trinket for Fire Mage, even much higher than other iLvl372 ones.\nTried 10x thouroughness giving the same result.\nXML file attached below.",
    "LastUpdatedDate": "2013-05-16T05:17:50.47-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2011-05-31T08:38:00.843-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Mage] Figurine - Jeweled Serpent considered as BIS trinket",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 20889
  },
  "FileAttachments": [
    {
      "FileId": 4999,
      "FileName": "FirePVE_0530.xml",
      "DownloadUrl": ".\\4999"
    }
  ],
  "Comments": [
    {
      "Message": "You have to realize, that trinket is VERY GOOD. Not only are you getting an averaged out 237.5 SP from the On Use effect, but your also getting 285 Intellect, SP, and a little bit of crit. In addition that number is buffed by 5% because of Cloth specialization. So in reality, it's more of a 300 SP boost or a total of 536.75 value",
      "PostedDate": "2011-05-31T10:30:32.333-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Hinalover, I can't agree more with the fact that the trinket is VERY GOOD. But is it really THAT GOOD compared to other iLvl 372 trinkets, especially Bell of Enraging Resonance? Is it undoubtedly the BIS trinket for Fire Mage as for patch 4.1?",
      "PostedDate": "2011-05-31T10:55:34.93-07:00",
      "Id": -2147483648
    },
    {
      "Message": "I think this might actually be a valid concern. The way the solver optimizes the trinket is to use it with Combustion. I know that LB and Pyro part of Combustion are affected by the current spell power (so even if you use trinket after you put up the dots it'll increase Combustion damage). I'm not sure about the Ignite part. If Ignite part of Combustion isn't affected by current spell power that could be problematic in terms of modeling. You could use the trinket early to generate a stronger Ignite to then use with the Combustion. Some more information regarding this would be useful. One alternative would be to treat on use spell power effects as averaged for Combustion purposes. I'm not sure what would be better.",
      "PostedDate": "2011-05-31T13:30:00.083-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-06-13T02:29:24.873-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:24:53.48-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:17:50.47-07:00",
      "Id": -2147483648
    }
  ]
}