{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Base.ItemFilters",
      "DisplayName": "Rawr.Base.ItemFilters"
    },
    "ClosedComment": "The issue stated in the opening post has been fixed",
    "ClosedDate": "2010-07-02T14:12:55.18-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "Make a filter ENABLING gems.\n \nI can understand why you previously chose to make a JC (no-gem) filter, but now the only way to enable gems is either enabling \"other\" filter or creating your own filter. Creating your own filter is easy enough, but creating it every time a new version is release makes it a bit of an annoyance.",
    "LastUpdatedDate": "2013-05-16T05:21:19.607-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2010-03-23T08:57:09.387-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Feature Request.ItemFilters] Gem Filter",
    "Type": {
      "Name": "Feature",
      "Id": 1
    },
    "VoteCount": 1,
    "Id": 16929
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "You shouldn't really need to filter gems at all.\r\n\r\nThe model itself should take care of filtering out any gems who's stats aren't relevant to the model (such as Def and SP gems for melee). Every gem having modelled stats should be available via the custom gemming. It's possible the model is doing something wrong and isn't following filtersettings or options properly.  If this is the case, you should open an issue for that specifically (and mention which model you have a problem with).\r\n\r\nNormal gem availability on items should be handled via the gemming templates.\r\n\r\nIf you need to continuously change the gemming templates each version, then either you're doing it wrong, or you should open an issue for the model to provide a better set of default gemming templates.",
      "PostedDate": "2010-03-23T09:18:04.683-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Well, there are some models that enable weird gems in their templates (MP5 gems in Hunter? o.O), so I choose to manually enable gems for the optimizer instead of using the \"Consider gems in enabled gemming templates to be available\" option. (That, and I'm a control freak)\r\n\r\nThis hides all gems from the gem lists unless you make your own gem filter, which I do every time the filter list updates. Would be nice to not have to do that.",
      "PostedDate": "2010-03-23T09:51:02.947-07:00",
      "Id": -2147483648
    },
    {
      "Message": "That is not what he is talking about at all.   Currently, if you don't have the \"other\" filter checked, no gems show up at all.\r\nYou go gems=>red or whatever and nothing shows up at all.    So if you want to mark gems as available (or indeed equip a custom gemming) you have to go into the filters and tick the \"other\" box to be able to do it.\r\n\r\n",
      "PostedDate": "2010-03-23T15:14:59.01-07:00",
      "Id": -2147483648
    },
    {
      "Message": "The issue above seems to be a valid issue; gems should have a matching filter, and not require you to check 'Other'.\r\n\r\nHowever, I have to point out that you're 'doing it wrong', ZDBioHazard. For what you describe, you should definitely be just disabling the offending gemming templates, and leaving 'consider active hemming templates blah blah' on. ",
      "PostedDate": "2010-03-23T16:19:13.07-07:00",
      "Id": -2147483648
    },
    {
      "Message": "I would love to turn off the offending built-in gemming templates, but when I go to the gem template window, I can't tell which gems are which (I can't click on them and there is no tooltip). Might just be a Mono bug though.\r\n",
      "PostedDate": "2010-03-23T21:21:12-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Sounds very odd, yeah, that's Mono.",
      "PostedDate": "2010-03-23T22:26:02.447-07:00",
      "Id": -2147483648
    },
    {
      "Message": "ZBioHazard: \"Well, there are some models that enable weird gems in their templates (MP5 gems in Hunter? o.O), so I choose to manually enable gems for the optimizer instead of using the \"Consider gems in enabled gemming templates to be available\" option. (That, and I'm a control freak)\"\r\n\r\nIf you feel a model has unwanted default templates, or doesn't include some templates that are wanted. Then you should open an issue for that specifically. Don't forget to mention the specific model.\r\n",
      "PostedDate": "2010-03-24T08:37:03.623-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-04-18T10:26:45.533-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-07-02T13:56:47.473-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-07-02T14:12:55.18-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-03-17T19:19:11.37-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:29:11.44-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:21:19.607-07:00",
      "Id": -2147483648
    }
  ]
}