{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Tree",
      "DisplayName": "Rawr.Tree"
    },
    "ClosedComment": "Not a bug. ",
    "ClosedDate": "2011-05-14T14:01:43.167-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "Ok, I think this may be an issue with Rawr.Tree, and hope that more experienced people can clarify or explain it to me. I am aware that Rawr.Tree is only partially Cataclysm-ready, but it seemed good enough to also partially consult for the time being, and I wanted to understand how this apparent relationship came to be. I was doing some testing on Rawr for my Resto Druid, playing around with the talent points, and after coming to a fairly standard 8/0/33 spec (taking Genesis & Living Seed), just as I ditch Blessing of the Grove (as part of the testing) to take Malfurion's Gift x2, something—that looked strange to me—happened: suddenly Moonglow pops up in the talent order in the \"Individual Talents (Full)\" view. If I take Malfurion's Gift x2 off, Moonglow goes down again with all the talents with 0 value.\n \nWorth mentioning is that this does [not] happen in the \"Individual Talents\" view. I tried to find information on these two views: Individiuals Talents, and Individual Talents (Full) here on the site, but I couldn't.\n \nCan someone explain why Moonglow goes up the priority list of \"Individual Talents (Full)\" when Malfurion's Gift x2 is taken? Is this an issue with the current model? And why does this not happen with the other view, \"Individual Talents\"? What is the difference between both views?",
    "LastUpdatedDate": "2017-11-27T11:05:42.783-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2011-05-13T16:36:08.453-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Tree] A relationship between Moonglow & Malfurion's Gift?",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 20760
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "I take the part about the different behavior in \"Individual Talents\" back! Actually, after adding the standard glyphs, the behavior of both views, the \"Full\" and the Individual Talents, is the same: when I add Malfurion's Gift x2, Moonglow goes up the priority list significantly. So yes, with glyphs, this now happens in both views.",
      "PostedDate": "2011-05-13T16:45:57.423-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Moonglow reduces mana cost of spells, thus if you are mana limited (which should be the case unless your using a very short fight duration) adding that allows more spells to cast/swap more nourish casts for HTs.\r\nMalfurion gives Omen procs, which gives free casts (i.e. saves mana).  Malfurion now also affects cooldown of tranquility, which gets recast on cooldown, thus affecting time remaining to cast other spells.\r\nSince both affect mana it is expected that they will interact:\r\nOne gear+buff combo I tried actually showed no interaction.\r\nIf each gives mana for a half a HT wasted at the end of the fight, picking up both will allow that HT, thus giving an increase to picking the second one.\r\nIf choosing both will push you to being timelimited instead of mana limited, the value might drop or even go down to 0.\r\n\r\nSustained rotation modelling isn't perfect yet and the single target rating can effectively be ignored, but I don't see the reported behaviour as necessarily indicating a bug. \r\nCurrently evaluating Ultis's rewrite of a large part of Tree, which might change things significantly.\r\nIf you still believe the current behaviour might indicate a bug, please attach an xml character file, to allow us to see exactly what happens in your specific scenario.",
      "PostedDate": "2011-05-14T11:04:50.26-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-05-14T11:05:25.41-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Thank you very much for clarifying all this, Wildebees. It took me a few minutes to absorb it, as I'm not a theorycrafter. However, the part that was clear and made perfect sense to me to justify a direct relationship was about Malfurion's Gift reducing the cooldown of Tranquility! Indeed, if I'm going to be casting Tranquility more often, then a talent that reduces its mana cost should surely pop up in the priority ladder. So this is definitely not a bug, but normal behavior. Thank you again.",
      "PostedDate": "2011-05-14T13:25:41.54-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-05-14T14:01:43.167-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-05-20T23:09:45.937-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:25:02.433-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:17:58.193-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2017-11-27T11:05:42.783-08:00",
      "Id": -2147483648
    }
  ]
}