{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Base.ItemFilters",
      "DisplayName": "Rawr.Base.ItemFilters"
    },
    "ClosedComment": "duplicate to other issue, posting this there",
    "ClosedDate": "2009-10-12T11:06:55.98-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "We are missing valuable resource information.\n \nI propose a slight change in the source handling.\n \nWith two sources available, why not use them both at the same time? This may require adding separate variables for Wowhead and Armory, but the information from both will eliminate a lot of the filtering problems.\nAlso the benefit of having both sources at the same time would be that items that are actually available in more then one place will now be filtered accordingly.\nAs for hovering over an item, you would then have two location information instead of just the one or the other.\n \nAnother problem is the NULL variables. We can not filter for NULL, not without causing other problems, so if the location information returns a NULL value, can you fill it with \"NULL\" or \"No Data\" or something? If not this information will just fall down into the \"Other\" tab. Of-course if both resources are being used together, the number of items that would have a NULL value from BOTH sources would be minimal.\n \nSo now comes the question of how to filter for two sources instead of just one? Truthfully, it will depend on how the sources are put together, or whether or not they can be sorted individually. This part I am not sure of, however I am sure someone can come up with an answer.",
    "LastUpdatedDate": "2013-05-16T05:23:57.54-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2009-10-08T09:17:33.81-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[ItemFilters] Source Handling",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 2,
    "Id": 14377
  },
  "FileAttachments": [],
  "Comments": []
}