{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.TankDK",
      "DisplayName": "Rawr.TankDK"
    },
    "ClosedComment": "",
    "ClosedDate": "2010-09-08T17:31:38.87-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "Rawr shows me that Ability Food and Expertise Food are significantly better than Strength Food as a DK Tank.\n \nThe Agility Food shows more Survival benefit than any of the other +40 Stam foods (all of which show equal Survival benefit from the +Stam), which I can't understand. Either that is a mistake or I am missing something. My understanding is that Health and Armor are the two factors in deciding Effective Health, or Survival. If you are including bleed and magic reductions, then I still do not see where Agility comes into play.\n \nExpertise also shows a large Mitigation benefit, but my understanding is that this only applies to a Boss that has parry-haste enabled, which for ICC is only Lady Deathwhisper and Sindragosa. In ToC only 3 of the 4 Monster Menagerie have parry-haste enabled (Acidmaw, Dreadscale, and Gorehowl). Halion is still unknown. Does it make sense to list Expertise as better than Strength when only 5 of the current \"end game\" bosses are known to have parry-haste?\n \nSo... Which is the best tanking food? If Expertise has Mitigation only w/ a parry-haste Boss, would that mean Agility is still better than Strength? It would be good to be able to see/figure it out from the Food Buff charts.\n \nSteps to Reproduce:\n(1) Load DK Tank\n(2) Go to Buffs => Food\n(3) Observe food rankings.\n \nAdditional Information:\n(1) Mac OS (10.6.4)\n(2) Rawr v.b3.0.3.21\n(3) Toon is Wyntyr on Sisters of Elune\n \nThank you, by the way, for all your good work. I certainly appreciate being able to have a tool like Rawr!",
    "LastUpdatedDate": "2017-11-27T11:04:43.277-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2010-08-19T15:22:08.813-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[TankDK] Food Buffs giving unexpected results",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 18523
  },
  "FileAttachments": [
    {
      "FileId": 3900,
      "FileName": "TankDKWyntyr.xml",
      "DownloadUrl": ".\\3900"
    }
  ],
  "Comments": [
    {
      "Message": "I see that in the \"Stat Values => Relative Stat Values\" the exact same effect appears: Agility gives Survival, Mitigation, and Threat, and Expertise gives Mitigation and Threat. I assume now that I am missing something, and this probably should have been posted in one of the various forums. My apologies if that is the case.",
      "PostedDate": "2010-08-19T15:29:01.9-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-08-19T17:28:08.823-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Some things to keep in mind:\r\nFirst Agi v Sta:  This is entirely dependent upon where you sit in your gearing, also the weight of Survival v Mitigation.  Agi does provide all 3: Survival & Mitigation by increasing armor which plays a part in both.  Mitigation by increasing dodge.  Threat by increasing crit and dodge (Rune Strike chance).  Stam only provides health at this stage of the game, so it's possible that something like armor may provide you more benefit than just adding to your HP pool.  In general, your gear will and should have lots of stamina on it.  Then next agi can help quite a bit.  If you are pushing in a specific direction, you can sort by that sub value (Survival, Mitigation, threat) and then if you feel you are short in one area, you can start weighting the other sub value(s) more.  Having 100k HP doesn't help if your avoidance/mitigation is only at 10 %.  As per the tool-tip for the 3 sub values: you only want Enough Survival and Enough Threat.  Stacking Threat doesn't help if you're out threating the rest of your dps.  It's really only a concern if you are loosing threat to the dps on a boss.  Likewise, you don't want to be 2 or 3 shot with a string of big shots that weren't avoided.  \r\n\r\nAs you say, expertise helps mitigation only on bosses that parry-haste.  Unfortunately, I don't have the Rawr3 UI fully fleshed out in the same way as Rawr 2 where this a switch to enable parry-haste.  In Rawr 3, I'll be plugging into the boss-handler stuff, but that's not fully hooked up yet.  However, have faith that parry-haste/expertise is implemented reasonably well in the engine, and we're just limited by the state of Rawr3 at the moment.\r\n\r\nFor more information on how I handle each of the sub values see the wiki: http://rawr.codeplex.com/wikipage?title=TankingForumulas&referringTitle=Rawr.TankDK",
      "PostedDate": "2010-08-19T18:18:19.037-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-09-08T17:31:38.87-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-05-20T23:39:00.11-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:27:41.09-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:20:04.377-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2017-11-27T11:04:43.277-08:00",
      "Id": -2147483648
    }
  ]
}