{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.DPSWarr",
      "DisplayName": "Rawr.DPSWarr"
    },
    "ClosedComment": "Please check patch notes, instructions and previous discussions&#47;issues before creating duplicate issues.",
    "ClosedDate": "2009-08-17T07:05:44.747-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "I've noticed with the last 2 versions of Rawr that whenever I clicked on Leader of the Pack or Rampage under Buffs, nothing happened. It would also un-check itself whenever I reloaded that Profile.\n \nI started messing around with it and realized that if I unchecked having the Rampage talent, I could then Check either the LotP buff or the Rampage buff to finally get the 5% crit to take affect.\n \nI believe it must be a problem with the coding of the Rampage talent and not the Buffs because I have no problem selecting the buffs on any other classes I click it for.",
    "LastUpdatedDate": "2013-05-16T05:24:47.723-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2009-08-17T00:22:33.507-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[DPSWarr.Fury] Rampage Talent not meshing with LotP/Rampage Buff",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 13899
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "While you hinted at it, please say which model you are working with.\r\n\r\nThis is not a bug , but a feature.  Please read the DPSWarr changelog (Options > Instruction > Version Notes).  If YOU are providing the buff/debuff, then the options panel will remove the Buffs panel checkmark.  Fear not, you are still getting the benefit of the buff.\r\n\r\nAnd please, do a search on issues before posting them.  This is getting pretty old.",
      "PostedDate": "2009-08-17T01:49:46.817-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-08-17T07:05:44.747-07:00",
      "Id": -2147483648
    },
    {
      "Message": "The two versions I was referring to were v2.2.13 and .12. The way you are describing it is the way it should work yes. I wouldn't waste anyone's time if it was as simple as the Rampage Buff unchecking itself when I had the Rampage Talent selected with no dps change. The problem, that I was trying to describe, is that the Rampage Talent is doing nothing. With LotP/Rampage Buffs unchecked and Rampage Talent unchecked, with your response I would assume by clicking the Rampage Talent, that I would get the 5% Crit, yes? Well I don't. That in itself might not necessarily be a huge issue because you could just say that someone else is supplying the buff. The fact that when you have the Rampage Talent checked (nothing happens) AND when you check one of the two buffs and you still don't get the 5% Crit.\r\n\r\nI apologize for not posting all of that in the original message. I realize you must go through many many Issues with something that has already been mentioned. I had used the search, and I had read the notes about the changes to the talents/buffs from version .11.\r\n\r\nI'm just hoping this gets looked at again. Thank you if you do look at it again.",
      "PostedDate": "2009-08-17T11:43:35.483-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-09-08T16:41:47.643-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:33:33.913-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:24:47.723-07:00",
      "Id": -2147483648
    }
  ]
}