{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Hunter",
      "DisplayName": "Rawr.Hunter"
    },
    "ClosedComment": "http&#58;&#47;&#47;rawr.codeplex.com&#47;WorkItem&#47;View.aspx&#63;WorkItemId&#61;16601",
    "ClosedDate": "2010-03-03T09:48:49.037-08:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "The shot rotation must be changed or here come the Haste gems on the gear. When changing Priority 1 from Rapid Fire to Kill Shot the change is practically ignored. Shown by 1) The Haste gems still showing top dps overall in the right pane when \"Slot Gems, Yellow\" are selected. 2) When Optomizing. Haste gems all over the gear with very little agility. Also humerous to note that Rawr is applying these haste gems and seeing the Optomized score is much less then the current score and asking if I wish to use the \"Optimized\" configuration. Obviously think it's better to keep the current score. \n \nThe default Hunter Survival shot priority is always defaulted with Priority 1: Rapid Fire. (Only 15 sec buff with a CD of 5 minutes, big whoop.) Would be nice if this was defaulted to kill shot which always has priority 1 for Survival) \n \nThe Pet skill priority is not changing when changing your Armory Pet under the \"Pet Talents\" Tab. The Pet skill priority sticks with a cat so if a wolf is selected this must be manually changed. Also the points in the Pet talents changing incorrectly. More talent points are added instead of removing points from some talents and moving them to others or a talent is totally ignored. For me Cobra Reflexes was totally ignored. Saved a custom configuration and going from one spec and returning to the saved custom did not help. \n \nAlso interesting to note that the Terrorshaft Arrow is being picked over the Saronite Arrow when optomizing whcih obviously has higher dps. \n \nJust a suggestion but the Hunter Shot rotation cleaning went a bit overboard. \n \nReally I like this product and highly recommend it to others. I know this is all volunteer work you are doing and would like to give you all a pat on the back. Spread sheets are not fun and Rawr is. If I knew where to learn the code you are using I'd do so to help you out.",
    "LastUpdatedDate": "2013-05-16T05:21:36.62-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2010-03-03T02:40:00.787-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Hunter] Shot Priority and Pet Skill Priority ignored in latest build",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 16624
  },
  "FileAttachments": [],
  "Comments": []
}