{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "This was implemented some time ago with Filters and SubFilters that sort down to the instance &#40;and even to the individual boss with some filters&#41;",
    "ClosedDate": "2009-08-19T13:40:16.537-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "An interesting feature would be to be able to get a list of potential upgrades you could get from a particular instance.\n \nIf you're joining a group/raid for that instance, you can then see which bosses will drop which potential upgrades.",
    "LastUpdatedDate": "2013-05-16T05:25:47.887-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2009-04-18T15:42:49.81-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "Upgrades by instance",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 2,
    "Id": 13045
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "This is handled by filters.",
      "PostedDate": "2009-04-18T15:51:50.07-07:00",
      "Id": -2147483648
    },
    {
      "Message": "I think what he is getting at is perhaps a filter setting. Like just show what you want out of ulduar 10, or naxx 25, much like how you can filter out profesion upgrades and BC items. Sometimes a large list can be overwhelming, especially when you only do some of the instances that have upgrades. So perhaps more freedom to limit the upgrade lists would be nice.",
      "PostedDate": "2009-04-20T10:19:24.747-07:00",
      "Id": -2147483648
    },
    {
      "Message": "I believe he wants the program to actually generate a checklist, sorted by instance, of upgrades, and what bosses they drop from.  To be honest though, this would be a downgrade from the current system because you won't be able to simply go after the biggest upgrade (within your reach) and ignore the other, lesser ones.",
      "PostedDate": "2009-04-21T19:19:20.95-07:00",
      "Id": -2147483648
    },
    {
      "Message": "And still, Filters *do* solve that need.",
      "PostedDate": "2009-04-21T22:55:45.76-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Filters solve that need... indeed.\r\n\r\nIn the same way that Notepad is the answer to \"I need some editor to create a multipage e-commerce website\".  You can sort of use filters it for what I have in mind, but it's a bit of a cludge.\r\n\r\nIt's more a feature for people that go raiding in pugs where you can't save some sort of DKP to get that uber item from the last boss but where you sort of \"roll for whatever is an upgrade to what you have\" rather than \"what do I need to save my dkp for\".\r\n\r\nselect the instance, get a list of bosses with for each boss which potential upgrades he drops.\r\nif you get the choice to go to one or another instance you can even see which instanc ewill offer you the best or biggest chance at upgrades.",
      "PostedDate": "2009-04-23T11:08:56.057-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-05-19T21:19:16.55-07:00",
      "Id": -2147483648
    },
    {
      "Message": "...what?\r\n\r\nI'm confused, can you explain yourself better? What is your issue?",
      "PostedDate": "2009-05-20T09:23:07.89-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-08-19T13:40:16.537-07:00",
      "Id": -2147483648
    },
    {
      "Message": "I understand that the people who develop Rawr see this as an easy problem that's been solved already. But it's certainly not an easy and intuitively user-friendly feature for beginners. Only reason I found out about it was due to searching first when I was intending to put in a Feature Request for it.\r\n\r\nRecommendation would be to just enable a drop-down menu for Source:\r\nAll\r\nArena\r\nHonor\r\n25p hard/heroic\r\n25p\r\n10p hard/heroic\r\n10p\r\n5p heroic\r\n5p\r\n\r\nand/or go as far as individual instance so you could see EASILY AND AT A GLANCE with just one or two button-presses that was blatantly obvious, all the gear in your upgrades list that was in instance X that you were about to do.",
      "PostedDate": "2009-11-11T20:02:39.677-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Ok, nvm. Found the filter listed by tier.",
      "PostedDate": "2009-11-11T20:34:29.047-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:34:47.567-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:25:47.887-07:00",
      "Id": -2147483648
    }
  ]
}