{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Base.ItemFilters",
      "DisplayName": "Rawr.Base.ItemFilters"
    },
    "ClosedComment": "",
    "ClosedDate": "2010-12-17T14:15:58.09-08:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "Hello, I tried searching the issue tracker and did not find anything related to this issue.\n \nI'm on windows 7, have silverlight 4, and everything \"as far as I know\" seems to be updated. I've tried the offline and online version of Rarw4 and cant get it to work.\n \nPROBLEM: The Filter is only showing certain items and I can't update the item cache.\nUnder the \"Filter by Item Type\" it is only possible (the rest are greyed out) to select Leather, Staff, Polearm, 2H Mace, Off-Hand-Misc., Ranged-Relic. Everything else is greyed out, so I thought I needed to update the cache. I've tried all the reset options, and redownload options availalbe, rarw4 reloads, but I still get the same filter problem.\n \nAny thoughts?",
    "LastUpdatedDate": "2013-05-16T05:19:35.87-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2010-12-17T10:39:18.34-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[ItemFilters] Cache & Filter not functioning",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 19326
  },
  "FileAttachments": [
    {
      "FileId": 4226,
      "FileName": "rawr_error_filter.JPG",
      "DownloadUrl": ".\\4226"
    }
  ],
  "Comments": [
    {
      "Message": "1) Why can't you update the item cache? What exactly are you doing (or are unable to d) that makes you say that?\r\n2) What items are you expecting to show up?\r\n3) What were you expecting to be able to select in Filter By Item Type?\r\n4) What model is this for?",
      "PostedDate": "2010-12-17T11:29:12.71-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-12-17T11:53:10.073-08:00",
      "Id": -2147483648
    },
    {
      "Message": "OK, I'll try to give more information, thanks for asking - you gave me more to work with :)\r\n\r\nOnline version\r\n1.\r\n1) Opened up RAWR 4.x from elitistjerks.com. It loads, and I see the welcome screen. I click OK.\r\n2) Immediately, I click on FILTERS in the item list (top left), I then select \"Filter by Item Type\" and I see only [Leather, Staff, Polearm, 2H Mace, Off-Hand-Misc., Ranged-Relic] checked off and the rest are all greyed out. I've attached a screen shot of this. I've tried to UNCHECK them, and when I do so, they become unchecked, but they are the only ones that I can possibly re-check. The rest are greyed-out and unaccessible.\r\n3) From reading other posts, I figured it must be because my item cache is corrupt/not working/not up to date. So I go to Options --> Reset Item Cache -->\"Are You sure\" --> Yes --> Rawr reloads with the same problem as #2.\r\n4) #3 didn't fix my problem, so I tried Options-->Reset ALL Caches-->\"Warning, Are You Sure?\"-->Yes-->Rawr reloads with same problem in #2.\r\n\r\n2. I was expecting plate items to show up - I thought that perhaps since this was beta, it might be limited and only functioning with those set filters selected, but I didn't see any post or comment related, therefore I assumed it was a bug.\r\n\r\n3. I was expecting the filters to be accessible. Meaning, instead of only 7, to be able to check and uncheck all 22 categories. (Unless of course this has been disabled for the Beta and I didn't realize it)\r\n\r\n4. What model is this for ? Errr... I'm not sure what model you mean. The browser Rawr says version Rawr  b4.0.10.0 if that helps.",
      "PostedDate": "2010-12-17T11:53:11.33-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Those checkboxes are specifically limited by the model. You wouldn't check Plate for a Druid.\r\n\r\nBefore going to the filters, try changing the model drop-down to whatever model you are looking for. It defaults to Druid > Bear. I'm guessing you want a DK, Warrior or Paladin",
      "PostedDate": "2010-12-17T13:00:03.3-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Well darn, if it was that simple - I'm a nub !",
      "PostedDate": "2010-12-17T13:56:26.127-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-12-17T14:15:58.09-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-03-17T18:56:24.437-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:27:07.363-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:19:35.87-07:00",
      "Id": -2147483648
    }
  ]
}