{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "",
    "ClosedDate": "2012-10-20T19:54:23.07-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "Hi, I thought I already raised an issue but I can't find it so maybe not.  I get differences between gear shown as higher on usual character import screen from rawr wow addon to gear in the optimiser.  I am not at all teccie and I can't understand why this would be.  I have valor points to spend and I am really not sure what is best.  Would be most grateful for some help.   I attach a screen showing head item, with optimiser upgrade screen over the top of the character screen",
    "LastUpdatedDate": "2013-05-16T05:17:03.543-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2012-02-17T03:37:19.97-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "character gear\\optimiser difference",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 22242
  },
  "FileAttachments": [
    {
      "FileId": 5651,
      "FileName": "rawr charac and optimiser comparison.JPG",
      "DownloadUrl": ".\\5651"
    }
  ],
  "Comments": [
    {
      "Message": "sorry, i see my other attempts to raise an issue now, but I don't know how to get rid of the extras, apologies",
      "PostedDate": "2012-02-17T03:40:26.707-08:00",
      "Id": -2147483648
    },
    {
      "Message": "I'm not exactly sure what you think is wrong, can you explain more in detail what is your problem? Nothing on the screenshot seems strange to me.\r\n\r\nIn any case I would suggest you read the help topic on optimization: http://rawr.codeplex.com/wikipage?title=GearOptimization",
      "PostedDate": "2012-02-17T10:47:07.95-08:00",
      "Id": -2147483648
    },
    {
      "Message": "In the screenshot, please see Hood of Hidden Flesh.  I was trying to determine whether to spend VPs on this or not.  You can see that on the character screen it is shown beneath the equipped Time Lords Hood, on the inset upgrades screen it is shown as higher than the equipped item.  So in one place it seems an upgrade, in another it doesn't. Sorry if I am being dense.  I don't really understand this.  Does this mean that looking at the character screen is not in fact any good for telling if an item is an upgrade or not.  If this is so can you also please tell a non-teccie how I save upgrade file so I can actually view it?  I've saved the upgrade file previously but it is not in a readable form when I try to re-open it. Many thanks for your help",
      "PostedDate": "2012-02-18T00:43:20.24-08:00",
      "Id": -2147483648
    },
    {
      "Message": "The charts on the main screen show direct upgrades. That is, how does the value change if you directly swap just that piece of gear. Upgrade list shows you how much value you could get from that piece if you had the freedom to change all the other stuff around to maximize the effect of that piece.\r\n\r\nDoes this mean that the charts on main screen are useless. Not quite, you just have to understand what they represent. Also if something doesn't show on the upgrade list that doesn't necessarily mean that it's totally useless. The limitation there is that it only looks at adding one piece of gear at a time, but that gear might suddenly get more value if you also got another piece of gear.\r\n\r\nI would say both are useful in their own way, but neither completely absolves you from using your own head.\r\n\r\nRegarding saving the upgrade list. You're supposed to view it in that chart, if you saved it and would like to reopen it then in the main window menu you have the option to load a saved upgrade list in the file menu. If you need it in some other format you have the export menu in the upgrade list itself.\r\n\r\nLet me know if this helps.",
      "PostedDate": "2012-02-18T10:09:19.147-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2012-10-20T19:54:23.07-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:23:46.747-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:17:03.543-07:00",
      "Id": -2147483648
    }
  ]
}