{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Warlock",
      "DisplayName": "Rawr.Warlock"
    },
    "ClosedComment": "No longer a known issue in 2.3.14.",
    "ClosedDate": "2010-04-11T20:24:03.797-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "I think that there is a trouble with the haste. A member of my guild gains 136 DPS on changing his wrist gem 23sp to 20haste Oo\n \nImpossible isn't it?",
    "LastUpdatedDate": "2013-05-16T05:24:18.133-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Medium",
      "Severity": 100,
      "Id": 2
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2009-09-17T04:25:36.443-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Warlock] Haste Issues",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 8,
    "Id": 14179
  },
  "FileAttachments": [
    {
      "FileId": 2232,
      "FileName": "Keewii.xml",
      "DownloadUrl": ".\\2232"
    },
    {
      "FileId": 2269,
      "FileName": "Lucifel affliction 2.xml",
      "DownloadUrl": ".\\2269"
    },
    {
      "FileId": 2417,
      "FileName": "iso-2009-10-22-raid-optimized-with-legs.xml",
      "DownloadUrl": ".\\2417"
    }
  ],
  "Comments": [
    {
      "Message": "For future reference, please post a little more information when creating an issue.  For example, this is in the Warlock module.  Thank you for posting the xml file, though.",
      "PostedDate": "2009-09-17T04:55:52.76-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-09-17T04:56:41.06-07:00",
      "Id": -2147483648
    },
    {
      "Message": "mhmm...Okay but i have posted in the warlock Area Isn't it ?",
      "PostedDate": "2009-09-17T06:27:14.56-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-09-17T10:25:58.247-07:00",
      "Id": -2147483648
    },
    {
      "Message": "I understand that warlock is still mostly a work in progress, and as a warlock I want to say I GREATLY appreciate all the difficult and arduous work and coding that has gone into Rawr as a project. It's a great help in todays WoW environment. That said there does seem to still be some lingering warlock issues. Stats not being accurate to my character, strange suggestions in the optimizer, stat values being listed at negative numbers... Rawr is currently telling me to avoid haste like the plague as it's actually valued at -88.87, and equipping it via any means, buff or stat or gem, causes my DPS to DROP. Very strange indeed. However most everything else is working fantastically, keep up the amazing work everyone.",
      "PostedDate": "2009-09-17T23:36:24.833-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-09-18T10:55:37.1-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Heroes' Plagueheart Circlet [200] has a value of 371.77 DPS.\r\nGul'dan's Hood of Triumph [258] has a value of 337.65 DPS.\r\nNemesis Skullcap [245] has a value of 302.03 DPS.\r\n\r\nThis looks like it's also related to haste being weird.",
      "PostedDate": "2009-09-26T23:13:20.193-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-09-26T23:13:21.937-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Nope, it's because you don't have the bonus 4P with Gul'dan's Hood of Triumph [258] and you have the bonus 2P with Heroes' Plagueheart Circlet [200] ;)",
      "PostedDate": "2009-09-27T06:07:18.793-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Nope, plumeseck, I tested with 4 pieces of plagueheart NOT counting the helm. (All 5 pieces Plagueheart, VS 4 + Gul'dan's or Nemesis.)\r\nBesides, even without Fel Armor or Glyph of Lifetap, making spirit (and the 4p PH bonus) useless, it still shows as higher value.\r\nNice try, though. That was my first thought too.\r\nCheck out the Lucifel xml to see for yourself.",
      "PostedDate": "2009-09-27T13:34:20.473-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Rebuilt the profile from scratch and it seems to be giving more accurate values now... but what caused it to freak in the first place?",
      "PostedDate": "2009-09-27T13:49:37.323-07:00",
      "Id": -2147483648
    },
    {
      "Message": "...aaand it took less than a minute for the new one to break and give NEGATIVE values for a bunch of gear.",
      "PostedDate": "2009-09-27T14:01:41.817-07:00",
      "Id": -2147483648
    },
    {
      "Message": "The Moral of the Story is: WE KNOW it's broken with Haste as well as some other scenarios (Life Tap) and we can easily replicate this issue on our end and our Warlock Devs are working on it. UNTIL then, additional specific items, etc doesn't really help so much as an extra character file for them to check with.",
      "PostedDate": "2009-09-27T14:09:22.53-07:00",
      "Id": -2147483648
    },
    {
      "Message": "I apologize for opening a new issue on this yesterday.  I didnt realize it was a long open issue and I had not looked all the way back in time.\r\n\r\nIn 2.2.24 (the attached xml file runs in that), i have the same issues with negative haste values.  As the xml stands right now the relative stats portion shows haste weighted at 1.62.  This is a reasonable value.  Now we all know that haste > crit.  The optimization that Rawr! performed to generate this xml file put a 12SP/10 crit gem in my pants instead of the 12SP/10 haste gem. \r\n\r\nUpon seeing that I added the same pants i am wearing now, but replaced the 12SP/10crit gem with a 12SP/10haste gem.  If you do that and equip the pants, then the relative haste weighting goes to 24.60 and crtie goes to .73.  I WISH haste had that high or a weighting...  Anyway, I hope this xml file helps you isolate the issue.\r\n\r\nI agree with MoneyLoo...  Thanks for the work.\r\n\r\nTo the OP:  yes, it is possible to get to a point where a 20 haste gem is worth more than a 23 SP gem.  If you look at my attached xml file, haste is rated at 1.62 and SP is rated at 1.40.  20*1.62 = 32.40.  23 *1.40= 32.20.\r\n\r\nAlso, the extra haste may have put him at a haste level where his rotation works better and he is able to cast the DPCT spells instead of having to fill.\r\n\r\nJothay - I have attached my xml file.  I hope my description points you guys in a good direction.  I did not describe the other issues I see in that file because you said they were irrelavent.",
      "PostedDate": "2009-10-28T07:35:37.827-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-10-28T07:35:41.37-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-10-28T07:37:19.17-07:00",
      "Id": -2147483648
    },
    {
      "Message": "/facepalm\r\n\r\nI thought we had cleared that up? 1.62 isn't a stat weight, it's what the next point of Haste would have given you and that 1.62 will change for 2 points, much more for 20. Haste has a VERY spikey nature, we're working to implement a new Graph system for Rawr3 to sure users how Haste's value changes as you go up and down in Rating.",
      "PostedDate": "2009-10-28T10:29:44.133-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Sounds like I should have just attached my xml file with a, \"haste has negative values in there\" comment instead of trying to analyze it.  Thanks for the explanation, I now understand the Relative Stats display better.  I still hope the xml file helps the Devs out.",
      "PostedDate": "2009-10-28T13:33:54.017-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-12-10T16:02:13.363-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-12-14T02:46:17.903-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-12-22T14:36:14.727-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-12-30T12:02:34.46-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-01-19T12:22:11.223-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-04-11T20:24:03.797-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:32:58.8-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:24:18.133-07:00",
      "Id": -2147483648
    }
  ]
}