{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Hunter",
      "DisplayName": "Rawr.Hunter"
    },
    "ClosedComment": "That&#39;s as far as this is gonna go",
    "ClosedDate": "2010-09-09T14:07:04.967-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "It would be great to save at least \"Pet Talents\" and \"Rotations\" to the saved Talents.  Swapping to a different talent set almost always requires a new rotation and often a different pet.\n \nThere's also an argument for putting Buffs and Pet Buffs under this, but that one's debateable.",
    "LastUpdatedDate": "2013-05-16T05:24:09.31-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2009-09-24T15:48:40.68-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Hunter] Tie Pet Talents and Rotations to Saved Talents",
    "Type": {
      "Name": "Task",
      "Id": 2
    },
    "VoteCount": 1,
    "Id": 14260
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "I have a new direction I want to take this: Basically, instead of setting up the priority queue yourself like you do now, you just turn abilities on/off and we'll calculate the optimal rotation/priorities for you. I'm also gonna toss the Pet ability selector completely, the abilities the Pet has are what you will use anyways so this section is unnecessary. Then I won't need to try and tie rotations into the Talents.\r\n\r\nThis still leaves the question of saving Pet Talents to the Primary Talents, which isn't physically possible right now, nor do I think it will ever be. Instead, I'm gonna make a preset menu like you see in the Player Talents so you can quickly swap groups, limited by the pet type (Ferocity, etc).",
      "PostedDate": "2009-12-27T17:37:00.807-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Thank you for your continued efforts!  I've also wanted the rotation and pet talents saved with the talents (the spreadsheet saves the rotation, though not the pet, as I recall). Retaining the ability to manually specify a priority is important to enable playing with factors that Rawr cannot be aware of (e.g., multi-shot might be more dps but I'm moving too much, or I've been asked to keep the Aimed Shot debuff up for the ToC pvp fight).  Providing more control over timing (e.g., how much delay to align with cooldowns) would be marvelous.  Also note that the current sets don't include Blood Fury and the like, so focusing on pre-specified sets can reduce the accuracy a lot (though I like having sets to start from).\r\n\r\nAn additional wrinkle for pet talents is taking account of the extra points for exotic beast master.  Those make a big difference. I can also imagine that the optimal allocation of the normal 16 points might actually depend on gear.\r\n\r\nIncidentally, I had a file for which changing the rotation from the drop down list had no impact; e.g., I switched to MM rotation and it kept bestial wrath (it didn't change the priority list at all). I haven't been able to repro it so I haven't filed a bug.",
      "PostedDate": "2009-12-31T13:26:34.507-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Some of what you mentioned will be getting handled when we switch to Rawr3, where the full BossHandler will be in effect for all models. Movement, stuns, etc. will be handled. I'm also going to be making options for things you have to maintain (like in DPSWarr, you might have to maintain Sunder Stacks)",
      "PostedDate": "2009-12-31T13:50:15.25-08:00",
      "Id": -2147483648
    },
    {
      "Message": "With the new Armory Pets code, we are closer to this position",
      "PostedDate": "2010-02-01T16:14:44.15-08:00",
      "Id": -2147483648
    },
    {
      "Message": "I've got it now using the cookie cutters when doing major spec changes (going from MM to BM, etc).",
      "PostedDate": "2010-02-05T19:37:31.043-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-04-18T07:56:43.613-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-07-02T15:49:25.397-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-07-06T20:40:23.247-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-09-09T14:07:04.967-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:32:45.997-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:24:09.31-07:00",
      "Id": -2147483648
    }
  ]
}