{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Base.LoadCharacter",
      "DisplayName": "Rawr.Base.LoadCharacter"
    },
    "ClosedComment": "",
    "ClosedDate": "2010-02-22T13:09:04.72-08:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "I have used Rawr for a long time with no issues.  It is great and I sadly miss using it at the moment.  I can't use it because I keep getting the following error message,\nStep = Get Character\nDetail = No character returned form the Armory.\nI have read through all 185 posts on this Issue Tracker and have searched on Google but cannot find the resolution.  There are old posts from a couple of years ago but all the replies say this has been corrected in the recent version.  Unfortunately, that is two years ago.  \nPlease, please, please can somebody tell me why this happening?  I have used Rawr without this issue for so long.\nI am running Windows XP and use Firefox.  I am on a home PC and am running the latest Rawr.  I have also tried older versions which 'used' to work.  Something has changed but I cannot find out what.\nI appreciate your time reading this and hope someone nice out there can help me.  Thanks, DtM",
    "LastUpdatedDate": "2013-05-16T05:23:26.027-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2009-11-12T11:24:23.21-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[LoadCharacter] No Character Returned From Armory",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 2,
    "Id": 14781
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Uhh it's been answered several times, the last of the stesp being \"try again later\"\r\n\r\nBut you can still use the program without the Armory, just build out your character manually instead of loading from Armory. It's also better to not just load your character every time you use the program, save the file and make changes as you get changes in game.",
      "PostedDate": "2009-11-12T12:36:49.23-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Hi Jothay - Sorry I could not find the answer before.  Thanks for answering my question.  I will open an old saved char and manually input the new items I have.  Thanks again.  Maybe the Issue Tracker should have stickied topics so it's easier to find answers and repetitions are eliminated.  :)",
      "PostedDate": "2009-11-13T08:44:11.22-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Codeplex.com is limited in how things can be set up. There is no 'sticky' function in the Discussions or Issue Tracker",
      "PostedDate": "2009-11-13T11:31:04.867-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-11-13T11:50:58.923-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-11-15T16:41:08.74-08:00",
      "Id": -2147483648
    },
    {
      "Message": "I have just tried Rawr for the first time And cannot load any toons at all from the armoy can someone please help?",
      "PostedDate": "2009-11-15T16:43:41.717-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Please note that over the last week or so the armoury has been down a lot. We suspect this is due to Blizzard getting the site ready for the new patch 3.3 items and perhaps some more new armoury features. If you are getting a message \"No character returned form the Armory\" Please actually take the time to check that the armoury is working before you complain.",
      "PostedDate": "2009-11-16T05:47:12.82-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-01-04T09:19:37.487-08:00",
      "Id": -2147483648
    },
    {
      "Message": "terribly sorry for kind of necro'ing this topic, but i also have this problem with Rawr v2.3.5. i cannot load any character from armory. i've tried my paladin, my DK, Kungen (from Ensidia) and 2 different US characters from different servers. i have checked all 5 of the armory pages. they are all available. it is also a bit further from patch 3.3, so it should not give problems.",
      "PostedDate": "2010-01-05T07:49:04.223-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-02-22T13:09:04.72-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-09-09T15:44:00.157-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:31:51.22-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:23:26.027-07:00",
      "Id": -2147483648
    }
  ]
}