{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Rogue",
      "DisplayName": "Rawr.Rogue"
    },
    "ClosedComment": "",
    "ClosedDate": null,
    "CommentCount": 0,
    "Custom": null,
    "Description": "In the past, when there's a \"problem\" with Rawr results, I've found it's usually operator error.  However, I've been back and forth over every setting I can find, and I just can't figure this out.\n \nAssassination rogue, the optimizer consistently tries to put the faster dagger in MH, slower dagger in OH.  Except when the weapons are of wildly disparate levels, which these aren't, this runs contrary to basically every bit of theorycrafting I've ever read on mutilate rogues.\n \nAs an example, making no other changes to the file below except switching the weapons they way Rawr wants me to, Rawr shows my total value going from 28996 > 29243, or an increase of 246.\n \nConversely, Shadowcraft shows a score of 25569 with a slow MH, and swapping the two weapons shows a score of 24345, or a loss of 1224.\n \nPlease help me figure out what I'm undoubtedly doing wrong.",
    "LastUpdatedDate": "2014-03-07T18:39:40.51-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2011-11-07T20:40:41.76-08:00",
    "Status": {
      "Name": "Proposed",
      "Id": 1
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Rogue] Optimizer wants faster dagger > MH",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 21754
  },
  "FileAttachments": [
    {
      "FileId": 5430,
      "FileName": "pennet.xml",
      "DownloadUrl": ".\\5430"
    }
  ],
  "Comments": [
    {
      "Message": "Oh, I forgot to say, I forced it to put the fast dagger in my OH by editing it to be Off-hand instead of One-hand after I uploaded this.  But I'd still like to know why Rawr insists on reversing common practice.",
      "PostedDate": "2011-11-08T12:50:41.283-08:00",
      "Id": -2147483648
    },
    {
      "Message": "I'm not entirely sure if it's a Rawr issue, however:\r\n\r\nHigher DPS is obtained by putting the higher DPS weapon in the main hand, and speed will usually only matter that you have at least one fast weapon for deadly poison.\r\nIt is perfectly viable to have a 359 1.4 speed dagger in the main hand with a 353 1.8 speed dagger in the off hand, however, Shadowcraft shows that as a dps loss.\r\n\r\nWhy does Shadowcraft show it as a dps loss?\r\n\r\nBecause you have to switch the poisons around in the Shadowcraft options!\r\n(deadly always goes on faster weapon, regardless of ilevel or hand, instant on the other weapon)\r\n\r\nHope this helps.",
      "PostedDate": "2011-11-12T14:40:51.627-08:00",
      "Id": -2147483648
    },
    {
      "Message": "I had the same problem on my assassination rogue. I had to edit my faster weapon to be an off-hand only to keep that from happening.",
      "PostedDate": "2011-11-20T13:08:33.047-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:24:08.64-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2014-03-07T18:39:40.51-08:00",
      "Id": -2147483648
    }
  ]
}