{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Base.Items",
      "DisplayName": "Rawr.Base.Items"
    },
    "ClosedComment": "You can refresh the data to fix the problem",
    "ClosedDate": "2010-04-21T11:22:44.37-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "I've noticed since version 2.3.15, at least one items purchasable by Emblems of Frost no longer indicate that.\nIt merely says \"Sold by   at\" now.\nSpecifically, on my druid, in both a Bear and Kitty profiles, the Lasherweave Headguard appears that way.\nIt used to work properly in older versions.",
    "LastUpdatedDate": "2013-05-16T05:20:58.357-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2010-04-21T09:32:23.05-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Items] Items Purchasable via Frost Emblems not showing as Such",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 2,
    "Id": 17341
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "You mean you are refreshing the data from wowhead/armory and that's what it is saying?",
      "PostedDate": "2010-04-21T10:10:06.96-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-04-21T10:11:39.467-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Same problem here.\r\nAll Emblem of Frost items have invalid source data in the default item cache (either says \"Sold by at\" or dropped in Vault of Archavon). Refreshing all Emblem items from WowHead and reloading the cost file fixes the problem, but it's annoying to refresh them all.",
      "PostedDate": "2010-04-21T10:14:40.82-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-04-21T10:14:45.723-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-04-21T11:22:44.37-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Refreshing the data doesn't seem to be working as intended.  Some items are showing that shouldn't be there, others are saying that the item couldn't be found on Armory or Wowhead (which isn't true). And the new filters for Trophy's and Armor Tokens, while nice, don't seem to be working as intended, either.  The item list will still show heroic tier gear, etc.\r\n\r\nThe Emblem of Frost problem that Joescat reported does seem to get fixed when refreshing all items from Armory/Wowhead.",
      "PostedDate": "2010-04-22T15:30:31.557-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Why was this closed? Having gear come up in proper places is very important. If you don't know there is a problem it can lead to bad things. A friend of mine that I told Rawr about just spend 39 conquest emblems on legs. Was the best emblem upgrade not using frost emblems. Later he found out T9 was coming up on VoA and he should have bought T9 legs :(\r\n\r\nThere seem to be quite a few items not coming up properly. Doing a item refresh takes for ever and shouldn't be unnecessary. May be attach a corrected file so we don't have to spend 20 min refreshing items?",
      "PostedDate": "2010-05-04T23:47:42.557-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-03-17T20:15:00.62-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:28:44.553-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:20:58.357-07:00",
      "Id": -2147483648
    }
  ]
}