{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Base.Optimizer",
      "DisplayName": "Rawr.Base.Optimizer"
    },
    "ClosedComment": "Closing due to lack of additional information.",
    "ClosedDate": "2011-12-17T19:54:20.737-08:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "I have seen some other comments on how slow this program is and I would like to chime in on this.\nThe responsiveness of this program is not acceptable at all. I'm glad you want to make it right but if it takes over an hour for it to compute that is not right! On a quad core q6600 with 8gbs of ram. Trying to do a ctrl click optimization is an hour long ordeal. This machine could crunch your password faster than it can crunch my toons hit chance. Also when a person hits cancel on the optimization part it really needs to cancel and stop what it is doing. Not think about it and stop being responsive. I shouldn't have to use the task manager to halt the program when I use the cancel feature. I really can't believe this is version 4 when the same issues have not been addressed yet. Why can a website perform this same task in less than 30 seconds and this can't as a standalone app? So your attitude of wanting to get it right, is in the right place but you are neglecting key performance issues.",
    "LastUpdatedDate": "2013-05-16T05:17:22.313-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2011-10-11T13:22:13.797-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Optimizer] Slow and Unresponsive",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 21628
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Please remember each model can have vastly different performance profiles, so please note with which model you have this problem. \r\n\r\n",
      "PostedDate": "2011-10-11T13:46:05.687-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Also there is no need to use ctrl click optimization, that is complete overkill in most cases.",
      "PostedDate": "2011-10-11T17:19:04.847-07:00",
      "Id": -2147483648
    },
    {
      "Message": "1) Which Model\r\n2) Character File\r\n3) Why do you need to use Ctrl+Click Optimize for the x10? Is the normal max thoroughness coming up with consistently very different results? BTW, crunching your password isn't even close to what Rawr is doing, mathematically.",
      "PostedDate": "2011-10-13T17:49:35.723-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-10-13T17:49:50.167-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-12-17T19:54:20.737-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:24:13.033-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:17:22.313-07:00",
      "Id": -2147483648
    }
  ]
}