{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Base.Optimizer",
      "DisplayName": "Rawr.Base.Optimizer"
    },
    "ClosedComment": "Old issue.",
    "ClosedDate": "2009-08-09T17:31:33.64-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "When I run the optimizer it is often suggesting the same trinket in both slots.  This may not be happening when the trinket is marked 'Unique' in the armory, I'm not sure.  But, for trinkets that are quest rewards it is.  e.g. it is recommending that my dps warrior run two 'First Mate's Pocketwatch', which is a quest reward.  The character file is attached.\n \nThank you for your time.",
    "LastUpdatedDate": "2013-05-16T05:25:54.87-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2009-04-05T12:10:12.47-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "Optimizer Doubling Trinkets",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 12945
  },
  "FileAttachments": [
    {
      "FileId": 1774,
      "FileName": "Monato Optimized Apr 5, 2009.xml",
      "DownloadUrl": ".\\1774"
    }
  ],
  "Comments": [
    {
      "Message": "Not a bug. If you only have one available, mark the item as unique.",
      "PostedDate": "2009-04-05T12:59:13.943-07:00",
      "Id": -2147483648
    },
    {
      "Message": "While not a bug, are there any trinkets or rings that one can equip 2 of the same piece?  Would it possible to flag every trink and ring as effectiely unique?  (That sounds wrong phrasing-wise, but meh.)",
      "PostedDate": "2009-04-05T16:37:25.793-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Yes, certainly. That's why we don't treat everything as unique.\r\n",
      "PostedDate": "2009-04-05T17:30:36.537-07:00",
      "Id": -2147483648
    },
    {
      "Message": "What trinket can you get two of, if I may ask? I'm unaware of any such trinket. Rings, certainly, but not trinkets.",
      "PostedDate": "2009-04-06T16:39:28.2-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Engineering trinkets aren't unique, I believe? Quite sure some older raid content trinkets weren't unique? Don't have Wowhead in front of me at the moment to look for specifics. Regardless, since some items can be equipped in multiple slots, and you can have the same item in both, we have the Unique option on items, which is automatically populated for any item that the game marks unique. In any other case that prevents you from getting two (such as being a quest reward from a single-time quest), it's up to the user to mark the item Unique manually. That's a 2 second process, so I don't expect we'll devote much time to improving that any time soon.",
      "PostedDate": "2009-04-06T22:14:39.03-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Perhaps it would be a good idea to mark items that come from quests as unique... while it's POSSIBLE that there exists in WoW some quest that is repeatable, and gives a green-or-better item each time... I find it highly unlikely. And that's where the majority of these issues occur.\r\n\r\nAt worst, you'll get a couple items marked as unique that shouldn't be. And again, it's 'just a couple seconds' to fix. Fixing a couple items that come from repeatable quests is a lot easier than fixing the thousands of items that come from non-repeatable quests.",
      "PostedDate": "2009-04-08T12:19:56.577-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Fwiw: Both the Oracles and Frenzyheart trinkets are not unique AND are often used two at a time.  \r\n\r\nhttp://www.wowhead.com/?item=44074\r\n\r\nFor instance, I (L80 Mage) use 2x Oracle trinkets (which each give 5% of max mana on a killing blow) when AoEing or Soloing.   Essentially, they make running Naxx trash or Culling of Stratholme or farming be pretty non-stop (no drinking and very few evocates).",
      "PostedDate": "2009-04-13T12:59:16.62-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-08-09T17:31:33.64-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-09-09T16:03:17.383-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:34:59.703-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:25:54.87-07:00",
      "Id": -2147483648
    }
  ]
}