{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Bear",
      "DisplayName": "Rawr.Bear"
    },
    "ClosedComment": "",
    "ClosedDate": "2010-07-02T11:35:16.563-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "Rawr is currently favoring massive agility boosts over all else in the Bear model for my character.  I'm concerned that if I follow its instructions it's going to put me behind the curve on health, or ignore a clear upgrade of a tank piece simply because it doesn't have as much Agility (or any, in the case of most tanking jewelry).  I have thus far been somewhat ignoring it, and using Shifting Dreadstones/Enduring Eye of Zul/Solid Majestic Zircon where appropriate, but it has, since the first piece of ICC gear I equipped, tried to put Delicate Cardinal Rubies in every single gem slot on my gear (barring the two blues needed for meta of course).\n \nI have to wonder if this is due to the bear modeling options only going up to T9 heroic for the survival softcap and thus assuming I have enough health for that and should be pumping up dodge/armor instead?\n \nI know health isn't everything, but looking at ICC gear for other tanks the stamina values do keep going up.  If Blizzard simply wanted people to increase their other mitigation/avoidance components I would think they would make it fairly stagnant and adjust the item budget to favor those other stats instead.\n \nCharacter file attached, thanks for any insight.",
    "LastUpdatedDate": "2013-05-16T05:21:59.363-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2010-02-03T08:05:12.143-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Bear] Agility being (over)favored",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 16232
  },
  "FileAttachments": [
    {
      "FileId": 2900,
      "FileName": "rana tank.xml",
      "DownloadUrl": ".\\2900"
    }
  ],
  "Comments": [
    {
      "Message": "Correct, your survival soft cap is set too low for progression. Set it significantly higher (how much is very subjective, based on your raiding group).",
      "PostedDate": "2010-02-03T11:04:32.853-08:00",
      "Id": -2147483648
    },
    {
      "Message": "I've found if you set your survival cap to 265,000, the program will continually ask to stack for stamina for normal ICC 25. If you set it to 300,000 your set for ICC 25 HM.",
      "PostedDate": "2010-02-03T11:09:33.9-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Ok, good to know I'm understanding what I'm looking at then.\r\n\r\nWhat exactly is the survival soft cap a measure of?  I get the point of it as a control in the model, but how does it translate into that six digit number (and conversely, how does one gauge the subjectivity of it 'based on your raiding group')?",
      "PostedDate": "2010-02-03T21:35:11.59-08:00",
      "Id": -2147483648
    },
    {
      "Message": "It lines up with your Survivability rating, mouseover it on the stats tab for a description of what it is.",
      "PostedDate": "2010-02-03T22:40:45.017-08:00",
      "Id": -2147483648
    },
    {
      "Message": "How you judge how to set it is... Do you have 'enough' survivability? Enough meaning that you never die to burst without your healers screwing up.",
      "PostedDate": "2010-02-03T22:51:54.703-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-04-18T07:57:12.22-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-07-02T11:35:16.563-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:30:04.677-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:21:59.363-07:00",
      "Id": -2147483648
    }
  ]
}