{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.TankDK",
      "DisplayName": "Rawr.TankDK"
    },
    "ClosedComment": "Closing as intended - alot of the mitigation value comes from the idea that you can&#39;t parry if there&#39;s no weapon.  I&#39;ve seen this when disarmed. &#58;&#40;  ",
    "ClosedDate": "2009-10-15T11:21:48.843-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "When I look at the list of Weapons for my DK Tank, it show a massive proportion of the bar as red \"mitigation\" and only a small bit of green for threat.   This remains the same even if I delete all stats of the weapon except DPS & speed.  Is it possible the threat & mitigation have been mixed up somewhere?",
    "LastUpdatedDate": "2017-11-27T11:04:26.427-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2009-09-11T19:34:28.32-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[TankDK] Weapon Ranking",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 14125
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "If you have the tanking Rune on it, that would account for the mitigation. Strength might end up triggering a mitigation increase based on parry (which would change the percentage of Rune Strikes you get, and something like the Rune strike procs if you have the T8, T9 Sigils). Just having any weapon at all allows you some base parry, so it's probably calculating that in there too, as a baseline for all weapons.\r\n\r\nIf your intent is to get a better grip on what the relative threat generation of weapons is, either sort by threat, or go to Options and set the Survival weight to something small (like .2 or .5), and the threat weight to something large (like 10 or 20). You can fiddle with the number to get some relative valuation that make sense to you. \r\n",
      "PostedDate": "2009-09-14T01:44:56.427-07:00",
      "Id": -2147483648
    },
    {
      "Message": "much of what JRPascucci has said is correct.  Threat is a smaller aspect of a weapon's value compared to what else it does for the DK.  I am still working on the Threat area, so current builds will see some flux, however, the fact that parry is only possible when you have a weapon, and many of the abilities do some effect despite what the weapon's stats, also plays a part eg: 255 + dam. \r\nThreat is also currently being tracked as TPS, so that it remains consistent across weapon speeds.  This is to help balance out the 2h vs. DW comparisions.  EG.  a big slow 2h may look impressive per-hit, but it's TPS may be similar to someone DW in the right setup.  This currently isn't the case, but Blizz's notes for 3.2.2 mention continuing efforts to make DW tanking viable, so the model needs to factor that in.",
      "PostedDate": "2009-09-14T10:43:28.29-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-09-17T11:19:27.81-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-10-15T11:21:48.843-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-05-20T23:42:14.79-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:33:07.217-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:24:26.04-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2017-11-27T11:04:26.427-08:00",
      "Id": -2147483648
    }
  ]
}