{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Enhance",
      "DisplayName": "Rawr.Enhance"
    },
    "ClosedComment": "4.0.18 Released",
    "ClosedDate": "2011-02-03T21:11:00.917-08:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "I am an avid user of rawr, and since I read about using spellpower weapons as main hand for more dps. I noticed a tiny thing.\nWhen in my talents I have elemental precision 3/3 (gain spell hit from items) this is not reflected in the stats when i equip one.\nin game i have unbuffed, 1811 spell hit rating and in Rawr I have 1710. Even without the Scepter of power in my hands i have 1725 spell hit, but 1710 melee hit rating. The scepter of power have 86 spirit which gives me 86 more spell hit power. And the extra 15 spell hit i deduce is from the + 15 stats i have on my chest. No need to be over the hitcap when we are so closer with spirit accounted for :D But it is correct without that talent in. \n \nOldlefty @ emerald dream-eu",
    "LastUpdatedDate": "2013-05-16T05:19:11.903-07:00",
    "PlannedForRelease": "Rawr 4.0.14 Beta",
    "ReleaseVisibleToPublic": true,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2011-01-06T07:33:31.83-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Enhance] Spell Hit Wrongly Calculated",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 2,
    "Id": 19581
  },
  "FileAttachments": [
    {
      "FileId": 4652,
      "FileName": "stillmissing9spellhit.xml",
      "DownloadUrl": ".\\4652"
    }
  ],
  "Comments": [
    {
      "Message": "Perhaps there is not much interest in this issue because of Enhancement's avoidance of Spirit weapons in patch 4.0.6 and beyond, however Mighty Stats and Peerless Stats remain our best chest enchantments, so we will always have at least 15 Spirit.  Perhaps as a quick Band-Aid it could grant a flat 4/9/15 SpellHit Rating to wearers of Mighty and 6/13/20 SpellHit Rating to wearers of Peerless until the actual Spirit-to-SpellHit calculation is implemented?  What I've been doing until a fix gets applied is just editing a \"% Spell Hit = 0.0008785126\" attribute (the correct amount of SpellHit% with Mighty Stats and 2/3 Elemental Precision) into the Chaotic Shadowspirit, Fleet Shadowspirit, and Relentless Earthsiege Diamonds, but it's obviously a less-than-ideal approach.",
      "PostedDate": "2011-01-30T15:59:27.483-08:00",
      "Id": -2147483648
    },
    {
      "Message": "This is on my ToDo list for the Enhance module.  It will make it in when I make some changes to fix another issue.  So next release, or if things go pear shaped, the one after that.",
      "PostedDate": "2011-01-30T18:12:09.367-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-02-01T16:48:22.207-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Fixed for next release.",
      "PostedDate": "2011-02-02T16:42:27.313-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-02-02T16:42:38.047-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-02-03T21:11:00.917-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-02-24T02:20:52.38-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Still seems to be displaying 9 SpellHit Rating short for me with patch 4.0.20.0b after clearing all cache and building a new profile from both the Armory and the Rawr addon's exported data.  However, I suspect that it is merely a display error and that the module is actually calculating the extra SpellHit Rating from Spirit but not displaying it, as it is fairly consistent at Optimizing my equipment to give a display of ~16.92% spellhit (1733 rating).  I have no idea how I can verify this, but I have attached the character file.",
      "PostedDate": "2011-02-24T02:20:53.86-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Yes, it's a known display issue.  I messed up parts of the display, namely the hit and procs.",
      "PostedDate": "2011-02-24T04:35:43.823-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:26:36.15-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:19:11.903-07:00",
      "Id": -2147483648
    }
  ]
}