{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Base.Optimizer",
      "DisplayName": "Rawr.Base.Optimizer"
    },
    "ClosedComment": "Working as intended. Optimizer will find the best enchants out of those marked as available, so if you don&#39;t mark any as available it won&#39;t chose any. See help files on the optimizer for more details.",
    "ClosedDate": "2009-09-13T07:14:57.61-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "If I optimize a gear set the suggested set is cleared of enchants, no matter whether \"Override Reenchant\" is checked or not.\n \n \nMacOS 10.5.7\nSafari 4.0.2 & Firefox 3.0.13\nSilverlight plugin 3.0.40818.0",
    "LastUpdatedDate": "2013-05-16T05:24:29.037-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2009-09-09T03:50:16.647-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "Rawr3: Optimizer clears enchants",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 14091
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "First of all, there's several issues and discussions on the topic, so please try to search more thoroughly.  In answer to your question, you have no enchants selected for optimization.",
      "PostedDate": "2009-09-09T04:22:32.587-07:00",
      "Id": -2147483648
    },
    {
      "Message": "A search for \"rawr 3 optimizer\" returns 791 hits for all issues, nothing remotely relevant on the first five pages. Perhaps there is usable search function somewhere?\r\n\r\nI wouldn't expect it to suggest clearing enchants if I don't have the \"Override Reenchant\" option checked, even though I haven't selected any enchants.\r\n\r\nIn any event, from a pure user experience it's odd that gemming suggestions will work without any selections, while enchantments won't.",
      "PostedDate": "2009-09-09T05:16:20.92-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Gems still have Gemming Templates to use, enchants dont",
      "PostedDate": "2009-09-09T07:21:00.03-07:00",
      "Id": -2147483648
    },
    {
      "Message": "And enchants usually have whatever enchant you started with when you loaded from the Armory. Is that not working, or did you not start from the Armory? If not, then this isn't a bug, and is well documented in the help files, and many issues if you searched for something like 'optimizer enchants'. Please still do keep reporting Rawr3 issues, though.",
      "PostedDate": "2009-09-09T09:42:02.11-07:00",
      "Id": -2147483648
    },
    {
      "Message": "I've retested the part of my observation that may be a bug. Full description:\r\n\r\n1) I've manually selected a gear set, with corresponding available gear. (Armory was down when I initially tested). No enchants were selected.\r\n2) I manually added enchants to my gear.\r\n3) I selected Optimize and left all options on default (Override Reenchant unchecked)\r\n4) Optimized gear set does not include enchants, I press load optimized set and the previously entered enchants are gone.\r\n\r\n",
      "PostedDate": "2009-09-10T02:47:47.61-07:00",
      "Id": -2147483648
    },
    {
      "Message": "I should also note that this is Rawr3, which isn't exactly feature-complete yet.",
      "PostedDate": "2009-09-10T04:57:41.777-07:00",
      "Id": -2147483648
    },
    {
      "Message": "brizz, you stated your own problem, you added the enchants to your gear but you did not mark them as available. The optimizer doesn't automatically assume that enchants on your gear are available, this is not a bug.",
      "PostedDate": "2009-09-10T05:51:54.357-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Dopefish, we still do want reports of the incompleteness.\r\nBrizz, yeah, if you don't mark any enchants available to the optimizer, then it won't use any. Working As Intended.",
      "PostedDate": "2009-09-10T08:05:30.49-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Would it be possible to maintain a rough feature completeness list somewhere? Would love to test the (cat/bear/tree) modules aswell, but they seem incomplete from the quick glance I gave them.",
      "PostedDate": "2009-09-10T10:25:37.87-07:00",
      "Id": -2147483648
    },
    {
      "Message": "When we get farther along, we'll have that, but right now just assume it's either there or it's not, it should be obvious. For example, half the menu items just say \"Not Implemented\".",
      "PostedDate": "2009-09-10T14:26:58.16-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-09-13T07:14:57.61-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-09-09T16:03:17.383-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:33:10.893-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:24:29.037-07:00",
      "Id": -2147483648
    }
  ]
}