{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "The options aren&#39;t available because it&#39;s an inoperable model",
    "ClosedDate": "2011-10-03T18:35:14.45-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "Unable to edit the Reforging Selectors. I've looked through all the literature/guides on how to use Rawr and did not see any explanations for reforging other than the Getting Started guide mentions that you can select the reforging that you want. An example of what I was trying to do is: already hit capped and looking to reforge Firemend Cinch (#71254): avail stats are Int, Haste, Crit. I wanted to reforge the Crit to Mastery but the option was not there. Only options available are Haste to Spi, Haste to Hit, Crit to Spi, Crit to Hit. Not sure if this is a global issue for all models or just for the Elemental Shaman model which I was messing with (I know elemental is inoperative-this may be the reason). Is there intentions of adding a Reforging Template like there is for gems or just modify the list to include all available reforges kinda like enchanting?",
    "LastUpdatedDate": "2013-05-16T05:17:23.98-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2011-09-29T10:12:56.247-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "Reforging Options",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 21590
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "If you know Elemental is inoperative, then why are you trying to mess with it?  Mastery probably hasn't been implemented for Elemental.  We do have a developer looking at possibly starting work soon, but until then, don't try.",
      "PostedDate": "2011-09-29T12:19:12.807-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-10-03T18:33:39.163-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-10-03T18:35:14.45-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:24:15.763-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:17:23.98-07:00",
      "Id": -2147483648
    }
  ]
}