{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "Old issue.",
    "ClosedDate": "2009-08-08T05:44:24.73-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "the Gem list in FormMassGemReplacement shows only five options. (Bright Crimson Spinel, Enscribed Fire Opal,. Pulsing Amethyst, Glistening Fire Opal, Empty)\nNo Northrend gems are shown. \n \nA Bold Bloodstone (about 3g on my server) is better than any of the above.\n \nSecond, the top-rated chest (for my source filter) is the Bonegrinder Breastplate with +20 Str and +10Str/+15Sta gemmed to get the 6 CSR socket bonus. \nReplacing the Soverign Dreadstone with an Inscribed Flawless Ametrine would get 4 more CSR at the expense of +15Stam. (A clear win for the DPS warrior). \n \nThirdly, stupid gemmings are suggested. Warriors will never ever socket for spell power, intellect, spirit, or MP5. (And probably not any stats but  Str, Crit, Hit, Exp, Agi, ArmPen, Haste)",
    "LastUpdatedDate": "2013-05-16T05:26:19.347-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2009-01-29T15:56:29.463-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "Gem list incomplete; poor gemming suggested",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 12505
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "First, we have no idea what you're talking about. You're using the DPSWarr model? First, your lack of visible gems indicates that you've somehow majorly screwed up your itemcache. Perhaps a partial download or something? A blank itemcache that you loaded a few random characters in?\r\n\r\nSecond, sure, you can commonly make better gemmings by ignoring socket bonuses; what's your point? If the Optimizer is returning these results, and you have better gems available, that'd be a bug, but seeing as the Optimizer is broken in DPSWarr currently, I don't see how Rawr can be 'suggesting' anything for you.\r\n\r\nThird, as mentioned above, none of these gemmings are suggested. Make sure you understand how gemmings in Rawr work.\r\n\r\n\r\nMost importantly, search for existing issues before posting.",
      "PostedDate": "2009-01-29T17:05:33.193-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-08-08T05:44:24.73-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:35:37.283-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:26:19.347-07:00",
      "Id": -2147483648
    }
  ]
}