{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Base.Optimizer",
      "DisplayName": "Rawr.Base.Optimizer"
    },
    "ClosedComment": "User needs to set thoroughness considerably higher, issue does not persist at high thoroughness",
    "ClosedDate": "2010-03-09T11:31:38.693-08:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "Re: How do you understand Rawr? (http://www.mmo-champion.com/class-shaman/how-do-you-understand-rawr/)\n \nHere is the information you requested. I'm using Rawr v2.3.11 (although my original post was about 2.3.10, I still get the same result). If I equip whispering fanged skull, the optimizer uses it, and gems hit, but if I equip the mark of supremacy, the optimizer uses it instead. The other trinket is the Herkuml War Token.\n \nThe first file (Fujinn.xml) has been loaded from the armory, totem of the quaking earth marked as available, and the weapons marked as unique. I also marked whichever trinket that's not currently equipped as available. \n \nThe other two files are the results from the optimizer, starting with each trinket. I ran the optimizer on minimal thoroughness, which may or may not effect the results. My computer cannot handle much higher settings.",
    "LastUpdatedDate": "2013-05-16T05:21:35.473-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2010-03-04T17:44:23.41-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "Optimizer giving different results for different equipped items.",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 16655
  },
  "FileAttachments": [
    {
      "FileId": 3095,
      "FileName": "Fujinn.xml",
      "DownloadUrl": ".\\3095"
    },
    {
      "FileId": 3096,
      "FileName": "Fujinn-Optimizer Start with Mark.xml",
      "DownloadUrl": ".\\3096"
    },
    {
      "FileId": 3097,
      "FileName": "Fujinn-Optimizer Start with Skull.xml",
      "DownloadUrl": ".\\3097"
    }
  ],
  "Comments": [
    {
      "Message": "Minimal thoroughness means repeated direct upgrades, it definitely depends on initial character. For true optimization you'll have to increase thoroughness.",
      "PostedDate": "2010-03-04T17:55:47.2-08:00",
      "Id": -2147483648
    },
    {
      "Message": "You should really only have the Optimizer set at no less than the default (25%?  33%?) thoroughness, for the reasons Kavan noted.  The higher the thoroughness, the more confident you can be in the Optimizer's results, as this is representing more exhaustive trials of gear setups.\r\n\r\nWhen you say that your computer cannot handle much higher settings, what do you mean by this?  That it would take an unwieldy amount of time to run an Optimization?  Or that it is already running at max load, and you don't believe that it can handle more?  To the latter, all higher Thoroughness does is increase the length of the gear plugging-in of the Optimizer routine, so there is no increased load, only an extended one.  And to the former, especially given the limited gear flexibility in the profiles you posted, there really shouldn't be any issue with any system that can handle WoW at even the most modest of graphical intensities, in terms of pushing into long (5-10+ minutes) Optimize routines.",
      "PostedDate": "2010-03-05T23:01:36.25-08:00",
      "Id": -2147483648
    },
    {
      "Message": "That said, try running at 50% thoroughness - I'd like to hear the results in terms of Optimizer results and the time it takes to run the Optimize (with your minimum thoroughness time noted as a point of reference).",
      "PostedDate": "2010-03-05T23:03:25.09-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-03-09T11:31:38.693-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-09-09T16:03:17.383-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:29:34.433-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:21:35.473-07:00",
      "Id": -2147483648
    }
  ]
}