{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Tree",
      "DisplayName": "Rawr.Tree"
    },
    "ClosedComment": "Fixed",
    "ClosedDate": "2010-01-09T08:33:38.287-08:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "With a resto druid with average T8-T9 level gear and all relevant buffs checked, I have the following stat weights under \"Relative Stat Values.\"\nCrit: 204.16\nInt: 8.23\nMp5: 4.27\nSP: 3.72\nHaste: 2.70\nSpi: 1.70\n \nI could understand a high crit weight if I had heavy emphasis on Nourish with very little crit gear, but this is not the case. For crit to be THAT highly emphasized, it seems like a bug. XML attached.",
    "LastUpdatedDate": "2017-11-27T11:05:40.923-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2009-12-13T13:27:29.39-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Tree] Crit heavily overweighted",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 2,
    "Id": 15395
  },
  "FileAttachments": [
    {
      "FileId": 2624,
      "FileName": "Devi Tree.xml",
      "DownloadUrl": ".\\2624"
    }
  ],
  "Comments": [
    {
      "Message": "I played with the file you attached.  As an outsider and Rawr noob, I am also baffled.  It's especially fun to move some sliders around and watch those stat values jump around.  Like changing to 1 Wild Growth per minute (instead of 3) suddenly makes crit worth -212.89.",
      "PostedDate": "2009-12-13T14:57:17.467-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-12-13T14:57:26.113-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Ya I'm curious as well.  I know that Rawr still hasn't updated the tooltip for \"Gift of the Earthmother\" to the 3.3 version.  The new version makes haste now a top stat.  So maybe when that changes it will make more sense.  \r\nI would Love to see how a programmer of Rawr sets up his sliders for Resto Druids.  Cause it does seem any little change drastically changes the outcomes.",
      "PostedDate": "2009-12-13T15:20:37.68-08:00",
      "Id": -2147483648
    },
    {
      "Message": "It's just the tooltip, GotEM has been updated under the hood.",
      "PostedDate": "2009-12-13T16:12:40.73-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Interesting, I'll take a look at it later today. \r\nWhat I did notice is that you set your primary spell to be Rejuvenation. You also set a casting time percentage of 80% Rejuvenation, 10% Regrowth and 10% Lifebloom (This is already 100% plus 2 Lifebloom stacks, 3 Wildgrowth casts and 1 swiftmend, so the model has to downscale the whole thing.\r\n\r\nCan I ask a question? If you just ignore the Relative Stat Values and look at the gear lists, do you still see discrepancies, like gear that gets too much value?",
      "PostedDate": "2009-12-14T02:08:15.503-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Well, I'm the one who already mentioned the new model/sliders were confusing for my just-an-alt druid in a discussion thread ^^; I set it to something that I thought made sense for a raiding resto druid who primarily rejuv-blankets the raid, keeps a hot stack up (including LB) on a couple tanks, casts WG when possible/necessary, and casts Swiftmend to save people's butts. Realistically I'd also Nourish from time to time, but I didn't see how to set Nourish percentage, so /shrug. Is \"primary spell\" supposed to be the gap-filler once all the other sliders are done or the actual primary spell? This model is confusing to me. If you can suggest something more appropriate, I'm all ears, because as aequitas28 said--\"I would Love to see how a programmer of Rawr sets up his sliders for Resto Druids. Cause it does seem any little change drastically changes the outcomes.\" Basically I just adjusted the spell rotation until I got something I was happy with that also liked Idol of Flaring Growth better than Idol of Awakening.\r\n\r\nTo answer your question, crit gear does not seem particularly overweighted in gear lists, just relative stat values. My gear lists look pretty normal... I think.",
      "PostedDate": "2009-12-14T10:56:19.157-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Yes, \"primary spell\" is the gap-filler.  Which is really only \"primary\" if you don't have much else going on, like if you are strictly a main tank healer who keeps HoTs on 1 tank & spams nourish otherwise.\r\n\r\nAlso, if you start a new tree profile in Rawr you'll see the defaults, set up by a Rawr programmer (obviously).  But that doesn't mean it'll be anything like your casting profile in your raids.",
      "PostedDate": "2009-12-14T11:40:58.75-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-12-14T23:31:12.66-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-01-09T08:33:38.287-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-07-09T12:30:54.787-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-09-05T18:07:58.887-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-05-20T23:09:45.937-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:31:22.893-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:23:00.973-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2017-11-27T11:05:40.923-08:00",
      "Id": -2147483648
    }
  ]
}