{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Bear",
      "DisplayName": "Rawr.Bear"
    },
    "ClosedComment": "Old issue.",
    "ClosedDate": "2009-08-08T07:16:47.8-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "When watching my gear for the back slot, using the bear model, and toggling the WoW 3.0.4 armor model on and off, I get a very strange result. \nAfaik, armor from the item in the back slot will loose its bear modifier in next patch. However, when turning it on in Rawr, the item value goes up, significantly.\n \nRegardless, it shows a very strong preference for armor, so much that I'm wondering if the armor changes are applied backwards.",
    "LastUpdatedDate": "2013-05-16T05:26:42.35-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2008-12-07T01:07:42.347-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Bear] Back Armor Weird",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 11917
  },
  "FileAttachments": [
    {
      "FileId": 1535,
      "FileName": "Rooted-Bear.xml",
      "DownloadUrl": ".\\1535"
    }
  ],
  "Comments": [
    {
      "Message": "Last I heard, the cloak slot was still going to be getting the modifier - GC clarified that a day or so after original post.   The only slots losing the modifier are trinkets, rings & necks.\r\n\r\nBecause the cloak will be getting the new 66% multiplier, the value of armor on cloaks goes up.\r\n\r\n",
      "PostedDate": "2008-12-07T15:58:35.943-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Ok. I must have misinterpreted the change then.",
      "PostedDate": "2008-12-07T23:37:20.48-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Ok, I've been reading and calculating, and it just doesn't add up...\r\n\r\nQuote from EJ:\r\nAssume we have a cloak with 100 base armor + 400 extra green armor. Currently, all 500 of this gets multiplied with the bear armor.\r\nWhen the change goes through (is it confirmed for 3.04?), you'll get: 100 x bear armor multiplier (which will be a different number than it is now) + 400\r\n\r\nThe old Bear Armor Modifier was 4.7 which made the cloak in the example have 2350 armor in bearform.\r\nThe new Bear Armor Multiplier is said to be changed from 4.70 to 4.70*1.66=7.80. The 1.66 is from SotF that will add 66% of your gears armor as extra armor to compensate for this change. However, it's only the cloaks base armor that gets that modifier, the rest gets no modifier. That would make the cloak have 100*7.80+400=1180 armor, which is a lot less than 2350. \r\nA cloak that today only has 100 armor would see an improvement though, from 470 armor in bearform to 780 armor.\r\n\r\nOk, back to Rawr:\r\nTake the \"Gilded Thorium Cloak\" as example. It's the cloak from Illhoof in Kara, way back in the lv70's. For me, at 3.0.2 mode it has a score of 11958. In 3.0.4 mode it has a score of 17001. It has a lot of armor (and most of it is bonus armor), and thus it should get worse by this change (not 42% better!). It's the 4th best cloak in the game for me according to Rawr when 3.0.4 hits. \r\n\r\nLinks:\r\nhttp://elitistjerks.com/f73/t36932-feral_questions/p7/#post994039   (the EJ post about cloak armor)\r\nhttp://forums.worldofwarcraft.com/thread.html?topicId=12891010295&sid=1 (Ghostcrawler post about change to Bear Armor Modifier)\r\n",
      "PostedDate": "2008-12-08T06:27:55.59-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Ok, more weird armor stuff...\r\nUsing the file I attached, I'm watching my Relative Stats Values.\r\nWith 3.0.4 armor, 1 armor is valued to 2.34, about 5% of 1 agility.\r\nWith 3.0.2 armor, 1 armor is valued to 25.00 (exactly 12.50 for both mit and surv), about 55% of agility.\r\n\r\nSomething is really wrong here...\r\n\r\n",
      "PostedDate": "2008-12-08T09:43:08.4-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2008-12-08T09:43:12.323-08:00",
      "Id": -2147483648
    },
    {
      "Message": "I'd like to add to the bonus armor calculation comments.\r\n\r\nI think the comments concerning where the Bear Armor Modifier is applied to ONLY base armor on cloaks is correct. \r\n\r\nBased on GC's comments the absolute BEST modifier available will be: \"4.7 (Dire Bear form) x 1.66 (Survival of the Fittest) x 1.1 (Thick Hide)\" = 8.5822 or 8.75384 with a 1.02% Meta gem. To echo Rooted's comments on 12/8 @ 7:27am this modifier should then only be applied to the base armor of a cloak, and not to any bonus armor the cloak has. So I guess the question is, is the BASE armor value available for any cloak that has bonus armor?\r\n\r\nSource:\r\n\r\nhttp://forums.worldofwarcraft.com/thread.html?topicId=12891372479&sid=1",
      "PostedDate": "2008-12-08T15:48:53.783-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-08-08T07:16:47.8-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-09-05T19:15:25.917-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:36:07.52-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:26:42.35-07:00",
      "Id": -2147483648
    }
  ]
}