{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.DPSWarr",
      "DisplayName": "Rawr.DPSWarr"
    },
    "ClosedComment": "Looking into this and can&#39;t find anything wrong. It all appears as it should be",
    "ClosedDate": "2010-06-20T18:45:33.82-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "I'm sure that I am missing something, and I am sorry if this issue has been discussed before, but I am confused about expertise in the DPS warrior model. I read just about everywhere that fury warriors need to be expertise capped. In Rawr, when I gem my gear with pure strength gems which results in my being way below the expertise cap, I get a higher final DPS value than if I gem my gear in order to reach the expertise cap. Shouldn't gemming for the expertise cap result in a higher DPS than gemming purely for strength? If I can get better DPS gemming for strength, why should I care at all about expertise?\n \nI noticed a really old discussion in which an author mentioned expertise being undervalued below the cap and wondered if this might be what is causing a problem. The weird thing is that the spreadsheet from elitist jerks is giving me similar results. Must be something I am not getting.\n \n(Also, I can't for the life of me get the optimizer to meet the Chance to be Dodged <= 0 requirement to be met. And, yes, I have the expertise gems selected.)\n \nI have attached two character files, one with strength gemming and the other expertise.\n \nThanks for such a great tool!",
    "LastUpdatedDate": "2013-05-16T05:21:40.08-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2010-02-26T21:00:24.643-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[DPSWarr.Fury] Expertise vs. Strength",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 16574
  },
  "FileAttachments": [
    {
      "FileId": 3059,
      "FileName": "WarriorFiles.zip",
      "DownloadUrl": ".\\3059"
    }
  ],
  "Comments": [
    {
      "Message": "DPSWarrior has done this as long as I can remember and I've been confused about it too, but since Landsoul's spreadsheet does the same thing, I've always just assumed it's been correct that DPS warriors need not be extremely concerned about Expertise. (which seemed odd to me)",
      "PostedDate": "2010-02-28T01:49:26.017-08:00",
      "Id": -2147483648
    },
    {
      "Message": "I'm no expert but when I'm on my warrior (Fury), I always try to be behind the bosses while the tank is in front. Since I'm behind the boss cannot dodge or parry my attacks and therefore I do not need much expertise. Not sure if it works this way but this is my understanding.",
      "PostedDate": "2010-02-28T09:01:18.72-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Being behind the boss means that they can't Parry, but they can still Dodge.",
      "PostedDate": "2010-02-28T11:11:21.947-08:00",
      "Id": -2147483648
    },
    {
      "Message": "A few comments:\r\n1) Expertise Cap, for warriors, is assumed to be 26 expertise (or 18/22 with Weapon Mastery, if you're arms).\r\n2) The Expertise Cap, like the Hit Cap, is beneficial, but not always more beneficial than strength or armor penetration, point for point.  Generally, at lower gear levels, expertise isn't that great, because the lost DPS from a missed cooldown isn't as substantial (for Arms, a missed attack means one less slam, but slam does less damage than most other abilities, so the penalty isn't that great.  For fury, lower gear levels means less heroic strikes means less slam procs means more free GCDs to make up those missed attacks.  Now, you're just delaying your ability one GCD, rather than delaying that ability and missing a slam proc).  At higher gear levels, the penalty increases due to Arms having slams hit harder relatively speaking, and Fury having more slams (and possibly double slams with 4T10).\r\n3) Expertise is less valuable than Hit because dodged white attacks still generate normal rage, whereas missed white attacks generate no rage\r\n4) If you're maintaining a dodgeable ability (such as Sunder Armor), expertise increases in value.  A dodged sunder means two GCDs that you're not generating damage.  Arms is more affected by this than Fury, for the same reasons listed in #2\r\n\r\nThat said, I haven't had time to look at this particular character to see if anything is amiss, so leaving this open for now.  My guess is, if it's on par with what Landsoul's sheet shows, there's probably no bug and this is just a perception issue.",
      "PostedDate": "2010-03-03T13:45:08.243-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-03-09T11:13:54.353-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-06-20T18:45:33.82-07:00",
      "Id": -2147483648
    },
    {
      "Message": "I'll add onto the item 4 ebs2002 mentioned.\r\nIf you are maintaining any sort of buff/debuff based on hitting a mob, not being expertise capped can be an issu.\r\n\r\nRawr.Retribution calculates expertise value based on how much DPS it does, however, the Retribution model doesn't account for the fact that a buff/debuff can fall off or will take longer to stack up (SOV 5 stack, Libram of three trusts stack, any stacking trinket)...  Something similar may be true in the warrior model.  So conventional wisdom may tell you that you need to be hit/exp capped because of those, but the model you're using may not be taking such things into account.",
      "PostedDate": "2010-06-21T01:02:26.433-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-07-09T12:30:42.78-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-09-08T16:06:26.327-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:29:41.26-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:21:40.08-07:00",
      "Id": -2147483648
    }
  ]
}