{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Base.Optimizer",
      "DisplayName": "Rawr.Base.Optimizer"
    },
    "ClosedComment": "Rawr.Retribution is 0&#37; ready for cata and unless another dev steps in to work on it, will remain to be in this state until at least end of januari 2011. I can&#39;t make any guesses after this since it&#39;s highly dependant on decisions being made by management and Q&#38;A at work end of januari.Even if I do get back to a more normal work schedule at that time, actually working on ret and making it cata aware will likely take several weeks more.",
    "ClosedDate": "2010-12-23T05:34:38.507-08:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "Well, i have used Rawr to come up with the gear i'm currently using. Somehow the same version of Rawr is giving me a downgrade in dps, instead of an upgrade. It's aiming for more AP, instead of hit/crit/haste and showing a lower value on DPS even putting the prismatic gems(which i do not have on my currently gear. Also, it's only selecting 1 prismatic gem, even setting up to use 3.\nOh, setting are the same as i used: aim for dps/hit cap/expertise cap and i double checked to make sure buffs are the same.\n \nEdit: it seems to be a issue with JC's gems, as i am losing dps in some slots when i change from rare to epic JC gems. But even with same gems, i'm getting a 5~ dps loss.",
    "LastUpdatedDate": "2013-05-16T05:19:25.85-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2010-12-23T03:22:05.107-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Optimizer] Showing lower dps after optimization.",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 19423
  },
  "FileAttachments": [
    {
      "FileId": 4276,
      "FileName": "Sem título.jpg",
      "DownloadUrl": ".\\4276"
    },
    {
      "FileId": 4278,
      "FileName": "Low-Default.xml",
      "DownloadUrl": ".\\4278"
    }
  ],
  "Comments": []
}