{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Base.Optimizer",
      "DisplayName": "Rawr.Base.Optimizer"
    },
    "ClosedComment": "Old issue.",
    "ClosedDate": "2009-08-08T07:18:02.093-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "The \"Override\" options in the Optimizer are very vague in what it's actually allowing. The description says, \"Choose whether to let the Optimizer regem or reenchant items that don't specifically allow it.\" That implies that by checking \"Override Regem\" I am allowing Optimizer to regem. Well, what am I overriding then? What is the 'default' behavior of Optimizer? Because it doesn't seem to matter whether I have the Override options checked or not. It never regems, and it always tries to put \"Mighty Spellpower\" or \"Accuracy\" enchant on my offhand, whether I have \"Override Reenchant\" checked or not (see Issue: Offhand Enchant).\n \nSome clarity regarding this feature would really help. Perhaps the options should just be: \"Allow Regem\" and \"Allow Reenchant\" -- that is very specific... if it's checked, you're allowing Optimizer to regem your items and renchant items.",
    "LastUpdatedDate": "2013-05-16T05:26:36.04-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2008-12-21T21:34:10.58-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "Override in Optimizer",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 12183
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "No, it's not anything like that, it really does mean exactly what it says, that's all. If you tell the optimizer that you only have a specific gemming of an item available, it won't regem it, normally. If you check that, it will override that, and will regem that. If you would like to provide some wording that you think would be more clear, let us know.",
      "PostedDate": "2008-12-21T21:51:36.3-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-08-08T07:18:02.093-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-09-09T16:03:17.383-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:35:59.027-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:26:36.04-07:00",
      "Id": -2147483648
    }
  ]
}