{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.TankDK",
      "DisplayName": "Rawr.TankDK"
    },
    "ClosedComment": "",
    "ClosedDate": "2011-04-11T13:21:38.45-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "Rawr thinks that Symbiotic Worm (generally regarded as one of the top DK trinkets) is so toxic for my DK tank I would be better off with no trinket at all (it assigns a negative value.)\n \nI believe this is related to negative values for stamina and health, despite this possibly being technically correct (still find that confusing.)",
    "LastUpdatedDate": "2017-11-27T11:04:49.297-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2011-04-11T12:20:47.52-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[TankDK] Symbiotic Worm has overall negative value",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 20485
  },
  "FileAttachments": [
    {
      "FileId": 4839,
      "FileName": "Alathas.xml",
      "DownloadUrl": ".\\4839"
    }
  ],
  "Comments": [
    {
      "Message": "This can't be right.  Rawr is telling me that my Symbiotic Worm is so toxic that it has a negative value of -18,630.  It is recommending some useless trinkets in its place but what it really means is it would prefer I just leave the slot empty.\r\n\r\nThere's no way the trinket is actually overall hurting me, right?  At worst its value is so diminished that it could approach 0 (which I'm also highly skeptical of, but save that for another time.)\r\n\r\nPerhaps what's missing here is a floor that prevents a total value from being driven below zero?\r\n\r\nIs there a discussion on burst / softcap you can point me to?  I had thought I was up on current DK theory but am not aware of this topic.",
      "PostedDate": "2011-04-11T13:02:43.27-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Not a bug. With Burst abilities (cooldowns you activate) active, you are over soft cap. So more regular survival (like stamina) hurts Burst as more of the Burst gets converted downward by Softcap. It means with your cooldowns, you don't need to stack more Stam. If you think it's doing it too much you can devalue Burst calcs using the Options pane or increase your Hits to Survive, though the defaults should technically be accurate.\r\n\r\n\n\n** Closed by Jothay 4/11/2011 12:47 PM",
      "PostedDate": "2011-04-11T13:06:41.813-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Although I'm still not sure I understand the more general case being defended here, I appreciate the correction and will re-title the bug to more specifically describe the issue that I am sure is a bug and re-open accordingly.",
      "PostedDate": "2011-04-11T13:06:42.37-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-04-11T13:08:35.84-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Mastery is increasing Burst, Burst which is not being used, ergo, it's becoming a useless trinket. You are still missing Rings and your incoming attack damage is too low (like I said on one of your other tickets)",
      "PostedDate": "2011-04-11T13:20:27.95-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-04-11T13:21:38.45-07:00",
      "Id": -2147483648
    },
    {
      "Message": "After fixing rings and glyphs, the Symbiotic Worm retained its negative value only at 125K incoming damage, but not at 100K 10N Average Boss (where it shows as only marginally useful) or at 160K (value suggested by Jothay in another ticket.)(where it shows as highly valuable trinket.)\r\n\r\nI remain of the opinion that it is either extremely counter-intuitive, or outright wrong, that there is any situation in which a DK Tank is better off just leaving the trinket slot empty than equipping the Symbiotic Worm.\r\n\r\nIn any event I appreciate the responses and am fine just agreeing to disagree.  I'm sure there's bigger fish to fry.",
      "PostedDate": "2011-04-11T14:26:56.87-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-05-20T23:42:14.79-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-05-20T23:44:15.71-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:25:21.11-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:18:12.493-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2017-11-27T11:04:49.297-08:00",
      "Id": -2147483648
    }
  ]
}