{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Retribution",
      "DisplayName": "Rawr.Retribution"
    },
    "ClosedComment": "As brittuck mentioned, see closed issue item &#35;19423 explaining the Retribution status.",
    "ClosedDate": "2010-12-24T02:48:39.983-08:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "So I am now at the point where I am level 85 with full blues and ready to start min-maxing my character again.  However, it was immediately clear upon attempting to use Rawr 4.0 that Retribution is severely out of date.  The talent trees, gear lists, buff lists, and fight parameters all seem reasonably correct, but the dps rotation and calculations are very obviously wrong and outdated.  Issues I noticed include:\n \nThe entire options tab appears completely broken:\n- Target level can't be set above level 83\n- Changing seal has no effect on DPS\n- Changing other parameters such as mob type, fight length, and using bloodlust or not also have no effect on dps calculations\n \nThe rotation tab is unusable:\n- You can't specify a custom rotation anymore, the box is completely blank\n- The abilities listed no longer accurately represent what we would be using in a single target situation (Divine Storm will never be used single target anymore, consecrate is too much of a mana sink to use on cooldown now, templar's verdict and holy wrath don't show up, etc\n- The Inquisition ability/buff has a significant impact on our dps at level 85, yet it does not even get mentioned anywhere in the Rawr options.\n \nThe DPS breakdown is very clearly completely inaccurate:\n- Crusader strike shows up as 0 dps\n- Other abilities dps breakdowns are clearly inaccurate as well.  The two that stand out the most are exorcism and hammer of wrath.  Both of these abilities will nearly always be hitting for 15k+ at level 85, yet the average damage done for both abilities does not even top 5000\n- My current theoretical max dps according to Rawr is 3,357, yet I can pull more like 9,000 self-buffed on a Cataclysm boss training dummy.\n \nLastly I also noticed that the dps breakdown of certain enchants is highly suspect.  The one that stands out the most is Avalanche, which according the spreadsheet is over 400 dps BETTER than Landslide which on paper is clearly the superior choice.  I am also willing to bet that Hurricane does not take into account the fact that you can have two separate, stacking procs (1 from melee hits and 1 from spells).\n \nI suspect that Retribution was just never given an update when 4.0 hits, but I figured I'd try and be as specific as possible with the issues that I saw.  I commend you guys on your work, as Rawr was an invaluable tool for me in Wrath of the Lich King for improving my dps and determining gear choices, and I'd love for the same to be true in Cataclysm.  However, at least for now I'm going to have to seek out other options as this tool is completely unusable for my spec at the current time.\n \nThanks!\n \n-Calefax",
    "LastUpdatedDate": "2013-05-16T05:19:25.01-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2010-12-23T13:02:50.01-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Retribution] Needs a Large Level 85/4.0 update",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 19430
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Indeed, we don't currently having anyone working on Rawr.Ret, to my knowledge. WTB Ret dev. ",
      "PostedDate": "2010-12-23T14:36:55.527-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Refer to Closed issue item #19423 for further Retribution status and explaination.",
      "PostedDate": "2010-12-23T16:18:08.153-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-12-24T02:48:39.983-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-03-17T20:06:03.233-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:26:53.08-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:19:25.01-07:00",
      "Id": -2147483648
    }
  ]
}