{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Retribution",
      "DisplayName": "Rawr.Retribution"
    },
    "ClosedComment": "Not entirely clear if there&#39;s still an issue for Ret.  If yes, open new issues for single problems, don&#39;t combine several problems into one post.",
    "ClosedDate": "2010-04-18T06:58:46.333-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "I was reading through the elitistjerks forums, because people told me that my solution i calculated with rawr for my paladin wasnt the best off all possible solutions.\n \nRetribution:\n \n1) First of all its available to set ALL glyphs to active, but its not possible to do so ingame. Maybe restricting that would be good.\n \n2) http://elitistjerks.com/f76/t68951-retribution_updated_3_3_a/ \n \n[Quote]\n \n[Glyph of Seal of Vengeance]\nWe now have the option of glyphing for 10 expertise! This glyph grants exactly what it says, 10 expertise (82 rating, 2.5%) when using our primary dps seal. This is a decent option if you are under the expertise cap or if you want to use other stronger items in place of expertise items. It's worth noting that if you benefit from even half of the expertise (example, glyph puts you at 31 expertise) it is more dps than the exo glyph. The main benefit of this glyph is a lot of freedom in gear choices, as you can drop weaker expertise pieces.\n \n[Glyph of Exorcism]\nAn option if you are naturally expertise capped, or perhaps for pvp. This glyph is worth ~50 dps, and as noted above you can gain more from using freed itemization on non-expertise gear.\n[/Quote]\n \nThe Optimize-dialog  gives you the choice to select food, flasks, talent specs, and talents, additionally.\nBut how will it deal with the choice between several glyphs? In this case its a matter of expertise which one will give you more.\nHow about adding an option to consider glyphs but not the rest of the talent.stuff in the optimize.process?\n \nHoly-Part\n \n[Quote]\n \nQ: How should I gem my gear?\nA: Short answer, Intellect. Long answer, a starting Holy Paladin should gearing up with spell power so your heals will keep your group alive. When picking stats, you should shore up your weakness. If you are spamming HL and people die before it lands, then you need more haste. If you are using mostly Flash of Light and the tank is dying, try switching to HL and Int gems. If you are running out of mana, try to use items/enchants that favor Mp5, Int, and to lesser extent crit rating rather than focusing on haste or spell power. \n[/Quote]\n \nHow about a gemming template that Include more haste and the nightmare tears? I was told thats better if you use a lot of holy light.\n \nRawr-Base\n \nOptimize should offer an additional Requirement \"only items less or equal ilevel x\", so you can get the best possible gear for achievements like herald of the titans or tribute to dedicated insanity.",
    "LastUpdatedDate": "2013-05-16T05:22:41.097-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2009-12-31T05:55:42.793-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Retribution] Model and Base, Suggestions/Questions",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 15665
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Please report Feature Requests separately from each other rather than all at once, this lets us close them out individually as they are handled.\r\n\r\n1) No, for the same reasons posted here: http://rawr.codeplex.com/Thread/View.aspx?ThreadId=78570\r\n2a) Mutating Glyphs in Optimize: Kavan would need to look into this, but it does sound like it might be a good idea. An option to mutate just the glyphs and not the talents themselves.\r\n2b) Healadin Gemming Templates: Healadin guy will probably add them at some point.\r\n2c) Limit iLevel in optimize: While it would be nice for that situation, it's rare that someone would actually need to do that so implementing this feature would be a low priority.",
      "PostedDate": "2009-12-31T10:54:20.293-08:00",
      "Id": -2147483648
    },
    {
      "Message": "2b) In the interim you can just mark the Nightmare Tear and the Haste Gems as available to the optimizer and it will go ahead and use them. Be sure to mark 'Enforce Gem Requirements' or it will try to use multiple Tears.",
      "PostedDate": "2009-12-31T11:03:46.637-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-04-18T06:58:46.333-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:30:56.45-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:22:41.097-07:00",
      "Id": -2147483648
    }
  ]
}