{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "&#34;Refine Types of items Listed&#34; overrides the green diamonds for the purpose of optimisation. This isn&#39;t only the case in ret, this same behaviour is present in all models.This is not a bug.  It&#39;s designed this way.&#34;Working as intended &#169; Blizzard&#34;",
    "ClosedDate": "2010-07-02T04:44:43.77-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "The Ret spec of my Pally is off-spec so his gear is definitely sub-par, but that is what brought this to my attention.\n \n1) I load my Pally in Ret-spec from the armory.\n2) Run optimize.\n3) Receice the following\n-----You have not selected any of the following:\n----------Head Items\n \nI have my helmet selected \"Helm of the Brooding Dragon\" (hold your laughter please) but Rawr tells me I have no head items selected.\n \n4) If I select an additional helm as avialable (such as \"Valorous Aegis Helm\") - Keeping Helm of the Brooding Dragon selected\n5) Receive the following warning\n-----The following currectly equipped items are not available\n-----Helm of the Brooding Dragon is not available\n \nThe Helm is marked with a green diamon.\n \nI think the problem is related to the Helm of the Brooding Dragon being chain; while of course, a Ret Pally is plate.\nTo test my theory \n \n1) Tools\n2) Edit items...\n3) Selected \"Helm of the Brooding Dragon\"\n4) Changed its \"Type\" from \"mail\" to \"plate\"\n5) Ran optimizer\n6) Received no warnings.\n \n7) Went and changed the helm's properties back to \"mail\" (It is a mail helmet after all)\n8 Made sure the helm was \"green diamonded\" as available\n9) Ran optimizer\n10) Received the \"not selected\" warnings again.\n \nThe best I can guess (other than \"don't equip plate as a mail wearer\") is that selecting a mail item ( if you are a plate class) ignores the item",
    "LastUpdatedDate": "2013-05-16T05:20:23.13-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2010-07-01T09:58:38.403-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "Mail item on Plate Ret Pally not recognized as selected",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 18115
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "While wearing mail as a plate Dpser is usually a bad idea, sometimes it can actually increase your overall DPS. To be able to see (and possibly optimize using mail) make sure that mail is selected under Tools->Refine Types of Items Listed...\r\nI cannot remember if I deselect leather and mail on new installs or if they come deselected but this might solve your problem.",
      "PostedDate": "2010-07-01T11:16:28.363-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-07-02T04:44:43.77-07:00",
      "Id": -2147483648
    },
    {
      "Message": "To Brittuck and whoever else interested: The item types filters are enabled by default for all models. If they're off, you've clicked them off.",
      "PostedDate": "2010-07-02T04:47:35.08-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:28:04.78-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:20:23.13-07:00",
      "Id": -2147483648
    }
  ]
}