{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.DPSDK",
      "DisplayName": "Rawr.DPSDK"
    },
    "ClosedComment": "closing as dup.",
    "ClosedDate": "2010-10-13T10:27:56.657-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "Previously I was using v2.3.11 and when I went and upgraded to v2.3.19 today I noticed that the ability to specify the abilities used in the Death Knight rotation have been removed.  I don't know if this is causing an issue for Blood or Unholy Death Knights, but as Frost Rawr is no longer able to model my rotation or dps properly.  When I could specify the rotation my Obliterates were doing 45% of my damage, melee 27%, frost Strikes about 15%.  Now that I am unable to modify the rotation the simulation says my Obliterates should be doing 27%, melee all the way up at 31% and other such skewed numbers.  Rawr used to be able to properly predict my dps both percentage-wise and dps-wise.  Rawr is now predicting I will do about 1500 less than I actually pull in game.  Before the rotation specifier was removed it was properly predicting my dps. If the locked rotation or priority in place now was predicting I would pull more dps with it than i actually do, then I would assume I was doing something wrong on my end in the way of rotation or talents.  Unfortunately that's not the case so therefore the system in place can not be a \"best\" rotation for everyone.  I ask that based on this argument a rotation modifier be placed back into the program alongside the current locked priority for those people whom the priority system does not yield max dps.",
    "LastUpdatedDate": "2013-05-16T05:20:23.55-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Medium",
      "Severity": 100,
      "Id": 2
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2010-06-29T21:27:14.473-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Feature Request.DPSDK] Rotation modifier removed for Frost",
    "Type": {
      "Name": "Feature",
      "Id": 1
    },
    "VoteCount": 1,
    "Id": 18101
  },
  "FileAttachments": [
    {
      "FileId": 4002,
      "FileName": "Perseon.xml",
      "DownloadUrl": ".\\4002"
    }
  ],
  "Comments": [
    {
      "Message": "Thanks for posting. Please try again, following the bug reporting guidelines, so that we can help you. We really want to help you, but can't, if you don't follow the posting guidelines.\r\n\r\nOn an unrelated sidenote, I'd love to hear your comments of why you didn't upgrade to a newer version until v2.3.19. ",
      "PostedDate": "2010-06-29T21:46:38.14-07:00",
      "Id": -2147483648
    },
    {
      "Message": "side-note: welcome to like 4 months of not upgrading, when we had these discussions about the new rotation setup like 4 or 5 months ago. Please search the closed issues as there's a whole bunch of comments about this already.",
      "PostedDate": "2010-06-30T00:38:29.657-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-07-02T08:22:23.753-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-07-02T15:42:24.267-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-07-16T12:56:01.85-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Are you still seeing this issue?  While the rotation work needs to be adjusted and cleaned up, I\"m noticing my DW frost numbers surprisingly close to what I actually pull against the target dummy.  As I posted in a different thread.  I seem to see Rawr giving me what I should do, Kahorie's telling me what I could do in an ideal world. (no lost time to lag/missed/resisted GCDs, no lost RP, etc.)",
      "PostedDate": "2010-08-25T14:33:28.287-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Re-purposing this defect:\r\nFeature: Create/return a means of viewing the current rotation/priority.",
      "PostedDate": "2010-08-31T09:52:04.33-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Yes, I actually am still seeing this issue with the optimizer as it seems to be adjusted in order to optimize for strength gemming.  I am gemming Armor Penetration and so Obliterate is otpimized far more in the rotation and KM is no longer a priority.  Rawr is still predicting that I will do about 2-3k less dps than i actually do.  In fact I need to activate the 30% buff in order to even get the simulation to register what my base dps in VoA etc. actually is.",
      "PostedDate": "2010-09-01T14:49:46.373-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Awesome, could you please attach your character XML, so that I can test with it?\r\n\r\nThanks.",
      "PostedDate": "2010-09-01T15:22:04.293-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-09-04T20:26:05.593-07:00",
      "Id": -2147483648
    },
    {
      "Message": "I hope you get some useful information from this.  As you can see in the xml, my Obliterates are only doing 35% of my damage, while in reality they do about 43%.  It also says that with Strength of Varian Wrynn (6) that the max dps I pull single target is 11,333.  In-game I usually pull more around 13.8 or 14k.  Thanks for looking into this, using version 2.3.11 to model my DK sure has been a pain for the last few months.",
      "PostedDate": "2010-09-04T20:26:06.893-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-09-13T15:49:30.833-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-09-16T10:59:47.89-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-10-13T10:27:56.657-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-03-17T19:52:23.52-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:28:05.383-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:20:23.55-07:00",
      "Id": -2147483648
    }
  ]
}