{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.ProtPaladin",
      "DisplayName": "Rawr.ProtPaladin"
    },
    "ClosedComment": "Old issue.",
    "ClosedDate": "2009-08-08T07:17:12.24-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "I am seeing some strange behavior in the Tankadin Module.\n \n1. Combat Table Values. These values seem slightly wrong. They do not compare with Tankpoints in wow or Armory. I set the boss level to 80 in Rawr and still the values do not match with my armory or tankpoints. You can load my character to test:\nhttp://www.wowarmory.com/character-sheet.xml?r=Smolderthorn&n=Fuseflower. Another point here is that as I raise the target level, it increases the chance to block. At target level 80, it says that I have a 54.53% chance to block. When I set the target Level to 83, it says that I have a 56.33% chance to block.\n2. For the * in \"Chance to be Crit\" when you hold the mouse over the value, it says \"Uncritable. <nyi> defense rating or <nyi> resiliance rating over the cap.\" - not a huge issue but it would be cool if that would actually show the numbers instead of \"<nyi>\".\n \nWould really love it if this could get fixed =D\n \nThanks",
    "LastUpdatedDate": "2013-05-16T05:26:40.137-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2008-12-11T11:16:43.21-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[ProtPaladin] Incorrect Values",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 11989
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Also, I think that Armor might be overvalued in this.  In some situations it is saying that even if I am critable, an item with extra armor on with no defense rating it is better than one with defense rating.",
      "PostedDate": "2008-12-11T12:34:29.463-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Block rating is giving 100x more then it should. I fixed it in my local copy, but forgot to upload it to the server before the next version went. I was going to do more work on Tankadin, but school stuff came up and ended up not being able to. I will also implement the Defense thing. Is the combat table off any other way besides block rating? (When mob level is set to 80). I have tested it with my character and it produced same results as in game. Make sure when testing that the talents are the same, and the buffs are matching your own. If it still inconsistent please post the character file (the XML file, copy&paste or upload it somewhere), and the expected results you are getting, and what you are.\r\n\r\nAs for critable, it doesn't give any extra weighting to critable besides the overall damage you take. I will try to find a way for Survival Points to somehow reflect this.\r\n\r\nSorry for the bugs, been busy with school, Holy module and raiding. I will try to get them fixed asap.",
      "PostedDate": "2008-12-15T19:25:45.583-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-08-08T07:17:12.24-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-09-08T14:41:26.953-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:36:04.547-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:26:40.137-07:00",
      "Id": -2147483648
    }
  ]
}