{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Mage",
      "DisplayName": "Rawr.Mage"
    },
    "ClosedComment": "",
    "ClosedDate": "2010-04-23T13:35:37.477-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "I'm not sure what's going on, but upon importing my old mage, Rawr 2.3.14 showed her DPS as 0.0: http://img37.imageshack.us/img37/39/rawr14zero.png\n \nThinking this had something to do with the level 70 gear I logged out in, I started to replace items and noticed that sometimes the blue DPS bar would \"activate\" and Rawr would tell me sensible DPS numbers for that character, but also showed certain items with huge negative values: http://img249.imageshack.us/img249/7092/rawr14negative.png\n \nEquipping them and trying other items often switches back to zero DPS values where only the survivability rating remains. I couldn't find any pattern to this behaviour as it's not really consistent - either of (eg.) [Sash of Potent Incantations], [Braid of Salt and Fire] and [Strip of Remorse] moved between showing reasonable DPS numbers, negative numbers and 0.0, seemingly at will. Sometimes it's enough to just re-select the same item.\n \nTo verify I imported a guild mate's mage (Nona on Doomhammer-EU) into 2.3.12 and 2.3.14, with the same options and buffs checked (the screenshot was taken with a personalized version of 2.3.14 with some filters off, the result with the default download is the same though). Right after the armory sync, the stats section is identical, the spell info section is very similar (can be attributed to changes to the model), but in the solution section it looks like the DPS calculation bugged out for some reason:\nhttp://img641.imageshack.us/img641/8499/rawr14weird.png",
    "LastUpdatedDate": "2017-11-27T11:02:00.513-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2010-04-12T11:11:42.017-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Mage] DPS calculation bugged [Fixed by r49456]",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 10,
    "Id": 17215
  },
  "FileAttachments": [
    {
      "FileId": 3350,
      "FileName": "Malk_Test.xml",
      "DownloadUrl": ".\\3350"
    },
    {
      "FileId": 3353,
      "FileName": "Llewser.xml",
      "DownloadUrl": ".\\3353"
    },
    {
      "FileId": 3354,
      "FileName": "Morsker Arcane.xml",
      "DownloadUrl": ".\\3354"
    },
    {
      "FileId": 3355,
      "FileName": "BiSArcaneT10.xml",
      "DownloadUrl": ".\\3355"
    },
    {
      "FileId": 3356,
      "FileName": "Dresden.xml",
      "DownloadUrl": ".\\3356"
    },
    {
      "FileId": 3358,
      "FileName": "Barbatruccø.xml",
      "DownloadUrl": ".\\3358"
    },
    {
      "FileId": 3364,
      "FileName": "TTWfire.xml",
      "DownloadUrl": ".\\3364"
    },
    {
      "FileId": 3365,
      "FileName": "TTWfire.xml",
      "DownloadUrl": ".\\3365"
    }
  ],
  "Comments": [
    {
      "Message": "I'm having the same problem. Rawr3 (online) doesn't have the problem, but 2.3.14 seems completely broken for my mage now. I'm attaching my mage's xml file as well, in case it helps any. Thanks!\r\n",
      "PostedDate": "2010-04-12T11:40:13.977-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-04-12T12:29:30.45-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Can someone post another character xml where this happens? When I load the attached character I see nothing out of the ordinary.",
      "PostedDate": "2010-04-12T12:43:51.687-07:00",
      "Id": -2147483648
    },
    {
      "Message": "I had the same issues last night when I downloaded 2.3.14. At first I thought maybe it was the old .xml saved files so I took my character (Draginclaw-Thunderlord) from the Armory and it looked fine initially. I adjusted the gems template to 1 gem and clicked on JC gems and it went out of whack again as shown in the above image. \r\n\r\nI'll upload the .xml files when I get home from work.",
      "PostedDate": "2010-04-12T13:51:40.003-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-04-12T13:53:25.137-07:00",
      "Id": -2147483648
    },
    {
      "Message": "I am having the exact same issue. When I just loaded this .xml file it is showed the green survival values that orcane described. I also redownloaded 2.3.14 and started from scratch but the same problems (massive negative values and survival ratings) keep happening.",
      "PostedDate": "2010-04-12T13:59:46.95-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-04-12T13:59:47.487-07:00",
      "Id": -2147483648
    },
    {
      "Message": "I have the same issue, with a fresh install and loading Morsker @ Blackhand-US straight off the armory. Here's the XML though.",
      "PostedDate": "2010-04-12T14:19:31.457-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-04-12T14:19:32.907-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Attaching BiSArcane file...one a few that is doing it for me.",
      "PostedDate": "2010-04-12T14:39:37.95-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-04-12T14:39:38.933-07:00",
      "Id": -2147483648
    },
    {
      "Message": "I just re-checked this. While the issue remains when I run Rawr on my Windows XP (German language version) installation, the problem goes away if I run the exact same Rawr version (same folder as before, same files and armory characters) from my Windows Vista (64-bit, English version) parallel-installation. Likewise I was unable to reproduce the weird behaviour by loading the linked character files or my guildie from a fresh Rawr installation on my Windows 7 (also 64-bit, English release) notebook.",
      "PostedDate": "2010-04-12T15:03:55.13-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Well this is very strange. I can't reproduce this with any of the files. I am testing on a 64 bit machine though, so if that is the main difference that causes the error I might have a hard time tracking this problem down. Is anyone that is experiencing the problem able to compile the source and assist me in tracking this down?",
      "PostedDate": "2010-04-12T15:35:57.18-07:00",
      "Id": -2147483648
    },
    {
      "Message": "If anyone can compile source try going through some of the checkins I made in the last week and see if you can find where the issue was introduced.",
      "PostedDate": "2010-04-12T15:38:56.32-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Hmm, it didn't seem to upload Dresden.xml - trying again.",
      "PostedDate": "2010-04-12T15:49:10.84-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-04-12T15:49:11.88-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Update: After reading what Kavan wrote, I tried 2.3.14 at work where my PC is 64 bit. Sure enough, no repro on an x64 OS. Interesting. I raid Mon/Tue/Wed so I'm not sure when I'll be able to sync and build at home, sorry.\r\n\r\n",
      "PostedDate": "2010-04-12T15:59:31.34-07:00",
      "Id": -2147483648
    },
    {
      "Message": "I get the error on a 64-bit machine with a 32-bit OS, Windows XP.",
      "PostedDate": "2010-04-12T16:21:11.303-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-04-12T18:47:55.577-07:00",
      "Id": -2147483648
    },
    {
      "Message": "I think I've found the problem, if you can test the latest dev version let me know if it fixes things for you.",
      "PostedDate": "2010-04-12T20:21:04.74-07:00",
      "Id": -2147483648
    },
    {
      "Message": "That seems to have helped. I had the worst time getting Rawr (.2010.sln) to build on my machine though, it kept complaining about missing graphs and such. I commented those unrelated-to-mages parts out,so YMMV. \r\n\r\nAnyway, on Windows XP SP3 (32 bit) with your latest dev changes, Rawr stopped exhibiting the problem.",
      "PostedDate": "2010-04-12T21:32:14.597-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Last version don't work with my mage, I attach my xml file. Big thanks for your work!",
      "PostedDate": "2010-04-13T03:35:38.787-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-04-13T03:35:39.553-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-04-13T03:44:29.91-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-04-13T08:23:07.44-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-04-13T11:25:31.403-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Hi! I'm from Spain. I'm a great follower Rawr software and I hope someday to have enough time and knowledge to help to code rawr! :D I try every version, and last one 2.3.14 has deep problems with optimize function and dps calculation. It seems to bug on the f(x) calculus proces, because first numbers f(x) get are near 0.\r\n\r\nI hope you could repair it on 2.3.15! Mages are best math model in rawr! :D\r\n\r\nSorry for my english.",
      "PostedDate": "2010-04-13T11:29:45.687-07:00",
      "Id": -2147483648
    },
    {
      "Message": "The newest version can no longer optimize my mage! i get negative results\r\n",
      "PostedDate": "2010-04-13T15:31:59.573-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-04-13T15:32:00.143-07:00",
      "Id": -2147483648
    },
    {
      "Message": "(continued)... i found by chance that when I unchecke heroism from spells&buffs, I no longer get negative values.... plz fix this as soon as possible\r\nwarmest regards ",
      "PostedDate": "2010-04-13T15:35:53.343-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-04-13T15:35:53.913-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-04-14T00:59:25.907-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Same problem. v2.3.14 is completely unusable for Mages; surprised this problem got past internal testing.\r\n\r\nAfter several minutes of trying to troubleshoot why when checking/unchecking some things, the proper values appeared (then disappeared), I started from scratch. Deleted the prior version's  files that are changed on every use: SpecialCache.bin, Data\\BuffCache.xml, Data\\ItemSource.xml and so on. Then installed v2.3.14 fresh.\r\n\r\nLoad an 80 Mage character from Armory, Score & DPS show as \"0\". And weirdly, the Comparisons frame has every item in Gear, Head missing their blue DPS bars. Instead, only the (irrelevant) green Survivability bars show for each item.\r\n\r\nNext, go into Options, Spells & Buffs & uncheck Heroism/Bloodlust. Yay, things return to normal; Score & DPS show properly as do the Comparison bars for every item.\r\n\r\nBut then switch an item for a different on on the character. Now, the Comparison graphs change to include negative values (never seen that before). Next, go into Buffs and uncheck Ferocious Inspiration. The Comparison bars completely switch around yet again and go back to only showing Survivability values. As well, Score & DPS show as \"0\" again. Checkmark Ferocious Inspiration again the bars switch back, but strangely some items are ranked as higher DPS than they were prior to the first uncheck. Uncheck it again and the fun continues. The circus happens with most buffs, options and switched out items you change.\r\n\r\nSo have reverted back to v2.3.13 in order to be able to use the program. Hope the fixes for this serious issue are pushed to a release sooner than later. The only compilers I have access to locally are GCC & javac. So any way to access Rawr v2 dev builds without having to compile them?",
      "PostedDate": "2010-04-14T06:32:39.003-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-04-14T06:54:59.587-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-04-14T18:27:39.4-07:00",
      "Id": -2147483648
    },
    {
      "Message": "It got past internal testing because it only hits on 32 bit operating systems, which the mage dev doesn't run one of.",
      "PostedDate": "2010-04-14T20:19:09.213-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-04-15T06:36:56.18-07:00",
      "Id": -2147483648
    },
    {
      "Message": "I'm also experiencing this problem. Even when loading char from Armoury, Rawr 2.3.14 only shows the Survivability (green bars) in the comparisons window.",
      "PostedDate": "2010-04-15T06:39:54.303-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-04-15T08:59:53.363-07:00",
      "Id": -2147483648
    },
    {
      "Message": "confirmed, the latest version of rawr works flawless on a x64 operating system (windows 7)",
      "PostedDate": "2010-04-15T22:22:07.47-07:00",
      "Id": -2147483648
    },
    {
      "Message": "What will it take to get a 2.3.15 generated with the fix in it?",
      "PostedDate": "2010-04-16T00:08:12.58-07:00",
      "Id": -2147483648
    },
    {
      "Message": "It should be out in the next few days.",
      "PostedDate": "2010-04-16T00:19:57.107-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-04-23T13:35:37.477-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-03-17T21:30:21.047-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-05-21T00:00:19.307-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:28:52.76-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:21:04.787-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2017-11-27T11:02:00.513-08:00",
      "Id": -2147483648
    }
  ]
}