{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Base.Items",
      "DisplayName": "Rawr.Base.Items"
    },
    "ClosedComment": "Added in 2.3.15 for Warlocks, then fixed for 2.3.16.",
    "ClosedDate": "2010-04-24T07:11:26.11-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "I think Rawr is undervaluing this trinket for Shadow Priests and likely also for any other class that can take advantage of rolling DoTs (I think maybe affliction warlocks).  When this trinket is used right before casting Shadow Word: Pain, the dot will carry the inflated crit chance through being refreshed by Mind Flay due to the priest talent Pain and Suffering.  This makes the trinket extremely good as it is basically a static 920 crit rating to Shadow Word: Pain in most fights.  However, Rawr is telling me that the Abyssal Rune from regular ToC 5 is a better trinket than this one.\n \nTo show the effect I have described, here is a world of logs parse where I used this trinket as described: http://tinyurl.com/y9bkq7f.  As you can see, my Shadow Word: Pain crits considerably more often than any of my other spells.",
    "LastUpdatedDate": "2013-05-16T05:21:56.37-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2010-02-09T14:06:55.953-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Items] Nevermelting Ice Crystal value on Rolling DoTs",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 3,
    "Id": 16291
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Fair enough. I already knew about it and have been wondering how exactly I should model it.\r\n\r\nOne question, can you list all the ICC fights and give me an estimate of how long uptime your SWP has with the entire 920 crit rating?\r\n\r\nI still haven't been able to get this trinket (Damn ninjaing holy paladins :P).",
      "PostedDate": "2010-02-10T09:10:58.98-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-02-10T09:14:18-08:00",
      "Id": -2147483648
    },
    {
      "Message": "I'm unclear on a few organizational things - is this really an \"Item\" issue, or is it something that should be handled by the relevant class developers?  I know Warlocks and Spriests have rolling dots, and IIRC Rogues/Druids/Hunters have dots that can have extensions added to them by glyph/talent procs.",
      "PostedDate": "2010-02-10T09:17:12.023-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Sorry if I misclassified it, I had [Shadow] at first but I changed it at the last second.\r\n\r\nAs for the uptime, here is a log query that kind shows it but it's not really very easy to read: http://tinyurl.com/ygqq6nn\r\n\r\nAssuming I don't mess anything up, every single tick of shadow word: pain on a single target should have the inflated crit rating.  Even on Saurfang, it is fairly easy to keep the dot refreshed on him while dpsing the blood beasts.  It's not really that useful on the Gunship battle but I don't think too many people are worrying about their dps on that fight.",
      "PostedDate": "2010-02-10T10:22:12.3-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Another thing worth mentioning, I have only done the first four bosses as shadow so the later bosses might be less friendly with this trinket.",
      "PostedDate": "2010-02-10T10:23:38-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Festergut, Rotface, and Queen should be friendly with the trinket. Less so on Rotface but still duable. Putriced MAYBE, if you can snipe a quick Mind Flay on Put while dpsing the oozes (doubtful though). Council is less friendly since your switching ever 30 seconds. Dreamwalker, is even worse since it's an add fight with many adds. Lich King (will be attempting him this week), moderate amount of usability.  You will be switching to adds a lot throught the fight until 40%. Besides Phase 2, you should be able to snipe a quick mind Flay to refresh. However at 40% your going to be Mind Seering adds from 40% to 9%.",
      "PostedDate": "2010-02-10T11:51:33.2-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Just wondering if I need a checkbox (~100% vs normal average) or a slider to implement it best. Seems to me that it may be perhaps best to checkbox it, as some fights you use it, others you don't. Not really anything between?",
      "PostedDate": "2010-02-10T14:23:48.213-08:00",
      "Id": -2147483648
    },
    {
      "Message": "I think a checkbox would suffice.  I can't imagine a situation where you can \"kinda\" use this effect.",
      "PostedDate": "2010-02-10T16:22:26.707-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Warlocks \"kinda\" use the effect on some bosses, depending on setup.  At least, I don't think I've ever managed to keep Corruption rolling from the start while being in the outside - between vomiting and running to the grouping spot, it pretty much always falls off.  But that's more of a user error.  Deathbringer & Marrowgar are absolutely friendly to it.  Deathwhisper & Gunship not so much.  Princes, never.  Dreamwalker, nope.  Sindragosa & LK I haven't seen yet.",
      "PostedDate": "2010-02-11T08:22:17.367-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Deathwhisper is good for this trinket for me because my guild always has me just stay on her the whole time so I think that one depends on the strategy. ",
      "PostedDate": "2010-02-11T13:34:38.673-08:00",
      "Id": -2147483648
    },
    {
      "Message": "I use NMIC on my warlock.  I don't keep corruption rolling in the first wing because the adds need dps and the enrange timers are long.\r\n\r\nOn Festergut, there are several setups that will allow a warlock to roll corruption\r\n\r\n1. Stand in the center and leave a teleport circle on the ranged group that you may be asked to deliver spores to.\r\n2. Stand on the outside and (if human) use every-man-for-himself to get out of puking\r\n3. Stand on the outside and equip a Wintergrasp pvp trinket as your second trinket\r\n4. Stand on the outside and hope you get lucky.  Your luck should be inversely proportional to your haste, because haste makes corruption drop off faster.  It would be nice to get some hard uptime numbers for this scenario.",
      "PostedDate": "2010-02-12T10:19:05.973-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Added the Trinket to the ShadowPriest model. Did not bother with an option to disable its effect, as I'm pretty sure people will know what fights it is useful for (right?). Anyway, that trinket is really not that hugely impressive for Shadow as it is for Affliction.",
      "PostedDate": "2010-02-12T13:22:28.707-08:00",
      "Id": -2147483648
    },
    {
      "Message": "It would be fantastic to get this model implemented for warlocks - at the moment I have great difficulty trying to decide what level of haste it stops being worth equipping this. With 1000 or so haste, and heroism, and a potion of speed, during the <25% phase of a boss, with Eradication up, Corruption drops off VERY quickly. You use Drain Soul to execute, which is also haste-effected, but once you get to a certain point you either have to use Haunt to refresh Corruption, which has a massive travel time as it flies so slowly, or waste a GCD on refreshing Drain Soul.\r\n\r\nI honestly don't know how it's possible to model it properly but things can get a bit nuts with all those procs up. Perhaps I should just stick to SimulationCraft for that eventuality and work out what haste level things go wrong at (NMIC rolling Corruption is implemented there). The right tool for the right job, and all that.",
      "PostedDate": "2010-02-19T16:41:15.077-08:00",
      "Id": -2147483648
    },
    {
      "Message": "It would be fantastic to get this model implemented for warlocks - at the moment I have great difficulty trying to decide what level of haste it stops being worth equipping this. With 1000 or so haste, and heroism, and a potion of speed, during the <25% phase of a boss, with Eradication up, Corruption drops off VERY quickly. You use Drain Soul to execute, which is also haste-effected, but once you get to a certain point you either have to use Haunt to refresh Corruption, which has a massive travel time as it flies so slowly, or waste a GCD on refreshing Drain Soul.\r\n\r\nI honestly don't know how it's possible to model it properly but things can get a bit nuts with all those procs up. Perhaps I should just stick to SimulationCraft for that eventuality and work out what haste level things go wrong at (NMIC rolling Corruption is implemented there). The right tool for the right job, and all that.",
      "PostedDate": "2010-02-19T16:41:22.697-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-02-27T12:58:18.62-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-03-19T05:59:35.093-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Updating comment for the poor sap doing the warlock programming.",
      "PostedDate": "2010-04-24T05:28:00.857-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-04-24T07:11:26.11-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-09-08T16:42:11.62-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:30:01.34-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:21:56.37-07:00",
      "Id": -2147483648
    }
  ]
}