{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Base",
      "DisplayName": "Rawr.Base"
    },
    "ClosedComment": "Closing, Very old issue and we&#39;ve had multiple new versions since then",
    "ClosedDate": "2010-07-02T13:16:49.377-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "First I just want to say Thanks for this great tool! I'm exited to see a version that is starting to work on my Mac.  :)  It's looking very nice as well.\n \nI haven't had a lot of time this past week to dig in and test it much yet, but what I did test looks slick. My only issue so far (other than a few items mentioned by someone else about mouse scrolling and such) is that is seems to run unbearably slow for me.  I'm on a 2 x 2.66 GHz Dual-Core Intel Xeon Mac Pro with 5GB of RAM and NVIDIA GeForce 8800 GT.  Anyone else running slow? I would think my system should be more than adequate system. Rawr 2 runs fine in my Windows 7 VM.",
    "LastUpdatedDate": "2013-05-16T05:22:49.78-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2009-12-22T10:33:08.543-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Base] Runs very slow",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 2,
    "Id": 15573
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Try now?",
      "PostedDate": "2009-12-22T10:39:41.503-08:00",
      "Id": -2147483648
    },
    {
      "Message": "One note: Rawr3 Silverlight is never going to be exactly as fast as Rawr3 WPF, or Rawr2, due to you being unable to use certain direct memory modification operations in Silverlight, that they disable for security reasons. However, we do hope to get it to within ~15% of the performance of Rawr3 WPF.",
      "PostedDate": "2009-12-22T11:57:31.637-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-12-22T13:02:00.853-08:00",
      "Id": -2147483648
    },
    {
      "Message": "ok, tried again.\r\n\r\nFirst thing I tried was to see if I could open a file from v2.  It made safari hang with a white screen.\r\nNext I restarted Safari again and asked it to get my toon from the Armory. It got stuck on item 2 of 2.  getting the talents. but I was able to close the safari window this time.\r\nNext, I  loaded a saved file from rawr3 I saved a few days ago. It took 5 or 6 minutes before anything showed up (I just waited this time, so maybe it didn't fully hang on the other tries, but was taking a very very long time.)\r\n\r\nonce I got my toon loaded, I can't say it's any faster.  for example I click on my Back item to see the list of upgrades and get nothing (everything freezes) as I write this, it has still not let me have control back. seems to be hung up again.  (has been several minutes as I write this message)\r\n\r\nBTW, the spinning blue dots with loading % doesn't show up when I first load the page any more. just solid white screen for a minute or so. \r\n\r\nIs there a version display someplace?\r\n",
      "PostedDate": "2009-12-22T13:48:56.14-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Right click anywhere in Rawr3, Silverlight. Leave that dialog open. Close all Rawr3 windows. Goto the last tab of that dialog, and hit Delete All. Now fully clear the browser cache. Then try again. Sounds like something went very wrong with your copy, shouldn't be even remotely as slow as you describe.",
      "PostedDate": "2009-12-22T16:35:48.06-08:00",
      "Id": -2147483648
    },
    {
      "Message": "ok,\r\n\r\nCleared out application in Silverlight.\r\ncleared cache.\r\n\r\nloaded rawr3 link and got the blue dots and % loaded.\r\n\r\nselected to download my toon from Armory, and it said 2 of 3 takes for about 2 minutes then it changed to Errors and said. \"Rawr encountered an error get\"  (if there is more I can't read it) when I clicked on the text of the error in the little list, it duplicated the error to the next line.  \r\n\r\nmy toon seems to have loaded all shirt, and the tool tip for that says.  [Downloading from Armory] Unknown Location, please refresh.\r\n\r\nwhen I click on it I'm now frozen again.  (letting it sit for a time waiting to see if it comes back...)    Nope  crash, stuck.",
      "PostedDate": "2009-12-22T22:41:49.467-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Sorry that would be all BUT the shirt.",
      "PostedDate": "2009-12-22T22:53:16.6-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Armory loading is just really unsupported for Rawr3 right now. It's a barely held together hack, until we build the actual armory/wowhead parsing engine.",
      "PostedDate": "2009-12-23T00:38:43.743-08:00",
      "Id": -2147483648
    },
    {
      "Message": "I have also noticed that Rawr3 has been slow the last few days. It is actually unusable in it's current state. I have flushed all caches, deleted the application space within silverlight, used another computer entirely, etc with no change in operation. I am guessing it started with whatever update added the ICC gear. \r\nAny operation, such as loading a character from the armory or a saved file, switching to another gear slot, clicking a buff on or off can take a minute or more to update, causing Safari to freeze during the process. It will eventually come out of the freeze and operate again until something else is clicked, at which point it freezes again.\r\nI would also like to see a version number or \"last update\" listed on the front page if possible.",
      "PostedDate": "2009-12-23T07:24:28.547-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-12-29T18:30:23.77-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Rawr3 is  being way too slow for me too. Clicking an item slot to change the item takes about 1-2 minutes for the popup list to show up. I've cleared chaches, deleted my local install, done everything listed here, but still takes forever and a day to do anything in it. It used to be super fast... now, not so much. Running 10.6.2 in Safari.",
      "PostedDate": "2009-12-29T18:31:56.47-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-07-02T13:16:49.377-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-11-22T19:56:47.293-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-03-17T21:40:45.093-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:31:08.49-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:22:49.78-07:00",
      "Id": -2147483648
    }
  ]
}