{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Base.Items",
      "DisplayName": "Rawr.Base.Items"
    },
    "ClosedComment": "Fixed for next release.",
    "ClosedDate": "2010-02-15T16:30:50.45-08:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "The 'Add Custom Gemming' feature, which use to work fine, stopped working for me around version 2.3.4. The program itself and all other functionality appears to be intact. When you right-click on an item, then select 'Add Custom Gemming', and then make the appropriate gemming selections, it appears that the custom item is being added. However, nothing is done and no new custom gemmed item is added; which previously use to. Again, this feature always worked before prior to 2.3.4 & 2.3.5. Furthermore, every new version is exported to a completely new folder and all saved character files are in a separate folder. Any assistance or guidance is appreciated.\n \nRawr 2.3.5\nWindows XP Pro SP3",
    "LastUpdatedDate": "2013-05-16T05:22:28.913-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2010-01-10T14:23:17.787-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Items] Custom Gemming No Longer Working",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 2,
    "Id": 15823
  },
  "FileAttachments": [
    {
      "FileId": 2953,
      "FileName": "Test.xml",
      "DownloadUrl": ".\\2953"
    }
  ],
  "Comments": [
    {
      "Message": "1) Is this still an issue in 2.3.6?\r\n2) Can you clarify the issue? Does it add the new gemming to the comparisons list? Are you expecting something else to happen?\r\n3) Don't save your char files to the same folder as Rawr, save them to a global location like My Documents",
      "PostedDate": "2010-01-19T09:50:04.89-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-01-19T12:20:23.107-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-02-07T17:42:13.407-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Closed for no contact\r\n\r\n\n\n** Closed by Jothay 2/7/2010 5:42 PM",
      "PostedDate": "2010-02-11T07:26:32.033-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Sorry for the delayed response.\r\n1.  Yes, the issue still persisted in 2.3.6 and in the current version 2.3.8.\r\n2.  I don’t know how much clearer I can be. As I mentioned, when I click on an item in the comparison list, then select 'Add Custom Gemming', and then make the appropriate gemming selections, it appears that the custom item is being added. However, nothing is done and no new custom gemmed item is added to the comparison list; which previously use to.\r\n3.  Also as I mentioned, every time I download a new version, that version is exported to a completely new folder and all saved character files I maintain in a separate folder.\r\n4.  Additionally, I also downloaded/exported Rawr on a completely different computer, then imported a clean armory profile. I then again attempted to select an item an follow the same process and still was not able to add custom gemming.",
      "PostedDate": "2010-02-11T07:26:33.723-08:00",
      "Id": -2147483648
    },
    {
      "Message": "This is working for me. Can you attach the character xml where you added a custom gemming and it doesn't show for you (the custom gemmings are saved per character, not per installation)?",
      "PostedDate": "2010-02-13T14:30:45.457-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Attached is the newest character .xml I saved. It was created with the latest version, 2.3.9, imported a clean armory profile, made character adjustments (talents/buffs/options), then attempted to add custom gemming of an item. Again, it appears the item is being created/added, but still no new item is showing.",
      "PostedDate": "2010-02-14T19:58:02.833-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-02-14T19:58:04.147-08:00",
      "Id": -2147483648
    },
    {
      "Message": "The issue was if the custom item instance was already generated by the gemming template.",
      "PostedDate": "2010-02-15T16:30:34.59-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-02-15T16:30:50.45-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Thanks for the reply. I'll re-check next release and post if it's working again or not.",
      "PostedDate": "2010-02-17T17:19:16.193-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Feature is finally working again in 2.3.10. Previously added items that didn't show in earlier versions (from 2.3.4-2.3.9) finally appear and newly created items can now be created/added properly.",
      "PostedDate": "2010-02-24T16:36:26.583-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-09-08T16:05:04.33-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:30:39.74-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:22:28.913-07:00",
      "Id": -2147483648
    }
  ]
}