{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.DPSWarr",
      "DisplayName": "Rawr.DPSWarr"
    },
    "ClosedComment": "",
    "ClosedDate": "2009-08-06T10:13:16.03-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "See  the attached character file. Toggling most any buff off having to do with haste / hit / crit rating will cause crit to go from 1.15 SEP (obviously bogus) down to a more reasonable 0.88 SEP.",
    "LastUpdatedDate": "2013-05-16T05:25:01.293-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2009-08-01T08:16:54.857-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[DPSWarr.Fury] Crit rating corner case bug in Relative Stat Values",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 13758
  },
  "FileAttachments": [
    {
      "FileId": 2065,
      "FileName": "Miklenne Fury.xml",
      "DownloadUrl": ".\\2065"
    }
  ],
  "Comments": [
    {
      "Message": "Followup: Haste rating also doubles in value in this corner case.\r\nInterestingly, Agility barely moves.",
      "PostedDate": "2009-08-01T08:20:43.313-07:00",
      "Id": -2147483648
    },
    {
      "Message": "I'm sure ebs or Jothay will investigate this, but while they do, please note that Rawr doesn't use SEP, or any sort of relative stat values, and you shouldn't either, where possible. See the GIANT FRELLING DISCLAIMER on the Relative Stat Values chart. Instability that you see on that chart is not an indication of there actually being a problem. There may be a problem, but this doesn't show that there is one.",
      "PostedDate": "2009-08-01T11:08:54.203-07:00",
      "Id": -2147483648
    },
    {
      "Message": "The stat points can vary wildly from one point/rating to the next. Haste for instance was broken in a few areas and I believe I just fixed the last of it, other stats are a different story. I'm doing some extensive testing with arms point to point off of a blank character to see what stats are still giving negative DPS with certain abilities (which was the reason for the haste issue).",
      "PostedDate": "2009-08-01T20:07:41.94-07:00",
      "Id": -2147483648
    },
    {
      "Message": "mike,\r\n\r\nnot-withstanding your shortcomings on this character (poor gemming, failure to activate meta, poor enchanting, wearing leather when you could have easily worn better plate, failure to follow hit/exp caps, putting berserking on a blue weapon, very poor talent choices)........\r\n\r\nI loaded up your character in the unreleased build and was not in any way able to reproduce your issue with crit. I did however notice that Hit behaved almost in the fashion you described, although this isn't an issue, it's just a numbering thing.\r\n\r\nand please, select the enchants available to you and run an optimize, your character could be a lot better.",
      "PostedDate": "2009-08-01T23:53:11.94-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Yeah I noticed later that Hit varied wildly too.\r\n\r\nThanks for the somewhat unnecessary advice on my 6th alt that dinged 80 3 days ago, whose offspec gear & stats I haven't bothered to keep 100% up to date in Rawr :P   (It tends to get exported as Prot to the armory)",
      "PostedDate": "2009-08-02T05:49:28.717-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-08-06T10:13:16.03-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-09-08T16:41:47.643-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:33:51.797-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:25:01.293-07:00",
      "Id": -2147483648
    }
  ]
}