{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "You apparently didn&#39;t read the Optimizer documentation. It says to mark it with a Blue Gem if you don&#39;t want to reforge, regem and reenchant the item. Make sure it doesn&#39;t also have a Green gem on it, which you can check by going to the Available &#62; Gear chart",
    "ClosedDate": "2011-04-04T15:04:51.463-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "I searched the documentation and forums and even googled \"rawr restrict specific item reforge\" and have found nothing on the subject, though I am sure the functionality is there, I'm just not bright enough to find it or figure it out on my own it seems.\n \nI am building 4 sets of gear: arcane5, fire5, arcane raid, and fire raid. Arcane will be the primary raiding spec. All of the sets will feature 2 items that won't change and that I don't want to reforge/regem which would be the Dreamless Belt and Breeches of Mended Nightmares. Having no desire to drop another 8k gold to pick up a second set of each. I want to optimize those 2 pieces for arcane raiding and have the other three builds optimize around those static pieces. \n \nIs there a way to restrict the optimizer to not allow reforge/regem on just those 2 specific items? \n \nI know it must be in there somewhere, but I can't seem to find it... maybe I am just wording my issue/documentation/google queries, but I am just not having any luck!\n \nThanks in advance :)",
    "LastUpdatedDate": "2013-05-16T05:18:16.89-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2011-04-04T13:52:31.797-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "Restrict specific items from being reforged",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 20412
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Sorry, blue diamond, not gem",
      "PostedDate": "2011-04-04T15:05:09.01-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:25:25.647-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:18:16.89-07:00",
      "Id": -2147483648
    }
  ]
}