{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Base",
      "DisplayName": "Rawr.Base"
    },
    "ClosedComment": "Seems to be fixed in current version.",
    "ClosedDate": "2008-12-04T07:57:04.94-08:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "The popouts which appear when selecting gear for a particular item slot will extend upwards outside of the viewable screen area.  This requires repositioning of the Rawr screen on the desktop in order to select items at the top of the list.  Some popouts will extend down, rather than up, if they are close enough to the top of the screen, but there are usually one or two item slots which will extend above the top of the screen.  The attached image is a screenshot of the upper-left portion of the desktop.  Screen resolution is 1280x800, Windows XP, Rawr Beta 9a.",
    "LastUpdatedDate": "2013-05-16T05:27:36.31-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2007-12-07T14:01:52.46-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "Item Selection Popouts Extend Outside of Viewable Screen",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 2,
    "Id": 9029
  },
  "FileAttachments": [
    {
      "FileId": 663,
      "FileName": "rawrerror.PNG",
      "DownloadUrl": ".\\663"
    },
    {
      "FileId": 738,
      "FileName": "RAWR-screen.jpg",
      "DownloadUrl": ".\\738"
    },
    {
      "FileId": 745,
      "FileName": "rawr9viewbug.JPG",
      "DownloadUrl": ".\\745"
    },
    {
      "FileId": 746,
      "FileName": "rawrviewbug.JPG",
      "DownloadUrl": ".\\746"
    }
  ],
  "Comments": [
    {
      "Message": "Well, currently, it'll try to extend downward... If it doesn't have enough room to extend downward, it'll extend up instead. On small screens like yours, it may not have room in either direction. Knowing that, ya should be able to work around it, until I can fix it so that it displays in the middle if it doesn't have room at the top either.",
      "PostedDate": "2007-12-11T12:29:38.313-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Hi Astrylian,\r\nfirst of all many thanks for your work. Rawr is just great!\r\n\r\nI got the same problem as described in the post above. Additionally the inner frame is somewhat too small to show the full box containing the \"Basic Stats\" and the \"Complex Stats\".  I'm using Windows XP with a Screen Resolution of 1440x900 Pixels. The bug showed up for the first time with Rawr Beta 10. Any Idea how I can circumvent this problem in order to see all the calculated stats?\r\n\r\nThanks a lot for your help!\r\n\r\n",
      "PostedDate": "2008-01-31T09:58:04.213-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2008-01-31T09:58:05.497-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2008-01-31T10:07:35.663-08:00",
      "Id": -2147483648
    },
    {
      "Message": "I also gotta say Astrylian; Awsome job with Rawr! I have been using it a lot!\r\n\r\nI have the same bug as ernato.. However I also had that bug in the Rawr Beta 9. In that version it only occured in the Buffs window tho so I dident bother too much about it. Now it appears both in the stats window, like in the screenshot, and in the buffs window. Same bug occurs in both the cat and the bear version.\r\nI have Windows XP with Screen Resolution 1680x1050.",
      "PostedDate": "2008-02-09T07:21:01.61-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2008-02-09T07:21:02.593-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Another bug I have been having ever since I started using Rawr is that the edit item window is too small. I'm guessing it has to do with my screen or something but I cant seem to get it fixed myself. The window is just so small that you can only see the top of the buttons, meaning you cant see the label and thereby just have to hope you click the right button.. ",
      "PostedDate": "2008-02-10T05:02:39.777-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2008-02-10T05:02:40.45-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2008-12-04T07:57:04.94-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-05-20T22:28:03.673-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:37:17.35-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:27:36.31-07:00",
      "Id": -2147483648
    }
  ]
}