{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "Rawr does NOT IN ANY WAY use the RSV&#39;s in it&#39;s calculations. As Lord said, the chart you see is simply an output of the calculations.",
    "ClosedDate": "2010-05-07T07:57:00.16-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "Any chance a slide bar could be added to adjust a selected stat +1/-1 (I'm picturing radial buttons next to each stat) for a couple of points?  I'd like to be able to manually adjust stat values 1 point at a time it to see how the other relative stat values change for a quick glance without having to re-gem/chant different items around until I get a more precise combination. If this wouldn't be terribly difficult to implement maybe adding a subtraction selection too, as you would essential be taking away from stat as you re-gem to increase another stat.  The subtraction would need to be automatic and correlated to the stat being increased as the stats are not all a 1:1 ratio in game.  A button to reset the adjusted value(s) back to zero would be nice too.  I know there's the disclaimer at the bottom of the relative stats value tab, that the RSV's are not completely accurate, but I do enjoy seeing the impact of getting so close and/or over a stat that can be capped has on the other relative stat values.",
    "LastUpdatedDate": "2013-05-16T05:20:48-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2010-05-07T05:36:51.797-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "Relative Stat Values adjuster (Feature request)",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 17567
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "The calculation Rawr does is not based on these relative stats. Instead these values are an unreliable result.\r\nIn order to see how your stats weights shift when you increase some of them, I suggest you create a tabard with these stats modifiers on it and equip it to your character.",
      "PostedDate": "2010-05-07T05:46:04.89-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-05-07T07:57:00.16-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:28:33.27-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:20:48-07:00",
      "Id": -2147483648
    }
  ]
}