{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Hunter",
      "DisplayName": "Rawr.Hunter"
    },
    "ClosedComment": "",
    "ClosedDate": "2010-01-23T11:15:25.947-08:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "hiys just wonderd using Rawr 2.3.5 its now saying I should gem haste and armor pen over agility its also saying swap out a hit gem for haste which would take me below 8% is Rawr ok with hunters at the moment or is there some error and its same for other hunters ive spoken to any ideas would be welcomed !!!\n \nhttp://eu.wowarmory.com/character-sheet.xml?r=Moonglade&n=Hearne",
    "LastUpdatedDate": "2013-05-16T05:22:32.393-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2010-01-07T18:51:20.063-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Hunter] Survival Haste and Armor pen over Agility",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 15774
  },
  "FileAttachments": [
    {
      "FileId": 2751,
      "FileName": "hearne.xml",
      "DownloadUrl": ".\\2751"
    }
  ],
  "Comments": [
    {
      "Message": "I need you to post your character file",
      "PostedDate": "2010-01-07T19:03:23.207-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Looking at your Armory, you are 19 rating over on the hit cap so replacing 1 gem would put you 1 rating under cap. So yes, wasting 19 hit rating or grabbing a +20 ArP gem?",
      "PostedDate": "2010-01-07T19:04:43.737-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-01-07T19:29:37.563-08:00",
      "Id": -2147483648
    },
    {
      "Message": "yep I agree with that thx noticed i'm over 500 armor pen will that account for using armor pen gems over agility?",
      "PostedDate": "2010-01-08T02:57:43.207-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-01-08T02:57:44.893-08:00",
      "Id": -2147483648
    },
    {
      "Message": "I can't take an actual look right now but 500 may be right at your tipping point, I'm going to implement the stat graph in Hunter this weekend to watch for things like this.",
      "PostedDate": "2010-01-08T07:46:15.613-08:00",
      "Id": -2147483648
    },
    {
      "Message": "grabed the armor pen gems (8 of them it sugested)I gemed up the chest and rest of gear rawr suggested now it says change most of them for haste i'm well over haste cap and as we no haste only benefiets auto shot and steadyshot i'm at a loss what todo next.",
      "PostedDate": "2010-01-08T10:18:32.68-08:00",
      "Id": -2147483648
    },
    {
      "Message": "sorted it thx",
      "PostedDate": "2010-01-08T10:22:16.923-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Notes from your Character File:\r\n- Enforce Gem Requirements wasn't set, this prevents the optimizer from using too many Dragonseye gems and makes sure your Meta is active with the proper requirements. As a Jewelcrafter this is especially important for you.\r\n- Turn on the 'Hide PvP Gear' and 'Hide Spell Gear' options, this cuts down on gear displayed and makes it easier on the Build Upgrade List feature\r\n- You had no Self-Buffs or Pet Buffs selected\r\n- Your Shot Rotation wasn't set up\r\n- Your Pet Talents were not set up\r\n- You have useless items selected, like fishing hats. This only serves to slow down the optimizer.\r\n- You have a lot of items selected per slot, I'd recommend at least dropping it to your top 2 per slot and uncheck the rest\r\n\r\nOnce I fixed half that stuff above, Agility went WAY up in the RSV's and it no longer recommended ArP/Haste and wants Agi now.",
      "PostedDate": "2010-01-08T10:38:26.373-08:00",
      "Id": -2147483648
    },
    {
      "Message": "sorry if i'm being a bit thick but fishing hat is in my bags but not seen nothing in Rawr thats setup with fishing hat and how would that alter my stats if its not equiped have done shot rotation and pet talents as to buffs depends on if i'm raiding or running heroics is there forum where you can get help with Rawr rather than wasting your time when you could be doing something better than helping me with usless fishing hats regards Hearne",
      "PostedDate": "2010-01-09T02:43:39.087-08:00",
      "Id": -2147483648
    },
    {
      "Message": "You have the fishing hat marked available. That means that the Optimizer will waste time trying to use it when you optimize. You probably got it marked available by loading from CharacterProfiler, and not cleaning out all the useless junk that it marked available for you. (It just marks available everything equippable in your bags/bank)",
      "PostedDate": "2010-01-09T14:21:45.407-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-01-23T11:15:25.947-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:30:44.83-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:22:32.393-07:00",
      "Id": -2147483648
    }
  ]
}