{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Base",
      "DisplayName": "Rawr.Base"
    },
    "ClosedComment": "4.1.01 Released",
    "ClosedDate": "2011-03-27T17:48:44.667-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "It would be sweet to have a feature to solo (quick filter) your item lists. Something like an audio mixing board, where when you click solo everything else is muted.\n \nSo for example, lets say you are looking over your options for head slot. You could be looking at an item and then somehow click solo for an aspect of it like source raid or boss, etc. Then all items listed would vanish showing nothing but things dropped in that raid or by that specific boss, and your current equipped items in all configurations. (in every slot). Until you un-solo, and then everything would go back to the regular filter settings.",
    "LastUpdatedDate": "2013-05-16T05:19:49.43-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2010-09-20T18:04:37.773-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Feature Request] Solo Buttons",
    "Type": {
      "Name": "Feature",
      "Id": 1
    },
    "VoteCount": 1,
    "Id": 18793
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "In an effort to translate this to something that makes sense:\r\n\r\nYou want to be able to click and item and see everything that drops from that source (either the boss or the instance the boss is in). But not only that, how your gear would improve based on having those items (individually I'm guessing).\r\n\r\nSo basically, you want to use Build Upgrade List with only those filters active.\r\n\r\nMore basically, with the exception of a direct button to do so, you want what you can already do with the program.",
      "PostedDate": "2010-09-21T12:50:59.29-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Sorry, it seems i'm not getting the idea across clearly.   You can't do what I'm talking about in the application. To do anything like what i'm talking about you have to go through the filter list and uncheck each one till the only thing left was the ONE filter you want.    Correct?  (maybe i'm not seeing something, I don't have it in front of me here at work...)   then you get to go back and turn them all back on.\r\n\r\nI would like to see a way to SOLO that essentially makes that 1 filter the ONLY one active, till you un check it, or check a different SOLO box.  all the other filter settings remain as they are, they just are ignored as long as the solo (one) button is checked.  I see effecting every place the filters do, not just in upgrade lists, everyplace.",
      "PostedDate": "2010-09-21T13:43:13.36-07:00",
      "Id": -2147483648
    },
    {
      "Message": "This took me quite a while to understand, but I think I do now. \r\nHowever, I doubt any users (apart from those who do audio mixing) would find it anything other than extremely confusing. ",
      "PostedDate": "2010-09-21T16:11:37.35-07:00",
      "Id": -2147483648
    },
    {
      "Message": "sorry for the confusion.  I'm sure there is some way to make it more simple to understand.  audio mixing was the best example I could come up with to get the idea out there...",
      "PostedDate": "2010-09-21T18:16:34.49-07:00",
      "Id": -2147483648
    },
    {
      "Message": "I got it clearly the first time, but then again, music's kind of my 'thing', so... yeah.\r\n\r\nI do see value in this, to quickly see what's available in any given instance (most notably, if you happen to go to an instance and either find how potential gear stacks up, or to quickly determine what's even available there).  The functionality is there already, this is just another way to get at it.",
      "PostedDate": "2010-09-22T17:23:38.737-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-11-23T13:49:26.427-08:00",
      "Id": -2147483648
    },
    {
      "Message": "More generically what I think he is after is the ability to switch filters. So rather than ticking/unticking specific filter options, he is talking about loading a specific filter set. In his example he talks about a filter set with a single item ticked. \r\n\r\nI'd see this as a useful feature to be able to save/load the current filter set so you could swap around filters quickly and easily without having to manually tick/untick things. \r\n\r\nI THINK this is what he is after.",
      "PostedDate": "2010-12-02T09:09:40.937-08:00",
      "Id": -2147483648
    },
    {
      "Message": "different filter sets would indeed be handy.\r\n\r\nbut what I'm talking about here is even more basic than that.   a Solo button would be like an instant filter set, where everything is unchecked except for the ONE thing you just chose to solo.  Solo meaning Alone, or Unaccompanied.  pilots have to have their first Solo flight, great musicians often play alone (solo) or get a solo in a musical work (drum solo, guitar solo)  etc.   :)",
      "PostedDate": "2010-12-02T16:56:26.923-08:00",
      "Id": -2147483648
    },
    {
      "Message": "I have a better idea for this and am working on it now",
      "PostedDate": "2011-03-18T15:11:34.377-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Commit 58908 adds a new chart called Search Results. With this and the Live filtering box (shift+enter when typing or enter the text and click the 'Adv Search' button) you can do the following search scenarios and more:\r\n* \"Maloriak\" and be shown a completely unfiltered list of all items that drop from him (including items you may not be able to wear like Plate in Bear)\r\n* Check Regex and do \"65187|65037|59346|65252\" to list only those items by their id\r\n* \"Magma Plated Legguards\" to see both the 359 and 372 versions of this item\r\n\r\nIn each of these cases the chart allows you to mark the item/enchant/tinkering with Green and Blue diamonds and you should be able to use the Equip option directly.",
      "PostedDate": "2011-03-18T16:52:59.797-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-03-27T17:48:44.667-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:27:22.423-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:19:49.43-07:00",
      "Id": -2147483648
    }
  ]
}