{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Base",
      "DisplayName": "Rawr.Base"
    },
    "ClosedComment": "",
    "ClosedDate": "2010-01-12T08:23:55.033-08:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "I have used Rawr for my DK and Warlock, across several versions of Rawr, and it continues to make recommendations ignoring Meta gem requirements.",
    "LastUpdatedDate": "2013-05-16T05:22:35.85-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2010-01-05T03:52:59.74-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Base] Blue gems never recognized as required in Optimizer",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 15724
  },
  "FileAttachments": [
    {
      "FileId": 2769,
      "FileName": "Ebonstorm1052010.xml",
      "DownloadUrl": ".\\2769"
    }
  ],
  "Comments": [
    {
      "Message": "You might want to post your character file, and also is the box checked to enforce meta gem requirements?",
      "PostedDate": "2010-01-05T04:38:43.267-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-01-05T08:11:20.3-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Checking the box to force Meta gem requirements still leads to confusing results. I get a higher gear score without checking the box - in which case the Meta Gem is not activated - than I do when I check it.\r\n\r\nBasically, RAWR is saying with a gain of 14 Strength and a loss of 10 Agility, 21 Crit rate, and 3% Crit damage I get a higher DPS than if I gem for a 16 Strength increase and 10 crit rate loss!\r\n\r\n2 things bother me here. 1) That you consider this to be a \"low impact\" issue, and 2) That Meta gem activation is disabled by default.\r\n\r\nThe whole purpose for using programs like this is to be able to make the judgments that aren't obvious - and 95% of them are, in which case the program is of little value. If it can't tell the difference between activating a Meta gem and not, then it throws the whole program in to major suspicion in my eyes. This is not really a \"low\" impact problem, in that light.\r\n\r\nMeta gems are powerful gems (at least a few of them). Not considering them as a must-have by default causes me to question the thinking of the programmer(s) involved in the development of the program.\r\n\r\nDon't get me wrong here, I understand you put a lot in to this and are working on it continually. My criticism is intended to spur you on to more accurate efforts, not tell you that you have a bad product (I don't believe that's the case).",
      "PostedDate": "2010-01-12T08:10:33.71-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-01-12T08:10:39.64-08:00",
      "Id": -2147483648
    },
    {
      "Message": "A) Lose the pissy attitude, we don't like it.\r\nB) Low impact is the default, someone has to physically take it off that in order for it to change to Medium or High.\r\nC) 90% of the issues with Meta Gems not getting their blue gems for activation are due to the user not activating the Enforce Gem Requirements option on the Stats pane, as described in the Documentation: http://rawr.codeplex.com/documentation This is not on by default in Rawr2 due to the overwhelming number of emails Astrylian gets from users stating that the Item values in the Comparison charts are skewed because this item looks better than that item and the real reason is because it's got that blue gem in it to activate the Meta. Rawr3 has it on by default regardless.\r\nD) The reason you get a higher score without checking the box is because the Meta is ignoring what it needs to activate it, so it works regardless (giving you that 21 Crit, 3% Crit Damage) without needing the 2nd blue gem. Checking the option means that you need to replace that STR gem (or any other, we recommend a blue slot if possible) with something that works as a blue, either a Nightmare Tear (prismatic), a Purple Gem or a Green Gem would be best as the pure blue ones don't help most DPS classes.\r\n\r\nTLDR: It's functioning as intended, mark Enforce Gem Requirements for more accurate results, turn it off to see more flowing values in the comparisons charts.",
      "PostedDate": "2010-01-12T08:23:48.24-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-01-12T08:23:55.033-08:00",
      "Id": -2147483648
    },
    {
      "Message": "I'm sorry that you took my criticisms to be \"pissy attitude\". However, I clearly stated at the end of my post that what I said was NOT to denigrate you or RAWR in any way. I fully acknowledged your hard work and attempts to make RAWR an accurate tool for everyone to use.\r\n\r\nI'm still confused though. Pardon my being dense, but it seems to me like you are saying that if I don't check the box the results will be wrong, and if I do check the box the results will be wrong, but RAWR is working as intended?\r\n\r\n1) My base score is lower than the results with the box unchecked and \"optimize\" is run, as is should be becasue there are better gemming options than what I have.\r\n\r\n2) If I check the box, the gear score is higher than my base, but lower than the score with the box unchecked.\r\n\r\n3) I need to check the box for the Meta to be activated in RAWR so the gems it recommends will be more accurate, but ignore the gear score because the Meta gem is actually activated in both situations (box checked or unchecked).\r\n\r\nYou are saying this is not because of how RAWR is written but becasue Meta gems force themselves into being activated and RAWR can't change that, so RAWR is working as intended.\r\n\r\nDo I understand correctly?\r\n\r\nPlease, please take my criticism in the spirit intended; if I didn't think RAWR was worth putting effort in to, believe me I would not take the time to make these posts!\r\n\r\n\r\n\r\n\r\n\r\n",
      "PostedDate": "2010-01-13T07:16:19.203-08:00",
      "Id": -2147483648
    },
    {
      "Message": "When the box is not checked, Rawr will always have the meta gem as active.  We have this for comparing individual slots in a vacuum: \"My gloves currently have a blue gem in a blue slot, which activates my Meta.  Are there any gloves that don't have a blue slot, but are an upgrade if I re-gemmed something else with a blue gem?\"  I uncheck the box and look at the glove chart to see what the best glove is, regardless of whether it has a blue slot.  So yes, the results are \"inaccurate\" if you aren't meeting the meta requirement.  It was a design decision made a long time ago due to how many questions we got from people complaining that their BIS gloves weren't showing as an upgrade in the charts.  The only other way to get these results is by building an upgrade list (across all slots), which takes a long time and isn't user-friendly.\r\n\r\nWhen the box is checked, it will not give you the bonus of the meta unless you fulfill its requirements.\r\n\r\nIdeally, you should ignore optimization results without \"Enforce Gemming Requirements\" checked, and that's something we can consider for Rawr3 (forcing it to use that option when you optimize, or popping up a warning while optimizing).\r\n\r\nIs that more clear?",
      "PostedDate": "2010-01-13T10:04:51.857-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-09-05T16:01:48.6-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:30:49.36-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:22:35.85-07:00",
      "Id": -2147483648
    }
  ]
}