{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "Fixed for next release.",
    "ClosedDate": "2011-12-19T16:33:19.23-08:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "Apologies if this has already been brought up although I couldn't find any obvious Issue open on the system.\n \nBasically, I cannot start up any version of Rawr past version 4.3.0 including the most recent build 4.3.2b. I get the error which I have attached as a JPG. The error just loops and I have to terminate the Rawr process via Task Manager. I am running Windows 7 Ultimate x64 and have not had a problem with previous versions of Rawr. I could get v4.3.2b running briefly but an error occurred when I ran an Optimisation for my Ret Paladin with a certain trinket (the VP one I believe, Skull) and the Optimisation progress just hung, I terminated the process and ever since I just get this error when I try to start, is there a cache I can clear? Might there be a bug with this trinket for Ret?\n \nIn an attempt to get Rawr working I uninstalled all versions of the .NET Framework and reinstalled v4.0 plus current updates only, numerous restarts etc. I have deleted the Rawr software folder and un-zipped fresh for each startup attempt but still no luck. I am not un-zipping to the Program Files folder. I'm pretty sure there is no other software interfering with Rawr, I run the basic Security Essentials virus scanner.\n \nBizarrely, I can still open and use Rawr 4.3.0 just fine but naturally it is a bit out of date now and I would like to be using the latest version.\n \nThanks.",
    "LastUpdatedDate": "2013-05-16T05:17:10.667-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2011-12-19T16:05:52.583-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "Unable to open any Rawr version past 4.3.0",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 21940
  },
  "FileAttachments": [
    {
      "FileId": 5505,
      "FileName": "rawr_432b_Startup-error.jpg",
      "DownloadUrl": ".\\5505"
    }
  ],
  "Comments": []
}