{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.TankDK",
      "DisplayName": "Rawr.TankDK"
    },
    "ClosedComment": "",
    "ClosedDate": "2010-01-04T14:33:33.247-08:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "from a post in EJ:\nFirst, thanks for all the work on rawr.\nNow to my question... quite simply, is the frost DK 2h model broken? I'm speaking specifically to the way that threat is calculated. I've been bouncing around looking at 3 different builds (frost DW, Frost 2H, and Blood 2H), and the threat comparisons just don't match up. Speccing my tank as blood, adjusting glyphs, and adjusting the rotation results in a threat rating of ~20k, changing only weapons, talents, glyphs, and rotation to DW frost results in ~18k threat (sound pretty reasonable), but when i load up 2H frost (using the exact same gear as blood) and adjust talents, glyphs, and rotation accordingly my threat value goes to 40K.... It's widely agreed here in the forums that Blood single target trumps Frost single target period, so frost coming off as 2x the threat of Blood is making my brain hurt. Gear being used is the current gear for Enchantrix on Suramar (us), spec's being used are the \"defaults\" listed here on the forums, and DW weapons has been a various assortment all mostly lineing up with expected threat values.\n \nJust to clarify i have checked, rechecked, and triple checked that im adjusting talents glyphs and rotations on 10+ occasions, and always come out with the same results.\n \nAlso, a smaller problem... You can't actually assign a manual number to rune strike in the rotation creation screen. With the rotation set to custom and \"auto manage RP\" turned off, you still can't push the number of rune strikes past 2. If you input a manual value of 3, close and re-open the config screen then number of RS will be reset to a lower value. I'm not sure if this is enforced on purpose (3 RS doesn't seem impossible in a 20s timeframe, but i have not tested it) or a glitch, any clarification would be appreciated.\n---\nI found the source of my first problem (possibly)... For my Frost 2H tanking set, speccing into Improve Icy Talons is boosting my Threat ~20k. I'm almost positive that would be a bug, so hopefully you guys can get it worked out.\nLast edited by Hatesfury : Yesterday at 6:23 PM.",
    "LastUpdatedDate": "2017-11-27T11:04:33.043-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2010-01-01T07:40:51.583-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[TankDK] Investigate Threat gains from Improved Icy Talons",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 15671
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Resolved with changeset 44980.",
      "PostedDate": "2010-01-04T14:33:33.247-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:30:55.63-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:22:40.53-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2017-11-27T11:04:33.043-08:00",
      "Id": -2147483648
    }
  ]
}