{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "Answered by Astrylian. Support for poor quality items would be a lot of work for no real gain at all. If you really need this I'd suggest you spend an hour or two in game and gain a level or two instead of spending the time trying to get this to work in Rawr.",
    "ClosedDate": "2009-03-19T09:52:55.78-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "I've noticed that items with random enchantments (e.g. Smokey Quartz Ring  http://www.wowdb.com/item.aspx?id=25048) are not handled by Rawr yet, since these items have the same item ID and only differ in name and stats. Those items can neither be added manually (adding an items with the same item ID overwrites the old ones) nor are they imported from character profiles or the armory. It would be great if you could support those items (especially having multiple with the same item ID but different names/stats), since the enchantments can make a lot of difference.",
    "LastUpdatedDate": "2013-05-16T05:26:02.033-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2009-03-17T15:31:38.683-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "Items with random enchantments don't work",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 2,
    "Id": 12828
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "These are about as supported as they're going to be, by just editing the item in question to add the stats. If you really need multiple versions of it, just change the ID to something unique.",
      "PostedDate": "2009-03-17T18:31:33.983-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-03-18T05:13:42.777-07:00",
      "Id": -2147483648
    },
    {
      "Message": "1 more vote for working on this if possible.  It basically removes a whole class of items from this tool or forces each individual user to do a bunch of manual work.",
      "PostedDate": "2009-03-18T05:17:29.273-07:00",
      "Id": -2147483648
    },
    {
      "Message": "So there are no plans to support the Suffix-IDs (see http://www.wowwiki.com/ItemString) in the future? ",
      "PostedDate": "2009-03-18T07:23:34.287-07:00",
      "Id": -2147483648
    },
    {
      "Message": "So there are no plans to support Suffix-IDs (see http://www.wowwiki.com/ItemString) in the future, even if that would largely improve the quality of loading character profiles?",
      "PostedDate": "2009-03-18T07:32:35.82-07:00",
      "Id": -2147483648
    },
    {
      "Message": "What are you guys talking about? Seriously? You're talking about (mostly) crappy greens. On the (should be) rare occasion that you are actually using a decent suffixed item, it takes you literally 10-15sec to add it to Rawr, and this is a problem? Seriously? There's no 'removing a whole class of items' or 'forcing each individual to do a bunch of manual work' here.\r\n\r\nNo, there are no plans to support suffix IDs, due to it being a waste of our time to do so.",
      "PostedDate": "2009-03-18T08:55:53.723-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-03-19T09:52:55.78-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:35:10.837-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:26:02.033-07:00",
      "Id": -2147483648
    }
  ]
}