{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.DPSWarr",
      "DisplayName": "Rawr.DPSWarr"
    },
    "ClosedComment": "Updated for b6.",
    "ClosedDate": "2009-03-26T03:00:45.95-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "Whilst checking Enhance module logic vs similar classes (trying to clean up Enhance) I noted that DPSWarr module still uses 25% for glancing blows in WhiteAttacks.cs. It is my understanding that the widely accepted figure is now 24%.",
    "LastUpdatedDate": "2013-05-16T05:25:59.49-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2009-03-24T05:17:26.567-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[DPSWarr] Using 25% Glancing Blow",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 2,
    "Id": 12864
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Reposted from one of my posts in the \"Any Love for DPS Warriors?\" disussion on this topic:  \"What combat ratings are currently in use in the model?  There have been plenty of conversations about base miss, dual-wield miss, dodge, and glancing blows.  I think the most current accepted values are 16%, 27%, 6.5%, and 24%, respectively.\"\r\n\r\nI do not know, or know how to find out, the comat ratings that are currently implemented - my guess is, it's in the codin side, not something a normal user would have access to.\r\n\r\nAlso, is Expertise still truncating, both in this and other models?  It has been proved that it does not truncate (plateau with zero benefit of increased expertise rating until the next full point fo expertise), contrary to the widely-held belief.",
      "PostedDate": "2009-03-24T06:14:27.363-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-03-24T06:14:36.997-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Updated glancing blow to 24%, thanks Levva\r\nBrWarner, all the combat ratings are in the code. I just checked in changes for them all. I also removed the expertise truncating.",
      "PostedDate": "2009-03-24T07:49:54.763-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Awesome, thanks!  One more thing on this subject: Is crit suppression factored in?\r\n\r\nI'm assuming the combat ratings for ArP will be updated to the new 3.1 values?  If you need the values, I'm sure Astrylian would be able to supply them (or maybe the model relies on certain core code that includes the rating conversions, on a per class basis?)  I can also grab them for you, if need be.",
      "PostedDate": "2009-03-25T07:36:21.557-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Damage reduction from armor with armor penetration is actually one of the few things shared between models right now (though we're actually in the process of making alot more shared, like that).\r\n\r\nWhen we know what the right calculations for ArPen are, I'll implement them in the base classes, and all models will automatically get them.",
      "PostedDate": "2009-03-25T08:27:39.853-07:00",
      "Id": -2147483648
    },
    {
      "Message": "\"When we know what the right calculations for ArPen are\"\r\n\r\nOh, too true...",
      "PostedDate": "2009-03-25T08:56:35.723-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-03-26T03:00:45.95-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-09-05T19:58:53.78-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:35:06.23-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:25:59.49-07:00",
      "Id": -2147483648
    }
  ]
}