{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Retribution",
      "DisplayName": "Rawr.Retribution"
    },
    "ClosedComment": "",
    "ClosedDate": null,
    "CommentCount": 0,
    "Custom": null,
    "Description": "When using the optimizer for DPS Rawr is setting a higher value on Haste and reforging all stats to Haste. It seems as it's trying to get CS to a 3.0 CD which just isn't realistic in the game.\n \nYou can take any character and import it and run the optimizer and it will always try to reforge into Haste.\n \nI've noticed this on every version since woltlk but the version I'm currently using is Rawr4 Beta offline mode.",
    "LastUpdatedDate": "2013-02-21T18:24:45.747-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2011-07-02T10:42:28.153-07:00",
    "Status": {
      "Name": "Proposed",
      "Id": 1
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Retribution] Haste has a High Value",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 21064
  },
  "FileAttachments": [
    {
      "FileId": 5144,
      "FileName": "4.2.1 Ret.xml",
      "DownloadUrl": ".\\5144"
    },
    {
      "FileId": 5156,
      "FileName": "odd.png",
      "DownloadUrl": ".\\5156"
    }
  ],
  "Comments": [
    {
      "Message": "To start with: Please download the latest verion 4.2.0 (you are 2 or 3 major changes and several tweaks behind) since a lot of work has gone into re-defining the retribution combat cycle. Secondly, if the problem doesn't clear up, please post your character html file so that the developers can dig into identifying the probable cause(s). If the latest version resolves the issue, please post here so that this issue can be closed",
      "PostedDate": "2011-07-02T14:00:16.867-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Well that's right, the stat value for haste is a bit off. => slightly higher than all the other, so it reforges everything to haste.",
      "PostedDate": "2011-07-03T04:42:23.34-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-07-12T10:12:00.347-07:00",
      "Id": -2147483648
    },
    {
      "Message": "I have been using the most up to date versions as I update it every time it has an update available and maintain checking the rawr website to be sure I'm using the latest software version. However I went ahead and downloaded the 4.2.1 WPF and ran the calculations again to see if there was a change.\r\n\r\nEnd result is Stat values show Mastery to be above Haste and Crit to be below Haste which appears to be slightly off still. I also have noticed that switching around the refresh time on Inquisition is changing the stat value as well, for instance using 3 HoPo for Inq and refreshing @ 1 second Show 40 Haste Rating gems having a extremely superior DPS value ( 759.28 ) simply changing the refresh from 1 second to 2 brings the 67 Str JC gem to 171.23 as the top value. All the way up to 6 seconds on the refresh shows Str being superior 7 seconds brings Haste/Str gems up top and then 8 seconds back to Strength.\r\n\r\nI'm not sure where the stat value is coming from depending on Inquisition refresh time but I figure it has to do with something in there.\r\n\r\nI've attached the XML file for my current character that I have done the testing with.",
      "PostedDate": "2011-07-12T10:12:01.913-07:00",
      "Id": -2147483648
    },
    {
      "Message": "I did some additional checking and really it appears if you set Inq refreshed time to 8 seconds ( I know this sounds wrong ) and HP used for Inq to 2 and take a look at the stat values as well as run the optimizer it properly values Mastery -> Crit -> Haste at least closer to what people are reporting. Personally I'm showing Haste to be much further down according to Simcraft so with all the fluctuating values between spreadsheets and applications it's hard to really tell who is correct.",
      "PostedDate": "2011-07-12T10:32:30.107-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Well the HP used and the Inq refreshed defines the rotation. Which defines the stat value. So there is nothing wrong if they're changing if you change the options.\r\n\r\nOn the other hand there are newly some spikes on hit rating and haste rating. On that I'll have a look at it.",
      "PostedDate": "2011-07-12T14:58:05.943-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-07-13T17:51:03.913-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Here is a screen shot of what I was talking about with the stat values getting a little out of control.",
      "PostedDate": "2011-07-13T17:51:07.54-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-10-01T17:11:47.677-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-10-08T14:56:13.86-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:24:45.747-08:00",
      "Id": -2147483648
    }
  ]
}