{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.RestoSham",
      "DisplayName": "Rawr.RestoSham"
    },
    "ClosedComment": "Expected function of gemming more towards SP closer to haste-cap, closing issue",
    "ClosedDate": "2010-02-26T09:21:33.843-08:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "This is not an issue but as directed by your posting guide lines I'm posting here.  I'm curious why Rawr would suggest using SP gems over Haste.  I selected the buffs I normally get in 10 mans. Rawr keeps suggesting the +23 SP gems instead of the +20 hate gems I usually use.  It also recommends the Ancient Pickle Egg over the Solace of the defeated.\n \n1) Launch Rawr\n2) Any change I made from default install can be see in the char file\n3) ran optimizer at full thoroughness.\n \nVer: Rawr 2.3.9\nOS: Win7 64",
    "LastUpdatedDate": "2013-05-16T05:21:49.13-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2010-02-17T22:54:01.51-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[RestoSham] Optimizer gemming for straight SP seems odd",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 16406
  },
  "FileAttachments": [
    {
      "FileId": 2975,
      "FileName": "llela-resto-pve.xml",
      "DownloadUrl": ".\\2975"
    },
    {
      "FileId": 3040,
      "FileName": "25FEB2010HEP_REPORT.txt",
      "DownloadUrl": ".\\3040"
    }
  ],
  "Comments": [
    {
      "Message": "Stats at that level can be odd at times.  In relative stats, which I hate using but heck, it's the easiest part, there is a small thing to note.  20 haste is 4.68 per point, or 93.6 total.  23 Spell power is 4.51, or 103.73 total.  Clearly Rawr believes that by sacrificing some MP5, grabbing a haste trinket, and sailing SP through the roof that you'll get better results.  This can happen in that grey area where Haste starts to over-take SP but is still not enough to be 100% the winner.  I'll look at this more thoroughly tomorrow to make sure it's not a bug.\r\n\r\nDo you get the same values from the current spreadsheets and/or Shaman_HEP?  This would help me see if there is something off.",
      "PostedDate": "2010-02-17T23:13:43.78-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-02-17T23:14:29.587-08:00",
      "Id": -2147483648
    },
    {
      "Message": "You are right.  The difference between choosing the +23 SP gem over the +20 haste gem is trivial when you consider one single slot.  At least if you go by rawr.  But it starts to add up when you sum it across all slots on all gear.  My Rawr gear score jumps from 23823.77 to 25174.32 for a 1350.55 gain.  I have no idea what the 5% increase means since I don't know what I'm comparing it to.  I do feel it is marginal though.  I have 4 items with a +5 SP socket bonus.  Rawr, suggests that I socket for the gem bonus in two of them but not in the other two.  Not sure if this is because I'm close to the haste soft cap or maybe the difference is so marginal that rounding up or down makes a difference.\r\n\r\nI haven't used Daidalos' spreadsheet in awhile.  It hasn't been updated with t10 set bonus either.  I just got a new computer so I have to install active perl to run HEP reports.  I will try to do this tomorrow.\r\n\r\nThanks,\r\nLlela",
      "PostedDate": "2010-02-18T22:46:25.657-08:00",
      "Id": -2147483648
    },
    {
      "Message": "T10 is very....odd.  It's very hard for models to model something like that specifically because it's over-heal needs to be tested.  We do as best as we can on it.  Again, my best idea to think of here is that it's quite possible that stat priorities shift at X gear level, but it's always good to be skeptical of even your own work.",
      "PostedDate": "2010-02-19T22:37:57.073-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Sorry for the late response.  I raided TOC25 tonight with my 4 piece T10 bonus.  The shaman_hep script returns an a lot of messages saying that it doesn't understand the 2 or 4 piece T10 bonus.  \r\n\r\nIt also returns a pretty interesting HEP break down.\r\n\r\nShaman Healing Equivalency Points:\r\n1 SP = 1\r\n1 mp5 = 0.7783 (calculated)\r\n1 mana = 0.0143\r\n1 Haste rating = 2.0362\r\n1 Crit rating = 0.5849\r\n1 INT = 0.6012 (actual)\r\n1 INT = 0.7730 (max theoretical)\r\n\r\nNotice the unusually high weighting given to haste.  It is about .5HEP above the listed value on EJ.  \r\n\r\nProbably because i'm haste capped on LHW and on toc25 I'm mindlessly casting chain heals.  I also had some pugs in the raid so I couldn't really pay attention to healing.\r\n\r\nI've attached the shaman_hep report.  I will post one from ICC25 and ICC10 later this week.  \r\n",
      "PostedDate": "2010-02-25T22:17:35.437-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-02-25T22:17:41.363-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Just one comment about the shift in stat...\r\n\r\nI agree with you on this.  As I move closer to the soft haste cap, i should be changing out my +20 haste gems for +12SP&+10haste gems.  Much like how DPS has to stop gemming for hit at a certain point.   That is why, I'm leaning more towards the gemming recommendations from Rawr of the lootrank/wowhead/EJ recommendation. \r\n\r\nI think this is the right thing to do because 1) it makes sense and 2) even if I were wrong the the cost is trivial.  Of course, one could argue that the reward of being correct is trivial as well.",
      "PostedDate": "2010-02-25T22:23:58.053-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-02-25T23:41:10.767-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-02-26T09:21:33.843-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:29:52.643-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:21:49.13-07:00",
      "Id": -2147483648
    }
  ]
}