{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Base",
      "DisplayName": "Rawr.Base"
    },
    "ClosedComment": "Added for v2.2.28",
    "ClosedDate": "2009-11-21T17:49:22.163-08:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "It would be good to have the new Profession enumeration used to allow users to display professions on the main form eg: drop down lists. If setting and changing professions was standardised in this manner so that developers could guarantee that professions were set we could then implement some significant data improvements.\n \nJewelcrafter specific gems could be filtered on the professions\nEnchanter & leatherworker enchants could be filtered on the professions\nInscriptor shoulder enchants could be filtered on the professions\nBlacksmithing gem sockets could be filtered on the professions\nBoP crafter only items could be filtered on the professions\nProfession buffs could be filtered.\n \nThis would mean that there was one clear and simple place to set (or have set via armoury load) your professions and that all things not available to you would be automatically filtered out. It gets confusing seeing leatherworking enchants on my Jewelcrafter etc.\n \nWe could also include a general preference parameter that turned on or off profession filtering that was on by default, in case users wished to compare existing functionality and look at the effects of profession change.\n \nIt would be trickier but a profession comparison chart could be implemented that showed the max benefit for each profession for that model. This would probably need to be implemented on a model by model basis.",
    "LastUpdatedDate": "2013-05-16T05:23:31.787-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2009-11-06T07:22:03.997-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Feature Request] Professions on the Stats Pane",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 14647
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Once the boxes are added wherever, you can steal the hide enchants code from DPSWarr.",
      "PostedDate": "2009-11-06T12:26:24.66-08:00",
      "Id": -2147483648
    },
    {
      "Message": "I've stolen the code from DPSWarrior but believe that it would be best put in a shared class as after all profession effects are not model specific and all that code is doing is filtering out professions if you don't have the profession.\r\n\r\nI'll have a bash at adding the profession drop downs to Rawr3. My guess is best place would be just below the model selection line in the top box.",
      "PostedDate": "2009-11-17T16:13:42.983-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-11-21T17:49:22.163-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:32:00.243-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:23:31.787-07:00",
      "Id": -2147483648
    }
  ]
}