{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "No point",
    "ClosedDate": "2010-04-14T07:04:00.767-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "Any chance Rawr will ever be split into Rawr Lite versions? I am thinking like Rawr Lite: DPS DK or Rawr Lite: Arcane Mage. It would be totally awesome if I could get only the functionality I need without getting the classes I don't need.",
    "LastUpdatedDate": "2013-05-16T05:21:06.277-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2010-04-11T00:37:52.717-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "Rawr Lite?",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 17200
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Uh... what?\r\n\r\nWell, the answer is no, but I'm more curious what you were thinking. What is the 'downside' you perceive about it including classes you don't need? (There's isn't one, beyond a tiny bit of download time or something, but I want to know why you'd think that there was, so perhaps we can improve the UI somehow)",
      "PostedDate": "2010-04-11T00:49:00.337-07:00",
      "Id": -2147483648
    },
    {
      "Message": "It seems when Rawr first loads and I click Arcane Mage, then I'm waiting for about a minute while the program loads what it needs. I suppose it could be my laptop is a P.O.S., but not knowing about computer programming, I assume the program isn't loading everything mage-related when the application is first started. I just saw that Rawr 3 is going to be browser-based, so maybe this will solve my issues with load time.\r\n\r\nSorry for the neglect to commend the authors with an excellent program. I love Rawr because it's my number one tool for improving my character and the first place I turn.",
      "PostedDate": "2010-04-11T02:42:18.983-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Taking the models out wouldn't change anything, you might be starting in the Mage model but swapping to DPSDK back and forth would yield the same times you see now.",
      "PostedDate": "2010-04-11T05:54:43.23-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-04-14T07:04:00.767-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:28:54.187-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:21:06.277-07:00",
      "Id": -2147483648
    }
  ]
}