{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Mage",
      "DisplayName": "Rawr.Mage"
    },
    "ClosedComment": "Old issue.",
    "ClosedDate": "2009-08-09T17:29:24.227-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "Would it be possible to add a rotation in Rawr.mage to do the usual FFBLBPyro rotation, except to use a Fire Blast if Living Bomb is about to end (caused by using a GCD on hot streaks in between LBs, but negated if two hot streaks proc)? This rotation can have a significant effect on the value of haste also.\nA maintain scorch variant would be appreciated also, in which case Scorch would be used instead of Fire Blast if the Scorch debuff is about to run out, otherwise use Fire Blast.",
    "LastUpdatedDate": "2017-11-27T11:01:45.033-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2009-01-24T18:49:30.257-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Mage] Another frostfire cycle",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 2,
    "Id": 12459
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "I'll keep this in mind, but I won't promise anything. When exactly did you want Fire Blast to be used, whenever cooldown is ready?",
      "PostedDate": "2009-01-24T21:41:36.687-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Fire Blast is used only when it allows you to recast Living Bomb faster than if you decided to wind up another Frostfire Bolt.\r\nThis condition depends on how many Hot Streak Pyroblasts you have proc'd in between Living Bombs, and your haste rating.\r\n\r\nIf you have no haste you would usually fit 4 frostfire bolts in between living bombs (living bomb being a 12 second debuff and frostfire bolts being a 3 second cast).\r\nHowever, if you proc 1 Hot Streak in between living bombs you will use a GCD on Pyroblast and a GCD on a Fire Blast - otherwise, winding up another frostfire bolt would make you lose 1.5 seconds of another living bomb.\r\nIf you proc 2 Hot Streaks in between living bombs, you would use 2 GCDs on Pyroblast and therefore you wouldn't Fire Blast, and so forth...\r\nSignificant amounts of haste would invert these conditions.\r\n\r\nObviously there is some probability math to be done here, which I would trust you with more than myself.\r\n\r\nMy theory is that this should yield more DPS than the regular FFBLBPyro rotation, and I'd really like to see Rawr back it up (or prove it wrong).",
      "PostedDate": "2009-01-27T20:54:07.21-08:00",
      "Id": -2147483648
    },
    {
      "Message": "I'm afraid this is it higher granularity than Rawr currently supports. I would have to first increase accuracy of the current rotations before a comparison like this would give meaningful results. Main difficulty in modeling this is the interaction between hot streak and LB cooldown. Right now the cycles use an approximation model, if a more accurate discrete model is designed at some point I'll take another look at this.",
      "PostedDate": "2009-01-28T16:38:31.187-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Alright. Thanks for the consideration.",
      "PostedDate": "2009-01-28T19:18:18.31-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-01-29T07:07:07.047-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-08-09T17:29:24.227-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-09-08T15:32:49.537-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-09-08T15:34:22.25-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-03-17T21:30:21.047-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-05-21T00:00:17.077-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:35:39.497-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:26:21.26-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2017-11-27T11:01:45.033-08:00",
      "Id": -2147483648
    }
  ]
}