[
  {
    "Id": "311843",
    "ThreadId": "104837",
    "Html": "<p>Is there any way to force item usage without shift-clicking on the items you already have?</p>\r\n<p>For example, I'm a Boomkin, and I have both Abracadaver and Nibelung. &nbsp;I want to run a gear optimization with Nibelung, but because the Abracadaver has better stat values, the optimizer picks it. &nbsp;I know that shift-clicking it off will remove it from the list, just wanting to make sure there's something I'm not missing!</p>\r\n<p>&nbsp;</p>\r\n<p>-Brin</p>",
    "PostedDate": "2010-02-20T17:21:24.8-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "312354",
    "ThreadId": "104837",
    "Html": "<p>Shift clicking? No, just click, to unmark it available.</p>",
    "PostedDate": "2010-02-20T17:52:20.697-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "406377",
    "ThreadId": "104837",
    "Html": "<p>This is of interest to me also ... id love to force an item to stay in slot so i can optimize around it.</p>\r\n<p>If there is a way, kindly post some info.</p>",
    "PostedDate": "2010-02-25T11:54:33.987-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "406385",
    "ThreadId": "104837",
    "Html": "<p>To force Rawr to optimize around a certain item, ensure that no other options are selected to be available to use when optimizing.</p>\r\n<p>So for example, to optimize for Nibelung and ignore Abracadaver as a weapon option, click &quot;Slot: Gear&quot; &gt; &quot;Main Hand.&quot; A list of main hand weapon items will be shown. (This list is organized based on that is selected on the &quot;Sort&quot; dropdown menu) Next to every item on this list there is a diamond shaped button. Clicking the diamond button will select that item and turn it green which&nbsp;basically tells the optimizer, &quot;You can use this item when searching for an optimized gear set.&quot; Go through the list and &quot;un-check&quot; all items but the Nibelung. This will ensure that the Nibelung is the only item in that slot that is available for optimization.</p>\r\n<p>This will work for all item slots.&nbsp;</p>\r\n<p>Note: to select only one variation of a specific item you can ctrl+click an item to make a single selection.&nbsp;</p>",
    "PostedDate": "2010-02-25T12:20:33.16-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "406567",
    "ThreadId": "104837",
    "Html": "<p>yes your right, i hadnt thought of that!</p>\r\n<p>Thanks for the reply</p>",
    "PostedDate": "2010-02-25T13:09:09.707-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]