[
  {
    "Id": "313970",
    "ThreadId": "106951",
    "Html": "<p>I've loaded my DK from the armory and when I try to change the meta from a Chaotic Skyflare Diamond to a Relentless Earthsiege Diamond, the earthsiege doesn't show up. I've searched through various posts and everything I've read makes it sound like I simply go to Gems: Slot and check which gems I want to have available to me, but nothing comes up. I can't even make a custom gemming template because there are zero gem options to put in the boxes. Am I being a complete noob about this or is this a known issue that I couldn't find in the issue tracker?</p>",
    "PostedDate": "2010-02-20T19:34:37.343-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "314322",
    "ThreadId": "106951",
    "Html": "<p>You most likely have the item filtered out</p>",
    "PostedDate": "2010-02-20T19:57:24.647-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "314569",
    "ThreadId": "106951",
    "Html": "<p>How do I go about unfiltering them? Because there is absolutely no gems available that aren't part of the default class template gems and when I check under the &quot;filters&quot; section the only thing I see for gems is the &quot;Disable Gems&quot; option which is not checked. I didn't have this issue until I updated to v2.3.9, which is why I thought it might be a known issue or something but I couldn't find anything on this specific issue. Thanks in advance.</p>",
    "PostedDate": "2010-02-20T20:20:02.03-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "314703",
    "ThreadId": "106951",
    "Html": "<p>Make sure you have ALL the filters enabled EXCEPT the 'Disable ...' ones and make sure those disable ones are all unchecked.</p>\r\n<p>If they still aren't showing up then open teh item editor and make sure they are still in the program as it could be that you have a broken Item Cache.</p>",
    "PostedDate": "2010-02-20T20:28:37.77-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "314964",
    "ThreadId": "106951",
    "Html": "<p>Thanks for the help. I checked everything except the &quot;Disable&quot; options and then went one by one. The &quot;other&quot; option at the very bottom is what put the gems back to being available. Thanks again for the help and a HUGE thanks to all that are developing RAWR. Its simply amazing!</p>",
    "PostedDate": "2010-02-20T20:45:18.693-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]