[
  {
    "Id": "324960",
    "ThreadId": "117857",
    "Html": "<p>I'm sure this has been addressed before, but I am not able to find.</p>\r\n<p>My question: &nbsp;Is the reason some Runetotem pieces (such as the 245 set head and shoulders) showing as higher dps rating than the level 251 Lasherweave counterparts, because of the Runetotem set bonus?</p>\r\n<p>The stats on the 251 Lasherweave seem superior, but RAWR seems to be telling me that it is not worth upgrading to these pieces. &nbsp;I have 2 Lasherweave pieces now (handgrips 251 / Leggards 264). &nbsp;Would RAWR recognize a dps increase if I were to replace the Lasherweave head and shoulders (or chest) at the same time? &nbsp;This would grant me the 4 set lasherweave bonus.</p>\r\n<p>&nbsp;</p>\r\n<p>Thank you very much,</p>\r\n<p>Jeyjar / Eonar</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-02-21T07:58:11.71-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "332799",
    "ThreadId": "117857",
    "Html": "<p>What spec are you talking about, balance or feral?</p>\r\n<p>I know as balance the 2T9+2T10 was almost identical to the 4T10 in terms of DPS (just slightly lower) and I'd imagine its similar for feral. Which means you're most likely going to want to keep 2+2 until you can get four pieces of T10.</p>\r\n<p>Or you could be losing a meta bonus while juggling gear :P</p>\r\n<p>edit: Doh! I'm sorry I didn't see the title said &quot;Feral DPS&quot; I just noticed Runetotem v lasherweave.</p>",
    "PostedDate": "2010-02-21T08:45:43.35-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "342266",
    "ThreadId": "117857",
    "Html": "<p>LOL Thanks )</p>\r\n<p>That what I was thinking? &nbsp;So RAWR does take set bonus into consideration while calculating dps for unique user setups? &nbsp;</p>\r\n<p>So - if we took the set bonus out of the equation, many of the level 251 lasherweave set pieces would rate higher on an individual basis?</p>\r\n<p>&nbsp;</p>\r\n<p>Thanks )</p>",
    "PostedDate": "2010-02-21T10:30:01.213-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "345212",
    "ThreadId": "117857",
    "Html": "<p>First, it's 'Rawr' not 'RAWR', common misconception.</p>\r\n<p>Second, you are correct. Individually, your T10 pieces would be better than your T9.5 if you didn't consider making/breaking set bonuses. To accurately determine when it would be viable to swap to the T10 gear, use the Cost system and try to optimize for 2P then 4P and see if it still recommends T9.5 over T10. There are several threads on this subject.</p>",
    "PostedDate": "2010-02-21T11:35:25.703-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "348936",
    "ThreadId": "117857",
    "Html": "<p>Thanks Jothay! &nbsp;I will check out the cost system. &nbsp;I have never used it before. &nbsp;</p>\r\n<p>Sorry - meant no offense by the 'RAWR&quot; thing. &nbsp;</p>\r\n<p>I have not been using Rawr long, but really love it for my feral dps. &nbsp;Donation on the way )</p>\r\n<p>&nbsp;</p>\r\n<p>Thanks !&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-02-21T13:01:56.043-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "357562",
    "ThreadId": "117857",
    "Html": "<p>WoW! &nbsp;And I mean WOW !! &nbsp;Just a follow up if anyone is interested. &nbsp;Amazing.</p>\r\n<p>OK. &nbsp;Just like Jothay said. &nbsp;It does take set bonus into consideration. &nbsp;Check this out:</p>\r\n<p>My current dps score with 2 pcs Runetotem / 2 pieces Lasherweave: &nbsp; &nbsp;9689.3</p>\r\n<p>I change 1 piece out. &nbsp;Upgrading the individual piece, but loosing the Runetotem 2 pc bonus: &nbsp;9612 (77 pt drop)</p>\r\n<p>I change 2 pieces together (replacing current 2 set bonuses, for a 4 pc bonus) and Bam! : 10,365</p>\r\n<p>&nbsp;</p>\r\n<p>Hope this is helpful. &nbsp;</p>",
    "PostedDate": "2010-02-21T19:26:18.64-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "357630",
    "ThreadId": "117857",
    "Html": "<p>Yeah, 4T10 is absolutely incredibly strong for Cat.</p>",
    "PostedDate": "2010-02-21T19:33:26.81-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]