[
  {
    "Id": "362893",
    "ThreadId": "155401",
    "Html": "<p>I saw in the patch notes for Rawr 2.3.10 that it had the new PTR patch updates added. &nbsp;However, poking through Rawr, I cannot find that this is the case as yet. &nbsp;Perhaps I'm missing a toggle elsewhere.</p>\r\n<p>Brain Freeze now allows instant frostfire bolt (instead of only fireball) in addition to fireball for the proc. &nbsp;Since frostfire bolt benefits from talents in the frost tree more than fireball does, it would seemingly make sense to add all of the ffb combos as a test for dps. &nbsp;Example: &nbsp;FoF shatter combo: &nbsp;Frostfire bolt + Ice Lance. &nbsp;I don't project that this is a massive dps improvement, but I do believe it will be a couple hundred dps more overall.</p>\r\n<p>I've been playing with a spec in Rawr that looks nice, but would be nicer to test once Rawr's got the updated frostbolt coefficients as well as the FFB/FoF/BF combos modeled.</p>\r\n<p>Relevant patch notes:</p>\r\n<p>Frostbolt: Spell power scaling on this spell has been increased by approximately 5%.</p>\r\n<p>Frost</p>\r\n<ul>\r\n<br>\r\n<li>Brain Freeze: This talent now allows your next Fireball or Frostfire Bolt to be instant and cost no mana. There is a small internal cooldown to keep the Frostfire Bolt from immediately triggering Brain Freeze again.</li>\r\n</ul>\r\n<p>And the spec in question would be: http://talent.mmo-champion.com/?mage#_uiDeurT5919_J,MQ6-OH,11403</p>\r\n<p>Am I missing something or was that not the update mentioned in Rawr's 2.3.10 release notes?</p>\r\n<p>(Edit to fix URL for spec/glyphs)</p>",
    "PostedDate": "2010-02-22T14:50:38.853-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "362897",
    "ThreadId": "155401",
    "Html": "<p>You have to turn it on using the PTR Mode checkbox on the options pane.</p>",
    "PostedDate": "2010-02-22T14:59:49.45-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "362898",
    "ThreadId": "155401",
    "Html": "<p>Perfect, thank you. I spent 10 minutes looking everywhere but there. &nbsp;Done. :)</p>\r\n<p>-J</p>",
    "PostedDate": "2010-02-22T15:02:33.147-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "362902",
    "ThreadId": "155401",
    "Html": "<p>Am I correct in assuming that the frostfire bolt in FoF/BF hasn't yet been modeled with the changes? &nbsp;I definitely show the increase in damage due to the improved frostbolt coefficients. &nbsp;But, it doesn't appear FFB is in the combos or final dps modeling. &nbsp;I would expect roughly a 100-300 dps improvement-ish but would like to see final confirmation. :)</p>",
    "PostedDate": "2010-02-22T15:10:04.247-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "362905",
    "ThreadId": "155401",
    "Html": "<p>It was partially implemented into this patch but the full implementation wasn't released until JUST after the release.</p>",
    "PostedDate": "2010-02-22T15:18:02.33-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "362906",
    "ThreadId": "155401",
    "Html": "<p>Thanks. &nbsp;I'll wait till Rawr is &ge; 2.3.11</p>",
    "PostedDate": "2010-02-22T15:20:30.64-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]