[
  {
    "Id": "363191",
    "ThreadId": "155501",
    "Html": "<p>Lets stop beating around the bush here...&nbsp; We've been told not to create discussions, submit bugs, create negative feedback in regards to the <span style=\"color:#ff0000\">Warlock</span> module within <span style=\"color:#0000ff\">Rawr</span>.&nbsp; But unfortunately I think we need to just be open and accepting that it will <strong>NEVER </strong>be completed, worked on, moved forward, progressed, or corrected, <strong>UNLESS </strong>we start to address the lack of serious programming resources / volunteers on the project.</p>\r\n<p><strong>THANK YOU</strong> <em>ArPharazon </em>and everyone else who has worked on it up until this point!!!&nbsp; We appreciate ALL the hard work, time, and effort you have contributed.&nbsp; Real life or other projects sometimes get in the way, and we realize that, and do <strong>NOT </strong>fault anyone when RL rears its ugly head.</p>\r\n<p><strong>BUT</strong>, we need to find additional resources, and own up to the fact that the <span style=\"color:#ff0000\">Warlock </span>module as it stands <strong>RIGHT </strong>now is <strong>INCORRECT</strong>, <strong>BROKEN</strong>, and a dis-service to the entire <span style=\"color:#0000ff\">Rawr </span>project.&nbsp; Including it within the <span style=\"color:#0000ff\">Rawr </span>package is misleading to say the least, and casts a shadow (lol no pun intended) upon ALL of the other modules within <span style=\"color:#0000ff\">Rawr</span>.</p>\r\n<p>Until such time as we can get programming volunteers I would recommend people use <span style=\"color:#800000\">Simulationcraft </span>coupled with stat weightings and <span style=\"color:#800000\">Lootrank </span>to gauge their respective gear, crap, I may even be tempted to allow Realms other than <span style=\"color:#800000\">Farstriders </span>to use my <strong>ONLINE </strong>version of it to juggle gear.</p>\r\n<p>I just hope we can find the people, and expertise to continue this great project for <span style=\"color:#ff0000\">Warlocks</span>.&nbsp; It is simply one of the best tools available, and it hurts me deeply every time I see the icon sitting there on my desktop, and knowing it has absolutely no use currently.</p>\r\n<p>&nbsp;</p>\r\n<p><em>PS: I've read the posting guidelines, but I'm sure this thread / discussion of resource allocation and recruitment doesn't meet some facet of it somehow :)</em></p>",
    "PostedDate": "2010-02-23T07:37:28.413-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "363229",
    "ThreadId": "155501",
    "Html": "<p>I, too, am appreciative of ArPharazon's work, and I, too, would be exited if another talented person out there who has more time&nbsp;could be given the model.</p>",
    "PostedDate": "2010-02-23T08:53:39.513-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "363454",
    "ThreadId": "155501",
    "Html": "<p>Indeed!!&nbsp; I totally agree with you Faidwen.&nbsp; If there is a programmer/developer out there somewhere in this big old wow&nbsp;world please help us.&nbsp; My lock is my favorite toon and this is my favorite gearing application/tool to use for her.&nbsp; We have been so patient and even scared to&nbsp;comment in here anymore for fear we will get our heads chopped off.&nbsp; It is a fabulous tool and should be enjoyed by all.</p>",
    "PostedDate": "2010-02-23T16:06:48.267-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "363463",
    "ThreadId": "155501",
    "Html": "<p>As I've told everyone who has inquired lately, it's open season on Rawr.Warlock. I just want it working as much as you guys do, and would welcome anyone that wants to work on it, it fix it's remaining problems, and maintain it. As far as I know, it's mostly complete, minus the obvious gaping hole of Pets.</p>",
    "PostedDate": "2010-02-23T16:26:47.947-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "363499",
    "ThreadId": "155501",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>Astrylian wrote:</strong><br>\r\n<p>As far as I know, it's mostly complete, minus the obvious gaping hole of Pets.</p>\r\n</blockquote>\r\n<p>Quick look through the source code comes up with this list:</p>\r\n<ol>\r\n<li>Pets not fully implemented&nbsp; - (there seems to be a mix of the old pet code in there, and parts that are obviously what ArPharazon was starting to work on)</li>\r\n<li>Hasn't been updated to match patch 3.3.2&nbsp; - (I have submitted a patch for this excl Empowered Imp change)</li>\r\n<li>Decimation/Drain Soul execute (inc Death's Embrace I think) not implemented</li>\r\n<li>Molten Core not implemented</li>\r\n<li>Needs to include patch 3.3.3 stuff as well</li>\r\n</ol>\r\n<p>I'll continue going through the code and implementing/updating what I am able to (more than likely very little as I have only basic C# knowledge) and post up some more patches when I can.</p>",
    "PostedDate": "2010-02-23T19:12:14.277-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "363807",
    "ThreadId": "155501",
    "Html": "<p>Last time I talked to ArP, he was actually getting pretty close to being ready to submit something.&nbsp; It's not a matter of programming resources as much as it's a matter of nailing down the theorycrafting, which is fairly complex for a Warlock.</p>",
    "PostedDate": "2010-02-24T11:08:10.657-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "406493",
    "ThreadId": "155501",
    "Html": "<p>Hey guys,</p>\r\n<p>Just looking for clarification and some honesty.</p>\r\n<p>I've been playing WoW for about a month now after a 4 year break. I'm from vanilla/early BC era. I leveled a Warlock from 1-80 in a few weeks and I've been raiding up to Sindragosa at this point as my guild's demo Warlock. As someone relatively new to the class, being introduced to Rawr was a godsend. No longer did I need to juggle hit and figure out what point I should start stacking haste with SP rather than raw SP... This tool did it all for me. I packratted away all my gear in the bank just in case Rawr's optimizer told me I needed to equip it again.</p>\r\n<p>I use Rawr to optimize me four sets progressively: 25man full-buffed Demo [Meta/Ruin], 10man Destro [Replenishment], no-buff Demo, no-buff Destro.</p>\r\n<p>Anyway, my question is this... Should I stop using Rawr to optimize my gear after every raid and build me an upgrade list? Should I be using something much simpler like stat weights and lootrank and manually juggle my hitcap?</p>\r\n<p>I LOVE what Rawr does for me, but ever since I've been using it (which is day 1 of raiding for me, actually) I've been told it's basically broken for Warlocks. I've read that the calculations aren't completely off and they are generally off by matter of scale rather than error in calculation. So I'm still not completely sure if this tool can be declared useless for Warlock or if it's useful as a gear optimizer but not a DPS simulator... I've read through this forum a bunch of times and I've heard it both ways from the developer standpoint and the end-user perspective.</p>\r\n<p>My guild is now on Sindragosa [25man] and Lich King [10man], and I want to be absolutely sure I'm raiding at my VERY best when raid days roll around. Should I drop Rawr (at least, temporarily) as my tool of choice for selecting gear?</p>",
    "PostedDate": "2010-02-25T12:58:02.51-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "406882",
    "ThreadId": "155501",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>xioustic wrote:</strong><br>\r\n<p>Should I drop Rawr (at least, temporarily) as my tool of choice for selecting gear?</p>\r\n</blockquote>\r\n<p>Not being part of the dev team, I can't exactly answer this with any true authority.  However, as a fellow warlock, I would say no -- you shouldn't drop Rawr.</p>\r\n<p>Rawr.Warlock's got some flaws in its model, sure.  Pets aren't there yet, some procs aren't working right, some talents aren't being correctly accounted for.  As such, it's not going to give you a gear list that's 100% error-free.</p>\r\n<p>What it <em>will</em> do, and admirably so, is give you a pretty good indication of your optimal gear.  Rawr isn't a combat simulator, which the devs have gone out of their way to stress.  It's not SimCraft, and I don't think it's the Rawr dev team's objective to make it as comprehensive and (dare I say) accurate as SimCraft.</p>\r\n<p>Personally, I use both Rawr and SimCraft in conjunction to figure out my optimal gear.&nbsp; I think it's worked fairly well so far.</p>",
    "PostedDate": "2010-02-25T14:44:24.807-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "407185",
    "ThreadId": "155501",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>McC wrote:</strong><br>\r\n<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>xioustic wrote:</strong><br>\r\n<p>Should I drop Rawr (at least, temporarily) as my tool of choice for selecting gear?</p>\r\n</blockquote>\r\n<p>Not being part of the dev team, I can't exactly answer this with any true authority.  However, as a fellow warlock, I would say no -- you shouldn't drop Rawr.</p>\r\n<p>Rawr.Warlock's got some flaws in its model, sure.  Pets aren't there yet, some procs aren't working right, some talents aren't being correctly accounted for.  As such, it's not going to give you a gear list that's 100% error-free.</p>\r\n<p>What it <em>will</em> do, and admirably so, is give you a pretty good indication of your optimal gear.  Rawr isn't a combat simulator, which the devs have gone out of their way to stress.  It's not SimCraft, and I don't think it's the Rawr dev team's objective to make it as comprehensive and (dare I say) accurate as SimCraft.</p>\r\n<p>Personally, I use both Rawr and SimCraft in conjunction to figure out my optimal gear.&nbsp; I think it's worked fairly well so far.</p>\r\n</blockquote>\r\n<p>What he said.</p>\r\n<p>I tend to complain a bit about it, but it's because I'm kind of an odd combination of perfectionist and lazy - if I can't do something right, I don't do it at all.&nbsp; As it stands, Rawr's stat balancing is off by somewhat-insignificant values, but it's enough to bug me.&nbsp; Given the number of procs and other things that aren't properly modeled, I don't think that the program is accurate enough for *me* to use - I can determine my own rough estimates of gear on an individual piece basis, I want to use Rawr to decide things like:</p>\r\n<p>-Is it better to use Dying Curse+NMIC and drop hit from other pieces of gear?&nbsp; [varies based on quality of the other gear and how close you can come to the hit cap]</p>\r\n<p>-How should I balance my Haste/Crit/Spellpower, given my particular [available] pieces of gear?</p>\r\n<p>-I have horrible luck with OH drops; is Shriveled Heart+Quel'Dalar better or worse than Nibelung with my current gear/spec?</p>\r\n<p>-Is it better to use [when I go Destro] Suppression for 3% hit or better to go full-hit?</p>\r\n<p>Given my wide variety of gear - I have half a bank of 20 slot bags full of T8/T9/T10 gear, plus some that I carry - figuring all of this out with Simcraft would be so time-consuming as to be pointless.</p>",
    "PostedDate": "2010-02-25T17:39:39.13-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "407275",
    "ThreadId": "155501",
    "Html": "<p>Thanks guys, that's the response I was hoping for. I just need to get more familiar with Simcraft and I can officially say I'm theory-crafted to the point I'm willing to take it.</p>\r\n<p>I'll continue using Rawr (somewhat blindly) to choose my gear from my bank/inv for each one of my specs. I've been raiding for 2-3 weeks and I already have half a bank full of alternate gear I let Rawr play with in optimizing. :)</p>\r\n<p>I figure, if anything, Rawr is thinking a lot harder than I normally would even if it's doing it marginally incorrectly at the time being. That alone makes it better than if I was without it.</p>",
    "PostedDate": "2010-02-25T18:41:51.16-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "408522",
    "ThreadId": "155501",
    "Html": "<p>The obvious way to determine if what you're seeing in Rawr matches up with &quot;reality&quot; (so far as it goes) is to run a couple of varied gear simulations in SimCraft and see what it generates for stat weights.&nbsp; Plug those in to Loot Rank and see what gear comes out on top.&nbsp; Then, compare that gear to what Rawr is generating.&nbsp; For me, the items are almost exactly the same, with minor variations in their placement within the top 5 or 10.&nbsp; The overall best is almost always the same between both.</p>\r\n<p>Some of your specs being demo, you're going to get tripped up when factoring your pet into the equation.&nbsp; AffLocks and destrolocks have it easier, since the pet is a much smaller percentage of their overall DPS (especially for affliction, where it's more buff support than DPS provider).</p>\r\n<p>I think Rawr's utility also depends on how you use it.&nbsp; I don't think I use it the way most people do.&nbsp; I look at the overall DPS list for each gear slot and mark as available the top 4 or 5 (whether or not I actually have them), filtered based on what I think I can reasonably get or work towards.&nbsp; I then run the optimizer on those top 4 or 5 to try and figure out the best gear to aim for, rather than the best gear I can put together with what I have.</p>",
    "PostedDate": "2010-02-26T06:37:24.807-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "408917",
    "ThreadId": "155501",
    "Html": "<p>I think part of the issue has to do with modeling of the trinkets.&nbsp; There are clearly some improperly implemented trinkets.</p>\r\n<p>I certainly wouldn't STOP using RAWR, as everyone has stated it has its uses, just be very very careful right now that you are using it correctly in its current state.</p>\r\n<p>Be very very careful of the priorities of your spells as changing their order has a drastic impact on gear selection, and be wary of the trinkets.</p>\r\n<p>Other than that, I think you are right, it is NOT that far from being almost there.</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>FOR EXAMPLE (maybe I am missing something):</p>\r\n<p>RAWR has itemized ( @ 114.68 )<br>- Rod of Imprisoned Souls - i245 (31crit 24haste 29int 50sp 40stam)</p>\r\n<p>as better than ( @ 88.67 )</p>\r\n<p>- Corpse Impaling Spike - i264 (34crit 34haste 39int 60sp 39stam)</p>\r\n<p>How can it be??&nbsp; Maybe I desperately need that extra 1 stam??</p>",
    "PostedDate": "2010-02-26T08:21:24.667-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "409156",
    "ThreadId": "155501",
    "Html": "<p>&lt;fixed&gt;</p>",
    "PostedDate": "2010-02-26T09:00:45.023-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "409688",
    "ThreadId": "155501",
    "Html": "<p>Rod of Imprisoned Souls, in the version you posted, is actually i245 from 10-man Northrend Beasts heroic.</p>\r\n<p>But still, that has to be a bug. &nbsp;I'd file an issue in the tracker for it, and be sure to include your character file.</p>",
    "PostedDate": "2010-02-26T10:22:38.797-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "410059",
    "ThreadId": "155501",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>roncli wrote:</strong><br>\r\n<p>Rod of Imprisoned Souls, in the version you posted, is actually i245 from 10-man Northrend Beasts heroic.</p>\r\n<p>But still, that has to be a bug. &nbsp;I'd file an issue in the tracker for it, and be sure to include your character file.</p>\r\n</blockquote>\r\n<p>Oooops, yes sorry my apologies, I added the iLVL after the fact and was caught up in my amazement about the recommendation :)</p>\r\n<p>-- we were asked not to specifically submit bugs and issues until there was a more complete code base.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-02-26T11:27:25.79-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "410191",
    "ThreadId": "155501",
    "Html": "<p>Definitely post bugs in any features that are considered working. ie, post that, but don't post that pets are broken.</p>",
    "PostedDate": "2010-02-26T11:47:15.673-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "410338",
    "ThreadId": "155501",
    "Html": "<p>I guess the one thing not often brought up about the lack of a Warlock module: Is there anything we can do to help? My fear is that, by the time the Warlock module is completed, either sweeping changes will push it in to irrelevance again or it'll be so late in to ICC that it's just not all that useful anymore. I know a lot of people have pointed toward using it as a relative decision making tool, but as someone who plays Demonology the missing pieces make the numbers Rawr produces either inaccurate or very difficult to judge ( ignoring any type of interaction with Demonic Pact - I'm happy to judge that on my own ).</p>\r\n<p>E.g. I know C++/C# very well, but I don't do a heck of a lot of theorycrafting of my own right now. I definitely try to keep up with the theorycraft that I can off EJ &amp; Warlock's Den.&nbsp;I know it's a huge undertaking and find it cool that someone took it on. Honestly, I pulled down the source down and took a look at what was there. I didn't commit because I have been working 12 hours a day a lot the last 6 months, so it seemed likely I might not have any chance to finish.</p>",
    "PostedDate": "2010-02-26T13:22:45.853-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "410519",
    "ThreadId": "155501",
    "Html": "<p>The &quot;coding&quot; part of the model is actually the easier part.&nbsp; The hard part about getting a model right is getting accurate information on how certain mechanics work in game.&nbsp; Blizzard has never been forthcoming on that respect (although recently there have been some actual formula's released).&nbsp; Especially what special type procs and such are concerned, getting right info on what abilities actually cause procs to happen can be hard to come by, and yes, anyone even those with no coding skills can help there by doing some ingame experiments.</p>",
    "PostedDate": "2010-02-27T04:12:08.43-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "412780",
    "ThreadId": "155501",
    "Html": "<p>Unfortunately, ArPharazon doesn't post on EJ or Warlock's Den. I haven't seen him ask for public assistance for theorycrafting outside of one time, so unfortunately, it's hard to know how to help him :(&nbsp;Most of the high level theorycraft is out there, but I know pets are an area where some stuff is missing ( though the recent spreadsheet on EJ seems to model them really closely ).</p>\r\n<p>Regardless, I'm just hopeful there's something we can do to help! Let us know, ArPharazon.</p>",
    "PostedDate": "2010-03-01T10:06:00.517-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "412789",
    "ThreadId": "155501",
    "Html": "<p>Well, Xemno here is trying for round three on the Warlock development. He appears to be starting from scratch almost (though working with a temporary module instead of the release module). If you have comments send them his way.</p>",
    "PostedDate": "2010-03-01T10:30:27.423-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "412905",
    "ThreadId": "155501",
    "Html": "<p>It's a fairly major undertaking for me to own a Rawr model.&nbsp; It has not officially happened, but I am working on understanding Rawr and for now I am planning to &quot;fix&quot; the Warlock module.&nbsp; I'm not really starting from scratch, I'm just starting with a bare-bones model and copy-pasting in the Warlock code as I understand it, with one major exception.&nbsp; It has been made know to the Rawr devs that combat simulators are unacceptable, which means that portion of the Warlock code needs to be re-written.&nbsp; Simulators have some fundamental problems in Rawr.&nbsp; For example, it's possible that by lengthening your combat by 1 second you get off 1 more cast, but that cast misses in the simulation.&nbsp; That will make hit a more valuable stat than it was when combat was 1 second shorter, which is not the kind of behavior Rawr should exhibit.&nbsp; The same problem would be more pronounced if you lengthened combat by 8 seconds and your refresh of Haunt missed.</p>\r\n<p>So anyway, I am working on the Warlock module in a separate, temporary copy, and I will welcome some help with the theorycrafting when I get to that part.&nbsp; So far I'm still getting a handle on the structure of things &amp; laying a foundation for a new way to model combat.</p>",
    "PostedDate": "2010-03-01T15:00:17.237-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "412928",
    "ThreadId": "155501",
    "Html": "<p>@Xemnosyst.... Oh wow, thank you so much for all you will be doing.&nbsp; I know it must be quite an undertaking at this point, but it is a relief to know someone is actually working on it. /Salute</p>",
    "PostedDate": "2010-03-01T16:21:20.78-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "412937",
    "ThreadId": "155501",
    "Html": "<p>Well, for the simulator, you might want to take a look at the mage or Shadow Priest modules. The Shadow Priest could be useful since they are also a &quot;dot spec.&quot; However you also may want to look at the mage module. They use what is called a Markov Process model. The basic premise is that there is a &quot;chance&quot; that a certain step is going to take place after performing an act. IE: you have a 30% chance to cast a Immolate after casting a conflag. Something like that.</p>",
    "PostedDate": "2010-03-01T16:52:38.743-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "412949",
    "ThreadId": "155501",
    "Html": "<p>I haven't used many of the different modules, but my experience with the Mage module has been excellent. Were you to pick an option, I would also recommend that one.</p>",
    "PostedDate": "2010-03-01T17:43:08.93-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "412985",
    "ThreadId": "155501",
    "Html": "<p>The Mage model is extremely well written, but also very complex. Take a look at the source code and you'll see what I mean. Basically what I'm getting at is that the Mage model may be a bit difficult to start with.&nbsp;</p>",
    "PostedDate": "2010-03-01T19:59:19.18-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "413392",
    "ThreadId": "155501",
    "Html": "<p>I didn't notice this until today - but I gotta ask, &quot;It has been made know to the Rawr devs that combat simulators are unacceptable&quot;?&nbsp; Is this a Blizzard thing, or something else?&nbsp; (It may have been discussed elsewhere, first I've heard of it though.)</p>\r\n<p>&nbsp;</p>\r\n<p>If Blizzard, how does Simulationcraft get away with it?</p>",
    "PostedDate": "2010-03-02T14:27:50.03-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "413414",
    "ThreadId": "155501",
    "Html": "<p>That's a part of an internal dev discussion</p>",
    "PostedDate": "2010-03-02T15:21:31.697-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "413436",
    "ThreadId": "155501",
    "Html": "<p>No no, it's not a Blizzard thing.&nbsp; It's a question of whether simulations are appropriately suited to Rawr's purposes.&nbsp; I didn't mean to bring up that topic in particular, just to say that I have a lot of work to do.</p>",
    "PostedDate": "2010-03-02T16:30:09.493-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "413489",
    "ThreadId": "155501",
    "Html": "<p>At the risk of derailing the thread, how can you effectively identify optimal gear without simulation?&nbsp; Each time you change your stats, the per-stat DPS weight changes, thereby necessitating re-simulation.</p>\r\n<p>I would certainly agree that you don't need to simulate complex raid mechanics.&nbsp; Simulating uninterrupted damage output should be sufficient, I think, but it's still simulation.</p>\r\n<p>I'm not actually trying to incite an argument here; I'm genuinely curious as to what the alternative is.</p>",
    "PostedDate": "2010-03-02T20:05:58.617-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "413493",
    "ThreadId": "155501",
    "Html": "<p>Because we don't want to <strong>simulate</strong> combat, we want to <strong>model</strong> combat.</p>",
    "PostedDate": "2010-03-02T20:38:40.207-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "413537",
    "ThreadId": "155501",
    "Html": "<p>Simulation = Loop over all the time in the fight, picking the action at each time. Typically involves randomness.</p>\r\n<p>Model = Calculate the rotation you use, and how many times you use it during the fight, and the average outcome of each rotation, or spell, etc.</p>\r\n<p>&nbsp;</p>\r\n<p>That's a really really loose example, and there are some exceptions, but generally, models work for determining gear value; simulations don't.</p>\r\n<p>And yes, it's all recalculated for every piece of gear, every time any piece of your character changes.</p>",
    "PostedDate": "2010-03-03T00:04:42.473-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "413917",
    "ThreadId": "155501",
    "Html": "<p>In simpler terms, a <strong>Simulator</strong> is a fake you, whacking the boss for &quot;X minutes, Y sessions&quot;, and showing an average of the <em>actual</em> results.&nbsp; A <strong>Model</strong> is a set of calculations that plugs your stats in, along with ability usage, and outputs <em>expected</em> results over time.</p>\r\n<p>Each has its pros and cons.&nbsp; Simulating, done correctly, accurately represents your in-game performance by playing for you, and recording the numbers.&nbsp; Modeling, done correctly, accurately represents your in-game performance by setting variables and plugging various numbers into set calculations.&nbsp; Simulating is extremely time/resource-consuming, and any analysis must be completely redone if even a single stat changes.&nbsp; Modeling is very quick, as changing individual values can be recalculated almost instantaneously.</p>\r\n<p>As Astry said, due to how the two approaches work at the fundamental level, only Modeling really works for making constant gear decisions based upon frequently-changing availability, and accounting for hundreds/thousands of possible combinations/permutations.</p>\r\n<p>The &quot;model/sim&quot; thing mentioned here is simply a reference to internal developer discussion - it has no bearing outside of that.&nbsp; What it boils down to, though, is that a model should include pure modeling.&nbsp; In other words, &quot;<em>Get your simulation out of my model</em>!&quot;&nbsp; :)&nbsp; Each has it's place, and they complement each other very well, but that is in reference to their outputs, rather than their coding.</p>\r\n<p>Anyways, back to Warlocking... :)</p>",
    "PostedDate": "2010-03-03T17:20:37.157-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]