[
  {
    "Id": "413713",
    "ThreadId": "203683",
    "Html": "<p>I am confused as to why the black heart is giving me a rating of 9784 survival (1537 mitigation),</p>\r\n<p>while Corroded Skeleton Key is giving me a survival rating of 10018 (0 mitigation).</p>\r\n<p>Correct me if I'm wrong, but shouldn't the survival of black heart be roughly half that of the skeleton key? While the proc on black heart is what boosts mitigation (and possibly overall) to much higher levels?</p>\r\n<p>This has been bothering me for some time now.</p>",
    "PostedDate": "2010-03-03T08:48:53.47-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "413718",
    "ThreadId": "203683",
    "Html": "<p>Which character model?&nbsp; Bear, ProtPally, TankDK, ProtWarrior?</p>",
    "PostedDate": "2010-03-03T08:55:51.1-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "413725",
    "ThreadId": "203683",
    "Html": "<p>Edit: Now that I read your post again, I know that ProtWarr counts  Armor as Survival and not Mitigation since it /always/ decreases the  amount of damage taken by a set amount as opposed to /sometimes/  decreasing damage taken like avoidance does. Actually, I'm not sure where the mitigation on Black Heart is coming from. &gt;.&gt; Anyway, I originally misread your question, so you can stop reading unless you want to know why Black Heart rates so high.</p>\r\n<p>The way I see it, it's all in the proc. (This is coming from a  Warrior standpoint)</p>\r\n<p>Corroded Skeleton Key absorbs 6400 damage every /2 minutes/. That's a long time. Maybe 3-4 uses a fight. 6400 damage is barely anything either. Hardly even half of a single boss attack.</p>\r\n<p>On the other hand, the Black Heart give a freakin' godly amount of Armor (Over 7000!, on my T9/10-geared tank, that's nearly 1/4 of his unbuffed total!) on an excellent uptime. It has a 25% proc chance every 45s and lasts for 10s. That's a 22% uptime if it procs shortly after the cooldown (and with ICC boss' fast swing timers and lower tank avoidance, it's more likely.)</p>\r\n<p>Basically, if you want to average everything out (which is bad! your uptime /will/ vary!), it's a battle between 102 Stamina and ~1568 armor. ...and 60 Frost badges versus farming reg ToC/5. &gt;.&gt;</p>\r\n<p>Amazing what itemization can do. Powerful trinket for lvl200 'eh? ;)</p>",
    "PostedDate": "2010-03-03T09:10:02.103-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "413821",
    "ThreadId": "203683",
    "Html": "<p>Armor provides both Survival and Mitigation, since it effects both.</p>",
    "PostedDate": "2010-03-03T12:26:53.483-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "413822",
    "ThreadId": "203683",
    "Html": "<p>Also, further info that's related can be found by searching for 'burst survivability' or 'burst survival'.</p>",
    "PostedDate": "2010-03-03T12:27:51-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "414124",
    "ThreadId": "203683",
    "Html": "<p>The short answer is: because Armor is awesome. :P</p>",
    "PostedDate": "2010-03-04T06:01:07.387-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "414994",
    "ThreadId": "203683",
    "Html": "<p>On my prot warrior. Thank you for the responses.</p>",
    "PostedDate": "2010-03-06T08:48:38.337-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]