[
  {
    "Id": "413852",
    "ThreadId": "203707",
    "Html": "<p>Under the <strong>Additional Requirements </strong>heading for the Hunter,&nbsp;rather than <strong><em>Hit Rating</em></strong>, there is an option that reads<span style=\"text-decoration:underline\"> &quot;% chance to miss (yellow).&quot;</span>&nbsp; This is followed by an input box starting at 0.00 with up and down arrows to move numbers...uh....up and down.&nbsp; The question is, how does this work?&nbsp; If I want a zero chance to miss I select it and leave it at 0.00?&nbsp; Or do put in a number to be read as a percentage, for example 8.00 (as in 8%) for the Hunter hit cap?&nbsp; There isn't much documentation on specific settings under the <strong>Additional Requirements</strong>&nbsp;and how to use them properly.&nbsp; There are several other potential setting which also use % but seem more straight forward, <span style=\"text-decoration:underline\">&quot;armpen %.&quot;</span>&nbsp; That simply implies you are looking for a % of armpen for the optimizer to find the best way to implement for you.&nbsp; The <span style=\"text-decoration:underline\">&quot;% chance to miss (yellow)&quot;</span>, is a bit less clear to me, more along the lines of muddy.&nbsp; If any of you have any insight on this/these setting(s), input would be appreciated.</p>\r\n<p>Questors</p>",
    "PostedDate": "2010-03-03T13:55:42.97-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "413860",
    "ThreadId": "203707",
    "Html": "<p>I swear, there's no way to write this stuff out so there's no way a person would ask this question.</p>\r\n<p>This is what you want</p>\r\n<p>% Chance to Miss &lt;= 0</p>\r\n<p>OR</p>\r\n<p>% Chance to Miss &lt;= 0.05</p>\r\n<p>The latter allows the optimizer to not absolutely enforce capped hit rating, but rather allows some room for gems to halvsies it. That is to say, at 5 rating from cap you would get more benefit from another AGI/Hit gem then a pure Hit gem.</p>\r\n<p>'Armor Penetration %' is literally just that, how much armor penetration % you want to enforce (either more than or less than).</p>\r\n<p>This question has been asked and answered several times in these forums and in multiple issues.</p>",
    "PostedDate": "2010-03-03T14:01:51.71-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "413872",
    "ThreadId": "203707",
    "Html": "<p>My apologies.&nbsp; I tried using the search tool but didn't find the information for which I was looking.&nbsp; I am not a programmer, coder or whatever one needs to be to create these sorts of things, but I am not stupid.&nbsp;&nbsp; Why could it not be written simply as hit rating like it is for the Death Knight?&nbsp; Hit rating is hit rating, regardless of class.&nbsp; I would also like to point out that the DK module&nbsp;indeed gave me halvesies on gems even though I put in a static&nbsp;desired hit rating. &nbsp;That would make it easier to understand and no one would have to ever bother you or these boards again with such silly questions.</p>\r\n<p>I appreciate your answer, but not the intolerant &quot;tone&quot; that went along with it.&nbsp; It wasn't necessary.&nbsp; However, for your piece of mind, I shall not bother this discussion community with future babble.</p>\r\n<p>Questors</p>",
    "PostedDate": "2010-03-03T14:33:37.833-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "413890",
    "ThreadId": "203707",
    "Html": "<p>Because we do <strong>not</strong> want actual ratings listed in any of the models, they require too much of the end user. The DK model using that is actually breaking our uniformity check and they need to remove it.</p>\r\n<p>'Hit Rating' requires the user to know every possible combination of Hit Rating cap for their character. For a Fury Warrior with Precision, he could have 1, 2 or 3 points giving him 1, 2 or 3% Hit, which changes his soft caps. Then there's the Draenei Hit% buff for another 1%. Asking the User to memorize all these values and try to screw with the numbers by hand is unnecessary.</p>\r\n<p>'% Chance to Miss' is uniform in that you only ever really need to enter one value, 0. Then the model will take the appropriate steps, via talents or gathering hit rating, to make you not Miss.</p>",
    "PostedDate": "2010-03-03T15:16:45.767-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]