[
  {
    "Id": "414411",
    "ThreadId": "203890",
    "Html": "<p>okay i just try out rawr today and i dont get what ABSSpam04mbam means? should i cast arcane barrage when i have 4stacks of arcane blast? and when missile proc&nbsp; should i cast it right aways or wait to have so many stack of arcane blast?</p>",
    "PostedDate": "2010-03-04T18:08:38.443-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "414425",
    "ThreadId": "203890",
    "Html": "<p>Mouse over the * next to the cycle name in spell info and you'll get a description in tooltip. This specific one is spamming Arcane Blast and use missile barrage proc when you're either at 0 or 4 stacks of AB. You never use arcane barrage.</p>",
    "PostedDate": "2010-03-04T19:59:17.837-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "422980",
    "ThreadId": "203890",
    "Html": "<p>is there any rotation in rawr for ABspam4MBAM ?</p>\r\n<p>is that what MBAM is?</p>\r\n<p>because it doesn't say it</p>\r\n<p>&nbsp;</p>\r\n<p>and i can't find an option to make a custom rotation so that i KNOW there's a MBAM on 4 stacks only.</p>\r\n<p>&nbsp;</p>\r\n<p>ED: or does 'ABSpam04mbam' satisfy this, as it probably isn't possibly to MBAM on a 0stack without casting abarr?</p>\r\n<p>&nbsp;</p>\r\n<p>ED2: if this is true, rawr mage is a little broken.. as the 'dps' on items is optimising for a non-optimal rotation, as i go to a lower 'rated' gem configuration (for example) yet the DPS listed for the rotation goes UP</p>\r\n<p>&nbsp;</p>\r\n<p>heck</p>\r\n<p>where is it getting this magical 'dps' number from.. if NONE of the rotations have the same number??</p>\r\n<p>&nbsp;</p>\r\n<p>is this actually an issue (anyone else confirm) ?</p>\r\n<p>...</p>\r\n<p>suddenly, i trust rawr a whooole lot less in evaulating my gemming correctly.</p>",
    "PostedDate": "2010-03-24T04:19:54.163-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "423004",
    "ThreadId": "203890",
    "Html": "<p>I'll venture a guess that you don't really understand what an optimal rotation means. Most likely wherever you saw what you think you know actually quoted one of my post on EJ.</p>\r\n<p>The dps that the items are rated by is not a dps of any single rotation. It is a dps of the overall solution, taking into account a mix of cycles, mana management and cooldown stacking. You can see that in the spell cycles tooltip in the Solution section. That dps is optimal in a very well defined way. It has its limitations, but they're far less trivial than what you seem to suggest.</p>",
    "PostedDate": "2010-03-24T05:43:15.683-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "423026",
    "ThreadId": "203890",
    "Html": "<p>optimal rotation = the rotation that nets you the highest DPS under the conditions provided (which, i thought, for an arcane mage is AB4MBAM :/)</p>\r\n<p>i don't really read EJ, as all the theorycrafting that goes on there seems to be generally based around full best in slot gear among other things... before i discovered rawr i used to spreadsheet&nbsp; by myself :/</p>\r\n<p>though.. what's this 'solutions' section you are speaking of?</p>\r\n<p>&nbsp;</p>\r\n<p>-- scrap that i found it</p>\r\n<p>it's suggesting ABspam034MBAM :/ except whenever i've used MBAM on 3 stacks it makes my DPS go down compared to stacking to 4 (considering it's 15% less damage :/).. strange... not counting cooldowns which is AB04MBAM</p>\r\n<p>&nbsp;</p>\r\n<p>oh well thankyou for pointing me to where it actually shows the rotation used</p>\r\n<p>&nbsp;</p>\r\n<hr>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-03-24T06:39:23.903-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "423187",
    "ThreadId": "203890",
    "Html": "<p>ABSpam4MBAM is the highest dps cycle (with 2T10), but it is not the only optimal cycle. In presence of mana management the optimal solution will almost always be combination of two cycles (in a simplified scenario without cooldowns you'll have exactly two cycles, but it gets more complicated once you add cooldown stacking). The main reason why it's suggesting ABspam034MBAM is because that allows you to use less evocation (and in practice allows you to fish for missile barrage more). Besides, the theorycrafting at EJ isn't exactly exclusive to best in slot gear. If you want to fully understand how Rawr works you'll want to check some info there. You don't need to read everything, but since you say you've done your own theorycrafting before you might be interested in some of the&nbsp;posts I've made on the topic of computing optimal cycles.</p>",
    "PostedDate": "2010-03-24T12:11:23.437-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "423591",
    "ThreadId": "203890",
    "Html": "<p>mana management makes sense</p>\r\n<p>&nbsp;</p>\r\n<p>except that in current gear on some fights i dont even need to evocate</p>\r\n<p>&nbsp;</p>\r\n<p>sometimes even the 3 gems are enough (most likely 2 in fact)</p>\r\n<p>at most it's usually 1 evocation and 1 gem, and that's with seriously unlucky MB procs and chaining AB 10x in a row.</p>",
    "PostedDate": "2010-03-25T07:25:32.97-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "423688",
    "ThreadId": "203890",
    "Html": "<p>&quot;some fights&quot; being the operative words there. Just setup the fight parameters to match the fight you want to optimize your performance to, and the DPS stat will accurately reflect your optimal DPS on that fight.</p>",
    "PostedDate": "2010-03-25T10:43:15.503-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "423872",
    "ThreadId": "203890",
    "Html": "<p>yes some fights i have 0 mana management</p>\r\n<p>&nbsp;</p>\r\n<p>no fights have i ever had full mana management (all 3 gems+2 evocates etc.)</p>\r\n<p>so i've never actually had to use a more mana efficient rotation</p>",
    "PostedDate": "2010-03-25T19:29:38.143-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "423873",
    "ThreadId": "203890",
    "Html": "<p>I hate to say it, but that's probably because you're not playing/gearing optimally. I guarantee you that there are several fights where you should be using all your gems and several evocates, in order to perform optimally.</p>",
    "PostedDate": "2010-03-25T19:41:46.463-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "424026",
    "ThreadId": "203890",
    "Html": "<p>gear is optimal (heck i use rawr) dps i use the MBAM on 4 stack only, and blink everywhere if i have to move</p>\r\n<p>marrowgar: fight too short</p>\r\n<p>lady deathwhisper: fight also too short</p>\r\n<p>gunship: lol</p>\r\n<p>saurfang: fight also too short</p>\r\n<p>same with fester/rot..</p>\r\n<p>prof put: too much movement and switching to nonstop cast, can go with just gems.</p>\r\n<p>princes/BQL, same deal really</p>\r\n<p>dreamwalker: trash trash trash</p>\r\n<p>sindragosa: massive gaps where you can just stand behind an ice block and evocate in phase 2... every time.</p>\r\n<p>&nbsp;</p>\r\n<p>if i'm lucky i can get by with 2 gems</p>\r\n<p>if i'm unlucky i have to use 2 gems + an evocate, never more than that though so far (and i doubt i'd have the luxury of 5 spare seconds to evocate more than once in hard modes....).</p>",
    "PostedDate": "2010-03-26T05:36:27.453-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "424256",
    "ThreadId": "203890",
    "Html": "<p>I'd like to see some of those logs. If you really don't have to use Evocation while using ABSpam4MBAM then either you're getting fed Innervates or something else doesn't fit. If fight is really short I can see that and in that case you should change the fight length you're trying to optimize for, but I don't see how this can be the case for a 5 minute fight which is default.</p>",
    "PostedDate": "2010-03-26T13:56:57.353-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "424328",
    "ThreadId": "203890",
    "Html": "<p>i only get innervates if i ever die and get brez'd</p>\r\n<p>&nbsp;</p>\r\n<p>the fights are usually roughly 3-5 minutes for the most part.</p>",
    "PostedDate": "2010-03-26T18:29:13.073-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]