[
  {
    "Id": "414342",
    "ThreadId": "203863",
    "Html": "<p>My apologies if this has been discussed elsewhere, but I can't find the topic if so.</p>\r\n<p>I want to creat a build optimized for 5-mans (so few or no buffs, and heavy on mana regen).&nbsp; I want to calculate talents and gear choices, but enforce gem restrictions that will prevent it from gemming for mp5 (I have a second spec reserved for 5man, but dont want to regem my gear).&nbsp; I can't figure out a way to restrict the gem choices the optimizer is using.&nbsp; I've gone in to Slot/Gems and only checked as available the gems I want it to use, and I tried to uncheck all the gemming templates that use mp5 gems (although my understanding was that the optimizer doesn't use the gemming templates).&nbsp; Yet, the optimizer insists on putting mp5 gems onto the gear.</p>\r\n<p>Is there something I'm missing?&nbsp; I thought the optimizer would only use gems marked as available (what else is marking things as available for if not that?), but that doesn't seem to be doing the trick.</p>\r\n<p>Any other way to accomplish what I'm trying to do here?</p>",
    "PostedDate": "2010-03-04T13:12:11.373-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "414346",
    "ThreadId": "203863",
    "Html": "<p>If it's still using them then you are missing *something* *somewhere*. To enforce the Optimizer to not use the Gemming Templates as avaiable gems, got to Tools &gt; Options... &gt; Optimizer Settings and uncheck 'Consider gems in enabled gemming templates to be available'</p>",
    "PostedDate": "2010-03-04T13:19:34.05-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "414405",
    "ThreadId": "203863",
    "Html": "<p>Thanks, Jothay, that was exactly the option I was looking for.</p>",
    "PostedDate": "2010-03-04T17:39:32.463-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "414889",
    "ThreadId": "203863",
    "Html": "<p>A better solution for this would probably be to restrict the fight length to, say, 90 seconds, or 60 seconds, or whatever.&nbsp; Forcing no regen gems is one way, but it's a hackish way of going about it, and if you do not set the profile as you expect to be buffed, there is bound to be some other inconsistencies.&nbsp; Just my two cents.&nbsp; :)</p>",
    "PostedDate": "2010-03-05T22:33:51.633-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "414910",
    "ThreadId": "203863",
    "Html": "<p>The problem is that forcing the fight length to 90 seconds doesn't optimize for what I want, because it would maximize damage over that short period, while what I want is to be able to go as long as possible without drinking/viper.&nbsp; Setting a short fight length would avoid using mana gems, but would also avoid any talents/gear that optimize for mana conservation.&nbsp; (e.g. it wouldn't put points in efficiency)</p>\r\n<p>The exact thing I want to be able to do is to specify the gems I currently have in all my gear (including the pieces I'm not currently wearing, but have available), and then I want to get the optimizer to first strive for maximum time to fight without using viper, and than maximize damage within that constraint.&nbsp; Specifying a long fight (or no viper, which is what I ended up doing), but not allowing any int/mana gems is pretty close to what I want.</p>\r\n<p>I'm open to suggestions though, if you have a better way to achieve what I'm after here (what I have now works pretty well, though, if I have some external mana replenishment, like jow, or a mana totem I can usually get thru a 5 man with no drinking/viper).&nbsp; This may sound like a little odd thing to optimize for, but in most 5 mans, with my normal 25-man spec, I do significantly more damage than the others, but constantly have to manage mana, so i'm happy to trade some damage capability for avoiding mana management.&nbsp;&nbsp; It also helps with tanks who are well geared and don't want to stop and wait for people to drink, but just want to run through as fast as possible.</p>",
    "PostedDate": "2010-03-06T00:55:39.06-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]