[
  {
    "Id": "414947",
    "ThreadId": "204038",
    "Html": "<p>as noted in the 2.3.11 changelog:</p>\r\n<p>&quot;- Rawr.Mage: Frost DPS Cycles with Frostfire Bolt on Brain Freeze DPS  in 3.3.3 implemented. Fire Mage changes for 3.3.3 implemented.&quot;</p>\r\n<p>bs it's been implemented</p>\r\n<p>unless you forgot to change the tooltips.. burning soul threat reduction hasn't changed</p>\r\n<p>fireball glyph hasn't been changed from crit into haste</p>\r\n<p>and i don't know what else</p>\r\n<p>but as far as i can eyeball it's identical to 2.3.10?</p>\r\n<p>&nbsp;</p>\r\n<p>got me all excited that i could plan whether i should swap to fire post-patch..</p>",
    "PostedDate": "2010-03-06T05:26:39.257-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "415003",
    "ThreadId": "204038",
    "Html": "<p>Did you make sure that the 3.3.3 PTR check box was checked under the Options -&gt; Advance tab? These changes would not be turned on&nbsp; if you had not have that check box checked. The only PTR change that is not in yet is the fireball glyph change.</p>",
    "PostedDate": "2010-03-06T09:27:48.797-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "415009",
    "ThreadId": "204038",
    "Html": "<p>i definitely have the 3.3.3 checkbox ticked.</p>\r\n<p>&nbsp;</p>\r\n<p>i'll mess with it some more if it's workign for other people.</p>",
    "PostedDate": "2010-03-06T10:08:26.367-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "415061",
    "ThreadId": "204038",
    "Html": "<p>Trust me in that the PTR changes ARE in the system. Yes, the tool tips if you hover over the talents are not updated in yet. The changes are in a temporary spot that can be added permanently whenever the patch goes through.&nbsp; A good way to check that the PTR mode is working is to hover over the pyroblast damage. If that doesn't change from PTR to normal, then yes there is a problem, and you might want to submit a ticket about the problem.</p>",
    "PostedDate": "2010-03-06T14:01:08.01-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]