[
  {
    "Id": "414829",
    "ThreadId": "204010",
    "Html": "<p>It feels from spellcasting as if they nerfed nibelung again:&nbsp; it doesnt seem to proc as often.&nbsp; Also, I have a question regarding haste.&nbsp; Does rawr account for very high levels of haste, for example: i am a mage, arcane. Should I push my haste up to 1000-1100.&nbsp; Rawr seems to suggest that is not helpful.&nbsp; Vickos</p>",
    "PostedDate": "2010-03-05T16:26:57.743-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "414832",
    "ThreadId": "204010",
    "Html": "<p>What do you mean by &quot;Rawr seems to suggest that is not helpful.&quot;? Haste doesn't have a practical hard cap for arcane.</p>",
    "PostedDate": "2010-03-05T16:41:09.98-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "414837",
    "ThreadId": "204010",
    "Html": "<p>I mean: my mage lead suggests that I maximize haste over the solution that rawr provides, even tho the haste maximization produces a lower total dps score.&nbsp; For exampl: I can use abracadaver and maxz out my haste, but rawr suggests a balanced approach is better</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-03-05T16:57:37.877-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "414839",
    "ThreadId": "204010",
    "Html": "<p>To be even more specific: if I add abyssal rune, abracadaver, and sceptre of imprisoned souls, my haste comes close to 1000.&nbsp; I get a better dps score solution however if I use Nibelung, Maguia misguided quill, and voldes cloak of the night sky.&nbsp;</p>",
    "PostedDate": "2010-03-05T17:10:32.243-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "414841",
    "ThreadId": "204010",
    "Html": "<p>A balanced approach is indeed better. Spell power and haste each benefit from each other so increasing both is better than just one most of the time. You can check the scaling vs spell power and scaling vs haste graphs to see how they affect each other.</p>",
    "PostedDate": "2010-03-05T17:23:52.643-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]