[
  {
    "Id": "416381",
    "ThreadId": "204450",
    "Html": "<p>Hello Everyone,</p>\r\n<p>Two questions, first:</p>\r\n<p>I wanted to verify an issue I am having with Rawr (Feral DPS module.)&nbsp; I am currently hit capped with 2T9/2T10.&nbsp; This week I will switch to 4T10.&nbsp; When I run a 100% optimized regem/reenchant optimization, Rawr is giving me a gearing solution with answer of 237 hit rating.&nbsp; It is maintaining agi/haste gems in some yellow slots and using hit/agi gems in others (rather than using straight +hit gems.)&nbsp; I've always believed the hit cap is your primary goal then all of the agi/str/arp/haste/crit numbers come after that.&nbsp; Does this make sense to anyone?</p>\r\n<p>A second thing I would like to ask is:&nbsp;</p>\r\n<p>I want to use my cat gear and a few extra pieces to optimize my bear set.&nbsp; My problem is that the cat gear produces so much threat value it is throwing the bear gear out of order.&nbsp; How can I sort bear gear while ignoring threat or how do I sort/optimize bear gear for survivability/mitigation only?&nbsp; I want to optimize the tanking side of the equation since I know threat can't be an issue using 1/2 cat gear.</p>\r\n<p>Thanks in advance.&nbsp; You guys always do great work and provide good answers.</p>\r\n<p>Bitter</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-03-10T06:31:43.307-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "416447",
    "ThreadId": "204450",
    "Html": "<p>Hit is valued pretty high for the majority of dps, but there come times where other stats&nbsp;can pull ahead.&nbsp; It really depends on your class/spec/current gear.&nbsp; I mainly play marks hunter, and I've&nbsp;had gear combinations where being being 3 or 4 rating under the hit cap was worth&nbsp;the extra armor pen I could obtain.</p>\r\n<p>Feral was my main for the first half of wotlk, and I remember while hit still held&nbsp;value, it wasn't to the same degree&nbsp;as say casters.&nbsp; It's not something a feral HAS to max.&nbsp; Because you're working with an energy bar, the only thing a miss should ideally cost you is a 1sec GCD.&nbsp;&nbsp;Besides missing occassional white hits or a FB, hit really&nbsp;isn't&nbsp;a big deal.</p>\r\n<p>As for your tanking question, go to the options tab and change &quot;Threat Value&quot; to none or whatever you'd like it to be.</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-03-10T08:48:26.913-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "416475",
    "ThreadId": "204450",
    "Html": "<p>Indeed, Hit is just a sub-par stat for Cats. It's good, but other things are better.</p>",
    "PostedDate": "2010-03-10T10:01:06.507-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "416633",
    "ThreadId": "204450",
    "Html": "<p>Thanks for the quick responses.&nbsp; I need to read more in EJ I guess.&nbsp; As far as the threat to zero, I've never been able to figure that out until today.&nbsp; Thanks!</p>\r\n<p>@Astrylian- could you please ask Blizz to give me one of your sutured cinches?</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-03-10T15:05:09.637-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]