[
  {
    "Id": "417309",
    "ThreadId": "204734",
    "Html": "<p>I have a question about comparing items.&nbsp; One of the most common things I do on Rawr is compare two items that I have (or can acquire), and I was wondering if there was a simpler way to do it.</p>\r\n<p>The way I do it now, I find where my current item is on the extremely long list of possibilities (I know I can clear that up, but I usually like to keep my options open, only eliminating the top heroic raid content I'm unlikely to do), then scroll up and down and try to find the other item that interests me.&nbsp; Problem is, while I can find the new item easily by typing in part of its name (especially useful if it turns out to not be in the default list), doing so eliminates all other options, including what I have equipped, and displays items that match the typed name on a scale where the top one has a 100% bar.&nbsp; That is to say, it shows a ranking of all items that have, say, &quot;Plagued&quot; in the title, but if the items I'm comparing don't share any words, that's not so useful.</p>\r\n<p>Using the optimizer seems like overkill for this sort of thing, and comparing all the relevant numbers (most of my characters tank, so at least three numbers interest me) is just inconvenient.&nbsp; It's especially annoying for rings and trinkets, since the ones I have equipped are removed from the other slot's list.&nbsp; Is there some feature I'm not using that allows me to easily compare two items I specify?&nbsp; I don't use the right half of the screen much, maybe there's something there?</p>\r\n<p>Sorry if I'm missing something obvious.&nbsp; Rawr has a lot of features, and learning to use all of them isn't always easy.</p>",
    "PostedDate": "2010-03-12T00:19:05.76-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "417310",
    "ThreadId": "204734",
    "Html": "<p>Right click, Evaluate Upgrade.</p>",
    "PostedDate": "2010-03-12T00:21:24.887-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "417318",
    "ThreadId": "204734",
    "Html": "<p>I must be using it wrong still - I marked both items with green diamonds, then right-clicked and chose Evaluate Upgrade.&nbsp; First it tells me I have no shoulder enchant selected, which is odd, but whatever.&nbsp; I tell it to continue and it brings up a new window with the name of the item I'm interested in shown as a bar.&nbsp; But it's not showing me the other green-diamonded item to compare it to, and I'm not sure what the bar is supposed to be telling me anyway.&nbsp; I imagine it's Overall rating, since that's what the Optimizer is set to, but changing it to survival made no bar at all come up.&nbsp; So I'm not really sure what I'm looking at.</p>\r\n<p>Also, finding an item to put a green diamond on it is almost as problematic as my initial method of comparing - I still have to find it by scrolling through a long list, since as far as I know the right side doesn't include a quick name search.</p>",
    "PostedDate": "2010-03-12T00:48:44.087-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "417326",
    "ThreadId": "204734",
    "Html": "<p>No, just mark the item you have currently as available (that should already be the case, before you start; always keep everything you already have marked available), and then Evaluate Upgrade on the potential other item. If it says you have no shoulder enchant marked available, it really does mean that; you have no shoulder enchant marked available (so go mark it available).</p>",
    "PostedDate": "2010-03-12T01:04:08.507-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "417512",
    "ThreadId": "204734",
    "Html": "<p>The single bar that you see for your 'wanted' item will be the estimated DPS (or Surv/Mit/Threat) that that single item will give you over what you currently have equiped.</p>\r\n<p>For example my warrior only has Skeleton Lord's Cranium for his head and I want to see how much of an upgrade it is if I get Helm of Thunderous Rage. While I can see both of these in the comparison panel and that it is worth ~405 dps and ~40 survival &quot;points&quot;while&nbsp;my curent helm is ~329 dps and ~29 survival.&nbsp;When i select &quot;Evaluate Upgrade' I see just the helm and a single bar showing that the new helm is worth a total of ~88 upgrade(?) points about 76 for the dps and 11 for survival.</p>\r\n<p>In this case if I was using dps has my optimizing criteria then the bar would have been at 76 while if I had used Survival as my criteria the bar would be at 11. Hopefully this clears things up for you.</p>\r\n<p>BTW while you should mark your enchants and gems when told they are missing, you don't have to mark the item itself has available to do the 'Evaluate Upgrade' step</p>",
    "PostedDate": "2010-03-12T08:21:35.5-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]