[
  {
    "Id": "417949",
    "ThreadId": "204922",
    "Html": "<p>Greetings,</p>\r\n<p>I am not sure if my issue is a bug or I am doing something wrong. I started using Rawr with v2.3.8 and recently upgraded to 2.3.11 it worked fine with the previous version but now once I load my character from the armory the item comparison list only shows items that I have&nbsp;equipped&nbsp;and nothing else. Am I doing something wrong or is this a bug. I have tried&nbsp;re-downloading&nbsp; the app and it does the same thing. Thank you in advance.</p>",
    "PostedDate": "2010-03-14T11:36:03.127-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "417951",
    "ThreadId": "204922",
    "Html": "<p>http://rawr.codeplex.com/documentation</p>\r\n<p>See Item Filtering</p>",
    "PostedDate": "2010-03-14T11:44:56.873-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "417952",
    "ThreadId": "204922",
    "Html": "<p>It has the items checked that would be&nbsp;appropriate&nbsp;for the character I am loading when I look at the selection for &quot;Refine Types of Items Listed&quot;. Feral Druid is the class I am loading. Since this is a&nbsp;fresh&nbsp;download I would not think there is a default filter in place and I have not created any filters.</p>",
    "PostedDate": "2010-03-14T11:48:55.743-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "417960",
    "ThreadId": "204922",
    "Html": "What you're describing is the result of having filters set to hide a wide selection of items. See both Refine Types of Items Listed, and the actual filters (in the top right).",
    "PostedDate": "2010-03-14T12:57:35.937-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "417964",
    "ThreadId": "204922",
    "Html": "<p>Thank you.</p>\r\n<p>I see what&nbsp;happened&nbsp;now. Heroic items where showing up in the&nbsp;Comparisons&nbsp;pane&nbsp;so I&nbsp;apparently&nbsp;removed the check mark from the &quot;Other&quot; option in the filters&nbsp;pull-down&nbsp;and once that was done EVERYTHING disappeared. Consequently adding that check mark back in restored the list of equipment options.</p>\r\n<p>That issue is resolved but I am still faced with a&nbsp;related&nbsp;issue. How do I remove those Heroic ICC/ToC items from the comparisons list? I have the check marks removed from Heroic in those respective dungeons but the Heroic items are still showing up in the list. Should I create a custom filter to accomplish this instead of filtering them from the Comparisons pane?</p>",
    "PostedDate": "2010-03-14T13:18:02.81-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]