[
  {
    "Id": "417912",
    "ThreadId": "204911",
    "Html": "<p>At my current gear level, Rawr seems to be valuing +Crit over +Haste consistently.</p>\r\n<p>I thought with the latest patches, since DoTs can crit, haste was more linear in its benefit to stack.</p>\r\n<p>As gear is getting expensive at this point (crafted and raiding time), I'm hoping to do a sanity check of the items it's steering me towards.</p>\r\n<p>I also wouldn't want to /roll someone away from an upgrade only to find it isn't really a dps increase for me after all.</p>\r\n<p>I picked up a new ring #1 last night, so now I'm substantially over hit cap, so that shouldn't be a factor.</p>\r\n<p>&nbsp;</p>\r\n<p>http://www.wowarmory.com/character-sheet.xml?r=Moonrunner&amp;cn=Gallien</p>\r\n<p>For example, some otherwise similar items Rawr is valuing higher:</p>\r\n<p>Belt of Omission http://www.wowhead.com/?item=50996 &gt; Circle of Ossus http://www.wowhead.com/?item=50997</p>\r\n<p>Loop of the Endless Labyrinth http://www.wowhead.com/?item=49977 &gt; Ring of Rapid Ascent http://www.wowhead.com/?item=50008</p>\r\n<p>Soulcleave Pendant&nbsp; http://www.wowhead.com/?item=50809&gt; Amulet of Silent Eulogy http://www.wowhead.com/?item=50005</p>\r\n<p>&nbsp;</p>\r\n<p>Thanks.&nbsp; I realize this is kind of a &quot;gear check me&quot;, but it's also a question why Rawr is making the decision it's making for gear upgrades.&nbsp; I'm just perplexed at it's choices, and want to assure it's valuing the stats properly.&nbsp; I don't have hard numbers, but I've done several &quot;upgrades&quot; recently, and it seems my dps is not increasing, doing pretty much the same things as before.</p>\r\n<div id=ic50008 style=\"float:left\">\r\n<div>&lt;ins style=&quot;background-image: url(http://static.wowhead.com/images/icons/large/inv_jewelry_ring_86.jpg);&quot;&gt;&lt;/ins&gt;&lt;del&gt;&lt;/del&gt;</div>\r\n</div>",
    "PostedDate": "2010-03-14T07:56:58.017-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "417916",
    "ThreadId": "204911",
    "Html": "<p>Loaded up your character in Rawr.</p>\r\n<p>&nbsp;</p>\r\n<p>Belt of Omission is being lower ranked than Circle of Ossus<br>Loop of the Endless Labyrinth is being lower ranked than Ring of Rapid Ascent<br>Soulcleave Pendant is being higher ranked than Amulet of Silent Eulogy</p>\r\n<p><br>&nbsp;I think you may have to make a new post in the Issue forum where you include your current Character.xml file as an attachment. You could have set up something different than me (I loaded default from armory), or maybe I have changed something in current version.</p>",
    "PostedDate": "2010-03-14T08:20:59.493-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "418012",
    "ThreadId": "204911",
    "Html": "<p>Ok I go after that then.&nbsp; Strange you are getting different results than I did - did you use DPS as the sorting?&nbsp; It's a shadow priest so dps is all that matters ;)</p>\r\n<p>I'm using the latest posted version, 2.3.11.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-03-14T15:38:33.63-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "429661",
    "ThreadId": "204911",
    "Html": "<p>I noticed this as well on my spriest. In fact I was going to make a post until I noticed your thread. I'm sitting at about 5010 GearScore atm, and rawr is putting me at about 22 percent crit, 13 percent haste, and&nbsp;is also telling me to gem crit. This just seems very strange to me, as&nbsp;all spriests I've talked with say I should be loading up on haste.</p>",
    "PostedDate": "2010-04-10T21:55:58.43-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "429680",
    "ThreadId": "204911",
    "Html": "<p>Try changing options until you get the result you expect if you are only interested in the result you want.</p>\r\n<p>&nbsp;</p>\r\n<p>Changing fight length to 4 or 5 minutes, changing the Brain Lag/Latency setting away from the default, etc.</p>\r\n<p>&nbsp;</p>\r\n<p>Also make sure you make good use of the Optimizer.</p>\r\n<p>&nbsp;</p>\r\n<p>I have this occationally for myself as well, where Crit and Haste are nearly the same value. Generally I ignore gemming Crit then and gem Haste anyway. When you are saying it favors Crit over Haste, the difference is very very minimal. If you have an item with 2 yellow slots, it may just as well gem one with Crit and the other with Haste.</p>\r\n<p>&nbsp;</p>\r\n<p>Let me know if this helps!</p>",
    "PostedDate": "2010-04-11T01:42:50.887-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]