[
  {
    "Id": "418293",
    "ThreadId": "205013",
    "Html": "I've got a general question regarding expertise - I was attempting to evaluate weapon upgrades for use in pvp and set up the fight parameters such that time in front of mob was 0%.  It was my assumption that expertise was worth nothing if you were always behind the mob.  I was evaluating the pve 251 weapon Oxheart againt the pvp 261 weapons - say Wrathful Gladiator's Bonegrinder.\r\n\r\nThe initial dps between them looked very similar which I didn't expect Oxheart (1602dps) Bonegrinder(1650)\r\n\r\nI then modified the Oxheart item and dropped Expertise to 0 - when I did this the value of Oxheart dps dropped to 1498dps\r\n\r\nSo, either I don't understand Expertise or there is a bug - can someone explain why expertise matters if time in front of mob is 0%?",
    "PostedDate": "2010-03-15T09:13:59.61-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "418298",
    "ThreadId": "205013",
    "Html": "<p>Expertise reduces your chance to be dodged or parried.&nbsp; Moving behind the mob eliminates parries anyway, makeing expertise *less* valuable, but an&nbsp;NPC can still dodge attacks from behind, so expertise still has value.&nbsp; Players, however, cannot dodge attacks from behind.</p>",
    "PostedDate": "2010-03-15T09:25:14.913-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "418304",
    "ThreadId": "205013",
    "Html": "Right, thanks - just figured this out and was going to reply to my own thread.  Maybe it would be useful then to add on option for mob type 'player' which would take into account this fact?",
    "PostedDate": "2010-03-15T09:32:26.57-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "418533",
    "ThreadId": "205013",
    "Html": "<p>Rawr is intended solely for modeling a max-level PvE environment.&nbsp; Rawr does not currently support or have any intention of supporting any PvP situations whatsoever.&nbsp; So, from a design standpoint: &quot;No.&quot;</p>",
    "PostedDate": "2010-03-15T22:22:45.317-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "418593",
    "ThreadId": "205013",
    "Html": "<p>/agree on the above</p>\r\n<p>Additionally, for PVP there's a lot more to worry about than plain DPS, specific PVP gear and weapons are still preferred because of the resilience they offer. There's usually not a whole lot of choice of items for a specific class/spec, so using a gearing tool like Rawr isn't even all that much needed.&nbsp; There's the season arena/PVP set, with weapons, and there's maybe just a couple items you could viably swap around otherwise.</p>\r\n<p>In a PVP environment, I'd also assume peoplpe don't just stand there keeping their backs turned towards you, so 0% time in front of players is probably wishful thinking. Expertise in a PVP environment will help as well.</p>\r\n<p>DPS as a metric for gearing choice in a PVP environment is just a really poor metric to go by.&nbsp; You don't typically get to whack a player for any length of time as they'll either die quickly that way or get out of your way.&nbsp; Steady DPS modelling simply doesn't work well, good survival coupled with burst and a touch of skill is what makes good pvp happen (but what do I know, I rarely pvp myself : p)</p>",
    "PostedDate": "2010-03-16T02:08:37.637-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "418708",
    "ThreadId": "205013",
    "Html": "Yeah, no problem.  For pvp I use it mainly to see average hits per ability etc.. rather than dps numbers, so I can get a decent sense of what I can do in a burst.  I don't get targeted much in our specific comp and I have some pve pieces that are much higher ilvl then some of my current pvp gear.  0% is generally unrealistic - I was just initially expecting expertise to to count for nothing if I set it that way.\r\n\r\nThanks for the answers.\r\n\r\n",
    "PostedDate": "2010-03-16T08:04:40.867-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]