[
  {
    "Id": "418388",
    "ThreadId": "205034",
    "Html": "<p>I know this has been mentioned in the past, but is it really that big of a project to update the item lists within rawr? Getting really tired of adding them each time rawr updates. There's still a lot of items that need querying as well. If it's a huge project or people just don't have time, I'd be more than happy to submit my item cache once i update it (again).</p>\r\n<p>I do realize that i can keep my own item cache each time rawr updates, but there are some items that get &quot;fixed&quot; (idols a prime example) within rawr and I'd miss those by keeping my own cache.</p>",
    "PostedDate": "2010-03-15T12:48:56.233-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "418406",
    "ThreadId": "205034",
    "Html": "<p>Yes, it really is a significant undertaking. I update it where I can, but am not always going to get everything right. That's why we've opted to making it super fast and easy for you to add/update whatever items you want.  If someone wants to take on the role of maintaining the default item cache, that'd be most welcome. (But remember, it needs to be updated for all items, not just the kinds of items that your class/spec uses.)</p>",
    "PostedDate": "2010-03-15T13:32:48.683-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "418407",
    "ThreadId": "205034",
    "Html": "<p>The problem we run into is that we would have to go model by model and run a &quot;Load Possible Upgrades from Armory/Wowhead&quot;. Once finished, we'd have to do a full item cache update. This total process would take hours.</p>",
    "PostedDate": "2010-03-15T13:35:34.17-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "418603",
    "ThreadId": "205034",
    "Html": "<p>That's how Rawr does it now, because that's the most efficient way to go about it for one specific class/spec.</p>\r\n<p>But if you do that for each class/spec, you're going to be getting a lot of doubles, and they'll just get reloaded. Causing the delays.<br><br>For maintainting all of the&nbsp;itemcache, it can be done more efficiently...&nbsp; Probably something like:</p>\r\n<ol>\r\n<li>(manually) Create a list of bosses, Professions and vendors.&nbsp; That would be the 'work' of the maintainer.</li>\r\n<li>Search those on wowhead/armory</li>\r\n<li>Get a list of all the items they drop, vendor or can make</li>\r\n<li>Get the items themselves.</li>\r\n</ol>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-03-16T02:34:02.68-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "418768",
    "ThreadId": "205034",
    "Html": "<p>Let your users do it for you?</p>\r\n<p>Give an option to upload our item caches, a script runs through them, adding any missing/changed items to a master item cache which is released with Rawr.</p>",
    "PostedDate": "2010-03-16T10:08:13.033-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "418782",
    "ThreadId": "205034",
    "Html": "<p>They already have given us the option. Refresh relevants from Armory followed by Refresh revelants from Wowhead. Every now and then I will 'Find upgrades' but mostly not. They have given the users the tools needed, we just need to quit being lazy and actually use them.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-03-16T10:29:14.887-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "418797",
    "ThreadId": "205034",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>Nekler wrote:</strong><br>\r\n<p>Let your users do it for you?</p>\r\n<p>Give an option to upload our item caches, a script runs through them, adding any missing/changed items to a master item cache which is released with Rawr.</p>\r\n</blockquote>\r\n<p>&nbsp;</p>\r\n<p>That would bloat the itemcache with tons of useless items.</p>",
    "PostedDate": "2010-03-16T10:56:29.887-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "418806",
    "ThreadId": "205034",
    "Html": "<p>I apologize for this, i didn't mean for this topic to get out of hand. My main gripe was items that have a clear value to be input into rawr at this time. None of the Lich King items are listed in rawr yet. Just a pain to reinput them with every new patch.</p>\r\n<p>There are many tools for us to use and I appreciate those. I honestly didnt mean for this to start an argument over random items in rawr. Just the pertinent end-game raiding items.</p>",
    "PostedDate": "2010-03-16T11:07:53.097-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "418843",
    "ThreadId": "205034",
    "Html": "<p>Not out of hand. Seriously would be interested in someone dedicated to maintaining the default item cache.</p>",
    "PostedDate": "2010-03-16T12:41:58.91-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "418879",
    "ThreadId": "205034",
    "Html": "<p>Not sure what it takes to submit something like that. But if it doesn't require coding experience, I would take that on.</p>",
    "PostedDate": "2010-03-16T13:59:30.107-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]