[
  {
    "Id": "419349",
    "ThreadId": "205285",
    "Html": "<p>I was curious what other Holy Priests are putting into Rawr settings for their Fight Length time (25 man ICC, non-heroic).</p>\r\n<p>The default setting of 480 seconds strongly prefers I gem for Intellect. &nbsp;However, I noticed that I very rarely had mana issues and figured I should adjust the fight time down a bit. &nbsp;But when I changed this to what I thought was a more reasonable time (360) it strongly preferred I gem for Haste.</p>\r\n<p>Any input or recommendations from other priests out there would be appreciated.</p>\r\n<p>Thanks in advance!</p>\r\n<p>PS. &nbsp;I didn't see how to attach my character xml in the discussions forum and perhaps its not relevant anyway.</p>",
    "PostedDate": "2010-03-17T11:14:47.473-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "419381",
    "ThreadId": "205285",
    "Html": "<p>I'm actually interested in knowing this as well, so I can see if people use the model as I expected them to.</p>\r\n<p>&nbsp;</p>\r\n<p>I'm also very interested in knowing what experience people have done with the Custom role.</p>",
    "PostedDate": "2010-03-17T12:43:07.213-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "419476",
    "ThreadId": "205285",
    "Html": "<p>I know with my guild, fights range from 2:30 minutes (Marrowgar) to 18 minutes (LK). Looking at last weeks kill times (we finally killed LK last week) all of these are on normal setting:</p>\r\n<p>Marrow - 2:39<br>Deathwisper - 3:47<br>Gunship - ~6 minutes (WoL doesn't show that fight for some reason)<br>Deathbringer - 3:06<br>Rotface - 4:07<br>Festergut - 4:11<br>Putricide - 9:02<br>Council - 3:41<br>Queen - 4:59<br>Dreamwalker - 6:09<br>Sindragosa - 9:07<br>LK - 17:44 (granted about 1-1:30 of that is RP near the end and because of the RP we are given 2 Heroisms [once during 2nd transition and one after the RP]). However after going through the logs, the amount of time that healers are actually healing is about 14:48.</p>\r\n<p>As for this week, we have only downed Marrow (6:13) and Gunship on Heroic [skipped Lady since we were having issues with P1].</p>\r\n<p>&nbsp;</p>\r\n<p>As for custom role, I'm unsure how you want us to work with that. Do you want us to say how many times we cast each spell?</p>",
    "PostedDate": "2010-03-17T16:03:28.15-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "419479",
    "ThreadId": "205285",
    "Html": "<p>Yes, the custom role basically expects you to take a combat log, and feed the information directly into it. Then it will try to tune your gear around that specific fight when you use Optimize.</p>",
    "PostedDate": "2010-03-17T16:13:35.033-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]