[
  {
    "Id": "420899",
    "ThreadId": "205882",
    "Html": "<p>I just got rawr a few days ago, and it's likely I just don't know what I'm doing, but rawr doesn't have wrathful in it's database. I've updated the item cache from both wowarmory and wowhead and they're still not there. I eventually resorted to loading wow armories of different players who are wearing the wrathful pieces I'm looking for, and they have weird pictures of people. What am I doing wrong? This is extremely frustrating.</p>",
    "PostedDate": "2010-03-21T00:59:35.53-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "420906",
    "ThreadId": "205882",
    "Html": "<p>...Gotta ask the obvious question. Did you try adding the items you're missing? Updating won't do anything to solve your problem if you don't have anything to update.</p>",
    "PostedDate": "2010-03-21T02:03:33.54-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "424445",
    "ThreadId": "205882",
    "Html": "<p>rxd,</p>\r\n<p>The correct answer is to goto your tools menu and click &quot;Load Possible Upgrades From Armory&quot;.&nbsp; This will put the full wrathful set into your item list.</p>\r\n<p>Brian</p>",
    "PostedDate": "2010-03-27T07:50:26.55-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "446307",
    "ThreadId": "205882",
    "Html": "<p>I too am having problems with the wrathful set appearing in Rawr.</p>\r\n<p>I did exactly what bhershey said, the best it had to show was still Relentless. The wrathful offpieces are all there but the set is not, as far as Rawr is concerned Relentless is the best.</p>\r\n<p>I'm&nbsp; using v2.3.17.</p>\r\n<p>Any other solutions?</p>",
    "PostedDate": "2010-05-22T22:25:11.6-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "446425",
    "ThreadId": "205882",
    "Html": "<p>Go to Wowhead.com. Choose Database-&gt;Itemsets-&gt;Class you want.</p>\r\n<p>In the &quot;Tag&quot; field in the filters section at the top of the page that loads, choose &quot;Arena Season 8 Set&quot; and click &quot;Apply&quot; so you only get the Wrathful set(s) for that class.</p>\r\n<p>If you have multiple sets available, choose the set you want. It should open another page with the five set items.</p>\r\n<p>Click on the first one in the list, in your address bar in your browser, it should give you something like: http://www.wowhead.com/item=51503. Take the number at the end, and write it down. Do that for all the Wrathful items you want to load into Rawr.</p>\r\n<p>Open Rawr, go to Tools-&gt;Edit Items and down at the bottom left hand corner click the Add button. In the window that pops up, uncheck Armory, and leave Wowhead checked. Punch in one of the numbers you wrote down and hit Ok. It should add it to your item cache. Continue for all the numbers you wrote down.</p>",
    "PostedDate": "2010-05-23T12:19:20.787-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "483072",
    "ThreadId": "205882",
    "Html": "<p>Sorry for bringing an old thread back, but this same thing is happening to me on my Hunter. I did the &quot;Load Possible Upgrades from Armory&quot; and I also add the items manually even though they were already in the items lists. But they are still not appearing in the Gear Upgrades List. I have all the filters on (except the &quot;disable&quot; filters of course).</p>\r\n<p>The weird thing is that the items are showing for my Shaman (and they share the same PvP gear)...</p>\r\n<p>I am using Rawr 2.3.21</p>",
    "PostedDate": "2010-08-21T06:47:28.29-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "483160",
    "ThreadId": "205882",
    "Html": "<p>Try the options pane.&nbsp;&nbsp; In the basic tab, under misc is an option &quot;Hide PvP gear&quot; - that may be your problem.</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-08-21T16:15:28.577-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "487512",
    "ThreadId": "205882",
    "Html": "<p>This has something to do with the default item filters, if you clear them out, the Titan-forged (WG) and Wrathful stuff is shown</p>",
    "PostedDate": "2010-09-01T04:35:17.727-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]