[
  {
    "Id": "422230",
    "ThreadId": "206916",
    "Html": "<p>Hi Astrylian, when we can expect changes to mangle introduced in 3.3.3?</p>",
    "PostedDate": "2010-03-22T12:18:40.39-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "422259",
    "ThreadId": "206916",
    "Html": "<p>Soonish. That said, I can tell you right now that the glyph won't even remotely be worth using for Cat PvE. It's purely a Bear/PvP glyph (Yay for getting to carry stacks of Growl, Maul, Mangle, and Frenzied Regen glyphs to swap between between each boss fight).</p>",
    "PostedDate": "2010-03-22T13:57:21.73-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "428754",
    "ThreadId": "206916",
    "Html": "<p>Are you 100% sure about this?</p>\r\n<p>I've tried the mangle glyph and spammed mangle on rotface 25 (where you need to turn a lot) and my dps was still on par as usual. I didn't test it enough to be sure but at least i'm sure it's not a big dps drop. For some fights it may be better. On a patchwerk / festergut tank spank fight shred would ofc still be better if you can keep the rotation up for 100%. Would be nice to see the effects in a sim tool like Rawr soon.</p>\r\n<p>Also on fights where you have adds to kill (Lady, Dreamwalker etc) it's probably better to spam mangle then shred.</p>",
    "PostedDate": "2010-04-08T04:57:41.513-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "428814",
    "ThreadId": "206916",
    "Html": "<p>I know a few people on Elitist Jerks tested a few builds (use mangle instead of shred, use shred only on Omen proc) and they were coming back with a 2.6% decrease in dps compared to a shred build using simulationcraft. So it is worth looking into.</p>\r\n<p>http://elitistjerks.com/f73/t63774-feral_dps_discussion/p33/#post1608143</p>\r\n<p>http://elitistjerks.com/f73/t81052-best_possible_feral_dps_simulationcraft/p7/#post1609271</p>",
    "PostedDate": "2010-04-08T07:43:36.42-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "429926",
    "ThreadId": "206916",
    "Html": "<p>Thanks for updating Mangle in latest Rawr. In my case I would suffer a 500dps loss 10200ish drops to 9700ish. So a dps loss of 5% assuming you can keep the rotations perfect. Apart from festergut it's hard to maintain perfect uptime of all (de)buffs so switching to mangle spammer 24/7 doesn't sound like a bad idea to me (I must admit I don't consider myself a rotation master so making rotation a bit easier is always welcome)</p>",
    "PostedDate": "2010-04-12T01:29:49.02-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "430095",
    "ThreadId": "206916",
    "Html": "<p>Honestly, I can't suggest switching to Manglespam. It's a very significant DPS loss.</p>\r\n<p>Instead, stick with Shred, but do this: Spend an hour straight on a target dummy, just maintaing your rotation. Watch some TV or something in the background. Try to keep near-100% uptime on both bleeds (without clipping), and SR, and Mangle. Then do it again the next night. Then again the next. Really. Cannot stress enough just practice on a dummy is for Cat DPS.</p>",
    "PostedDate": "2010-04-12T09:42:09.857-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "430510",
    "ThreadId": "206916",
    "Html": "<p>Ofc Shred will be better, and 5% dps is quite a bit. But that's only on tank/spank fights like festergut.&nbsp;On a lot of fights you have to switch targets, move away etc and you can't keep a rotation on adds that die in 10 seconds. In those cases I think I'll stick to mangle spam. Shredding on those fights may still be better (if you can get behind the target fast enough, also depends on fight) but the DPS loss won't be that significant I think. But that's just guessing and I need to experience that myself. No simcraft tool can accurately calculate that dps.</p>\r\n<p>And I have no problems keeping a rotation up on a target dummy, but when it comes to switching targets to adds other boss etc it gets much more complicated. My main spec is bear so if I dps they don't expect me to be nr 1 on dps anyway ;)</p>",
    "PostedDate": "2010-04-13T08:40:07.413-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "430548",
    "ThreadId": "206916",
    "Html": "<p>When it comes to target switching, it's *still* going to be more damage to only Mangle once, and Shred the rest (even if it's only say 1 shred). Nothing changes about that situation.</p>",
    "PostedDate": "2010-04-13T09:57:45.427-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "430643",
    "ThreadId": "206916",
    "Html": "<p>I think his point - and one I agree with for some cases - is that sometimes it's easier to repeatedly Mangle (no positioning requirements) adds than it is to Mangle/Shred [oh crap, someone pulled so it turned and faced me, so cast didn't work]/Shred/Shred etc... - the loss of 5% Damage from Mangling instead of shread is less than the loss of time because one Shred out of twenty didn't trigger properly.</p>\r\n<p>The first response that comes to mind is:&nbsp; Well then, make sure you are always behind the add!</p>\r\n<p>The response I would use to that is:&nbsp; Depends wildly on the add!&nbsp; Auriaya's resurrecting add, Dwarves in&nbsp; Thorim's room, Faction Champions, Scarabs in Anub'Arak, adds in Dreamwalker - with a few exceptions, either the tank or untanked adds are moving.&nbsp; If the tank is moving, you *will* miss a shred - even if only because of a bug on the floor making the mob turn briefly so it can be at the right hitbox location.</p>",
    "PostedDate": "2010-04-13T14:15:14.98-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "430689",
    "ThreadId": "206916",
    "Html": "<p>I would consider mangling on a fight like Faction Champs where I have trouble seeing which way the adds are facing and move around a lot.&nbsp;&nbsp; Almost every other fight I find shredding to not be a big problem.&nbsp;&nbsp; Even on a fight like Rotface, it isn't hard to reposition when he turns to spray (in fact you risk dieing if you don't!).&nbsp;&nbsp; As long as you haven't pooled your energy too high, or had (un)lucky OOC procs then you haven't lost any DPS by pausing to switch positions.&nbsp;&nbsp; You actually risk losing more DPS by mangling because when the boss turns towards you, there is a chance your mangle will be parried.&nbsp; You lose a little energy with the miss and have to wait a GCD before attacking again, risking a surplus of energy.&nbsp;&nbsp; If shredding, the attack just doesn't go off - no parry, no loss of energy, no wasted GCD.</p>\r\n<p>&nbsp;</p>\r\n<p>The difference between the two is slight, but frankly, I find it more important to aim high and practise my skills in all situations.&nbsp;&nbsp;&nbsp; I'd rather that than admitting that some of the fights are &quot;too hard&quot; and taking the easy option.&nbsp;&nbsp; That's how I feel - not criticising anyone else for making their own choice on this matter.</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-04-13T16:26:48.81-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "430695",
    "ThreadId": "206916",
    "Html": "Exactly. There are very few situations where it's optimal to Mangle for CP. It's only when it's so hard to maintain position that you hit 100 energy. Failing a shred due to facing 10% of the time doesn't do that, because there's no energy loss (that's what you're limited by 90% of the time, remember), and only a [ping] time loss. It's only things like faction champs, and... Heck, I think that's it, that I can think of, where it'd be optimal to Manglespam, just cause you can get CC'd frequently, and the mob facing can change so wildly, and you can't easily see where it's facing. Remember, anywhere you Mangle when you couldn't Shred due to facing, you're able to be parried, which cuts another 5-10+% DPS off it. \r\n\r\nThe bottom line is that Mangling for CP may 'seem' easier in some situations, but it's really just an excuse for lazy/poor play. Bite the bullet and do it right.  ",
    "PostedDate": "2010-04-13T16:40:53.363-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]