[
  {
    "Id": "422263",
    "ThreadId": "206925",
    "Html": "<p>Dear all,</p>\r\n<p>for quite some time now, I have been under the impression that rawr is overrating intelligence for holy priests. My holy priest is correctly stuffed and I have no mana pool or regen issue while raiding ICC 25.</p>\r\n<p>Yet, as it concerns overall optimization, rawr suggests me to gem yellow slots with +20 intel, while I tend to use +10 SP / +10 haste.</p>\r\n<p>I don't master all rawr features, so I may have missed something. I'm not a theorycraft expert either, so I may underestimate the benefits of intelligence for holy priests.</p>\r\n<p>Yet, I was wondering whether anybody else shares the same question.</p>\r\n<p>Regards, and many many thanks to rawr development team. I've been saving lots of aspirin thanks to you.</p>\r\n<p>Laurier@Cho'gall (EU)</p>",
    "PostedDate": "2010-03-22T14:00:42.943-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "422268",
    "ThreadId": "206925",
    "Html": "<p>See the 'I Don't Understand Why...' page of the documentation. You've almost certainly forgotten to buff yourself.</p>",
    "PostedDate": "2010-03-22T14:08:02.193-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "422306",
    "ThreadId": "206925",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>Astrylian wrote:</strong><br>\r\n<p>See the 'I Don't Understand Why...' page of the documentation. You've almost certainly forgotten to buff yourself.</p>\r\n</blockquote>\r\n<p>it seems that Mana Tide that I had not selected makes a hell of a difference. I might spend more time under its influence than I was thinking. I will have to check that in raid.</p>\r\n<p>Many thanks for this prompt feedback. The impact of buffs is amazing, indeed.</p>\r\n<p>Laurier.</p>",
    "PostedDate": "2010-03-22T15:15:24.947-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "422343",
    "ThreadId": "206925",
    "Html": "<p>I recently discovered that the impact of &quot;Fight Length&quot; is just as important when deciding between Haste and Intelligence. &nbsp;Fight Length = 360 seconds much prefers Haste for me... 420, Intel... only 1 min difference :)</p>",
    "PostedDate": "2010-03-22T17:47:30.553-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "422396",
    "ThreadId": "206925",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>Holygrubel wrote:</strong><br>\r\n<p>I recently discovered that the impact of &quot;Fight Length&quot; is just as important when deciding between Haste and Intelligence. &nbsp;Fight Length = 360 seconds much prefers Haste for me... 420, Intel... only 1 min difference :)</p>\r\n</blockquote>\r\n<p>Yes, a longer fight, means you will need a bigger mana pool and therefore more intelligence, as there is definitely no way you can regen as fast as you use mana up :-)</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-03-22T23:28:58.32-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "422413",
    "ThreadId": "206925",
    "Html": "<p>Also the FSR slider can be very decisive. Some long fights you can actually get a decent amount of breaks from time to time, even if the fight is rather long (Like LK in ICC).</p>",
    "PostedDate": "2010-03-23T00:03:54.55-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "422784",
    "ThreadId": "206925",
    "Html": "<p>This has always bothered me with the healing modules.&nbsp;&nbsp;&nbsp; It seems to be an all or nothing thing.&nbsp;&nbsp; Add 5 secs to the fight length and the value of Int/Mp5 goes from 0 to really high.&nbsp;&nbsp;&nbsp;&nbsp; Neither is a true representation of what we need.</p>\r\n<p>It is a bit like the stam for tanks.&nbsp;&nbsp; Once you get to a certain level, extra mana (base or regen) gradually decreases in value as less and less of the encounters go for long enough to make mana an issue.&nbsp;&nbsp; You could argue that you should always have the fight length set to the longest fight you will be doing, but often you have the option of an extra innervate or mana tide or something.&nbsp; Should you gear for that one fight that lasts 12+ minutes or should you gear for the bulk of your fights in the 5-8 minute range?</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-03-23T15:07:09.047-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "422909",
    "ThreadId": "206925",
    "Html": "<p>Yes, maybe if you add 5 secs to the fight, another 20 int may give you a lot, but after that 20 int, the value of int/mp5 should go back from really high to 0 again. Its not entirely too different for how Expertise/Hit works for dps.</p>",
    "PostedDate": "2010-03-23T23:54:42.113-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]