[
  {
    "Id": "423729",
    "ThreadId": "207332",
    "Html": "<p>Hello all. I apologize in advance for trying to use Rawr for something it wasn't necessarily designed to do. I know that Rawr isn't effective at modeling anything for pvp, but it's better than guesswork so forgive me.</p>\r\n<p>Many of you may know that using a prot paladin for dps in pvp has become an increasingly hot topic. There are tons of different gearing and gemming choices, including multiple variations of complicated set bonuses spanning different tiers of armor. I've been trying to model my protret paladin, and using &quot;threat&quot; as a stand in for dps, but it simply doesn't seem to be effective.</p>\r\n<p>For example, I'm fairly confident that gemming for strength for attack power, spell power, and block value is a greater dps increase over gemming for agility which is simply crit.</p>\r\n<p>My ultimate goal is to figure out the differences in damange done when using full ret gear, or using partial ret gear and partial block value gear, or using some&nbsp;prot t10 for the 2 piece bonus.</p>\r\n<p>Can anyone offer some tips or advice on how to accomplish this accurately?</p>",
    "PostedDate": "2010-03-25T12:32:37.25-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "423742",
    "ThreadId": "207332",
    "Html": "<p>I doubt that you'll be able to reasonably evaluate this using Rawr (like you said, it's not intended to), but the closest you may be able to come is to use the Ret model, with a Prot spec. Doubt that'll even work, because I don't think it uses HotR or AS.</p>",
    "PostedDate": "2010-03-25T12:56:58.37-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "423802",
    "ThreadId": "207332",
    "Html": "<p>I have been looking into this lately.&nbsp; The ret module is of no use at all as it does not allow you to equip a shield at all or use HotR, AS etc.</p>\r\n<p>&nbsp;</p>\r\n<p>The prot module is reasonably ok to use setting the ranking system to use &quot;Damage Output&quot;.&nbsp;&nbsp; As I was looking from a PvE DPS perspective, I also had to deselect the Holy Shield ability.&nbsp;&nbsp;&nbsp; It still is far from perfect, but it is somewhere to start.&nbsp;&nbsp; The ability rotation is probably different from tanking, the mana side of it isn't really modeled as it is assumed you are taking damage and getting mana through being healed.&nbsp;&nbsp;&nbsp;&nbsp; Seal of Command also isn't modeled which may be similar to Seal of Vengeance in effectiveness for some fights (not really sure).</p>\r\n<p>&nbsp;</p>\r\n<p>I'm certainly not asking for these to be done - PvE Prot DPS isn't something that is much of an issue in-game (just for me who wants to dual-spec Prot/Holy and may not always be needed to tank) and PvP isn't Rawrs thing.</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-03-25T15:12:42.177-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "423850",
    "ThreadId": "207332",
    "Html": "<p>I'm making pretty good progress with this as my nuance develops.</p>\r\n<p>Not all the tools are currently there, but just as a preview of what I'm doing:</p>\r\n<ol>\r\n<li>- In the options&gt;ranking tab check off &quot;damage output&quot;</li>\r\n<li>- Turn on/off all relevant abilities like turn off holy shield (no way to turn off consecration yet as far as i can see)</li>\r\n<li>- Edit your tools&gt;gemming templates to include the epic threat templates. I've tried putting in some custom templates to include relentless earthseige diamonds but I cant seem to do it right, since the BV meta gem still keeps showing up as the most damage output even after BV is hard capped.</li>\r\n<li>- Checked the item comparison tool with obvious damage upgrades (i.e., relentless glad pummeler to Gutbuster) and it seems to double check with other obvious upgrades</li>\r\n<li>- Used the optimizer to maximize threat generation, and it returned a very sensible set including 2 piece wrathful, 1 piece pve, and 2 piece lightsworn for the bonus. So I think this is a pretty decent way to model protribution</li>\r\n</ol>\r\n<p>There may be some other things i've done and i'll edit them in later. Things I don't know how to do:</p>\r\n<ol>\r\n<li>- Get consecration off of our &quot;dps rotation&quot;</li>\r\n<li>- add in the pvp bonuses on the &quot;buffs&quot; page (I can probably add the 150atk power by editing an item)</li>\r\n<li>- see a breakdown, similar to the ret module, of how hard different attacks hit on average</li>\r\n<li>- Trying to figure how to shave a second off judgements to model the pvp bonus.</li>\r\n<li>- Items are returning with strength gems, and dps enchants on the comparisons sidebar, though the meta gem issue still messes things up, seems to really value SBV too highly but maybe that's my ignorance</li>\r\n</ol>",
    "PostedDate": "2010-03-25T18:36:30.283-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "423871",
    "ThreadId": "207332",
    "Html": "<p>Just deselect any gemming templates with that Meta.&nbsp;&nbsp; This will probably mean you have to add in a few templates yourself - that is of course assuming you are BV capped.</p>\r\n<p>I'm not confident in the accuracy of this though as the &quot;relative stats&quot; panel is showing a value for defence - which doesn't seem right in any way I can think of.</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-03-25T19:27:41.14-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "424052",
    "ThreadId": "207332",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>RareBeast wrote:</strong><br>\r\n<p>Just deselect any gemming templates with that Meta.&nbsp;&nbsp; This will probably mean you have to add in a few templates yourself - that is of course assuming you are BV capped.</p>\r\n<p>I'm not confident in the accuracy of this though as the &quot;relative stats&quot; panel is showing a value for defence - which doesn't seem right in any way I can think of.</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n</blockquote>\r\n<p>&nbsp;Well, you're assuming that rawr is wrong. It might not actually BE wrong -&nbsp;maybe more block value on your way to the hard cap is better than +21agi and 3% increased critical strike damage. Going to test by putting a shit ton of BV on a random piece of gear and see if it still wants me to get the BV meta. In terms of defense.... well, it does boost parry which lowers your swing timer every time you parry&nbsp;:P</p>\r\n<p>Edit: I took a look at my relative stats panel, and it shows defense having a NEGATIVE value... which makes sense considering you lose threat by not getting hit etc. Yours has it as a positive value?</p>",
    "PostedDate": "2010-03-26T06:23:18.823-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "424141",
    "ThreadId": "207332",
    "Html": "<p>Quick question for Astrylian:</p>\r\n<p>How can I be sure that any of the PvP set bonuses are activating when I equip them? I see the buffs in the buff cache, but even when I activate the ret module, I see no evidence that equipping 4 pieces of wrathful reduces the cooldown of my judgements more than equipping 3 pieces of wrathful. Is there a way to put throw that buff in the buffs tab and be able to check it on or off?</p>",
    "PostedDate": "2010-03-26T09:00:53.64-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "424310",
    "ThreadId": "207332",
    "Html": "<p>Buffs =&gt; Set Bonuses.&nbsp;</p>\r\n<p>It isn't listed there so I assume that it isn't modeled atm.&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-03-26T17:49:37.77-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]