[
  {
    "Id": "425923",
    "ThreadId": "207910",
    "Html": "<p>So, this very well could just end up being a feature request, if so.. I apologize and I'll post in the tracker. I also searched a bit for this question, but so many topics start as one thing and change later I just couldn't find my problem,</p>\r\n<p>But, is there a way to specify certain gem sets when you click that an item is available.</p>\r\n<p>Here's what's happening. I'm a DK and I'm working on a tanking set. I have my dps gear gemmed, enchanted, etc. I do not, under any circumstances, want to change how the items are gemmed or enchanted. Is there a way to tell in just use this item as it is, don't regem it, don't re-enchant it, etc, but at the same time let it regem the other items as it pleases when optimizing.&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>For example, I have 4 sets of bracers, 2 actually have defense and dodge, one is my DPS set, and another is an old dps set. I'd like to tell it leave my current dps bracers untouched. As in, feel free to equip them if they are an upgrade as is.</p>\r\n<p>&nbsp;</p>\r\n<p>Hope this made sense... if not... *sigh* My bad.&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-03-31T04:26:36.203-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "425934",
    "ThreadId": "207910",
    "Html": "<p>You need <a href=\"http://rawr.codeplex.com/wikipage?title=BatchTools&referringTitle=Documentation\">Batch Tools</a> and <a href=\"http://rawr.codeplex.com/wikipage?title=Gemmings&referringTitle=Documentation\">Blue Diamonds</a> for the <a href=\"http://rawr.codeplex.com/wikipage?title=GearOptimization&referringTitle=Documentation\">Optimizer</a></p>",
    "PostedDate": "2010-03-31T04:53:59.023-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "425947",
    "ThreadId": "207910",
    "Html": "<p>Ok, not sure how that will help as I'm kind of new to this, but I'll look into it. One more question. One handed weapons that aren't unique. How can I make Rawr not assume I have 2? If I uncheck it from main or off-hand, it un-checks the other. Is it possible?</p>",
    "PostedDate": "2010-03-31T05:21:18.41-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "425954",
    "ThreadId": "207910",
    "Html": "<p>Edit the item and mark it unique.</p>",
    "PostedDate": "2010-03-31T05:33:14.133-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "425959",
    "ThreadId": "207910",
    "Html": "<p>Ah. good thinking. Sorry, been up all night messin with Rawr, mind not swift enuff to come up with stuff like that. Thanks!</p>",
    "PostedDate": "2010-03-31T05:45:56.86-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]