[
  {
    "Id": "428412",
    "ThreadId": "208596",
    "Html": "<p>I love this program and would love to see a version on my Droid!!! Would this be at all possible?</p>\r\n<p>&nbsp;</p>\r\n<p>Illrunyou - Lightbringer - US - Horde</p>",
    "PostedDate": "2010-04-07T11:06:25.627-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "428418",
    "ThreadId": "208596",
    "Html": "<p>Short answer: No.</p>",
    "PostedDate": "2010-04-07T11:17:37.06-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "428445",
    "ThreadId": "208596",
    "Html": "<p>Shorter response: FAIL!</p>",
    "PostedDate": "2010-04-07T11:46:10.273-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "428447",
    "ThreadId": "208596",
    "Html": "<p>eww... I can't imagine running the optimizer on a phone, the battery would die before it finished.</p>",
    "PostedDate": "2010-04-07T11:52:20.283-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "428453",
    "ThreadId": "208596",
    "Html": "<p>1) &quot;No.&quot; is actually shorter than &quot;FAIL!&quot;.</p>\r\n<p>2) Apple doesn't even support FLASH on the iPhone. &nbsp;I doubt they're even thinking about supporting Silverlight any time soon.</p>",
    "PostedDate": "2010-04-07T12:01:17.713-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "428476",
    "ThreadId": "208596",
    "Html": "<p>Slightly longer answer from a Dev standpoint: Hell no. An Android port would be a waste of time, for obvious reasons, and an iPhone port would be a gigantic undertaking, which would result in a terrible app.</p>\r\n<p>Slightly longer answer from a User standpoint: Think harder about it. The idea of &quot;Rawr in my pocket&quot; sounds great at first... until you think harder about it, and realize that it'd be a terrible idea. You wouldn't be able to optimize, the performance would be horrible, the UI interaction would be extremely restrictive, etc.</p>",
    "PostedDate": "2010-04-07T12:34:27-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "428811",
    "ThreadId": "208596",
    "Html": "<p>Already doing this &nbsp;:-D</p>\r\n<p>Although I'm cheating.&nbsp; I'm using my mobile to get a Remote Desktop session on my home PC.&nbsp; It has some practical issues, mainly dealing with the small screen. but it works. And it works at acceptable speeds to update the screen.</p>\r\n<p>Developing on the mobile (even with this) is still a no-go, mainly because of the small screen and because typing in lots of text still is annoying enough to pull out my hair.</p>\r\n<p>I agree with my fellow devs above that while it sounds like a good idea, a native mobile version of Rawr would probably be a bad idea.&nbsp; For one, rawr needs a connection to internet for many of it's features, and unfortunately mobile internet fees are still on the somewhat high side.&nbsp; Local storage requirements would be an issue (itemcache, icons...), Memory requirements would be an issue, and of course CPU resources would be an issue, many the features in Rawr only work well because it can use multiple CPU cores off your desktop PC.&nbsp; Plus your PC probably is a couple hundred to thousand times faster than the CPU of your mobile.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-04-08T07:35:10.727-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "429419",
    "ThreadId": "208596",
    "Html": "<p>Actually, the WoW Amory app for the iPhone is quite fast and easy to use:<br><a href=\"http://www.wowarmory.com/iphone.xml\">http://www.wowarmory.com/iphone.xml</a></p>\r\n<p>And if Rawr can build in Mono, there are supposedly ports available for the iPhone and Android:<br><a href=\"http://arstechnica.com/open-source/news/2009/01/open-source-mono-framework-brings-c-to-iphone-and-wii.ars\">http://arstechnica.com/open-source/news/2009/01/open-source-mono-framework-brings-c-to-iphone-and-wii.ars</a></p>\r\n<p>Not to say that it wouldn't be an enormous amount of work though!</p>",
    "PostedDate": "2010-04-09T15:15:57.13-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "429427",
    "ThreadId": "208596",
    "Html": "<p>Armory != Rawr.</p>",
    "PostedDate": "2010-04-09T15:27:53.08-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "429521",
    "ThreadId": "208596",
    "Html": "<p>Also Apple just updated their stuff for OS4.0:</p>\r\n<p>&nbsp;</p>\r\n<p>3.3.1 &mdash; Applications may only use Documented APIs in the manner prescribed by Apple and must not use or call any private APIs. Applications must be originally written in Objective-C, C, C++, or JavaScript as executed by the iPhone OS WebKit engine, and only code written in C, C++, and Objective-C may compile and directly link against the Documented APIs (e.g., Applications that link to Documented APIs through an intermediary translation or compatibility layer or tool are prohibited).</p>\r\n<p>&nbsp;</p>\r\n<p>This implies that any Mono solution is out of the picture.</p>\r\n<p>&nbsp;</p>\r\n<p>TLDR; We will have to recode Rawr from scratch to make it viable for iTune Store.</p>",
    "PostedDate": "2010-04-10T04:24:21.783-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "429552",
    "ThreadId": "208596",
    "Html": "<p>Devices generally lack the processing power and/or memory required to do any real gear optimizing. You'd basically be carrying around another version of the Armory app if you take the optimization stuff out. That'd be a waste of time for all the people who already put in their precious free time making the current version what it is. It's a grand idea to have the power of Rawr in your pocket, but I'm afraid the hardware isn't there yet.</p>",
    "PostedDate": "2010-04-10T07:27:53.903-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "562965",
    "ThreadId": "208596",
    "Html": "I think the amount of money one could make on even a simplified version of rawr for these devices is being underestimated. I'd buy it. Is there any way to have a separate machine do all the calculations and simply interface using the phones? Like a beefy\r\n server(s)? Or with one's own pc even if they had to have an app running in the background?",
    "PostedDate": "2011-02-08T15:41:02.347-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "563503",
    "ThreadId": "208596",
    "Html": "\r\n<p>I think you'd end up needing to do all the item caching and optimizing in the cloud, making the &quot;app&quot; a UI only. That's bad, because there'd have to be a cost associated with storing the content and all the processing (optimizing). So it wouldn't be something\r\n you could buy once for $0.99 and have it work forever. The $0.99 would be for the UI and then you'd have to have some kind of subscription model for actually using Rawr.</p>\r\n<p>Sounds like a headache.</p>\r\n",
    "PostedDate": "2011-02-09T11:55:13.923-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "563847",
    "ThreadId": "208596",
    "Html": "\r\n<p>If we were making rawr because it can make us more money, you'd already be seeing that in rawr now with advertisement banners both in the online and offline version and&nbsp;additional &quot;usefull stuff&quot; being combined in the rawr installer.</p>\r\n<p>it's not there now.<br>\r\n<br>\r\nHence, we're not doing it for the money.</p>\r\n<p>If we REALLY wanted to do what we do for the money, there are ways to generate more income per time unit spent on it than for making a mobile version of rawr. But yes, markdall hit the nail on the head. If you can't do processing on the mobile itself (too\r\n slow, too draining on the battery), then you have to do it on a server somewhere, that server needs to be payed for, so rawr wouldn't be a single payment thing. You'd have to pay for the app, and then pay fees for the usage service.</p>\r\n<p>You could make it work with the CPU power of your home PC, but that would make the app considerably less useful for many and thus make less money, and even if it wasn't for the money, it'd mean less potential users meaning lots of effort for little gains.&nbsp;&nbsp;\r\n To put it in more realistic terms however. unless one of the devs owns an iphone and rly rly wants this feature, it's just not going to happen.<br>\r\n<br>\r\nThat said. If you don't mind this working over your own PC, then get an RDP client (terminal server) for the iphone/android (there's several) and control your desktop from your iphone. Screen size will be a bit of an issue but it does work.</p>\r\n",
    "PostedDate": "2011-02-10T03:10:31.663-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "565514",
    "ThreadId": "208596",
    "Html": "<p>Now that Nokia and Microsoft have allied, here's hoping to see some kind of Silverlight compatibility on phones --&gt; Rawr.Mobile :)</p>",
    "PostedDate": "2011-02-13T12:00:10.67-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "565525",
    "ThreadId": "208596",
    "Html": "<p>So, to recap:</p>\n<ol>\n<li>No. </li>\n<li>Phone's don't have the processing power to handle Rawr, and won't until at least 2012 when dual and quad core phones come out at decent speeds and larger memory caches. </li>\n<li>Apple's restrictions on how apps can be coded eliminate Rawr's C# back end off the bat, not to mention the Silverlight aspect. You would have to jailbreak the iPhone/iPad just to install it (if we had an iPhone/iPad version). </li>\n<li>A cloud setup where the phone serves as just a UI function talking to a Server that does the processing would be expensive, difficult to set up, and not fun to maintain. </li>\n</ol>",
    "PostedDate": "2011-02-13T12:15:35.033-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]