[
  {
    "Id": "430884",
    "ThreadId": "209313",
    "Html": "<p>Are there any issues about using VS2010 to update the code? I've got a new machine and would rather install a fresh VS2010 since it was released on Monday than install an old VS2008 and have to upgrade later.</p>",
    "PostedDate": "2010-04-14T05:58:26.2-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "430957",
    "ThreadId": "209313",
    "Html": "<p>VS2010 works for me, if you make sure you open the Rawr 2010.sln.</p>",
    "PostedDate": "2010-04-14T07:57:31.11-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "430964",
    "ThreadId": "209313",
    "Html": "<p>Yes I noted that one. There doesn't seem to be a similar Rawr3.2010.sln file though? I was therefore reluctant to do any changes in VS2010 in case it screwed something up. I'm guessing that a simple commit of Rawr3.2010.sln which is created by opening Rawr3.sln in VS2010 would be ok. However I'd far rather hold off and let one of the principal project developers do that than have me commit anything, that might possibly break things for others.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-04-14T08:04:26.19-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "430983",
    "ThreadId": "209313",
    "Html": "<p>The Rawr.2010.sln file doesn't open in MonoDevelop, so is there anything I need to know about it? Is the 2010 version the new standard? Is there a difference between opening the regular and the 2010 version?</p>",
    "PostedDate": "2010-04-14T08:36:51.17-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "430988",
    "ThreadId": "209313",
    "Html": "<p>The nearest and simplest example of answering your question is to do an SAT style comparison :)</p>\r\n<p>Opening a VS 2008 sln in VS 2010 is like opening a 2.3.13 Warlock file in 2.3.14.</p>\r\n<p>There were fundamental changes on the back end.</p>\r\n<p>I'm sure at some point we'll all be migrating to VS 2010, but I'd rather wait until 2010 has been out for a little while so I don't get hit with system updates constantly while they fix their initial release bugset.</p>",
    "PostedDate": "2010-04-14T08:53:57.277-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "430992",
    "ThreadId": "209313",
    "Html": "<p>Looks like I have to dig out the MSDN license and install another IDE. :P</p>\r\n<p>On one machine I have 4 different Visual Studios&nbsp; BAH.&nbsp; Just me bitching...</p>",
    "PostedDate": "2010-04-14T08:58:13.59-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "431007",
    "ThreadId": "209313",
    "Html": "<p>You can download Visual Studio 2010 Professional Release version trial at <a href=\"http://www.microsoft.com/downloads/details.aspx?FamilyID=26bae65f-b0df-4081-ae6e-1d828993d4d0&displaylang=en\">http://www.microsoft.com/downloads/details.aspx?FamilyID=26bae65f-b0df-4081-ae6e-1d828993d4d0&amp;displaylang=en</a> its a small file that then installs from the web all the components you select. The Ultimate Edition trial is at <a href=\"http://www.microsoft.com/downloads/details.aspx?familyid=E2A1A098-995E-4468-816D-7FDBE0A64F38&displaylang=en\">http://www.microsoft.com/downloads/details.aspx?familyid=E2A1A098-995E-4468-816D-7FDBE0A64F38&amp;displaylang=en</a> it sits quite happily installed alongside any previous version.</p>",
    "PostedDate": "2010-04-14T09:20:59.337-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "431028",
    "ThreadId": "209313",
    "Html": "<p>Gotcha beat, Shazear. &nbsp;5 here. &nbsp;I keep '98 around for VB6 crap, 2003 for 1.1 apps they don't want to upgrade, 2005 for SSRS stuff that can't be designed in 2008, 2008 for current development, and 2010 for playing around with, future migration, some of my personal stuff, and now Rawr. ;)</p>",
    "PostedDate": "2010-04-14T10:13:43.893-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "431036",
    "ThreadId": "209313",
    "Html": "<p>What I mean by &quot;what's the difference&quot; is do I still get an up-to-date and functional version of Rawr if I use the non-2010 sln file, or is the code different like the Rawr3 version is?</p>\r\n<p>I'm fully aware the sln file format is different, otherwise MonoDevelop would still be able to open it. :P :)</p>",
    "PostedDate": "2010-04-14T10:30:39.037-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "431055",
    "ThreadId": "209313",
    "Html": "<p>For the moment, we're maintaining both solution files, to contain the same projects and code. Build process may be different, but should produce the same program, apart from performance (compiler enhancements, etc).</p>\r\n<p>At some point in the not-terribly-distant future we'll be switching to 2010 only.</p>",
    "PostedDate": "2010-04-14T10:55:48.857-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "431075",
    "ThreadId": "209313",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>roncli wrote:</strong><br>\r\n<p>Gotcha beat, Shazear. &nbsp;5 here. &nbsp;I keep '98 around for VB6 crap, 2003 for 1.1 apps they don't want to upgrade, 2005 for SSRS stuff that can't be designed in 2008, 2008 for current development, and 2010 for playing around with, future migration, some of my personal stuff, and now Rawr. ;)</p>\r\n</blockquote>\r\n<p>Yup... I was lucky enough to be able to drop VC7, but still have 6,8,9 and now 10.</p>",
    "PostedDate": "2010-04-14T11:30:45.057-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "431359",
    "ThreadId": "209313",
    "Html": "<p>I'd prefer to keep 2008 support available for as long as possible.&nbsp; I don't mind keeping the solution operational.&nbsp; But if you're starting to use features that are 2010 exclusive, that may mean I'll be out of the loop for anything on Rawr until I can get 2010 going (which is unlikely to be happening this year).</p>",
    "PostedDate": "2010-04-15T02:58:48.757-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "431363",
    "ThreadId": "209313",
    "Html": "<p>You can simply install the free version that the majority of Rawr coders use. ie: Visual Studio Express 2010. No-one will be prevented from contributing if we move the codebase over to a 2010 development platform as there is always the Express version that anyone can use.</p>\r\n<p>&nbsp;</p>\r\n<p>VS Express 2010 is available for download and install now at http://www.microsoft.com/exPress/ the full packages have a new website too at http://www.microsoft.com/visualstudio/en-gb/download</p>",
    "PostedDate": "2010-04-15T03:17:18.187-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "431389",
    "ThreadId": "209313",
    "Html": "<p>Just because it is free, doesn't mean it is automatically available for everyone to use.</p>",
    "PostedDate": "2010-04-15T04:59:13.763-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "431568",
    "ThreadId": "209313",
    "Html": "<p>For those who are already using 2010 - Anything I should look out for?&nbsp; Any &quot;gotchas&quot; from moving from 2008?</p>",
    "PostedDate": "2010-04-15T10:36:02.257-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "431893",
    "ThreadId": "209313",
    "Html": "<p>In a rather convoluted way, I've finally managed to get SVN working from the PC at work (not easy since it can only run certified software and internet access is restricted).&nbsp; It's slow, but it works.&nbsp; This at least means I can get some rawr coding done at work as well when I'm on standby.&nbsp; Same here, VS2008 only for the time being (and for some time to come), so remaining to have compilation under VS2008 going would be my preference.</p>",
    "PostedDate": "2010-04-16T05:16:43.12-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "432052",
    "ThreadId": "209313",
    "Html": "Opened the 2010 project for the first time today, everything seems to be in order.\r\n\r\nExcept right after I refreshed my source tree, the CodePlex TFS server went down, and has been for about 15 minutes now. &gt;_&lt;\r\n\r\nJust my luck, I get some time to be a code monkey, and the server dies, haha.  Kind of like raiding on Korialstrasz sometimes.  &quot;Okay, let's pull this first group of trash.  Um, why is everyone running in place?  Hey, did you just get disconnected?&quot;",
    "PostedDate": "2010-04-16T12:59:42.81-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "432091",
    "ThreadId": "209313",
    "Html": "<p>Noob question: (new to turtoiseSVN)</p>\r\n<p>If you select a specific file. How do you get the history of checkins (who checked in on what date) with the ability to compare versions of that file.&nbsp;In other words, the equivalent of the History in TFS.</p>",
    "PostedDate": "2010-04-16T14:33:44.907-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "432097",
    "ThreadId": "209313",
    "Html": "<p>Right-Click -&gt; TSVN -&gt; Show Log</p>",
    "PostedDate": "2010-04-16T14:47:45.917-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]