[
  {
    "Id": "436279",
    "ThreadId": "210791",
    "Html": "<p>Is there a way to code a custom filter that it will only show items that have (or do not have) a certain Stat?</p>\r\n<p>For example, for my Tree, I'd (personally) like to be able to filter out any items that show up as upgrades if they contain any Critical Strike Rating, or if they don't have any Haste Rating, when I'm looking at PvE upgrades I might see in my raids.</p>\r\n<p>&nbsp;</p>\r\n<p>Thanks!</p>",
    "PostedDate": "2010-04-27T20:23:57.38-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "436285",
    "ThreadId": "210791",
    "Html": "<p>A) No.</p>\r\n<p>B) Can you explain why you would want that, and perhaps we can help you solve the actual problem you're trying to solve?</p>",
    "PostedDate": "2010-04-27T20:43:38.467-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "436361",
    "ThreadId": "210791",
    "Html": "<p>The actual filtering part is technically easy enough to do.<br>Slightly harder/more work is creating an interface where you would be able to pick which of the several hundred stats you want or don't want.<br><br>Even if this were in place, it likely wouldn't work the way you intend and work against you.</p>\r\n<p>If you only want to see items that have crit and don't want to see items that have haste. you could very well be filtering out so much that no items are left or that only really poor items are left. They might have the stats you want, but the higher tier items can stil be better overall.</p>\r\n<p>You seem to be very interested in crit.&nbsp; But a piece without crit but a ton of other &quot;secondary&quot; stats might end up being better overall.</p>\r\n<p>&nbsp;</p>\r\n<p>If you have a honest reason for thinking Rawr.Tree is overvaluing haste and undervalueing crit then a custom filtering may seem like a good idea, but the real problem in this case is figuring why this inadequate valuing is happening and having the model changed to be more in line with expectation. Pieces with crit would then get a higher ranking and pieces with haste would be lower. Making gear choices more in line with what you expect.&nbsp; And even with that in place, it STILL can mean the best piece for you has a lot of haste and no crit at all.</p>\r\n<p>&nbsp;</p>\r\n<p>Like Astrylian said in B).</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-04-28T01:01:05.617-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "436619",
    "ThreadId": "210791",
    "Html": "<p>B) Ok, I kinda thought that was the answer but I couldn't find anything that definitely said it one way or the other. Its not a feature that is something I'd consider &quot;essential&quot; or one that most people would use - but I just wanted to know if it was an option and I was just missing it.</p>\r\n<p>Actually, the stats I'm most interested in are spell power and haste (since I'm not haste-capped). But I don't keep the same set of filters on all the time. I change them based on what I'm looking for at that time - drops from a specific raid or what I can buy for a specific emblem type. Basically I export upgrade lists to a spreadsheet so, for example, I can look on my ICC25N tab when gear drops in that raid to see if its on my upgrade list. I haven't actually compared on rawr two pieces that have identical stats, except one piece has haste and the other has crit. My guess is that if I did that I'd find, since I'm not haste-capped, that the piece with haste ranks higher.</p>\r\n<p>Thanks so much for the quick response guys! Rawr is a lifesaver for me; I'm very data oriented, so its fabulous to have a great tool like Rawr to use.</p>",
    "PostedDate": "2010-04-28T09:33:04.41-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]