[
  {
    "Id": "437315",
    "ThreadId": "211080",
    "Html": "<p>Has the development team given any thought to branching the current code base&nbsp;and moving toward maintenence mode for v2? Instead of developing v3 as a 'sub project'</p>\r\n<p>This might make development on v3 more focused on providing functionality and model updates instead of managing build directives for silverlight / v3 all over the place. The latest main development would always be the latest v3 and you could go back and fix issues on 2&nbsp;independent&nbsp;of 3. Why keep the code lying around for 2 when 3 is where you want to be.&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-04-29T13:38:43.033-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "437382",
    "ThreadId": "211080",
    "Html": "<p>It's the same code, actually. Just certain assemblies are build or not build in 2 vs 3.</p>",
    "PostedDate": "2010-04-29T19:22:11.57-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "437392",
    "ThreadId": "211080",
    "Html": "<p>Also Rawr3 is not a replacement for Rawr2. Rawr3.WPF will be at some point, but the performance and polish is not there yet to be competitive with Rawr2.</p>",
    "PostedDate": "2010-04-29T19:56:09.137-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "437679",
    "ThreadId": "211080",
    "Html": "<p>Yay!</p>",
    "PostedDate": "2010-04-30T13:08:25.933-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "438042",
    "ThreadId": "211080",
    "Html": "<p>Is there a current ETA on the next v2 update?&nbsp; Would be nice to calculate rare gems again... :)</p>",
    "PostedDate": "2010-05-02T08:08:45.31-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "438575",
    "ThreadId": "211080",
    "Html": "<p>Thanks luckton, you make my point for me. With a proper branch setup high priority updates like gemming and stuff could be released while other longer tasks (Model Revamp, WPF) could be worked on without breaking the stable code.&nbsp;</p>",
    "PostedDate": "2010-05-03T17:45:29.833-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "438578",
    "ThreadId": "211080",
    "Html": "<p>Actually, he didn't. Those are completely shared, and there's no such thing as breaking the stable code. We're always working on, and releasing, the most recent version. There's no branching going on here.</p>",
    "PostedDate": "2010-05-03T18:05:58.297-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "438606",
    "ThreadId": "211080",
    "Html": "<p>Correct... We don't have a release cycle that supports branching very well.&nbsp; We as individual model developer may have our own local dev branch for new features, but given the cyclical nature of releases, I really prefer this over the &quot;standard&quot; branching methodology.&nbsp; It would undermine the more agile nature of this project.&nbsp; Most of the issues in the tracker are single check-in type bug fixes.&nbsp; There is a branch for Rawr3 specific features, but the architecture is solid enough to support common models, and 2-3 different methods of delivering that model to the user: Rawr2 style, Rawr3 Web, Rawr3.WPF.&nbsp;</p>\r\n<p>I'm glad to work on the project and happy to get the issues fixed as we can.</p>",
    "PostedDate": "2010-05-03T20:17:50.487-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "438636",
    "ThreadId": "211080",
    "Html": "<p>From what I can see you are already in&nbsp;maintenance&nbsp;mode. My original post was coming from another direction, More feature&nbsp;oriented&nbsp;then model fixes. I'm used to a more feature driven cycle that releases often (1-2 weeks).&nbsp;</p>\r\n<p>Blame git for my branch bias. Its odd for me not to see branches,&nbsp;especially&nbsp;in a product at v2 moving to v3.</p>\r\n<p>It seems to be working for the project at the moment. Keep up the good work.</p>\r\n<p>I look forward to&nbsp;committing&nbsp;some patches once I get&nbsp;acquainted&nbsp;with the code.</p>",
    "PostedDate": "2010-05-03T22:49:09.897-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "438652",
    "ThreadId": "211080",
    "Html": "<p>There's just no difference between maintenance mode and new development mode for us. We just release (usually every 2 weeks, this build has just been especially stable and problem-free, so it's lasted a bit longer) whenever we need to.</p>",
    "PostedDate": "2010-05-03T23:44:10.883-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "439285",
    "ThreadId": "211080",
    "Html": "<p>The inside truth is that Astrylian, being a bear, is usually hybernating and never makes any new releases unless one of the model devs dares enter his cave to poke him awake...&nbsp;</p>\r\n<p>Coming out of this alive usually means you'd better have mass quantities of prime quality honey.</p>",
    "PostedDate": "2010-05-05T07:27:39.87-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "439330",
    "ThreadId": "211080",
    "Html": "<p>And when he says prime quality we mean, the kind that will knock you on your ass after two samplings, cuz if it takes three he'll roll over on you with all his bear weight.</p>\r\n<p>It's the Bear necessities man, the simple bear necessities of life.</p>",
    "PostedDate": "2010-05-05T08:58:33.897-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "440473",
    "ThreadId": "211080",
    "Html": "<p>A query then...how can a lowly non-programmer like myself apply these check-ins and fixes I see posted in the Source Code section instead of having to wait for a release?&nbsp;</p>",
    "PostedDate": "2010-05-07T13:06:18.59-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "440475",
    "ThreadId": "211080",
    "Html": "<p>Only by installing Visual Studio and building it yourself. If you're a 'lowly non-programmer', you can't really.</p>",
    "PostedDate": "2010-05-07T13:07:53.357-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "440517",
    "ThreadId": "211080",
    "Html": "<p>/cast [target=<a id=\"ctl00_ctl00_MasterContent_Content_PostRepeater_ctl20_UserNameLink\" href=\"http://www.codeplex.com/site/users/view/OReubens\">OReubens</a>] Tricks of the Trade</p>\r\n<p>/poke [target=Astrylian]</p>\r\n<p>Luckton, actually I feel for you, there are a few bugs that I posted about that have been fixed, just waiting for the next release.&nbsp; But I DO understand that too-frequent releases sucks for users also (especially those that instist on doing full Armory/Wowhead item updates each time they get a new release.</p>",
    "PostedDate": "2010-05-07T16:04:59.57-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "440619",
    "ThreadId": "211080",
    "Html": "<p>/cast Divine Shield<br>/cast Hearthstone</p>\r\n<p>/y RAN OUT OF HONEY!!!&nbsp; BAILING OUT! RUN FOR YOUR LIVES!</p>",
    "PostedDate": "2010-05-08T06:10:02.933-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]