[
  {
    "Id": "440135",
    "ThreadId": "211866",
    "Html": "<p>I am an arcane mage.&nbsp; 57/3/11.&nbsp; I can understand the gear dps efficiency stuff mostly.&nbsp; Can you advise me on what the best cooldown rotation is.&nbsp; I have at my disposal arcane power, presence of mind, speed potion, maghias misguided quill, icy veins, and mirror image.&nbsp; I am mostly interested in icc boss raid kills.&nbsp; I think I understand that during lust, its best to cast all this.&nbsp; I think its best to blow cooldowns at the start of a fight.&nbsp; Is there a specific order?&nbsp; After I blow the cds at first, should i do them again as the cds bear, planning for all of them to be available for the lust.&nbsp; Is there a specific order.&nbsp; Should it be done by cooldown time?&nbsp; should&nbsp; I wait to blow them all during specific periods, such as lust.&nbsp; TY.&nbsp; Vickos</p>",
    "PostedDate": "2010-05-06T18:19:37.273-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "440137",
    "ThreadId": "211866",
    "Html": "<p>By the above, I mean that i used rawr with the basic raid assumptions and maximimized my gear for highest dps.&nbsp; It is of interest that if i enter improved fairie fire, it changes my gear quite a bit, altho i cannot be sure that this will always be present on my targets unless it is a solitary boss.&nbsp; I dont know if i should assume this or the opposite and adjust my spell hit accordingly.&nbsp; Any comments?&nbsp; What I am currently doing is blowing all my cds in order of cooldown duration at the start of a 5-6 min fight, doing them again at about 3min, and then whenthe lust occurs.&nbsp; I could also do each one as it bears depending on the cooldown, resulting in my doing each individually.&nbsp; Any comments?</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-05-06T18:39:50.493-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "440158",
    "ThreadId": "211866",
    "Html": "<p>Rawr includes the optimal cooldown usage in its result. Look at the Solution section of the stats, and the Sequence Reconstruction chart.</p>\r\n<p>Of course spell hit buffs drastically change the optimal gearing. The +3% spell hit buff should always be up on anything of significance that you're DPSing, if you have either a Moonkin or an SPriest in your raid. If you have one of those consistently, you should gear with the assumption that they're there. If you only occasionally have one of those, you should build two sets of gear, one for if you have them, one for if you don't (typically only differing by one or two pieces, trading crit/haste/spirit for hit.)</p>",
    "PostedDate": "2010-05-06T19:37:33.633-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "440352",
    "ThreadId": "211866",
    "Html": "<p>TY.&nbsp; I am not so interested in spell rotation.&nbsp; I am more interested inoptimal use of &quot;specialty cooldowns&quot;, such as ivy veins, presence of mind, arcane power, mirror image.&nbsp; Can you give me a general guidelines on how they are best used?&nbsp; I will look in the sequence reconstruction chart, but will i see these cooldowns specifically?&nbsp; TY Vickos</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-05-07T07:32:22.14-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "440420",
    "ThreadId": "211866",
    "Html": "<p>Err... That's exactly what I said. Optimal cooldown usage is included in the Solution section of results, and the Sequence Reconstruction chart.</p>",
    "PostedDate": "2010-05-07T10:35:48.71-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]