[
  {
    "Id": "440669",
    "ThreadId": "212024",
    "Html": "<p>As we all know you can have a extream high gear score and still your DPS/Healing/Tanking&nbsp; will suck if you have miss mached gear</p>\r\n<p>Would it posible to have a Rawr score from your gear and have that as a gear score</p>\r\n<p>I know it would lot of work but it would also make picking people for raids a lot easier as GS tells me noting about wrongly gear and wrong gemed gear.</p>\r\n<p>Ofc it tells us noting about the gaming skill people have but at least it tells us the true potentiality of players</p>\r\n<p>As whit the new web Rawr at least people cant cheat by moding Rawr</p>\r\n<p>Offspec and PvP spec is ofc a little more problematic as people have to have that gear logged in to the armory but that should be doweball also</p>\r\n<p>&nbsp;</p>\r\n<p>My to cents, and tnx for this great tool</p>",
    "PostedDate": "2010-05-08T11:32:04.83-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "440673",
    "ThreadId": "212024",
    "Html": "<p>...wut?</p>\r\n<p>&nbsp;</p>\r\n<p>You can use Rawr to tell people how good your character is by simply telling people how good your character is. DPS, HPS, Survivability, Mitigation, etc. Anything beyond that is just being retarded.</p>",
    "PostedDate": "2010-05-08T11:39:55.813-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "440675",
    "ThreadId": "212024",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>Astrylian wrote:</strong></blockquote>\r\n<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\">DPS, HPS, Survivability, Mitigation, etc. Anything beyond that is just being retarded.</blockquote>\r\n<p>Yeah anything beyond&nbsp; is retarded, but whit Rawr plug-in like GearScore at least people cant lie, as if there are no lair's in wow, people cheat and if you can fix this by a &quot;simple&quot; plug-in all the better, you cant cheat Rawr</p>\r\n<p>I am just sick of people using GS to look if people are good ore not, because gearscore tells me noting</p>",
    "PostedDate": "2010-05-08T11:49:02.337-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "440681",
    "ThreadId": "212024",
    "Html": "<p>You assume that we have some magic way to make Rawr calcs work inside the wow client...</p>",
    "PostedDate": "2010-05-08T12:22:14.293-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "440706",
    "ThreadId": "212024",
    "Html": "<p>On top of that, even if you were able to do RAWR calculations in-game (which maybe possible if you have the patience to make such mod) the calculations would be a major memory hog. Other things that would hinder such mod is the fact that as far as I know of, the in-game client is unable to tell another user which glyphs they are using.</p>\r\n<p>Seriously, a RAWR-type of mod would be 10x better than Gearscore, just at this time, it would be too complicated to implement and the sheer amount of calculations associated with it would use up a ton of resources.</p>",
    "PostedDate": "2010-05-08T14:32:09.257-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "440713",
    "ThreadId": "212024",
    "Html": "<p>The latest version of Gear Score has a windowed portion that can show you how well their gear stacks up in their current spec. It even has negative scores/percentages for PvP gear so ppl can't inflate scores that way. I am not well versed in all the ins and outs of the GS program but it seems to me that this might be what you are looking for. While in-game try typing &quot;/gs&quot; while a player is targeted, this pulls up and secondary window showing spec related numbers. Try it out and see if this is similar to what you are looking for or if it helps you in any way.</p>",
    "PostedDate": "2010-05-08T16:13:43.977-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "440714",
    "ThreadId": "212024",
    "Html": "<p>What i was thinking of, is that score from http://elitistjerks.com/rawr.php kept in a online database.</p>\r\n<p>A simple mod could then read from there your Rawr gearscore from that database, and display in a simeler way as gearscore dose now, how well your potential dps/healing/tanking would be.</p>\r\n<p>Like you ware saying, a ingame mod would maybe be to mouths of a mem hog, but in this way it would be just a small mod.</p>\r\n<p>How it would work, we have a DKP slaker in-game mod and a DKP out-game mod, the out game mod that updates from the website database, and write the info in to a file in the AddOns folder, the ingame mod reads from there the file.</p>\r\n<p>Its pretty similer to this mod http://www.dkpsystem.com/dynpage.php?id=17, the mod we use is written by a guild member but very similer.</p>\r\n<p>&nbsp;</p>\r\n<p>Downside is ofcorse that you have to manualy update your Rawr GS, everytime you get new gear, but at lvl 80 and looking for people for full ICC run, ware that counts the most, that would be not that often.</p>\r\n<p>But I am pretty sure that the serious guilds would adapt to this pretty quick specially for recruitment and for 10man if they need pugs, and then it automatically will move to other players.</p>\r\n<p>And a plus point for Rawr dev team would be potential income from that website ads, because people have to come by to update there Rawr gearscore, and maybe optional a automatic mod that people have to pay for, a other plus would be more people would get to know Rawr.</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-05-08T16:30:59.33-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "440715",
    "ThreadId": "212024",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>brituck wrote:</strong><br>\r\n<p>The latest version of Gear Score has a windowed portion that can show you how well their gear stacks up in their current spec. It even has negative scores/percentages for PvP gear so ppl can't inflate scores that way. I am not well versed in all the ins and outs of the GS program but it seems to me that this might be what you are looking for. While in-game try typing &quot;/gs&quot; while a player is targeted, this pulls up and secondary window showing spec related numbers. Try it out and see if this is similar to what you are looking for or if it helps you in any way.</p>\r\n</blockquote>\r\n<p>Even do that helps a bid it its still dose not take in to account wrong enchants and gems, that would count for at least 20~30% lower potential.</p>\r\n<p>A real Rawr calculation is the only type of score i would have fate in, anything else is just to general to be trustworthy.</p>",
    "PostedDate": "2010-05-08T16:39:15.627-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "440724",
    "ThreadId": "212024",
    "Html": "<p>Just finished getting frost emblem helm for my warrior so i'll use him as an example. (yeah I'm not an end-game raider and only have average iLvl of 230ish). When I first equiped helm my GS went to 5036 but my SpecScore was close to 5800 and my fury bar was only 95% since I had no gems or enchants. After following Rawr recommendations, my SpecScore went to 6017 although my GearScore stayed at 5036. Also while both my Arms SpecScore and my Fury SpecScore showed 6017, Im at 99% on Fury since that is my spec and only 83% on Arms since I dual wield. (Turambar on Akama US)</p>\r\n<p>Bottom line is it seems to me that GS already has most if not all of what you are looking for without someone having to write a new addon from scratch.</p>",
    "PostedDate": "2010-05-08T18:25:24.43-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "440749",
    "ThreadId": "212024",
    "Html": "<p>Still GS ore SpecScore will not take in to account that you maybe heavy crit caped and that you for exampled need 6 ore 7 haste gems, for your full potential</p>\r\n<p>People here seems to think that writing a mod like that is extremely difficult, yeah for me it would but, there are so many skilled programmers out there just look at all the mods that have bin written, its not that hard for them, 2 years ago, ago the DKP slakker mod my guild mate wrote the 2 mod in 2~3 weeks, and i am pretty sure that if Rarw would &quot;just&quot; keep a database online of people's Rawr sim score, the people of GS mod would integrate it in there GS mod.</p>",
    "PostedDate": "2010-05-08T22:34:42.787-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "440750",
    "ThreadId": "212024",
    "Html": "<p>Please stop drooling all over your keyboard while on our site. Thanks.</p>\r\n<p>&nbsp;</p>\r\n<p>Gearscore, in any form, is utterly retarded. Trying to build Rawr calculations or results into WoW in-game somehow, is utterly retarded (the the <em>possible</em>&nbsp;exception of your own results of an upgrade list calculation).</p>",
    "PostedDate": "2010-05-08T22:49:11.58-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "440762",
    "ThreadId": "212024",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>Astrylian wrote:</strong><br>\r\n<p>Please stop drooling all over your keyboard while on our site. Thanks.</p>\r\n<p>&nbsp;</p>\r\n<p>Gearscore, in any form, is utterly retarded. Trying to build Rawr calculations or results into WoW in-game somehow, is utterly retarded (the the <em>possible</em>&nbsp;exception of your own results of an upgrade list calculation).</p>\r\n</blockquote>\r\n<p>Ok i will shut up, but i saw real potential in the possibility of having  Rawr score in a online database as would have so many other potential implementations imho</p>\r\n<ul>\r\n<li>A in-game mod (what you apparently don't like :-)</li>\r\n<li>Over time a mouths better alternative for the armory (maybe by someone else but using info from a Rarw database)</li>\r\n<li>Easier to post scores in Elitist Jerks discussion forum</li>\r\n<li>And yeah the other top one would be a in-game upgrade list (yeah that would be a real help whit deciding quickly&nbsp; the potential of drops during raids :-)</li>\r\n</ul>\r\n<p>The potential of a database like that whit real numbers would endless, and would widely use improve the game play of a lot of players (I know Rawr improved my game play immensely from average to one of the top DPSers in my guild, tnx for all the work it is appreciated)</p>\r\n<p>So i will shut up now, and stop polluting your forum now.</p>",
    "PostedDate": "2010-05-09T00:15:32.317-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "440763",
    "ThreadId": "212024",
    "Html": "<p>You already can spread your character in Rawr to other people:&nbsp;http://elitistjerks.com/rawr.php#Astrylian@US-Suramar, for example. We're working on letting you include whole character files that way, not just Armory lookups.</p>",
    "PostedDate": "2010-05-09T00:18:46.593-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "441063",
    "ThreadId": "212024",
    "Html": "<p>Lets assume for a moment that a mod did exist where your rawr gearing 'score' is available in game.</p>\r\n<p>Each model has a different means of rating gear.&nbsp;</p>\r\n<p>For most DPS&nbsp;specs this is 'DPS'.&nbsp; Some also have survival as part of their score, usually the survival part can be individually rated. How do you unify the different models into a single DPS scoring ?</p>\r\n<p>Tanks have an entirely different ranking system.&nbsp; And even there.&nbsp; Would you take tank A over tank B they have the same total score, but tank A has more mitigation while tank B has more survival.</p>\r\n<p>And then healers.&nbsp; They use a different rranking yet again.</p>\r\n<p>&nbsp;</p>\r\n<p>And of course.&nbsp; Even if you COULD uniform the rawr scores... it would still be just as much fail and retarded as GearScore (although maybe slightly less), since this scoring doesn't in any form or way tell you if the person wearing that gear is managin to use his gear efficiently.</p>\r\n<p>I have seen players in &quot;crap&quot; gear outperform players that had considerably better gear on numerous occasions.&nbsp; GS works under the assumption that everyone is equally skilled at playing their class, and that all the items they're wearing are appropriate for them.&nbsp; At best it can give you a rough indication that some people are obviously undergeared.&nbsp; But just because someone is geared, doesn't mean they're good.&nbsp; 264 epics are 'easy' to get, it just takes a lot of dailies. You can buy some 264 BoE drops, and 264 crafted items.&nbsp; Is someone decked in 264 BOE epics and emblem gear guaranteed to be good at playing that character&nbsp;?</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-05-10T06:41:38.92-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "441229",
    "ThreadId": "212024",
    "Html": "Not to mention.. I can put on any gear I want in Rawr. Are you expecting Rawr to constantly keep a tab on your current gear for this purpose? People will have to &quot;armory&quot; you anyways to verify your Rawr gear matches your actual gear. I suppose then we need another mod to do that for us, too. With all of these mods designed to circumvent having actual knowledge of the classes, stats, and gear, Blizzard may as well take the guessing away from us and just match us like in 5-mans. We all know how well THAT goes. :D ",
    "PostedDate": "2010-05-10T14:19:02.237-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "441360",
    "ThreadId": "212024",
    "Html": "<p>When organising pugs, I personally use two awesome mods called 'brain' and 'notebook'.</p>\r\n<p>Notebook is a&nbsp;mod where I can write down notes about how a player performed in a raid, if they emo'd out, or otherwise behaved (im)properly. Getting noticed positively gets you bonus points, geting noticed in a bad way gets you negative points, if you&nbsp; manage to just not get noticed at all, that's usually a good thing too.</p>\r\n<p>Brain is the mod that searches the info in Notebook and determines if I even wanna invite that person to the raid to begin with. For people not in the notebook at all, a quick armory check and a talk with the person that is vouching for the potential invitee is enough. Vouching for someone that turns out to be an annoyance gets you bad points as well btw.&nbsp; That feeds back into Notebook.&nbsp;</p>\r\n<p>Works miracles !</p>",
    "PostedDate": "2010-05-11T01:22:45.807-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "443141",
    "ThreadId": "212024",
    "Html": "<p>I could see this as potentially working, if one were driven enough.&nbsp; However, it doesn't work into the Rawr philosophy, so we're really not inclined to spend the development time on such a sideproject.</p>",
    "PostedDate": "2010-05-14T18:34:55.7-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]