[
  {
    "Id": "70878",
    "ThreadId": "21285",
    "Html": "\r\nHi Astrylian !<br /><br />First, thank you very much for developing Rawr ... both Raw.Cat and Rawr.Bear are very usefull and amazing !<br />I've got a druid (Irhondril) in EU-FR Server (Kirin Tor) and love this classe of course ;) But sorry for my bad english, I hope that you will understand something ^^ <br />Unfortunately I can't post messages in the following thread because of my character server, so i will write here<br />http://forums.worldofwarcraft.com/thread.html?topicId=2968113034&amp;sid=1&amp;pageNo=6<br /><br />So, i'd like one or two new features in your application : <br /><br /><h2>\r\n1) Tooltips\r\n</h2>In the Buffs panel, there is a list of usefull buffs for cat or bear, dependant of the part of application. <br />Is it possible to add a little tootlip for each buff in order to describe this one ? <br />i.e : <br /><ul><li>Grace of Air Totem : increases the agility of party members within 20 yards by 77</li></ul>or simplier : <br /><ul><li>Grace of Air Totem : +77 agility</li></ul><br />And the same thing for improved buff, of course.<br /><br /><h2>\r\n2) Translation\r\n</h2>Fortunately i can understand english language ^^<br />But it's not the case for everybody ... and more and more people know your awesome application but not necessarily english people :p<br />I'd like to know if a possible translation is in your timeline of your project ? <br />For example the automatically imported items could be imported by EU armory instead of US armory.<br />And of course this will be manually for the application (titles, desciptions, menus...). Maybe with a translation file for each language ?<br /><br />If you want a french translator, I think I could if you want, but I don't know if there are already planned modules for this inside your application :)<br /><br />Thank you very very very much Astrylian !!<br /><br />Best regards<br />Irhondril<br />",
    "PostedDate": "2008-01-30T12:07:16.133-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "72685",
    "ThreadId": "21285",
    "Html": "\r\nHey, sorry for the slow response to this. I hope to have buff tooltips in b11.<br /><br />For Translation... I'd like to do it at some point. There's alot of work needed to make Rawr support multiple or alternate languages, so it probably won't be soon. But I would like to. If someone wants to help with the coding to support this, that'd be quite welcome.<br />",
    "PostedDate": "2008-02-08T13:07:39.243-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "72866",
    "ThreadId": "21285",
    "Html": "\r\nOkay thank you Astrylian for you answers ! :)<br />",
    "PostedDate": "2008-02-10T04:16:32.47-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]