[
  {
    "Id": "443869",
    "ThreadId": "212920",
    "Html": "I've downloaded and installed the latest version of Rawr.  When inspecting my character, my equipped gear was listed even my T10 helm.\r\n\r\nWhen I tried to see the changes T10 pants would cause, it was not in the list.  That was both the click-on-item list and for choosing which gear piece from the drop-down.  I found a reference in the past of performing &quot;Tools&quot; &gt; &quot;Update Cache from WoWhead&quot;.  The dialog says that it only updates existing items, in which case the T10 gear would not be added.\r\n\r\nNothing is added.  Updating the cache does nothing to add the Lasherweave set.\r\n\r\nIn the Filter menu, all options are checked.\r\n\r\nI must be wrong.  Please help me see my error.",
    "PostedDate": "2010-05-17T09:30:59.677-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "443923",
    "ThreadId": "212920",
    "Html": "<p>I'm not seeing any T10 mage gear either, except for what I'm currently wearing.</p>",
    "PostedDate": "2010-05-17T11:28:59.853-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "443991",
    "ThreadId": "212920",
    "Html": "<p>The filters as they are have removed T10 drops that also drop in VOA and has moved them to PVP. I am working on new filters and trying to communicate this problem with other members so it does not happen again.&nbsp; Sorry for this confusion.</p>",
    "PostedDate": "2010-05-17T14:23:48.86-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "444051",
    "ThreadId": "212920",
    "Html": "<p>Same for warlock t10, even though the filters are marked for icc25 it does not show upgrades.</p>",
    "PostedDate": "2010-05-17T17:23:37.283-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "444068",
    "ThreadId": "212920",
    "Html": "<p>Is it a filtering issue, or are the items not in the item cache?</p>",
    "PostedDate": "2010-05-17T19:38:23.433-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "444278",
    "ThreadId": "212920",
    "Html": "<p>I found that enabling Emblems of Frost under Special currencies made T10 items appear again.</p>",
    "PostedDate": "2010-05-18T05:29:49.9-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "444473",
    "ThreadId": "212920",
    "Html": "<p><strong>* Click off the Special Currency filter and click it back on so all subfilters are active *</strong></p>\r\n<p>- Special Currency -&gt; Emblem of Frost (<em>all regular&nbsp;Tier 10&nbsp;gear</em>) -&gt; Class Token&nbsp;(<em>All Sanctified Tier 10</em>)</p>\r\n<p>&nbsp;</p>\r\n<p>My apologies.&nbsp; When I updated the filters, I was testing them to make sure they all worked correctly and&nbsp;forgot to re-enable them all when I was done.</p>\r\n<p>On a brighter note, I finally fixed the remaining&nbsp;PvP items.&nbsp; Now I can focus the rest of this week on&nbsp;finishing my&nbsp;accuracy checks.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-05-18T11:13:55.66-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]