[
  {
    "Id": "445039",
    "ThreadId": "213196",
    "Html": "How would I optimize gear for a hybrid build? I choose the 0/60/11 build in the talents tab, do I select the cat or bear model? I am MS heals & OS bear and have been ask to go DPS against Prof P until the 3rd phase when I will tank. I want to maximize my DPS since I will spend most of the fight in cat form while not failing at the important part (tanking).",
    "PostedDate": "2010-05-19T11:08:16.513-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "445122",
    "ThreadId": "213196",
    "Html": "<p>In the general sense, what you're talking about is accomplished using the Batch Tools. See the help on them for details. However, to answer your specific situation, the correct course of action is to optimize for bear, and ignore cat optimization. Just use a hybrid spec (ie Shredding Attacks and King of the Jungle, along with the bear-only talents).</p>",
    "PostedDate": "2010-05-19T13:51:41.87-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "445837",
    "ThreadId": "213196",
    "Html": "Thanks for the help, I will check out the batch tools documentation. On a related note, is there any good discussion on hybrid specs? I can see both (bear/cat) being useful at times. Would using shifting in every red and blue slot be a bad idea? Gems in general must make up a small percentage of a toon's stats so getting only 50% out of a cat's gems and more then 50% from bear gems shouldnt be too big of a hit.",
    "PostedDate": "2010-05-21T06:05:21.78-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "445965",
    "ThreadId": "213196",
    "Html": "<p>Stam is generally useless for Cats, but Agi is still useful for Bears. I'd generally gem Agi in Red, Agi/Stam in Blue, for a hybrid gearset. That's assuming you only tank as an offtank sort of thing.</p>",
    "PostedDate": "2010-05-21T11:35:28.59-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]