[
  {
    "Id": "71247",
    "ThreadId": "21380",
    "Html": "\r\nCurrently I'm in SSC/TK working on Vashj currently, and I'm running into the same issue many bears in my position are, when we have 2 priest/shamans on MT duty we have Inspiration/Ancestral Fortitude up the entire fight, and thus I'm over the armor cap (Rawr puts me at 6000).  So, I'm considering removing the 3 talent points in Thick Hide considering why would I need 10% armor when it's just going to waste?<br /><br />My suggestion is an option to take away Thick Hide from calculations.<br /><br />Edit: Btw I'm Marlie on Jaedenar<br /><br />Edit: I forgot to note, I already saw the Issue Tracker for this talent closed, however I would like it reevaluated for this talent specifically, considering the druid MT in Nihilium doesn't use this talent and I'm very close to removing it as well as I move into BT/Hyjal.<br />",
    "PostedDate": "2008-02-01T08:23:42.923-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "72147",
    "ThreadId": "21380",
    "Html": "\r\nJust bumping to see if I can get a reply at getting this reevluated.  I'm sure other ferals at my gear level are running into the same issue.<br />",
    "PostedDate": "2008-02-06T09:56:58.977-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "72205",
    "ThreadId": "21380",
    "Html": "\r\nAdded a new issue for this, will try to take care of it soon.<br />",
    "PostedDate": "2008-02-06T14:32:20.163-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "75991",
    "ThreadId": "21380",
    "Html": "\r\nEven if is interesting to have that option, if you usually are over the armor cap, change a couple items for more stamina/agility instead of armor. That way you get more tanking capabilites. Freeing up 3 talent points will not make you a better bear anyway.<br />",
    "PostedDate": "2008-02-23T15:38:01.177-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]