[
  {
    "Id": "449854",
    "ThreadId": "214536",
    "Html": "<p>&nbsp;</p>\r\n<p>Hello,</p>\r\n<p>First, thanks for the tool and all the work, really appreciate it! :-)</p>\r\n<p>I just had a few rogue related questions and observations I wanted to ask and pass on.</p>\r\n<p>1)&nbsp; Using the spreadsheet on elitistjerks I noticed that they tend to go towards gemming for AP and a little bit for haste (using Bright Cardinal Ruby, etc).&nbsp; Whereas I noticed with rawr almost all the gems seem to be agility related (delicate cardinal ruby) with some crit.&nbsp; Why's that?</p>\r\n<p>2)&nbsp; Heartpierce dagger is rated barely above a heroics dagger (Blood Weeper) for MH in rawr for dps.&nbsp; Yet postings on other sites mention it as being BIS.&nbsp; Is Invigoration not modeled?</p>\r\n<p>3)&nbsp; Shouldn't there be some way in options to differentiate between a mutilate and combat spec?&nbsp; (maybe it's done underneath somewhere magically :-)&nbsp; I've never gone Combat but I understand the gemming requirements are different and of course weapons requirement is.</p>\r\n<p>thanks again!</p>",
    "PostedDate": "2010-06-01T00:23:21.27-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "449859",
    "ThreadId": "214536",
    "Html": "<p>1) No idea, is it related to a specific talent or item or something? If so, open an issue and attach your char file.</p>\r\n<p>2) Invigoration is modeled, please open an issue for this and attach your char file.</p>\r\n<p>3) The differentiation is done by looking at talents, if you switch between combat and mutilate specs you'll see the optimal rotation changes as does the DpE of the affected attacks. If you'd then optimize gear and gemming suggestions could also change.</p>",
    "PostedDate": "2010-06-01T00:35:46.213-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "449929",
    "ThreadId": "214536",
    "Html": "<p>Don't know where I got the idea that it had been, but Invigoration has not been modeled yet.</p>",
    "PostedDate": "2010-06-01T02:44:41.82-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "450488",
    "ThreadId": "214536",
    "Html": "<p>&nbsp;</p>\r\n<p>thanks for the replies!</p>\r\n<p>The spreadsheet simply recommends almost all Bright Cardinal Ruby for every gem slot on just about every piece of gear, except for a few Stark Ametrines (AP/haste).&nbsp; So I don't believe it has anything to do with a specific talent or item.</p>\r\n<p>Forgot to mention that this is the Mutilate_1.3.3 spreadsheet on ElitistJerks at http://elitistjerks.com/attachments/f78/a7906d1265241837-combat_mutilate_spreadsheets_updated_3_3/mutilate_1.3.3.xls</p>",
    "PostedDate": "2010-06-02T02:53:32.973-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "450526",
    "ThreadId": "214536",
    "Html": "<p>Can you create an issue for this and include both your rawr char sheet as your spreadsheet? Then I can compare them and maybe find out what goes wrong.<br>I've modeled Invigoration now, it'll be included in the next release.</p>",
    "PostedDate": "2010-06-02T04:42:37.91-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "450893",
    "ThreadId": "214536",
    "Html": "<p>&nbsp;</p>\r\n<p>created issue # <span id=IssueIdLabel>17884</span></p>",
    "PostedDate": "2010-06-02T16:09:31.483-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "453526",
    "ThreadId": "214536",
    "Html": "<p>It seems that rawr doesn't take 'Custom rotation' section in to account in the options tab. I see no difference when changing poisons, combat point generator or finisher. For instance rawr is always using rupture for combat spec, instead of eviscerate and having eviscerate talented and glyphed for doesn't make a difference either.</p>\r\n<p>One other thing I noticed is that rawr values expertise very low, but in comparison with Aldriana's spreadsheet at Elitistjerks, expertise is the top stat until capped.</p>",
    "PostedDate": "2010-06-09T06:35:31.49-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "453567",
    "ThreadId": "214536",
    "Html": "<p>Changing the custom rotation options only changes your custom rotation DPS on the Stats page. The optimal rotation is just that, optimal, and thus doesn't change with custom rotation options.<br>If you disagree with the optimal rotation please check if the attack damages correspond to what you'd expect and if you can find some specific talent which causes the problem and then create an issue.</p>\r\n<p>If you have an Aldriana spreadsheet and an exact same Rawr char and you see a problem with stat valuation (small differences here are useless to report), attack damage or DPS difference please create an issue attaching both the spreadsheet and the Rawr char. Make sure that they are exactly the same though.</p>",
    "PostedDate": "2010-06-09T07:58:26.51-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]