[
  {
    "Id": "454501",
    "ThreadId": "215750",
    "Html": "<p>Ok I am having trouble using the TankDK setup in RAWR.</p>\r\n<p>&nbsp;</p>\r\n<p>I am a mage in game and have never tried to use it for tanking however one of our main tanks was having some issues with surviving strings of hits in ICC Heroic and he does not understand RAWR so I said I would have a look and see if I can work some stuff out.</p>\r\n<p>Now the issue I am having is I do not understand the three primary stats RAWR seems to be taking into account.</p>\r\n<p>Survival Points</p>\r\n<p>Mitigation Points; and</p>\r\n<p>Threat Points.</p>\r\n<p>&nbsp;</p>\r\n<p>Holding the mouse over them gives explanations however they don't make sense. It says that Survival Points is the largest RAW damage you can take before dying so ....... however the survival points are sitting on 179000 atm. The tank can take a 179k hit and live o_O. Then mitigation says its the amounf of damage mitigated but its also ridiculously high. So then I though maybe the first minus the second (size hit minus mitigation) may equal his maximum hit - which seemed ok until I worked it out and it would still be some high number like 100k which still doesn't make sense.</p>\r\n<p>&nbsp;</p>\r\n<p>The additional problem I have is when trying to optimise I would like to adjust some of the values (so optimize for Survivability but limit threat for example). Except, his threat to start with says 26000 points, so when I put in the optimizer &lt;= 25000 to try to limit threat it spat out an optimized score of 27000 o_O. So after a LOT of searching in google forums and these discussion boards I found a post that said that the adjuster was not value but % and gave the example if I wanted to say double the threat I would use the multiplier 2.0 (as in twice the current value). Trying this and putting in 0.85 as I wanted less than the current value - optimized and ........ got 27000 AGAIN.</p>\r\n<p>&nbsp;</p>\r\n<p>It has been really frustrating so if there is anyone here who can explain the strange numbers for these stats and how to use the optimizer to adjust them I would be very grateful.</p>",
    "PostedDate": "2010-06-11T10:06:54.213-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "454525",
    "ThreadId": "215750",
    "Html": "<p>Survival Points is exactly what you said, it's the largest raw damage you can take before dying. Being able to survive a raw 179k hit sounds about right. Are you perhaps forgetting the 'raw' part? Tanks have all sorts of things that reduce the damage they take, like armor, frost presence, talents, etc. Mitigation is also exactly as it's described. It's a value that increases inversely with how much damage you take, on average. Higher Mitigation = Less average damage taken. It's important to note that that really is <strong>average</strong>&nbsp;damage taken, not necessarily reliably. So things like avoidance increase your mitigation.</p>\r\n<p>Threat Points relate to how much threat you can do. I don't know who or what said anything about optimizing it being a multiplier or something, that's just dumb, and not at all how it works. It works exactly how you'd expect. More potential TPS = more Threat Points, based on the scalar you define on the options tab. Optimizing Threat Points works exactly as you would expect. It's really just optimizing Threat Points. When you told the optimizer to require Threat Points &lt;= 25000, and it returned 27000, that's almost certainly because it couldn't find a way to drop that low on Threat Points. Regardless, trying to set a requirement to 'lower' your performance is never something you want to do. It sounds like you're actually trying to tell it that you don't care about Threat so much. If that's what you're trying to say, you should actually tell it that; that's on the Options tab. Just lower the value of Threat. (And as a DK, you probably should lower it a whole lot; DKs have a retardedly easy time with single target aggro right now, since the IT threat buff. You can completely ignore threat when gearing, and just spam lots of IT, and hold aggro against DPS who are multiple tiers of gear above you.)</p>",
    "PostedDate": "2010-06-11T10:45:33.157-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]