[
  {
    "Id": "457800",
    "ThreadId": "216680",
    "Html": "<p>Hey Devs, sorry for the short notice, forgot to post this yesterday.</p>\r\n<p>I'll be making a build tonight, probably around 8pm PST or so. Let me know if you need me to delay that a bit to get something in.</p>",
    "PostedDate": "2010-06-20T13:23:40.053-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "457848",
    "ThreadId": "216680",
    "Html": "<p>Sounds fine to me, nothing major for Rogue coming in.</p>",
    "PostedDate": "2010-06-20T18:23:08.65-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "457849",
    "ThreadId": "216680",
    "Html": "<p>Had to post this while celebrating Father's Day. I'll upload what I can&nbsp; on the database (I do have all of the new Midsummer boss drops in). I should be finish by 11 EST.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-06-20T18:23:54.373-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "457867",
    "ThreadId": "216680",
    "Html": "<p>OK. I have a few database changes to add too, but I'll merge mine into yours. (Fixed the proc data on the damage taken proc trinkets)</p>",
    "PostedDate": "2010-06-20T20:59:04.55-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "457869",
    "ThreadId": "216680",
    "Html": "<p>Ok, I just uploaded my default database as well as the fix to the Last Word proc (which according to RAWR is not that great O_o) Also I was noticing that HealingReceived variable is not well supported for bears. Not sure if it's in the calculations or not.</p>",
    "PostedDate": "2010-06-20T21:11:30.947-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "457922",
    "ThreadId": "216680",
    "Html": "<p>I'll be happy if it includes the right version of TaJ this time. :p</p>\r\n<p>Note that there was an issue with wowhead updates recently.&nbsp; It's fixed now, but it may have&nbsp;some items that got updated while in the broken state.</p>",
    "PostedDate": "2010-06-21T00:50:20.173-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "458081",
    "ThreadId": "216680",
    "Html": "<p>Ok... Got the changes for Fallen Crusader in, and a hopeful fix for the PPM code w/i the tank module.&nbsp; I haven't made the equivalent change to DPSDK yet though.&nbsp; Still need to work that out.&nbsp; Once I figure out the best way to get the right runes to stack while other runes don't stack, I'll be happy camper around that area.&nbsp;</p>",
    "PostedDate": "2010-06-21T08:36:40.837-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "458118",
    "ThreadId": "216680",
    "Html": "<p>Was working on it til 4am last night, and didn't quite finish everything I wanted to, so ran out of time. Releasing it tonight instead.</p>",
    "PostedDate": "2010-06-21T09:47:38.817-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]