[
  {
    "Id": "457711",
    "ThreadId": "216656",
    "Html": "<p>Hi there.</p>\r\n<p>&nbsp;</p>\r\n<p>I had try rawr before, and there was a function to run simulation, select level of target and a lot of parameters, and set the time of the battle.</p>\r\n<p>At the end of that, you could wath on the time, your rotation, and all damage you did for each attack.</p>\r\n<p>&nbsp;</p>\r\n<p>Please, I don't remmermber how to, or where i can run it.</p>\r\n<p>Thanks to write back.</p>\r\n<p>Elud</p>",
    "PostedDate": "2010-06-20T04:48:49.233-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "457761",
    "ThreadId": "216656",
    "Html": "<p>Rawr is not a simulator, and does not run simulations. It's better than that. Most of the settings you mention are typically found on the models' options tabs, so check there. Stats about the damage of abilities and rotation are typically on the Stats tab.</p>",
    "PostedDate": "2010-06-20T09:57:13.07-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "457778",
    "ThreadId": "216656",
    "Html": "<p>Yes of course, but i think that I use it for run simulations about long battle, where you can look for :</p>\r\n<p>0.00 jol 10 510 (crit)</p>\r\n<p>0.00 auto 2300</p>\r\n<p>0.01 DS 8 500 (crit)</p>\r\n<p>0.02 CS 5300</p>\r\n<p>0.03 exo 3200</p>\r\n<p>0.035 auto</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-06-20T11:27:37.697-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "457798",
    "ThreadId": "216656",
    "Html": "<p>No; you can use SimCraft for that sort of thing, but it doesn't really help you make choices about gear/spec/etc. That's what Rawr is for.</p>",
    "PostedDate": "2010-06-20T13:22:26.907-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "457874",
    "ThreadId": "216656",
    "Html": "<p>You can use a combination of the two to evaluate how your gear would perform under different combination. As an example, I recently got the last few items on my feral druid that would have put me at Armor Pen cap. According to RAWR, going full armor pen with 7%ish Avoided attacks would give the best dps increase. However I have been debating on whether hit and expertise were better. So by setting up different gear combination in RAWR with variable avoided attacks, I gave myself a list to work with in SimulationCraft. Needless to say I was actually coming up with a higher dps increase around the 1.75% and 3.5% avoided attacks with a slight drop with the 7%ish avoided attacks. Basically use the two in conjunction. SimulationCraft has the ability to import RAWR files and run them. If both SimulationCraft and RAWR come up with similar results, then I would go with that. This may take a bit longer to do, but really RAWR and SimulationCraft do the same thing in two completely different methods.</p>",
    "PostedDate": "2010-06-20T21:49:53.553-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "458672",
    "ThreadId": "216656",
    "Html": "<p>Rawr isn't necessarily <em>better</em> than a sim, (for example, SimulationCraft).&nbsp; It's just flat-out different.&nbsp;&nbsp;&nbsp; Rawr uses formulae to calculate what your expected performance should be.&nbsp; Simulations emulate your actual play.&nbsp; The former is significantly better for creating gear solutions, while the latter is better for testing said solutions.</p>\r\n<p>So, Rawr has never and will never contain simulations (and the odd instances where sim-like processes have crept into the design, we've been weeding out).&nbsp; I assume you used something like SimulationCraft for the purposes you're talking about.</p>",
    "PostedDate": "2010-06-22T12:47:28.727-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "458675",
    "ThreadId": "216656",
    "Html": "<p>A model (Rawr) is definitely better for gear/enchant/gem/spec/glyph/etc selection. If that's what you're looking for help with, Rawr is what you want. Simulations have other valuable uses (primarily in validating the accuracy of models). I see them more of a developer tool, though the do have some end-user use too.</p>",
    "PostedDate": "2010-06-22T13:03:33.62-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "458685",
    "ThreadId": "216656",
    "Html": "So, I don't think we have enough Model vs. Sim discussions yet.  Discuss.",
    "PostedDate": "2010-06-22T13:29:32.43-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "458688",
    "ThreadId": "216656",
    "Html": "<p>I'll just quote a line from one of my favorite movies:</p>\r\n<p>&quot;I'm on one side, I'm on the other side. I'm on the east bank, I'm on the west bank. It's not that critical.&quot;</p>\r\n<p>Seriously, I tend to use both models. I use RAWR first then SimC later to validate the results.</p>",
    "PostedDate": "2010-06-22T13:41:39.427-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "458702",
    "ThreadId": "216656",
    "Html": "Uh, no. Sorry, but a toll is a toll, and a roll is a roll, and if we don't get no tolls, then we don't eat no rolls. ",
    "PostedDate": "2010-06-22T14:19:43.59-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "458713",
    "ThreadId": "216656",
    "Html": "Edit: deleted paragraphs that turned into a wall of text.\r\n\r\nCouldn't find a link to it in here, but http://code.google.com/p/simulationcraft/wiki/FormulationVsSimulation isn't bad.",
    "PostedDate": "2010-06-22T15:03:02.063-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "458739",
    "ThreadId": "216656",
    "Html": "<p>I don't really want to start another discussion on this, but I just need to add this :)</p>\r\n<p>Besides what was already said I see additional value in modeling in&nbsp;its value for predicting optimal behavior. If you set up a model as a mathematical optimization problem, then you know the result you get is optimal in the scope of the parameters that you're handling. For simulation on the other hand you have to input that behavior (i.e. spell selection logic, cooldown usage). What you'll get is a very accurate value of using that specific behavior, but there is no qualitative assessment of how good that is. You can try a few and see which is better, but you'll never know if there's something else that could perform even better, but you just missed it.</p>\r\n<p>So for me the ideal path is, use mathematical model to predict optimal behavior, validate the model using simulations. Unfortunately the sims I have seen don't allow for fine enough behavior control to utilize things like&nbsp;cooldown stacking or fine tuning of spell cycles as will be needed for Mana Adept for example.</p>",
    "PostedDate": "2010-06-22T17:18:21.197-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]