[
  {
    "Id": "460101",
    "ThreadId": "217385",
    "Html": "<p>Hey all,</p>\r\n<p>&nbsp;As you may or not be aware, Rawr is the largest/most popular project on CodePlex.</p>\r\n<p>&nbsp;CodePlex is an awesome site, providing us with tons of value. Having to run all this ourselves would be a huge nightmare. But it could be even better! The team at Microsoft developing CodePlex is very active, but relatively small; and they prioritize work on new features based on demand from users. And they measure demand based on votes on their own issue tracker (among other things). So, I thought it might benefit us if we all voted for the things that are useful to us. I put together a list of issues that look useful.</p>\r\n<p><strong>&nbsp;If you have a moment, please login to CodePlex,&nbsp;and go to these pages and click Vote (top left):</strong></p>\r\n<ul>\r\n<li><a href=\"http://codeplex.codeplex.com/workitem/24267\">Rich Text Editor used by Discussions doesn't work on iPhone</a></li>\r\n<li><a href=\"http://codeplex.codeplex.com/workitem/13887\">Ability to Mark Discussion Threads as 'Answered'</a></li>\r\n<li><a href=\"http://codeplex.codeplex.com/workitem/8258\">Automated (i.e. Nightly) Build Support</a></li>\r\n<li><a href=\"http://codeplex.codeplex.com/workitem/8152\">Add Support for Polls</a></li>\r\n<li><a href=\"http://codeplex.codeplex.com/workitem/9363\">Track and Recognize Active Contributors (i.e. a Reputation System)</a></li>\r\n<li>Look through their <a href=\"http://codeplex.codeplex.com/WorkItem/AdvancedList.aspx\">Issue Tracker</a> for more things that look useful to you!</li>\r\n</ul>\r\n<p>&nbsp;</p>\r\n<p>Thanks!</p>",
    "PostedDate": "2010-06-25T15:17:31.76-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "460411",
    "ThreadId": "217385",
    "Html": "<p>I'll vote on a few things now...</p>\r\n<p>&nbsp;</p>\r\n<p>Out of curiosity though-why codeplex and not sourceforge?</p>",
    "PostedDate": "2010-06-27T14:11:17.473-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "460412",
    "ThreadId": "217385",
    "Html": "<p>Codeplex is... prettier?</p>",
    "PostedDate": "2010-06-27T14:14:29.327-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "460439",
    "ThreadId": "217385",
    "Html": "<p>CodePlex is better in a wide number of ways. They actually communicate with their developers, and are very Microsoft tool-centric, which is great for us. (but not exclusively)</p>",
    "PostedDate": "2010-06-27T17:11:24.183-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "460690",
    "ThreadId": "217385",
    "Html": "<p>Also:</p>\r\n<p>Don't vote on EVERYTHING, because that just doesn't help. You want to make the stuff you care about stand out from the rest.</p>\r\n<p>RichEdit on iPhone:&nbsp;&nbsp; get a proper phone (or a get a proper browser for your flashy but underfeatured and buggy phone). :-)&nbsp; Better yet, get a life without clinging to your phone so much.</p>\r\n<p>Polls would be nice, but then the question arrises how many people actually READ the discussions on a regular basis?&nbsp; I guess most just go to the homepage and download and care not about the rest, should be easy enough to arrange polls from inside rawr if it was really needed.</p>",
    "PostedDate": "2010-06-28T07:49:05.703-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "460696",
    "ThreadId": "217385",
    "Html": "<p>I have used several services like codeplex (sourceforge, googlecode,...).&nbsp; Codeplex is by far the easiest and most convenient to use. it's also faster and isn't down as much.</p>\r\n<p>Otoh, Codeplex is missing some of the community feature pizzazz&nbsp;that the other sites have and it's why other sites seem to be more popular.&nbsp; A lot of people in the 'open source', 'gpl' communities also have a grudge against anything microsoft so they'd never use codeplex.&nbsp; If you remove all the microsoft originated projects from Codeplex, there wouldn't be a whole lot left.</p>",
    "PostedDate": "2010-06-28T08:03:23.13-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "460978",
    "ThreadId": "217385",
    "Html": "<p>My largest gripe, by far, is the Microsoft design of &quot;let's make sure that every time you visit a page, it's fresh&quot;.&nbsp; IE does this, in that if you hit Forward or Back within your browser to return to a page that you've already visited in that session, it completely reloads the page.&nbsp; Annoying and time-consuming.&nbsp; The Codeplex website is the same way, with the text boxes.&nbsp; Every time I want to go back to the main Discussion page after posting, I get a fancy schmancy warning that I have to resend a request for the page.&nbsp; Blah.&nbsp; Whatever happened to a regular old text entry box?&nbsp; I'd much rather a hiding of the entry box via some CSS magicks.</p>",
    "PostedDate": "2010-06-28T23:05:53.513-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "461216",
    "ThreadId": "217385",
    "Html": "<ol>\r\n<li>Launch IE.</li>\r\n<li>Tools &gt; Options</li>\r\n<li>Browsing History &lt; Settings</li>\r\n<li>Check for Newer versions of stored pages: Make your selection</li>\r\n</ol>",
    "PostedDate": "2010-06-29T08:13:33.093-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "461277",
    "ThreadId": "217385",
    "Html": "<p>Not really Codeplex related, but definetly Microsoft related. Interesting article on CNN about a leak Microsoft conference about Windows 8 being more Apple like.</p>\r\n<p>http://www.cnn.com/2010/TECH/web/06/29/cnet.microsoft.windows.8/index.html</p>\r\n<p>Also, IE 9 is coming along real nicely if you haven't <a href=\"http://ie.microsoft.com/testdrive/\">checked it out yet</a>. ;) For Microsoft to originally dismiss the ACID 3 test when it first came out (they were still working on IE 8 at the time), only to turn around and score an 83 on it is impressive to say the least.</p>",
    "PostedDate": "2010-06-29T10:43:39.803-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "461564",
    "ThreadId": "217385",
    "Html": "<p>Any company that ignores everything it's competitors are doing... is going to fail.</p>\r\n<p>Windows has borrowed the 'must have' features from other platforms before, and will continue to do so in the future.&nbsp; Apple is one, but certainly not the only competitor (hi google, intel, ibm, sun, ...) they're looking at.</p>\r\n<p>The Acidtest doesn't surprise me either.&nbsp; The web used to be largely a 'designed for IE' type environment. Web designers pretty much designed their sites to work for IE only with little care for other browsers.&nbsp; Even if you weren't targetting IE specifically, you were pretty much forced to at least make your site look 'ok' on IE.&nbsp; But those other browsers have been gaining ground, and as such, web designers are increasingly expecting their sites to render identically on all platforms, without the need to add tweaks for each platform and browser, which also means they would need to test their sites on each of those browsers.</p>\r\n<p>&nbsp;</p>\r\n<p>Now if only we can get a lot of those old sites to stop using quirks mode... :p</p>",
    "PostedDate": "2010-06-30T02:07:42.15-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "463116",
    "ThreadId": "217385",
    "Html": "Here, go vote this up:\r\nhttp://codeplex.codeplex.com/workitem/25491 [Feature Request] Issue Tracker Statistics Report",
    "PostedDate": "2010-07-03T12:19:44.413-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]