[
  {
    "Id": "461296",
    "ThreadId": "217761",
    "Html": "Looking at one item in particular today (Bracers of eternal Dreaming, heroic 277) wristsfor moonkin and noticed a problem.  with the purified dreadstone it's BIS, with runed cardinal it's 15th.  with my selected gear and buffs, SP/Spirit gemming is 765/791 sustained/burst. with the second SP gemming is  432/432 sustained/ burst.  All this from -6 SP (or less if you incl sp from spirit contribution) and +10 spirit.   I think not!  So ya, something seriously wrong there.  Similar issue with the cloth wrist (Death surgeons sleeves 277), and the back peice (greatcloak of the turned champion 264) and probably others",
    "PostedDate": "2010-06-29T11:27:25.25-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "461300",
    "ThreadId": "217761",
    "Html": "Alright, I'm going to be as blunt as I can with this one.\r\n\r\n1) This should not be a discussion, this should be an issue.  Discussions are meant for, well, discussion.  Bugs go in the Issue Tracker.\r\n2) You're a freaking moron.  You changed from a blue gem, which activates your meta, to a red gem, which does not.  It wouldn't be so bad if your cloak and bracers, coincidentally the two pieces mentioned in your comment, weren't the only two sporting blue gems.  If you want to see the differences without worrying about your meta requirements, uncheck the little box conveniently labeled &quot;Enforce Gem Requirements&quot; on the Stats tab, underneath the professions dropdowns.",
    "PostedDate": "2010-06-29T11:38:56.903-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "461304",
    "ThreadId": "217761",
    "Html": "thanks for the heads up on my error.  however, better a moron (really jsut a rawr newbie, TBH) than an asshole.  lol",
    "PostedDate": "2010-06-29T11:44:03.447-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "461312",
    "ThreadId": "217761",
    "Html": "<p>I love how things are always &quot;seriously wrong&quot; whenever a user doesn't understand something.</p>\r\n<p>Not to mention we have this lovely and filled out documentation section that NO ONE BOTHERS TO READ.</p>",
    "PostedDate": "2010-06-29T11:58:18.443-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "461379",
    "ThreadId": "217761",
    "Html": "<p>This has nothing to do with how Rawr works, understanding the program or whatever won't help.<br>This is only about understanding the game you're playing, if you can't realize by yourself that those slots you're asking about are the ones activating your Meta (those gems are in there by accident maybe?) you are in no way deserving any 277 items.</p>\r\n<p>Asking questions is fine indeed, but not even trying to think for yourself is, as Dopefish put it, moronic.<br>(Yes, normally I'm nicer and all that, that Fes will be back tomorrow :) )</p>",
    "PostedDate": "2010-06-29T15:19:43.327-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "461397",
    "ThreadId": "217761",
    "Html": "<p>Wow - you guys been on the angry pills today?</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-06-29T16:11:07.66-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "461399",
    "ThreadId": "217761",
    "Html": "<p>RRRRRR HULK SMASH!</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-06-29T16:16:53.27-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "461558",
    "ThreadId": "217761",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>RareBeast wrote:</strong><br>\r\n<p>Wow - you guys been on the angry pills today?</p>\r\n</blockquote>\r\n<p>&nbsp;</p>\r\n<p>Would appear that some people have been yes :)</p>",
    "PostedDate": "2010-06-30T01:53:57.07-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]