[
  {
    "Id": "461401",
    "ThreadId": "217786",
    "Html": "<p>These forums have been plagued by stupid questions lately. I'm getting pretty tired of it. So, please discuss intelligent things here, to brighten the mood. Ask about complex bear mechanics or something, I dunno.</p>",
    "PostedDate": "2010-06-29T16:24:28.07-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "461403",
    "ThreadId": "217786",
    "Html": "<p>What is the optimal rotation to hold 4 mobs attacking from flanking positions, 2 in front, 1 on left side and one behind. Requiring movement every 6 seconds for 3 seconds.</p>",
    "PostedDate": "2010-06-29T16:32:11.48-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "461405",
    "ThreadId": "217786",
    "Html": "<p>Spam Swipe+Maul. Ignore the one behind until the first time you move (after which they will be grouped up in front of you). If one is being actively DPS'd, trade a Swipe for a mangle on cooldown (if AoE'd, don't Mangle, but rotate which is targeted to spread Mauls around). If the mobs will last longer than about 45sec, use the ICC idol, and Lacerate once when aggro is secure, and again every 13.5 sec. If the mobs won't last that long, use the ToC idol. If the movement requirement is loose enough that you can S-Key out of whatever requires movement, do so, while maintaining facing on the mobs. If the movement need is immediate, turn perpendicular to the mobs, strafe jump, turn slightly back toward the mobs, while continuing to Swipe+Maul, and retarget the closest mob during the jump. Chain multiple of these jumps if required.   Next?</p>",
    "PostedDate": "2010-06-29T16:49:42.47-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "461407",
    "ThreadId": "217786",
    "Html": "<p>Think of the most difficult tanking job (as a solo tank, regardless of the number of recommended tanks) of all the Tier 7-10 bosses for a bear in it's present state (Full 277), state what that job is and describe how you would perform it.</p>",
    "PostedDate": "2010-06-29T16:54:49.807-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "461446",
    "ThreadId": "217786",
    "Html": "<p>Rawr. An interesting question. Well, there are many fights that flat out require multiple tanks (hi Thaddius). And there are many fights that could be done with one tank by simply not tanking some part of it (hi Thorim). And there are quite a few fights intended for multiple but takable by one (hi Freya).</p>\r\n<p>But I'm going to go with Lich King Heroic, because I actually have a lot of experience with that lately. I really like solo tanking LK because it actually can make the fight potentially easier, but at great risk, primarily placed on the tank, and healers. You can take it to the further extreme by solo healing it as well. My 10man group spent about 4hr this week on LK10H, 1tank/1healer/8dps. We had him down to low 30%s a few times, and it definitely looks like it's in reach.   I really like it because the damage mitigation, survival, and threat requirement are just so high. And worse, the damage is very bursty, and it doesn't let up very much throughout the fight. That necessitates very careful cooldown usage (and there are a lot of cooldowns available, that much be used perfectly). Every time my health drops to 1/3, it's a difficult decision about whether to use a cooldown, at the cost of not having it later when you know you'll need it.</p>\r\n<p>So how do I do it... Ability usage is very important, down to the individual GCD. I start with my Threat weapon equipped (Black Magic agi-gemmed Bloodfall), and after phase 2 ends, switch to my survival weapon (Wrathful sta-gemmed, Mongoose. Considering Blood Draining). I open the fight with Berserk 1.5sec before combat, Indestructable 1sec before combat, Enrage+Maul+Mangle as combat starts.  A second later, Heroism. Mangle on GCD, careful to target each ghouls as it spawns with the last 3 Mangles. Then do standard threat rotation, only lacerating to maintain stacks.</p>\r\n<p>&nbsp;</p>\r\n<p>...busy raiding now, will continue later.</p>",
    "PostedDate": "2010-06-29T19:48:55.757-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "461555",
    "ThreadId": "217786",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>Astrylian wrote:</strong><br>\r\n<p>These forums have been plagued by stupid questions lately. I'm getting pretty tired of it. So, please discuss intelligent things here, to brighten the mood. Ask about complex bear mechanics or something, I dunno.</p>\r\n</blockquote>\r\n<p>&nbsp;Stupid questions are an issue in pretty much any software project.&nbsp; The thing is that developers often suffer from being detached from the &quot;real&quot; world. Developers typically have their brains turned upside down and inside out.</p>\r\n<p>In an open software project like rawr, where people don't get a formal training in how to use the product, you also get new people asking the obvious new questions all the time.&nbsp; Yes, there's FAQ's, but as obvious as that may seem to us, it isn't as obvious a means for new users.</p>\r\n<p>I would definately say that Rawr has some features, and dialogs that aren't really user friendly.&nbsp; A well implemented&nbsp;user&nbsp;friendly and goal&nbsp;oriented UI and clear error reporting&nbsp;can cut down a lot on the 'stupid questions'.&nbsp;A lot could be done in that department.</p>\r\n<p>Even as a developer on rawr, there's features I'm not using, or not using as well as I should be.&nbsp; Some parts I even downright don't 'get'. Maybe this would be food for a interesting discussion, how to improve rawr from the user PoV and&nbsp;not only try to get more accurate models.</p>",
    "PostedDate": "2010-06-30T01:43:49.143-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "461587",
    "ThreadId": "217786",
    "Html": "It has been frustrating lately (last 6 months) to watch, as Rawr has grown in popularity, that that the general knowledge and theorycrafting skills of the users have diminished. Most posts today are related to issues regarding using the program, issues that are thoroughly covered in the user guides. The interesting posts are growing rare and the &quot;stupid&quot; posts are plentiful, and I fully understand the frustration of the developers! Back in the days when Rawr started out, the posters on the forums had deep knowledge and interesting findings and discussions erupted. On te top of my head I can only come up with 2 or 3 subjects in the last 6 months that have really contributed to the theorycrafting community.\r\n\r\nHowever, take it as a sign that Rawr is growing increasingly popular and attracting more and more users :) I hope you, the developers, can cope with more or less stupid questions and dont grow tired of it all!",
    "PostedDate": "2010-06-30T03:11:12-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "461656",
    "ThreadId": "217786",
    "Html": "<p>Doesn't a program such as this detach you from a lot of the theorycrafting, though? That is kind of it's function. It lets you make choices on gear without having to calculate it all out by hand, and consequently, you don't actually have to know as much. Of course, those that DO know all of that will actually get numbers in-game that come closer to Rawr's numbers than those that don't. Those that take an interest in learning why the numbers come out the way they do will generally have a better grasp on how to play their toon than those that don't. Now if only Rawr could optimize people's common sense... :D</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-06-30T07:16:20.517-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "461756",
    "ThreadId": "217786",
    "Html": "<p>Sorry, if I wasn't clear, this is a thread for intelligent discussion, not 'discussing the stupid'.</p>\r\n<p>Take that to&nbsp;<a href=\"http://rawr.codeplex.com/Thread/View.aspx?ThreadId=217883\">WTB Stupid Discussion</a></p>",
    "PostedDate": "2010-06-30T10:58:02.843-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "461984",
    "ThreadId": "217786",
    "Html": "<p>How about the viability of chicken-tanking in WotLK (Panzerkin ftw)? Having tanked a couple times as a chicken when the tank dies or sucks at threat, and having tanked a fair chunk of Kara and some other TBC bosses back in TBC I'm quite interested in returning panzerkin to their former *coff* glory *coff*. Is it possible to obtain a gear set in WotLK gear that renders a chicken crit immune while retaining sufficient caster stats to generate enough threat to keep a moderately geared group from pulling off you?</p>",
    "PostedDate": "2010-06-30T21:42:31.733-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "461995",
    "ThreadId": "217786",
    "Html": "<p>I have very little experience with Boomkins. Never spec'd boomkin even once, despite having created this character with the intention of going boomkin. But I don't think so. Crit immunity would be easy - PvP gear, though.</p>",
    "PostedDate": "2010-06-30T22:20:25.127-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "462461",
    "ThreadId": "217786",
    "Html": "<p>True, in TBC my panzerkin set was a mix of pvp and paladin gear (str+int+SP+def). Now all we need is the optimizer for moonkin to include defense cap and mitigation (joking).</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-07-01T20:27:21.973-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "462479",
    "ThreadId": "217786",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>Carnacki wrote:</strong><br>\r\n<p>True, in TBC my panzerkin set was a mix of pvp and paladin gear (str+int+SP+def). Now all we need is the optimizer for moonkin to include defense cap and mitigation (joking).</p>\r\n<p>&nbsp;</p>\r\n</blockquote>\r\n<p>Hey, if anyone wants to write a Panzerkin module for Rawr, I'd be happy to be of assistance.</p>",
    "PostedDate": "2010-07-01T22:56:22.643-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "462491",
    "ThreadId": "217786",
    "Html": "<p><em>*points to thread title*</em></p>",
    "PostedDate": "2010-07-01T23:17:47.747-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "463109",
    "ThreadId": "217786",
    "Html": "<p>Alright, back on the topic of intelligent discussion.&nbsp; I have three tanks for Halion: a paladin, a bear, and a warrior.&nbsp; All three are in similar gear (4T10 with mostly 264 offset pieces and a few 251 items).&nbsp; The paladin is currently the main tank, tanking outside, with an average unblocked hit of 23k.&nbsp; The warrior was our original twilight realm tank; his average unblocked hit was 28k.&nbsp; We switched to the bear for the twilight tank, with an average unabsorbed hit of 26k.&nbsp; We had a great deal of trouble keeping the warrior alive, whereas the bear was able to survive easily with the same healing setup.&nbsp; Why is the bear so much more stable than the warrior?</p>",
    "PostedDate": "2010-07-03T11:03:41.893-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "463160",
    "ThreadId": "217786",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>dopefish wrote:</strong><br>\r\n<p>Alright, back on the topic of intelligent discussion.&nbsp; I have three tanks for Halion: a paladin, a bear, and a warrior.&nbsp; All three are in similar gear (4T10 with mostly 264 offset pieces and a few 251 items).&nbsp; The paladin is currently the main tank, tanking outside, with an average unblocked hit of 23k.&nbsp; The warrior was our original twilight realm tank; his average unblocked hit was 28k.&nbsp; We switched to the bear for the twilight tank, with an average unabsorbed hit of 26k.&nbsp; We had a great deal of trouble keeping the warrior alive, whereas the bear was able to survive easily with the same healing setup.&nbsp; Why is the bear so much more stable than the warrior?</p>\r\n</blockquote>\r\n<p>Sounds like the Bear is better at utilizing his cooldowns, and may also have higher avoidance.</p>",
    "PostedDate": "2010-07-03T15:35:23.78-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "463257",
    "ThreadId": "217786",
    "Html": "<p>My inclination is the first half of what Astry said.&nbsp; Typically, whenever a healer is complaining that a tank takes too much damage on the whole, it's because the tank is SORELY lacking in their general CD usage.</p>",
    "PostedDate": "2010-07-04T10:51:20.427-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "463439",
    "ThreadId": "217786",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>BrWarner wrote:</strong><br>\r\n<p>My inclination is the first half of what Astry said.&nbsp; Typically, whenever a healer is complaining that a tank takes too much damage on the whole, it's because the tank is SORELY lacking in their general CD usage.</p>\r\n</blockquote>\r\n<p>Care to elaborate ?&nbsp;&nbsp; I don't see which CD's a warrior tank has at his disposal that will actually solve this.</p>\r\n<p>&nbsp;</p>\r\n<p>My personal guess would be that the warrior has geared to be a mana sponge.&nbsp; All sta, but low avoidance and mitigation. This has been a trend all through wotlk, and a trend blizzard has failed several times at breaking.</p>\r\n<p>The other guess would be that he's turning his back towards the dragon when moving.&nbsp; Thus getting no dodges, parries or blocks only hits.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-07-05T05:56:13.757-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "463497",
    "ThreadId": "217786",
    "Html": "<p>We're talking to both his targeted and general use of CDs.&nbsp; If he's not using CDs as part of his his normal &quot;I'm taking damage, but want to take less damage&quot; operation, then he's Doing It Wrong.&nbsp; So, just make sure that he's constantly cycling through CDs to minimize his total damage taken (SBlock &gt; Bloodrage for set bonus &gt; trinket &gt; SBlock &gt; other trinket &gt; Enraged Regen &gt; SBlock &gt; etc.&nbsp; Just constantly cycling through the CDs that he has available, while going about his normal business.&nbsp; If he's not currently doing this, and saving ALL CDs ALL the time, then he's taking WAY more damage than he needs to be.&nbsp; And, going straight EH isn't a new trend, and it's not the reason he's taking a lot of damage.&nbsp; It's his lack of normal CD usage.</p>",
    "PostedDate": "2010-07-05T09:17:37.61-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "463982",
    "ThreadId": "217786",
    "Html": "<p>(Haven't been following Rawr closely or spent a lot of time in WoW the last 2 or 3 months. Logged to get the latest version and have a quick look at what is happening on the discussions when I saw this thread. If it has been addressed and I missed that feel free to give me the standard go search before posting response).</p>\r\n<p>Here is a theorycrafting question, which might or might not totally be in the scope of Rawr:</p>\r\n<p>Astrylian said: &quot;That necessitates very careful cooldown usage (and there are a lot of  cooldowns available, that much be used perfectly). Every time my health  drops to 1/3, it's a difficult decision about whether to use a cooldown,  at the cost of not having it later when you know you'll need it.&quot;</p>\r\n<p>What modeling do you need in order to be able to make that decision optimally?&nbsp; This at least affects trinket choices and set-bonus values. But I believe it might also be useful in better understanding/comparing different tank classes to each other.</p>\r\n<p>For example modelling barkskin wasn't included in the bear model the last time I checked. If you where to model it based on average effect, the 4T7 and 4T9 set bonus should both give 1% damage mitigation (if my quick calc is correct), compared to the 2% from 4T10. Suddenly the decision to break 4T9 for 2T10 needs more careful thought). If on the other hand we assume barkskin is reserved for these low health spots, the extra duration of 4T7 is probably wasted, while shorter CD of the 4T9 makes it available more frequently.</p>\r\n<p>&nbsp;</p>\r\n<p>So for example: If your at 30% health, what is the chance that hitting your dodge trinket will actually be able to save you? This partly depends on boss mechanics (hi boss module) and healer modelling (...silence..., i.e. missing when it comes to tank modelling). If you take the healing model on which the &quot;Burst Time&quot; metric is based, you need one miss (I'm assuming one hit will kill you at this stage), then it is simply the increase in dodge considering DR etc. {Aside for those that don't know the details of that model:</p>\r\n&lt;!-- \t\t@page { size: 21cm 29.7cm; margin: 2cm } \t\tP { margin-bottom: 0.21cm } --&gt;\r\n<p style=\"margin-bottom:0cm\">The tank model in <strong>Reaction and Burst Times: The power of avoidance</strong> (<a href=\"http://www.tankspot.com/forums/f200/37241-power-avoidance-preliminary-results.html\">http://www.tankspot.com/forums/f200/37241-power-avoidance-preliminary-results.html</a>)  wants to avoid making too many assumptions about the healers, but settles for the assumption that you need a single miss to get the tank back to full health. This feels like a weird assumption, since the healers' reactions/capabilities now depend on the tank's dodging capability. If the healers can get a tank from 1% to 100% during a missed swing, why assume they cannot do any healing during a landed swing?}</p>\r\n<p>But if you assume the opposite extreme: Constant healing output, your actually assuming worst case healing (healer is running though his standard sequence without watching the fight at all). Since the healing isn't reactive, its only at the average level, a single miss probably isn't enough to ensure survival. It probably moves you from the one-shot to two-shot region. Hopefully the extra dodge and trinket duration will be enough to give some extra survival chance there as well.</p>\r\n<p>How does that percentage survival chance bonus compare to a battlemaster trinket or a blood-drain enchant?</p>\r\n<p>Given that you know the dodge chance etc. Can you calculate the average frequency of getting into this situation where you need an extra CD for a specific boss fight? Can you calculate on average how many healer CDs the tank would where his own CDs are all still on cooldown?</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-07-06T15:28:36.747-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "464095",
    "ThreadId": "217786",
    "Html": "<p>Short answer: You don't. Cooldown usage is very similar to Survival vs Mitigation. With Survival vs Mitigation, Rawr tells you an overall score, a sum, but it's really still on you to weight those appropriately. (If you're dying to burst damage, you need more Survival. If not, you need more Mitigation. That's the short version, anyway.) Same deal with cooldowns. Rawr will tell you an averaged out value, with some pretty intelligent uptime calculation, but optimal cooldown usage is very fight/strat/pull dependent. It's up to you to optimally choose cooldowns (ie trinkets) on a fight by fight basis. I have about 6 trinkets that I swap between on different fights in ICC.</p>",
    "PostedDate": "2010-07-07T00:28:38.427-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "464541",
    "ThreadId": "217786",
    "Html": "<p>At least from my point of view, it's easy enough just to average in trinket cooldowns as they are from gear and most likely are equipped to be regularly used in a given fight. Most are not a high enough magnitude to save you from insane timed events, so if you equip it you probably intend to use it for general damage reduction or survival increases.</p>\r\n<p>Class cooldowns, on the other hand, are a totally different matter. I've always gotten request to, for instance, average in Shield Wall--which is just not a good idea. Major cooldowns are used for specific events and specific events are either fight or condition dependant. There's no way to accuratly presume you will use your Shield Wall at any particular interval, and averaging it in (which would affect how everything is calculated globally!) is not very helpful.</p>\r\n<p>Cooldown usage, at least in my opinion, often just comes down to the tank knowing what is needed for a given encounter. There is usually no easy answer to that one. Good tanks know when to use their cooldowns--incoming burst, healer unavailability, or a general sense that it would really ease the situation--and bad tanks often forget about them completely.</p>\r\n<p>It's also a really complex question to compare two tanks of different classes on the same fight... cooldowns, gear, stats, talents could all play a role. Some fights, Ardent Defender is awesome, other times it's not...some fights Warrior cooldowns are great, sometimes they aren't.</p>",
    "PostedDate": "2010-07-07T15:40:08.847-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "465174",
    "ThreadId": "217786",
    "Html": "<p>Looking at what Wild is saying I guess you could calculate that yourself by doing two manual gear comparisons. Check your tanking scores using a normal trinket then recalculate using the &quot;Burst&quot; trinket but instead of modeling the proc as say 700 dodge for 10 seconds (which creates an average) you model it as just a flat 700 dodge. That'd give you your tanking stats for the 10 seconds the effect is active wouldn't it? Actually, you'd probably want to model three times... the third time would be with the burst trinket with zero dodge since you'd want to know your tanking stats for the rest of the fight.</p>\r\n<p>I've wondered much the same thing regarding my paladin tank for LK. Could I use a dodge trinket and when he gets soul reaper just pop that trinket cooldown and keep tanking instead of doing the two tank taunt rotation? It'd be an interesting stat to see the three different values for tanking totals in the model (Average, no-procs, procs) rather than just the average. But I would imagine it'd be painful to calculate, especially when you have multiple on-use or proc items.</p>",
    "PostedDate": "2010-07-08T19:23:28.897-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]