[
  {
    "Id": "461757",
    "ThreadId": "217883",
    "Html": "<p>Use this thread for discussing the stupid the plagues our userbase. How can we help cleanse the stupid? How can we improve usability? How can we make the help more easily available? How can we make people actually use the help we already provide? etc?</p>",
    "PostedDate": "2010-06-30T11:00:17.783-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "461774",
    "ThreadId": "217883",
    "Html": "Dunno why, but a thought just entered my mind to make a War Poster lookalike, with a subtext of &quot;Uncle Spam wants YOU!&quot;",
    "PostedDate": "2010-06-30T11:45:42.467-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "461863",
    "ThreadId": "217883",
    "Html": "A huge thing would be for Codeplex to allow the Project to nominate Moderators that have greater control over the Discussions.  I just can't get over how poor the Discussion back-end (and front-end, for that matter) is in terms of usability and fostering quality discussion.  Heck, I'd almost rather a phpBB or SMF setup to replace the entire Discussions section.",
    "PostedDate": "2010-06-30T14:44:41.943-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "461866",
    "ThreadId": "217883",
    "Html": "<p>Well I can make more people moderators. But yeah, the discussions are very feature limited.</p>",
    "PostedDate": "2010-06-30T14:48:42.947-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "461873",
    "ThreadId": "217883",
    "Html": "<p>And the text entry areas are REAL REALLY REALLY (REALLY REALLY) REALLY (REALLY) stupid.  I hope I put enough emphasis in that last line to make up for all of the times I have complained about it previously that you may have missed.</p>\r\n<p>That said, I'd be willing to step in to help moderate.&nbsp; Might help to be able to lessen the &quot;Rawr developers are mean because they call people out on stupid shit that's thoroughly covered in the Documentation / FAQ / whatnot&quot; perception that we sometimes give off.</p>",
    "PostedDate": "2010-06-30T15:01:31.137-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "461911",
    "ThreadId": "217883",
    "Html": "<p>The ability to sticky a post at the top of the discussions would solve a LOT of problems.&nbsp;&nbsp;&nbsp; A quick summary of how to get started, a link to the video tour (which a lot of people don't take the time to watch) and a nice FAQ would stop probably half of the issues being posted.&nbsp;&nbsp;&nbsp;&nbsp; I've written this Rawr &quot;guide&quot; and posted it a few times on other boards when people have had questions or were doing something wrong....</p>",
    "PostedDate": "2010-06-30T16:36:33.943-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "461913",
    "ThreadId": "217883",
    "Html": "<p>First, let me say I have no affiliation with the Rawr developers other  than being a long-time user of many/most of the modules.  I have seen a  lot of people who have looked at Rawr but not really worked it all out  yet or are using it sub-optimally (not using the optimiser).  It is an  excellent tool when used properly and this post is aimed at helping  people make the most of it. <br> <br>Download Rawr from   <a title=\"http://rawr.codeplex.com\" rel=\"external nofollow\" href=\"../\">http://rawr.codeplex.com</a> <br> <br> <br> <br>Useful Settings <br>========= <br>(1)  Tools =&gt;  Options =&gt; General Settings      -    I click &quot;buff sources&quot;, &quot;Gem  Names&quot; &amp; &quot;Item types&quot; <br>(2)  Tools =&gt; Edit Gemming Templates     - I set it to only show the top gemming template as it is simpler than  seeing multiple versions of each item <br> <br> <br> <br>Setting up your  Character <br>================ <br>(1)  File =&gt; Load Character from  Armory <br>(2)  Make sure the &quot;Enforce Gem Requirements&quot; is checked on  the &quot;Stats&quot; tab <br>(3)  On the &quot;Buffs&quot; tab, select all the buffs you  want - I select all buffs except the Draenei &amp; potions (I usually  save it for a health pot) <br>(4)  Change any settings on the &quot;Options&quot;  tab - this is different for each model - I usually set a 5 minute fight,  but you may want longer. <br>(5)  In the &quot;Comparisons&quot; pane (right hand  side), for each slot, left click on the little diamond next to any  other items you have that weren't equipped when you imported your  character from the armory - there should be a green diamond next to each  item you own <br>(6)  Similarly, mark any other enchants you have  access too that weren't on your current gear (I normally select the top  1-3 for each slot). <br>(7)  Tools =&gt; Edit Gemming Templates - make  sure the correct gems are selected - usually it is ok to use the default  but for poorly geared alts I often change it to the rare gems.   (Doesn't have to be every possible gemming!!  Just the fairly common  ones) <br>(8)  In the &quot;Comparisons&quot; pane mark any other gems available  that you might need that didn't appear in any of the templates.   For  Feral I make sure I mark the Nightmare Tear, 20ArPen &amp; 10Agi/10Haste  gems. <br>(9)  File  =&gt;  Save!!!! <br> <br> <br>Optmising Your  Character <br>================ <br>(1)  Tools =&gt; Optimise <br>(2)   Select what you want to optimise for - For Feral, I optimise for DPS  rating (Selecting overall for feral would include survivability) <br>(3)   Add any additional requirements - You might like to select &quot;Avoided  Attacks % &lt; 0&quot; if you want to be hit/expertise capped.  I DON'T do  this as enforcing the caps may(often) give you a result which has a  lower DPS score.   Also, for tanks you might like to set &quot;Chance to be  crit &lt; 0&quot; <br>(4)  Thoroughness - Time take to optimise varies  greatly with which model you are using and how good your PC is (and how  many items you have marked).  Try an optimise at the default setting to  see how long it takes and then adjust this slider accordingly.   Greater  thoroughness will often give you a better result - I use max  thoroughness for my feral and it doesn't take too long - make sure you  don't have silly items marked ie. don't have T7 or T8 stuff marked if  you have T10 gear - trinkets &quot;may&quot; be an exception as things like  Darkmoon Card, ArPen trinkets are OP for their ILvl. <br>(5)  I would  suggest ignoring most of the check boxes at this stage.  It can be  useful to let it pick the best food/flask for you, but I usually leave  all these unchecked. <br>(6)  Hit &quot;Optimise&quot; and let Rawr do what it  does best!! <br> <br> <br> <br>Using the Build Upgrade List <br>=================  <br>Say you are running 10man regular Icecrown Citadel tonight.  You  can use the &quot;Filters&quot; in the &quot;Comparison&quot; pane of Rawr to select only  the 10 man reg Icecrown loot.   Then select the &quot;Slot&quot; dropdown and  select &quot;Direct Upgrades&quot;.   You may think that it is then showing all  items that are an upgrade for you in 10 man reg Icecrown but this may  not be the case.  If your current gear is Hit Capped, then +hit items in  the lists will be devalued and may not show as an upgrade.  But you may  be able to fiddle around with gems/enchants or switch in a piece or two  that you have sitting in the bank and find that those items which  aren't showing as upgrades may actually be significant upgrades.   The  &quot;Build Upgrade List&quot; allows Rawr to take all these things into account  and show every item that will be an upgrade for you.  (Often this will  fairly closely match what is show in the comparison pane, but you do get  a few suprises). <br> <br>**  A warning:  This option takes  significantly longer to process so it is important that you are fairly  strict with your filter settings to reduce the number of items Rawr has  to process.  Don't just select Icecrown.  Select 10 Man regular  Icecrown.  Or even better (at the moment) select only &quot;The Lower Spire&quot;  &amp; &quot;The Plagueworks&quot;.  ** <br> <br>(1)  Tools =&gt; Optimise <br>(2)   Your options remain basically the same as what are discussed under  &quot;Optimising Your Character&quot; above <br>(3)  Once again, try on a lower  &quot;Thoroughness&quot; setting until you see how fast/slow it is with the  options/gear you have selected (I use max on my feral) <br>(4)  Hit  &quot;Build Upgrade List&quot; <br>(5)  After it has finished you get a new window  with a list of the upgrades.  If you hover over each one, then the  tooltip shows what combination of gear/gems/enchants give you the best  results with the potential upgrade. <br> <br> <br> <br>I hope that is  useful to people and will try and answer any questions.....</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-06-30T16:36:43.337-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "461983",
    "ThreadId": "217883",
    "Html": "<p>From a user perspective (stupid user maybe :P ) I think Rawr is a little confusing for first time use. Rather than the welcome dialog pushing users out of Rawr to the Tour video on youtube (which not all people do anyway) it'd be better to have some sort of &quot;first use wizard&quot; that hand-holds people through the process of importing their character, setting their buffs, boss fight options etc. Similarly it'd be worth having more wizards for other functions like filtering and optimizing characters, maybe even some sort of gear selection wizard.</p>\r\n<p>The optimizer is really powerful but it can be a little overwhelming and it's not immediately understandable. I'd suggest breaking it into a proper wizard interface (ie: multi-page where each page asking simple questions). Some of the confusion stems from providing too much information in a single dialog. (new) Users aren't sure what they need to do, breaking it down into smaller pieces of information allows them to understand a single piece of information and make a decision then move on to the next bit rather than trying to absorb and understand everything at once.</p>\r\n<p>It'd probably be worth having default sets of settings for a lot of  things (especially if you got the wizard route). For example, when picking buffs you could have a drop down with &quot;Typical 25 man raid buffs&quot;, &quot;Every possible buff&quot;, &quot;Self buffs&quot; or something similar so that with a single click the user picks a bunch of settings (which they can fine tune if they want).</p>\r\n<p>I'd also try to incorporate a troubleshooting wizard into the interface that addresses say, the half dozen most common questions/problems people have. Like &quot;Why don't I see item X in the list&quot;, &quot;Why isn't gem combination appearing&quot; that kind of thing.</p>\r\n<p>Another small thing, might be to highlight changed stats, of a user switches an item highlight stats that change favorably in green and detrimentally in red. Maybe even have the old value listed beside the new one so it's immediately visible what the change was. Oh, and I'd remove the enforce gem requirements thing altogether. Force the value to always be on, since it doesn't help things if it's turned off.</p>\r\n<p>Ideally, if you did go the wizard route, you'd provide an option to use the wizards or configure manually for expert users.</p>",
    "PostedDate": "2010-06-30T21:32:25.943-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "462048",
    "ThreadId": "217883",
    "Html": "<p>Rawr used to be a program used (almost) exclusively by the people in the &quot;top end raiding guilds&quot;. People that have been used to theorycrafting, the actual theory and mechanics behind their class, and as a result, people that tend to be somewhat more tenacious and used to experimentation, trial by error and reading through a lot of data to find the 2 sentences they need.</p>\r\n<p>Raiding has become a lot more casual in wotlk, even people that only play a few hours a&nbsp;week are running around with ICC epics these days.&nbsp;&nbsp;People invariably will be looking for means to tell them what gear they should be wearing, how to gem and enchant, because... they DON'T know the theory and mechanics behind their class, so they look for quick answers.&nbsp; These are the people that typically don't have the patience to figure out how a new program works, they just want to plug in their character and get told how to gem, enchant and what rotation to use.&nbsp; A lot of the info sites are telling people to go use rawr for that purpose.&nbsp; So yes.&nbsp; The percentage of 'casual' players using Rawr is increasing, and with that comes an increasing amount of entry level questions.</p>\r\n<p>I've done enough software projects to see the pattern.&nbsp; Your first users tend to be the &quot;hardcore&quot; users, the people that get your program because they NEED it, and they don't mind that the program is structured illogically and awkward to use, they use it because they have no other options. But as you get more users, you also get more 'newbs' using your software.&nbsp; And there's a lot more of those out there than the hardcore users.</p>\r\n<p>You can make documentation and FAQ's all you want, it won't help, these people don't read them. If they don't figure out how stuff works after fiddling around for 2 minutes, they go for the easy solution: ask on a forum. They won't search the forum if someone else already had the issue, because that again is too much effort.&nbsp; The only way to reduce the amount of 'flak' from the newbs:</p>\r\n<ul>\r\n<li>Make your program explicitely only for the hardcore users and scare the newbs away. You can do that by increasing complexity and 'awkwardness' and making even the basic stuff impossible to find unless you know where to look (haven't read the manual, then you'll never get anywhere approach).</li>\r\n<li>or... Make your program more user friendly.&nbsp; If 10 users ask the same usability question, then there's something obviously wrong with usability...&nbsp; (hello gemming templates, green diamonds, refine types of items listed, filters, buffs, and strange model settings, ...)</li>\r\n</ul>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-07-01T01:21:13.657-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "462297",
    "ThreadId": "217883",
    "Html": "<p>OReubens has the right idea...either hate the newbies that come here who can't figure out things themselves, and punish/yell/scream and call out their sillyness (which, IMO, you all have been doing a fantastic job of lately :) ), or help them out.</p>\r\n<p>Either way, having to deal with the issue is going to take time away from development (or possible help development, for that once-in-a-blue-moon post that points out a critical error). &nbsp;</p>\r\n<p>One issue I see from my perspective is that a casual user isn't used to the way programmers handle issues or talk about things. &nbsp;As far as WoW goes, they're used to talking on forums or blogs and hammering out their newbness. &nbsp;This whole 'Issue/Bug Tracking' thing is alien to them, and one would/could typically assume that such an area is for just talking about actual program-breaking bugs or malfunctions, not about how the Cat formula weighs one item more than another (when obviously it should be THIS item :P ).</p>\r\n<p>Perhaps bringing someone on-board that could oversee discussions/issue tracker and act a&nbsp;liaison&nbsp;between the public and the devs would be an idea. &nbsp;Like a CM poster on the Bliz forums.</p>",
    "PostedDate": "2010-07-01T11:38:18.373-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "462314",
    "ThreadId": "217883",
    "Html": "<p>WTB said person.</p>",
    "PostedDate": "2010-07-01T12:08:25.66-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "462410",
    "ThreadId": "217883",
    "Html": "<p>A few ways to improve usability :-</p>\r\n<p>1) I see a lot of people using Rawr with no buffs enabled.   Setting up a module with certain buffs turned on by default may improve things.</p>\r\n<p>2) Similarly, each module usually only has 2-3 enchants (often only 1) for each slot that are useful.    Having these turned on by default would be good.</p>\r\n<p>3) Much the same with gems.   You could easily set up all the common gems a  module uses and just allow the user to select whether they want to use the common, rare or epic level gems.   Still have the templates, but most users could just ignore them (assuming they are all accurate and complete - several classes need work still).</p>\r\n<p>4) Perhaps hide the options to optimise for talents and specs in a separate pop up &quot;advanced&quot; button (along with the overide gem &amp; enchant tick boxes).    This would simplify the screen and hopefully stop inexperienced users trying to work out the best spec with the optimiser.    It may be ok to leave the food &amp; elixir/flask boxes there, but the optimiser should come up showing the food/elixir/flask changes when it show the gear changes it is recommending.</p>\r\n<p>5) The descriptions for Thoroughness, Optimise &amp; Build Upgrade List are very long and wordy and could be simplified greatly.      For example something like, &quot;Finds the best upgrades based on your filter selections&quot; would probably be enough.</p>\r\n<p>&nbsp;</p>\r\n<p>PS.  I vote for Jothay for the position :)   He loves helping stupid people  :)  :)  :)</p>",
    "PostedDate": "2010-07-01T16:28:43.233-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "462414",
    "ThreadId": "217883",
    "Html": "Sorry for the wall of text - i've edited it multiple times  - the edit box shows it all spaced nicely, but it won't fix the post :(\r\n\r\n",
    "PostedDate": "2010-07-01T16:33:47.547-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "462420",
    "ThreadId": "217883",
    "Html": "<p>If you dont see the bar that has the Bold, Italic, etc buttons then you are looking at the raw HTML input. This bar seems to disappear a lot when posting. If you are stuck without the bar, use HTML tags to show your formatting, such as &lt;p&gt;&lt;/p&gt; for the space between paragraphs.</p>",
    "PostedDate": "2010-07-01T16:55:45.483-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "462449",
    "ThreadId": "217883",
    "Html": "Especially on Chrome.  I have to use HTML all the time. :(",
    "PostedDate": "2010-07-01T19:28:01.957-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "462450",
    "ThreadId": "217883",
    "Html": "<p>It's utterly random for me, I use Orca (based on Firefox 3) and it just comes and goes as it pleases.</p>",
    "PostedDate": "2010-07-01T19:36:47.32-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "462456",
    "ThreadId": "217883",
    "Html": "<p>I use Chrome and Safari, never not seen it, even when it should give me plain HTML (iPhone).</p>",
    "PostedDate": "2010-07-01T20:00:42.243-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "462465",
    "ThreadId": "217883",
    "Html": "<p>Oreubens has a good point. I develop apps (Vb.net + SQL sorry, not C#) and I found the initial users generally have no problems because they've been involved in the design process - the understand what the app is supposed to do and how to get what they want from it. The next tier of users are the ones who weren't involved in development but get formal training - they're not as au fait with the apps but aren't too bad, plus they get instructions on how to get more information (read doco, help files, talk to expert users, etc). Its the third tier of users that have the most problems - the ones with no formal training who get passed the app some time long after development and they just have to muddle through it.</p>\r\n<p>A couple approaches we tried that helped to reduce the &quot;stupid questions&quot; were;</p>\r\n<p>1. Wizard anything that is complicated (as per my previous post)</p>\r\n<p>2. Provide a knowledge base (or FAQ) of the most common problems, but put it right in the users face (or at least on the help menu - see next point). Sadly searching a forum doesn't work as you move to the stupid user end of the spectrum. Which reminds me, we compiled lists of the common questions users asked when we were developing, training or support an app, then put those into the knowledge base. Someone needs to do the same for Rawr.</p>\r\n<p>3. Provide a link from the program to the sources of support. eg; If you want users to report bugs using the Issue Tracker not the discussion forum then make a link under the help menu called &quot;Report of bug&quot; that takes them directly to the Issue tracker. BUT it should pop up a dialog something like &quot;Have you checked the FAQ&quot; and provide a link to that as well. Encourage the users to check the alternate information before reporting a bug that may in fact be pebkac. You might even want to force them to read something before they can use the link - eg: the MS license agreements that require the user to scroll through the license text before they can click Agree.</p>\r\n<p>4. Training and Expert users. Obviously this is something difficult to implement in a free project like this... But maybe there is some way to do it. Possibly post more videos on youtube showing how to perform the more complicated functions of Rawr? And if so provide links to the them from inside Rawr itself.</p>\r\n<p>5. This should be the first thing done when developing a UI (but its a bit late now). Get a user group involved, in this case a group of non-expert users. Preferably people who've never used Rawr but play WoW. Get them to tinker with Rawr trying to use it's functionality and get their feedback about what they do/don't understand and the problems they have. Then try to take their comments into account when working on the UI. You'll probably get complaints about a bunch of different functions, or different suggestions for the same function. The goal is to find the areas that have the most problems and focus on them.</p>",
    "PostedDate": "2010-07-01T20:54:21.85-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "466867",
    "ThreadId": "217883",
    "Html": "<p>Also note by the end of the UI enhancements, wizards, etc that are designed to stop the newbie questions a bunch of your hardcore original core users are going to hate you because they liked the way it used to do things not the newbie friendly way.&nbsp;&nbsp;&nbsp; In some cases they will have valid complaints but in most they will be the same folks complaining that 41 talent points in smaller trees is somehow a nerf...i.e. they will be being irrational.</p>\r\n<p>I suspect some of the rise in dumb questions is also due to typical WoW summer effect combined with so much stale content.&nbsp; Less people play WoW in the summer, every guild starts to feel it as folks lose interest or are otherwise busy/vacationing/etc, and students are married to their desks/schedules as much.&nbsp; Combined with getting-far-too-close-to-year-old content and a lot of the folks taking a break will be your hardcore.</p>",
    "PostedDate": "2010-07-13T09:01:52.073-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "466912",
    "ThreadId": "217883",
    "Html": "UI enhancements should always be moving up - no complaint from the &quot;hardcore&quot; should be expected.  Adding a &quot;beginner's mode&quot; also should not estrange the power users, because the &quot;advanced mode&quot; should still be available with a simple toggle.  It's about increasing accessibility, not reducing depth.\r\n\r\n<br>\r\n\r\n(Also, I tried posting this through Chrome as an experiment, and both the actual post and this edit both were sans the formatting bar.)",
    "PostedDate": "2010-07-13T10:37:41.687-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "467997",
    "ThreadId": "217883",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>BrWarner wrote:</strong><br>UI enhancements should always be moving up - no complaint from the &quot;hardcore&quot; should be expected.  Adding a &quot;beginner's mode&quot; also should not estrange the power users, because the &quot;advanced mode&quot; should still be available with a simple toggle.  It's about increasing accessibility, not reducing depth.  <br> (Also, I tried posting this through Chrome as an experiment, and both the actual post and this edit both were sans the formatting bar.)</blockquote>\r\n<p>I would disagree with that always being as you say.&nbsp; The green diamond functionality is perhaps one section that could be redesigned any number of ways.&nbsp; At current unless somoene tells you about it or you watch a video you'll probably never figure out on your own what those diamonds do nor how to get the elusive blue diamonds or the even more elusive blue diamonds with little red dots.&nbsp; The system is entirely functional.&nbsp; It is not, however, that intuitive.&nbsp; Making things more accessible and intuitive is the job of the UI.</p>\r\n<p>Increasing accessibility does not always reduce depth, true, but it will change how something is interfaced with.&nbsp; Your hardcore, your superfans (also sometimes your sticks-in-the-mud) may very well hate whatever new and interesting way someone might come up with to do the diamond function in a more intuitive and newbie friendly way.&nbsp; UI progress should not always include a &quot;put it back the old way&quot; toggle when you didn't lose functionality, you just changed method.</p>",
    "PostedDate": "2010-07-15T15:50:15.333-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "468038",
    "ThreadId": "217883",
    "Html": "<p>If the functionality is still there, and made more accessible, the power users WILL NOT CARE.&nbsp; A) they can get the same job done, B) they can do it in a more intuitive way.&nbsp; Now, I'm not saying that every single person will like every single change.&nbsp; I am saying that the vast majority will either welcome changes or not care one way or the other, as long as they have the same flexibility as before, and especially if the interface is more intuitive than the previous iteration.</p>\r\n<p>There's some things that make sense to include an &quot;old way&quot; toggle.&nbsp; If we end up creating a &quot;simplistic wizard&quot; interface for new users, and keep the more powerful, in-depth options available for the power users, then that's a good thing.&nbsp; Keeping an old interface for item selection when we completely revamp it, while keeping all of the same functionality in the new iteration, is a bad idea.&nbsp; It's not an all or nothing deal.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-07-15T20:36:06.503-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "471042",
    "ThreadId": "217883",
    "Html": "That reminds me - if you were thinking of redesigning the diamond interface when picking gear for the optimiser  I think it'd make sense (to newbies) to break it into two lists. One is the &quot;all gear&quot; list and the other is the &quot;gear to be checked in optimiser&quot; list. Behind the scenes everything works the same, you just make the selection interface different.",
    "PostedDate": "2010-07-22T07:14:17.013-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]