[
  {
    "Id": "462966",
    "ThreadId": "218223",
    "Html": "<p>I have a Healing and DPS gear set.&nbsp; If I log out in DPS gear, I can't do comparisons on new healing items.&nbsp; Is there a way to save your sets to recall them later regardless of what your last save was or what gear you last logged out in?</p>",
    "PostedDate": "2010-07-02T22:53:36.053-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "462967",
    "ThreadId": "218223",
    "Html": "<p>Uh... File &gt; Save? You shouldn't be loading/reloading from armory every time.</p>",
    "PostedDate": "2010-07-02T22:56:33.623-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "463075",
    "ThreadId": "218223",
    "Html": "<p>Your missing what I'm asking.</p>\r\n<p>&nbsp;</p>\r\n<p>Dual Spec Druid, Kitty and Tree.&nbsp;</p>\r\n<p>I log out on Monday as Kitty, I just got some new gear, so I open up Rawr and reload from Armory to get my new stuff in there and do some comparisons.</p>\r\n<p>Tuesday, still as kitty in armory and in Rawr, but I'm about to do an ICC 25 as my main spec resto, so I want to see if what drops off of Heroic Marrowgar is an upgrade or not.&nbsp;</p>\r\n<p>Open up rawr, still in my DPS gear/spec.&nbsp; As far as armory is concerned, I'm still in kitty gear so a reload from armory is not an option to display my tree gear. So I can't really see what my tree is wearing to compare.</p>\r\n<p>&nbsp;</p>\r\n<p>I'm trying to avoid having to File &gt; Save&nbsp; Druid_Kitty every time I'm in cat spec and File &gt; Save Druid_Tree when I'm in resto spec. I'm hoping that hidden in there is a 'save equipment set as..'' option that I can use to change the currently equipped gear, but still retain my single database of all items I have available.</p>",
    "PostedDate": "2010-07-03T07:55:15.937-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "463082",
    "ThreadId": "218223",
    "Html": "<p>You have to save separate files for each of your specs.</p>",
    "PostedDate": "2010-07-03T08:37:23.143-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "463108",
    "ThreadId": "218223",
    "Html": "<p>A single database (assuming you mean like what you have available) of all items is specifically what you <em>don't</em>&nbsp;want, trust us. You should save a separate Rawr character file for each spec. When you get new gear, you can either manually, add it, or use reload from armory after logging off in that spec's gear.</p>",
    "PostedDate": "2010-07-03T10:55:55.06-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "463131",
    "ThreadId": "218223",
    "Html": "<p>I keep a &quot;Gear.xml&quot; set loaded with all my gear (using character profiler, which marks all the gear from my bags as available).</p>\r\n<p>I then have various other models (resto.xml, moonkin.xml) for different specs or fight conditions.</p>\r\n<p>I then run batch tools, batch optimize or progressive optimize, with &quot;gear.xml&quot; as my &quot;first&quot; set.</p>\r\n<p>Admittedly, I would very much like the interface to let me copy &quot;available gear&quot; settings from one model to another.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-07-03T13:56:41.14-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "463155",
    "ThreadId": "218223",
    "Html": "<p>Pretty sure there is an option in the batch interface to do just that.</p>\r\n<p>&nbsp;</p>\r\n<p>That said, everyone please do keep in mind, that you specifically do <strong>not</strong>&nbsp;want all your gear in one file, for normal optimization, because it clutters up what the optimizer has to look through, and significantly degrades performance and accuracy. Only keep what's actually potentially useful as available.</p>",
    "PostedDate": "2010-07-03T15:26:16.12-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "463161",
    "ThreadId": "218223",
    "Html": "<p>I have set up two different batches for my druid.&nbsp; One does my Kitty &amp; Bear gear and the other does Tree/Boom gear.&nbsp;&nbsp; I used to have them all together but the optimiser doesn't like it.&nbsp;&nbsp; You end up having so many gems, enchants &amp; armor pieces selected that an optimiser takes ages.&nbsp;&nbsp; Separating them out for each spec is much faster.&nbsp;&nbsp;&nbsp; I maintain up to date tree &amp; kitty files.&nbsp;&nbsp; If I want to update my tank gear for instance, I load up my feral batch which has kitty then bear in it.&nbsp; I select the kitty file and hit &quot;tools&quot; + &quot;Set available items&quot; to mark all my kitty gear available to my tank file.&nbsp;&nbsp; Then I can run a progressive optimise to re-do my kitty and tank gear.</p>\r\n<p>&nbsp;</p>\r\n<p>90% of the time now, I have just my kitty &amp; tree files loaded.&nbsp;&nbsp; Once you have loaded each for the first time in a session, it is quick to switch between them and I normally do a quick switch between to check for upgrades in coming fight.</p>",
    "PostedDate": "2010-07-03T15:54:49.313-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "463199",
    "ThreadId": "218223",
    "Html": "<p>Right, but I have to reiterate, it's not just slowing down the optimizer, but also reducing its accuracy as well.</p>",
    "PostedDate": "2010-07-04T00:30:37.537-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "463318",
    "ThreadId": "218223",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>Astrylian wrote:</strong><br>\r\n<p>Pretty sure there is an option in the batch interface to do just that.</p>\r\n<p>&nbsp;</p>\r\n<p>That said, everyone please do keep in mind, that you specifically do <strong>not</strong>&nbsp;want all your gear in one file, for normal optimization, because it clutters up what the optimizer has to look through, and significantly degrades performance and accuracy. Only keep what's actually potentially useful as available.</p>\r\n</blockquote>\r\n<p>Never considered that.&nbsp; Thank you for the info, two files it is.</p>",
    "PostedDate": "2010-07-04T17:26:25.8-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]