[
  {
    "Id": "463856",
    "ThreadId": "218482",
    "Html": "<p>It seems to me that the hunter gemming templates that are included are excessive, and are severely impacting the processing time of the Optimizer. &nbsp;I think I lost count during one of the scrolls, but there are approximately 50 epic gemming templates in the hunter module. &nbsp;Whenever I run optimize without manually disabling some portion of the templates, I get the &quot;very large number of items&quot; message for Gems, Chest, Waist, and Legs. &nbsp;I currently only have 2 items for each gear slot selected, so I'm assuming it's pitching a fit based on 2-3 gem slots x 50 gemming options per item.</p>\r\n<p>I realize that I can turn them off, but they're turned on by default in every new release. &nbsp;Perhaps it would be possibleto eliminate some portion of them? &nbsp;I really fail to see a situation where four +10 Mp5 gems will be an appropriate gemming, and so there's my first nomination for deletion from the list.</p>\r\n<p>&nbsp;</p>\r\n<p>{edit} And I didn't put this in issue tracker. &nbsp;I'm such a bad. &nbsp;I'd delete it and move it if I could. &nbsp; /hideface</p>",
    "PostedDate": "2010-07-06T10:04:52.997-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "463857",
    "ThreadId": "218482",
    "Html": "<p>They were put in there cuz I had too much bitching about them *not* being in there.</p>\r\n<p>So which is it community? Include them all and make 50% of you happy or take them out and make 50% of you happy?</p>",
    "PostedDate": "2010-07-06T10:15:41.667-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "463873",
    "ThreadId": "218482",
    "Html": "<p>Ugh. Jothay, you can set default hemming templates to Enable=false, you know. Include them all, preferably in descriptive groups, and disable by default all the ones not typically useful.</p>",
    "PostedDate": "2010-07-06T11:00:32.807-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "463888",
    "ThreadId": "218482",
    "Html": "<p>Jothay, <span>\\jō</span>-<span><span>ˈ</span>thā</span><span>\\ : noun</span></p>\r\n<p><span>one who incites or escalates preexisting confrontations, often by coming up in arms; not to be confused with an Astrylian, which refers more to a bear-like mauling of a victim's face due to hunger, or a disruption of a nap</span></p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p><span>I jest!&nbsp; =D<br></span></p>",
    "PostedDate": "2010-07-06T11:46:49.583-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "463894",
    "ThreadId": "218482",
    "Html": "It's awesome that you managed to put the right pronunciation on there. Most people mistake it for 'Jawthy'. I blame Farscape.",
    "PostedDate": "2010-07-06T11:52:56.353-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "464016",
    "ThreadId": "218482",
    "Html": "<p>I personally enjoyed writing the little pun.&nbsp; :P</p>",
    "PostedDate": "2010-07-06T17:17:04.67-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]