[
  {
    "Id": "465196",
    "ThreadId": "218863",
    "Html": "<p>in rawr 2.3.20 under the options/raid buff tab what would be a good number for raid damage per point of spell power. Looking at 25 man raid buffed, i searched around and cant find a reference as to how much sp would convert via demonic pact into what amount of raid dps. Any ideas on this as id like to be able to monitor my person dps changes vs overall raid dps changes as a demo buffer.</p>",
    "PostedDate": "2010-07-08T21:04:15.92-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "465218",
    "ThreadId": "218863",
    "Html": "That is a MOST excellent question, and it is the perfect one to be asking.  I would take a sample of a few of your raid members who benefit from your buff, load them up into Rawr, and see what the relative stat values chart says for spell power.  Perhaps someone else knows of some resources - some theorycrafting that has already been done to answer that question, to save soloreaper (and other demo warlocks) some time & effort?",
    "PostedDate": "2010-07-08T22:31:30.567-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "465233",
    "ThreadId": "218863",
    "Html": "<p>I think Kavan has already set up something in the mage section. One of the options asks what the warlock's SP for demonic Pact.</p>",
    "PostedDate": "2010-07-08T23:39:09.987-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "465483",
    "ThreadId": "218863",
    "Html": "<p>Or, you could use somebody else's answers.&nbsp; <a href=\"http://code.google.com/p/simulationcraft/wiki/SampleOutputT10#DPS_Scale_Factors\">http://code.google.com/p/simulationcraft/wiki/SampleOutputT10#DPS_Scale_Factors</a>.</p>\r\n<p>It shows most casters gaining 2.0 to 2.3 DPS per point of SP.&nbsp; Retribution gets between .2 and .3 DPS/SP, and Enhancement sees about .85 DPS/SP.</p>\r\n<p>I believe this is a t10 gear fight with Patchwerk mechanics.&nbsp; I don't think it includes the ICC aura.</p>\r\n<p>Simulationcraft doesn't do heals, but&nbsp;a TreeCalcs.xls Tree gets 4 to 4.5 raw HPS/SP when raid healing, and roughly 2.3 HPS/SP when healing a single tank (and spec'd for tank healing).</p>\r\n<p>ymmv.</p>",
    "PostedDate": "2010-07-09T08:52:05.55-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "465632",
    "ThreadId": "218863",
    "Html": "<p><strong>Perfect</strong> link, Erdluf.&nbsp; Thank you!</p>",
    "PostedDate": "2010-07-09T14:14:27.25-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]