[
  {
    "Id": "468817",
    "ThreadId": "219857",
    "Html": "Im using rawr for a while now and it helped me out so much, i got from mostly lowest dps to highest. But i am wondering if i can fine tune my rawr settings even more so i can get that little bit more dps out. I am willing re-gem, spec and enchant. <br><br>\r\n\r\nWhat i do now is:<br>\r\n- load fresh data from armory into rawr<br>\r\n- Make sure i got best enchants by clicking under the item on the left side.<br>\r\n- Go to tools-&gt; Optimize<br>\r\n- In here i chose &quot;dps rating&quot; but im not even sure what the best is.<br>\r\n- Everything else in optimization options i leave as it is because i dont understand it. I tried to click some of those options but then it is suggesting something completely different for me.<br><br>\r\n\r\nSo is this the best thing to do to optimize my dps or am i doing it wrong? ",
    "PostedDate": "2010-07-18T18:28:52.367-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "468824",
    "ThreadId": "219857",
    "Html": "<p>Sounds like you're doing it wrong. Have you read the documentation on gear optimization? There's some very extensive documentation available that will help you understand how to use Rawr to do exactly what you're talking about.</p>",
    "PostedDate": "2010-07-18T19:18:13.61-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "468941",
    "ThreadId": "219857",
    "Html": "I have read the documentation and the part i only seemed to have skipped is the selecting buff and marking the items. I left the buff as it is because i pug so i dont really know what i will get. About the marking part im not very sure, if i select for example my head gear then i see my equipped item marked with a green thingy, then isnt everything that is above the green thingy listed better? And that is how i am trying to use rawr by going for the highest listed item i have.",
    "PostedDate": "2010-07-19T04:05:46.727-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "469295",
    "ThreadId": "219857",
    "Html": "http://rawr.codeplex.com/wikipage?title=GearOptimization&referringTitle=Documentation\r\n\r\nThis page has what you're looking for.",
    "PostedDate": "2010-07-19T16:58:39.9-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "469416",
    "ThreadId": "219857",
    "Html": "You should never ever everever<i>everever</i> Optimize while unbuffed.  Even if you don't know what buffs you will be getting, optimize for the most likely available.  At the very least, check off the scroll buffs, any buffs you can apply yourself, and at least a few other that are likely to be present.  If you mostly do 10m, check off at least 2-3 others in addition to this.  If you do even a few 25s, you should have almost all, if not all of them marked as available.\r\n<br><br>\r\nAlso, from what you said, it doesn't seem like you're saving a profile for your character.  You should not be reloading from the armory every single time you want to play with your character in Rawr.  You should save a profile, and add/remove gear to that saved character as you progress, as opposed to creating an entirely new character repeatedly.\r\n<br><br>\r\nI'm confused as to why <i>you're</i> confused as to &quot;I tried to click some of those options but then it is suggesting something completely different for me.&quot;  Changing an input often changes the output.  Why is this surprising?  Is there something we could help with the user interface, to make it more accessible or understandable?",
    "PostedDate": "2010-07-20T00:26:15.667-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "469697",
    "ThreadId": "219857",
    "Html": "I am doing 10 man mostly indeed and ill try to tick some buffs i often find having them :) Thanks for that tip.<br><br>\r\n\r\nThat is indeed correct, im not saving them because once i get a gear that is better than my current equipped one i will use the new one and sell the old item. While im doing this i thought it was a good way to do it and i dont have to update it by keeping track of what im selling etc. But i think i will try to keep a saved profile from now on since i really like rawr.<br><br>\r\n\r\nAbout the options in optimize panel, I didnt really understood for example what override gem and reenchant did from reading what is above that, but after browsing for a while i found out that you could lock some options out like gemming and enchanting with the red diamond and could ignore the red diamond with the tick on these two options. It does say there is a documentation about the gemming and enchanting but it would be nice if it was clickable to go to that specific part of documentation.<br><br>\r\n\r\nAs for the other options like food, elixer etc under regem and reenchant i still dont really know what it does, didnt i already chose those in the buff tab?<br><br>\r\n\r\nps. I tried to mark some of the enchants i got avaible but i have all enchants avaible since i will either buy the scrolls or make them myself, do i have to click mark all the enchants on every item by hand?",
    "PostedDate": "2010-07-20T06:58:39.47-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "469781",
    "ThreadId": "219857",
    "Html": "<p>When you get a new item, selling the old one is a bad idea, and is contributing to your misunderstanding of Rawr. Keep old items, it's very likely to be useful still. That's what you should mark available in Rawr.</p>\r\n<p>Optimizer food/elixir does exactly what it says it does; it optimizes your food and flask/elixir choice.</p>\r\n<p>Yes, you have to mark the items and enchants that you have available.</p>",
    "PostedDate": "2010-07-20T09:38:13.277-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "470755",
    "ThreadId": "219857",
    "Html": "<p>/agree with what astrylian said.&nbsp; don't sell old items the moment you replace them.</p>\r\n<p>Many times getting the best DPS means juggling around cappable stats such as hit rating, expertise, haste (which has soft caps)...&nbsp; You can upgrade to a better item, but that may mean you are no longer capped in a certain stat.&nbsp; This could mean that some older item which has a lot of that cappable stat suddenly becomes better.</p>\r\n<p>You can safely sell/nuke an item if:<br>- Your new item is a point for point improvement.&nbsp; As in, it has all the same kind of stats, and each one is better.&nbsp; This is typical for the normal mode vs heroic mode version of an item.<br>- the old item does not have any kind of cap stats<br>- the old item is multiple&nbsp;tiers below what you have now.&nbsp; (If you have a T10 class (232/245) item, then an older T7 (200/213) is very unlikely to ever pop up as best).</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>The idea is that you keep your older items, but mark them with a green diamond.&nbsp; This tells the optimiser you have this item available.&nbsp; When optimising, the optimiser will then look at all the items you have access to, and suggest which combination of item/gem/enchant is best.</p>",
    "PostedDate": "2010-07-22T02:08:37.417-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]