[
  {
    "Id": "473772",
    "ThreadId": "221719",
    "Html": "Was playing with my DK talents and was trying to work out if 2 points in Improved Unholy Presence and dpsing in Unholy Presence would be better for dps then not and sticking with blood Presence, is there an option you select and show you the score in either presence? If not would be a great idea as this would be good for other classes also with stance changes.",
    "PostedDate": "2010-07-28T09:38:19.923-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "473783",
    "ThreadId": "221719",
    "Html": "<p>When the issue tracker comes back up, we can move this to there.&nbsp; I agree that there could be some value to determine presence differences to see if there's a reasonable DPS difference.&nbsp;</p>",
    "PostedDate": "2010-07-28T10:02:51.157-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "473796",
    "ThreadId": "221719",
    "Html": "Wicked cant wait to see the results =)",
    "PostedDate": "2010-07-28T10:29:53.06-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "473806",
    "ThreadId": "221719",
    "Html": "<p>I would have to agree having the different presences could be useful. Especially frost presence in cata when it increases <span>Runic Power generation by 10% in addition to the 10% increase in damage. Also Unholy's 15% increase in speed would make it so that DKs would not have to enchant for Tuskanarr's Vitality.<br></span></p>",
    "PostedDate": "2010-07-28T10:59:42.88-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "473865",
    "ThreadId": "221719",
    "Html": "<p>Would having it on the &quot;Buffs&quot; list work for ya?&nbsp; So you can compare different buffs by looking for &quot;Blood Presence&quot;, &quot;Unholy Presence&quot;, or &quot;Frost Presence&quot; on the buff drop down chart?</p>",
    "PostedDate": "2010-07-28T13:06:02.56-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "473886",
    "ThreadId": "221719",
    "Html": "<p>I was under the impression that the buff tab was to be used for global buffs, not spec specific. Wouldn't it be better to put it in the options tab? default it to Blood (or frost come cata).</p>",
    "PostedDate": "2010-07-28T13:46:44.14-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "473911",
    "ThreadId": "221719",
    "Html": "<p>Sorry... I didn't mean the buff tab.&nbsp; Setting Presence would be on the options tab on the left side of the UI.&nbsp; I was looking for which section should I display the results.&nbsp; I was thinking that I could use the Buff infrastructure to display the benefits of that given presence. (And may use that infrastructure for consolidating certain things under the hood.)</p>",
    "PostedDate": "2010-07-28T14:57:55.923-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "473914",
    "ThreadId": "221719",
    "Html": "<p>http://rawr.codeplex.com/workitem/18313</p>",
    "PostedDate": "2010-07-28T15:19:52.777-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "473940",
    "ThreadId": "221719",
    "Html": "No, not in the Buffs Chart group, just make a Custom Chart (See DPSWarr in Rawr2 for an example) for it, name it &quot;Presences&quot;. It creates a new chart in the UI automatically with whatever calcs you set it against.",
    "PostedDate": "2010-07-28T16:48:48.963-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "473941",
    "ThreadId": "221719",
    "Html": "<p>Sounds good.&nbsp; I figured making presences a buff might simplify a number of things, but you're right, it's probably better to have it broken out.</p>\r\n<p>This is why I ask these kinds of questions.</p>",
    "PostedDate": "2010-07-28T16:53:15.277-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]