[
  {
    "Id": "474470",
    "ThreadId": "221919",
    "Html": "Currently, using Rawr3, when I run a Build Upgrade list it includes every possible entry in the filtered gear list, leaving me with items on the list that are not one's I'm willing to consider/have access to.  Is there a way to restrict the Upgrade list to only those items I've flagged for consideration by the optimiser or better yet force it to produce a ranked list of the improvement each piece of the optimised gear-set represents?  This would make deciding which piece to go after first much easier.",
    "PostedDate": "2010-07-29T14:58:41.303-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "474475",
    "ThreadId": "221919",
    "Html": "That's the difference between the optimizer and the upgrade list.  Anything you mark w/ the Green/Blue diamond in the list, are things that you currently have, or will be acquiring in the near term that should be &quot;what you can do now.&quot;  The Upgrade List what exists beyond that within the filtered gear list.  It's looking into the future and telling you where you should be looking for that NEXT item.  \r\n\r\nOptimizer: Current Gear.\r\nUpgrade List: Next Gear.\r\n\r\nIf you want fewer items on your Upgrade list, use a more restrictive filter  E.G.  Don't put in all of ICC when you're only working on ICC 10 man normal.",
    "PostedDate": "2010-07-29T15:12:11.087-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "474500",
    "ThreadId": "221919",
    "Html": "<p>In other words, the Optimizer considers what you <em>have</em> available (how best to make use of what you have), and the Upgrade list considers what you <em>don't have</em> available (looking at, well upgrades).</p>",
    "PostedDate": "2010-07-29T16:41:47.67-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "475422",
    "ThreadId": "221919",
    "Html": "<p>Optimizer = Make the most of what you have.&nbsp;&nbsp; Under the assumption that enchants and gems are 'easy' (although maybe costly) to change, whereas gear is not as easy to get since you can't control drops.&nbsp; You mark what you have available with the green diamonds, and the optimizer will tell you which pieces of gear to combine using what enchants/gemmings.&nbsp;&nbsp; This optimizing&nbsp;often involves working around hard/soft caps like hit, expertise, haste, defense, crit, etc.</p>\r\n<p>Upgrade list = what you would like to have.&nbsp; You restrict this list via the filters.&nbsp; If you'll never do ICC25, then untick the ICC25 filter, and it won't suggest ICC25 gear.</p>",
    "PostedDate": "2010-08-02T06:09:18.66-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]