[
  {
    "Id": "477530",
    "ThreadId": "222769",
    "Html": "<p>I would like to know why the boomkin setup doesn't seem to compare main hand and off hand as weapons.... only 2h ie staff. I  find info all over that seems to lead that a mh+oh is better for a  spellcaster/boomkin... but I can not get Rwar to do so. am I missing  something here?</p>\r\n<p>even the possible upgrades and not link to a main hand and off hand option.. so I find it very difficult to see the various combos that could be possible.</p>",
    "PostedDate": "2010-08-06T15:17:11.417-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "477532",
    "ThreadId": "222769",
    "Html": "<p>Do you have an OH equipped? Sounds like you need to equip an OH.</p>\r\n<p>MHs are valued combined with the equipped OH, and vice versa, so that they can be compared to 2H.</p>\r\n<p>&nbsp;</p>\r\n<p>Also, it sounds like you would probably benefit from reading the help on gear optimization as well.</p>",
    "PostedDate": "2010-08-06T15:26:17.76-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "477649",
    "ThreadId": "222769",
    "Html": "<p>The chart on the right just gives you scores, assuming one piece of gear is changed at a time.</p>\r\n<p>If you are just looking at the chart on the right, and you currently have a 2H equipped, a 1H will score poorly (since it is being used without an OH).</p>\r\n<p>Use the optimizer, or at least start with 1H+OH equipped, to get a better evaluation of 1H+OH options.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-08-07T10:13:10.517-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "477677",
    "ThreadId": "222769",
    "Html": "<p>ah ok.. I will give it a go. I already have a few combos i can select from my bags... for oh +mh.. I thought that it would have done a direct comparison side by side 2h Vs the comboe of MH+OH.</p>\r\n<p>most of my tinker time on rawr HAS been late atnight... so maybe&nbsp; I will do it when a bit corpus mentus:P)</p>",
    "PostedDate": "2010-08-07T16:10:05.497-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "477681",
    "ThreadId": "222769",
    "Html": "<p>That's what I'm saying; it *will* compare MH+OHs against 2Hs.</p>",
    "PostedDate": "2010-08-07T16:46:03.69-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]