[
  {
    "Id": "478089",
    "ThreadId": "222927",
    "Html": "<p>I wasn't around when you guys started on the TBC-&gt;wotlk version. So just throwing this in for discussion.<br><br>What's the overall plan of attack for WOW 4.0 (which is likely going to be a good month or more before cata release)?</p>\r\n<ul>\r\n<li>Model changes,</li>\r\n<li>﻿Talent tree changes (shorter trees, abilities from your main tree, mastery from talent points)</li>\r\n<li>Removal of stats, new stats like mastery</li>\r\n<li>Stat bonus for wearing &quot;your&quot; armor type exclusively (+5% I think it was).</li>\r\n<li>Reforging</li>\r\n<li>New racials</li>\r\n<li>Items are totally different stat-wise (2nd item database) ?</li>\r\n</ul>\r\n<p>Is the plan to have a build with a &quot;live&quot; or &quot;cata&quot; switch ? or are we going to just stop making a rawr for live and change everything over to cata ?&nbsp; or is the plan to fork a source tree and keep a live version running to fix bugs while having a cata build for the new stuff ?&nbsp;&nbsp;</p>\r\n<p>An actual timeline is still too early, cata itself is still in heavy flux and stuff gets changed every time you blink your eyes.&nbsp; but a rough plan should be doable ?</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-08-09T06:43:59.017-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "478286",
    "ThreadId": "222927",
    "Html": "<p>Well, I wouldn't worry about model changes now. Personally I would not touch the modeling until about 2 months prior to release. Back when Wrath came out, the patch for it took place a month prior to the release of the expansion. Those last two month though, there was VERY LITTLE changes to the trees. There were some just minor tweeks here and there, but generally what we saw about a month prior to patch 3.0, was basically final. So having the models worked on 2 months prior to release is a good time to work on them. This goes with all tree talents, stats, etc.</p>\r\n<p>There is already some Cata stuff already in. Mastery stat is in just I have not gotten around to looking at WoWhead's import to allow for it (well I tried locally just was having issues changing the ptr website to cata.wowhead.com).</p>\r\n<p>Reforging could be implemented now just not activated.</p>\r\n<p>Racials would probably be put in that last 2 months, though having basic racial information (Worgens are considered Alliance, Goblins are considered Horde) can probably put in now.</p>\r\n<p>Items again will be last. Once things start settling down, I can start adding items to the list. If I remember correctly, back at the beginning of wrath, RAWR did have lvl 70 gear in Naxx time frame. But once Ulduar hit, the lvl 70 gear was phased out.</p>",
    "PostedDate": "2010-08-09T14:20:57.847-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "478401",
    "ThreadId": "222927",
    "Html": "<p>To me, one of the major things is working out how Reforging will be implemented in the UI and be treated with the optimiser.&nbsp;&nbsp; It adds a whole layer of complexity to the optimisation process if even if you only have one item for that slots there is 4-5 different iterations of it to be considered due to reforging.&nbsp;&nbsp; Things like changing the models is all background stuff (other than a few changes in the options page), reforging is going to require some hefty UI work.</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-08-09T21:18:02.393-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "478597",
    "ThreadId": "222927",
    "Html": "<p>IDK about huge UI changes:</p>\r\n<ul>\r\n<li>2, maybe 3 charts</li>\r\n<li>A&nbsp;change to the base class that generates the Item Buttons (where your currently equipped gear is shown) to add a section similar to enchants for selecting reforges will change all the buttons at once</li>\r\n<li>The Optimizer gets an additional checkbox for optimizing with reforging in mind</li>\r\n</ul>\r\n<p>That could all be done in just a couple of hours.</p>",
    "PostedDate": "2010-08-10T07:10:43.183-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]