[
  {
    "Id": "482232",
    "ThreadId": "224077",
    "Html": "<p>I got a token for a new sanctified piece tonight, so when I got to work later I pulled out my laptop, loaded up my bear's file, used &quot;Equip All&quot; from the item I wanted in the upgrade list, and got a score some 2k higher. Works for me.</p>\r\n<p>I then marked the new piece available on the main window and ran the optimizer. Much to my surprise, it came up with a score that was another 4k higher. Then, my brain disengaged... curiosity made me dump that optimization to copy the original file's stats to clipboard so I could see what changed and how, and I did so without saving that great optimization.</p>\r\n<p>And now, hours later, I still can't get Rawr to come back up with it. It was something just over 708,000, but I can't get any higher than 707,215, even when I've cut out as many options&nbsp;as I could that I thought were not included in that +708k score.</p>\r\n<p>I understand about limiting options and how the genetic logarithm can't possibly analyze every single iteration every time. I'm wondering what else I can do to help. As mentioned, I tried cutting out gear/gem/chant options I'm fairly certain were not in that result. Does the optimizer use up temp cache or some such? Does a reboot of the computer help, or closing/restarting Rawr?</p>\r\n<p>Knowing I foolishly lost a better score that has since eluded me is a painful feeling.</p>",
    "PostedDate": "2010-08-19T03:25:11.68-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "482364",
    "ThreadId": "224077",
    "Html": "<p>I don't believe that any of the options you mentioned would help force the optimizer to come back to that result. Unfortunately, there's nothing we can really do as there's no cached place where you can pull that optimized set from.</p>\r\n<p>This does beg the question whether a new Feature Request should be opened in the Issue Tracker for saving the Optimized set into the Set Comparisons list(which is an undeveloped but partially existing feature). Then users could have an option to save the set instead of discarding it if they need to do something to/with their original before applying.</p>",
    "PostedDate": "2010-08-19T08:28:09.87-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "483148",
    "ThreadId": "224077",
    "Html": "<p>An interim solution would be to add an extra button. So in addition to &quot;Load Character with Optimised Set&quot;, we could add a &quot;Save optimised Set&quot; button which would simply save the optimised character to disk, without actually losing the current loaded character data by loading the optimised set.</p>\r\n<p>At present we present the user with 2 options - abandon your current character settings and load new set - or - abandon this optimised set and return to your previous character settings. A &quot;save this set I've found&quot; without actually loading it might be a very useful option.</p>",
    "PostedDate": "2010-08-21T14:57:11.73-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "483149",
    "ThreadId": "224077",
    "Html": "<p>Sounds like a good idea to me</p>",
    "PostedDate": "2010-08-21T15:11:09.903-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]