[
  {
    "Id": "482076",
    "ThreadId": "224019",
    "Html": "<p>i was wondering if you have a feature that would let me over write and use the 2 piece t9 mage set bonus without the gear. its the extra crit from spi buff. the reason i ask is because if i equipe 2 peice t9 and buff with molten armor and then equipe my regular gear, it still gives me the the 2 peice t9 crit bonus still. i am sure blizzard will change that some day but for now its nice and gives me an extra 2% crit or so. i just want to know because that could make some spirit gear a possibility again</p>\r\n<p>&nbsp;</p>\r\n<p>thx</p>\r\n<p>Nitrax</p>",
    "PostedDate": "2010-08-18T15:46:42.627-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "482079",
    "ThreadId": "224019",
    "Html": "See this closed thread. I gave a link to an elitist jerks posting that explains how to force the 2-piece T9 bonus in RAWR. But for all functionality, we are not going to implement it as a standard.<br>\r\n<br>\r\nhttp://rawr.codeplex.com/workitem/18383",
    "PostedDate": "2010-08-18T15:53:34.59-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "482089",
    "ThreadId": "224019",
    "Html": "Please note, I don't advocate changing Rawr for this, but the fix is only of some use.    For a start, equipping the 2pcT9 means your spirit changes, so just adding the bonus to T10 is not accurate.\r\n\r\nI personally have put together a &quot;spirit set&quot; which includes several old pieces of gear with spirit and also gemmed with spirit gems (only the +16 spi gems).   This set has a couple of hundred spirit more than my standard gear and so makes a pretty significant increase to the amount of crit gained by the 2pcT9 bonus.    I wait till I have my Kings, Spirit & MotW buffs then use outfitter to switch, buff and switch back.    Even without using a separate set using T9 this way is a very big buff and I would encourage other mages to try it and see just how much crit rating it gets you.    \r\n\r\n",
    "PostedDate": "2010-08-18T16:12:39.157-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "482092",
    "ThreadId": "224019",
    "Html": "From what I'm hearing it scales after you switch back. Meaning if you had 400 Spirit when you cast did the bug, switch to your normal T10 gear, then afterwards get kings, mark, and Spirit buffs; the bug will also factor in the new spirit. I think it's because of the type of Moltan Armor that is being affected, not the &quot;here and now&quot; bug.",
    "PostedDate": "2010-08-18T16:19:19.573-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "482362",
    "ThreadId": "224019",
    "Html": "<p>thanks guys. the links got me to what i needed.</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-08-19T08:25:03.553-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]