[
  {
    "Id": "483206",
    "ThreadId": "224385",
    "Html": "<p>This may seem simple, but how difficult would it be to add an item (under options or help maybe) to reset the entire program back to the defaults -- essentially reinstalling it.</p>\r\n<p>I've had reinstall the original program occassionally when doing something like deleting all the filters, and the ability to do that in the beta would be useful, and save a lot of pain for many of us.</p>\r\n<p>Thanks,</p>\r\n<p>Sgent</p>",
    "PostedDate": "2010-08-21T23:13:42.023-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "483208",
    "ThreadId": "224385",
    "Html": "<p>That exact option already exists.</p>",
    "PostedDate": "2010-08-21T23:27:13.383-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "483343",
    "ThreadId": "224385",
    "Html": "<p>You can reset all the options, but not changes to the data files, filters etc.&nbsp;&nbsp;&nbsp; To do this, Rawr would need to keep duplicate copies of those files.&nbsp;&nbsp; With how easy it is to download and install, it is probably not worth the effort.</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-08-22T15:45:52.17-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "483344",
    "ThreadId": "224385",
    "Html": "<p>The last menu on the bar option before Help has options to reset all the caches, which should be every XML file we use. It does this by re-downloading those files in a zip from the server.</p>",
    "PostedDate": "2010-08-22T15:52:37.91-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "483360",
    "ThreadId": "224385",
    "Html": "<p>So, like I said, that exact option already exists.</p>",
    "PostedDate": "2010-08-22T17:09:58.45-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "483401",
    "ThreadId": "224385",
    "Html": "<p>Thanks for the information... obviously it was a bit of user error. &nbsp;Thanks Jothay for saying where the feature was located, as I obviously hadn't found it.</p>\r\n<p>And thanks for Rawr!!!</p>",
    "PostedDate": "2010-08-22T20:39:34.52-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "483403",
    "ThreadId": "224385",
    "Html": "<p>I don't get it. <strong>You</strong>&nbsp;said exactly where it is, in your OP.</p>",
    "PostedDate": "2010-08-22T20:53:56.183-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "483436",
    "ThreadId": "224385",
    "Html": "<p>Yea, but I didn't understand what it was called, or I made a mistake and just missed it.</p>\r\n<p>Another issue I'm running into (you maybe already aware) is that the beta seems to not be deslecting properly.</p>\r\n<p>For instance, when I click on Filter -&gt; Tier 7 Raids to remove them from the selected filiters, it removes &quot;Tier 7 Raids&quot; as well as the items directly under it (10 man, 25 man, other); however, it does not deselect the subtiers underneath that. &nbsp;For instance, Tier 7 - 10 Man - Nax is still selected after unchecking &quot;tier 7 raids&quot;.</p>\r\n<p>This maybe more user error on my part, or a legitimate bug, but I'm not having this problem in version 2.</p>\r\n<p>Thanks again for Rawr!</p>\r\n<p>Sgent</p>",
    "PostedDate": "2010-08-22T23:33:30.17-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "483444",
    "ThreadId": "224385",
    "Html": "<p>Yes, that's a bug, and has been fixed already, and will be included in the next version. All that info can also be found in the Issue Tracker.</p>",
    "PostedDate": "2010-08-22T23:52:29.91-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]