[
  {
    "Id": "483351",
    "ThreadId": "224436",
    "Html": "<p>So I remember the doo-doo storm that would be impending when the last guy who was in charge of the Lock module would get asked this.&nbsp; However, the people taking charge of it jumped in full-throttle, but now there hasn't been any news lately that I can see.&nbsp; Any chance of getting an update on the state of locks in rawr?</p>\r\n<p>Thanks in advance, and thanks for your hard work.</p>",
    "PostedDate": "2010-08-22T16:44:36.65-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "483354",
    "ThreadId": "224436",
    "Html": "<p>Is there something specific you are looking for?</p>\r\n<p>Generally, a lack of both complaints and news updates means there's nothing majorly .wrong</p>",
    "PostedDate": "2010-08-22T17:04:07.563-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "483357",
    "ThreadId": "224436",
    "Html": "<p>I haven't been keeping up, honestly.&nbsp; I had a bit of a break from the game.&nbsp; The last time I was using it, it was unusable for 2/3 specs iirc, and pets had not been implemented.&nbsp; I didn't see anything after mid-July, I think, on the discussion, so I wasn't sure if any of that had happened.</p>",
    "PostedDate": "2010-08-22T17:07:23.293-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "483358",
    "ThreadId": "224436",
    "Html": "<p>Xemnosyst is unable to continue working on it, so we're once again looking for a Warlock developer.</p>",
    "PostedDate": "2010-08-22T17:09:17.61-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "483362",
    "ThreadId": "224436",
    "Html": "<p>Interesting.&nbsp; Please forgive the likely stupid question, but how deep does the programming language need to be to work on this?&nbsp; I have the time and class knowledge to figure this out if it's not heavy.&nbsp; I know object-oriented in very basic terms.&nbsp; I can learn a bit to fill in, but if the coding part is the problem with implementation, it probably doesn't make sense.</p>\r\n<p>Again, I likely know the answer, but given that I'm more than willing, it's stupid not to ask.</p>",
    "PostedDate": "2010-08-22T17:13:38.167-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "483363",
    "ThreadId": "224436",
    "Html": "<p>http://rawr.codeplex.com/wikipage?title=Development%20Applications&amp;referringTitle=Home</p>",
    "PostedDate": "2010-08-22T17:14:39.103-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "484831",
    "ThreadId": "224436",
    "Html": "<p>You can see what's still unimplemented on the Warlock model page (click documentation at the top, then scroll down to the models link, the find Warlock).&nbsp; Only the execute phase for Affliction (Demonology's is implemented) is really lacking.&nbsp; Everything else on the todo list is either icing on the cake or minor enough that it shouldn't affect gear choices in any significant way.</p>\r\n<p>For whoever takes over the project, I will be very happy to take them through the code I've written.</p>",
    "PostedDate": "2010-08-25T13:16:39.243-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "484902",
    "ThreadId": "224436",
    "Html": "<p>Xemnosyst,</p>\r\n<p>thanks for all your efforts to get this up to shape.&nbsp; you did A LOT to help make this class useable.</p>",
    "PostedDate": "2010-08-25T16:48:54.213-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]