[
  {
    "Id": "483918",
    "ThreadId": "224596",
    "Html": "<p>This is going to sound weird and I am not sure what the actual reason is, but Rawr3 &quot;hurts&quot; my eyes a lot more than Rawr2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Particularly the names of the items in the comparison pane.&nbsp; This may be the font or font size (or even to do with my monitor or resolution), but I immediately notice the difference when I alt-tab to Rawr2.&nbsp;&nbsp;&nbsp; I've tried both the online and offline Rawr3's.</p>\r\n<p>&nbsp;</p>\r\n<p>I haven't noticed this on other applications or websites.&nbsp;&nbsp; I'm using a Dell 24&quot;monitor at 1920x1200 and 60Hz.&nbsp;&nbsp; Using 2x ATI HD5970's as graphics cards.&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>It may of course just be me, but I figure it was worth mentioning.</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-08-23T20:34:00.123-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "483919",
    "ThreadId": "224596",
    "Html": "<p>A) What's with all the extra whitespace?</p>\r\n<p>B) Do you have a screeny of what it looks like on your system side by side? If there's something obvious we can look at ok, but if it's just your eyes we'll have to find some way of activating the Accessibility options in Windows for you. Can you describe better the issue you are having? Are you straining to read the words for being too small, too narrow, etc?</p>",
    "PostedDate": "2010-08-23T20:37:21.853-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "483946",
    "ThreadId": "224596",
    "Html": "<p>Are you using an abnormal DPI (you shouldn't, fix that), or any browser zooming (again, you shouldn't, unless you're on a really small screen, which isn't your case). Those both are known to cause significant issues with text blurriness. Additionally, there are some changes to how the text renders that I'm looking into, and possibly changing the fonts used.</p>\r\n<p>&nbsp;</p>\r\n<p>But yeah, screenshots of what you see would be helpful.</p>",
    "PostedDate": "2010-08-23T22:36:57.86-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "484403",
    "ThreadId": "224596",
    "Html": "<p>Yeah sorry about the big gaps - I hit enter 1 extra time and Codeplex puts a 3 line space in....</p>\r\n<p>I guess it looks a bit blurry (i'm at work atm - it's not really noticeable here).&nbsp;&nbsp; Zooming isn't the issue, I actually played around with that to see if it improved things but it makes it worse, so I reset it.&nbsp;&nbsp; I'll have a look at other settings and take some screenies if I remember tonight - too often I start playing and forget to do stuff like that :)&nbsp;</p>\r\n<p>My eyes are OK so far - it is definitely something to do with my PC setup, but I haven't noticed anything like it with any other application/web page etc,.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-08-24T16:26:36.77-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "484415",
    "ThreadId": "224596",
    "Html": "You just don't see Silverlight much yet. ",
    "PostedDate": "2010-08-24T16:54:03.737-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]