[
  {
    "Id": "485014",
    "ThreadId": "224898",
    "Html": "<p>It looks like the Rawr 3 beta was updated as I see new gemming icons beside the equipment icons. The problem I'm having is ever since then, the item values seem really screwed up and are greatly skewed towards MP5 and Spirit, which as an Arcane mage is horrible. For instance, I have a Dislodged Foreign Object and Heroic Spyglass, yet it's now pushing the Talisman of Resurgence as my BiS? It's even suggesting I break my 4 piece T10 to put in items with a lot of Spirit or MP5.</p>\r\n<p>I checked my buffs section to make sure all my normal raid buffs are selected, but I just can't see why it has now started skewing all of my gear towards mana regen. This is on my Mac, so I have to run the browser version. Using the latest 2.x build on my PC exhibits no such problem.</p>\r\n<p>Am I the only one seeing this issue? I even tried to reset all caches, but that didn't revert it back to its normal behavior.</p>\r\n<p>Help? :)</p>",
    "PostedDate": "2010-08-26T01:19:02.59-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "485015",
    "ThreadId": "224898",
    "Html": "<p>We'd love to be able to help you, but we can't from what you've posted. See&nbsp;<a href=\"http://rawr.codeplex.com/wikipage?title=IDontUnderstandWhy&referringTitle=Documentation\">I Don't Understand Why...</a></p>",
    "PostedDate": "2010-08-26T01:20:59.187-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "485026",
    "ThreadId": "224898",
    "Html": "<p>According to your link, I had verified all settings hadn't changed from what they used to be. I've been using Rawr almost daily from this computer and it's been flawless up until an apparent upgrade that added features such as gem icons, but potentially breaking how my gear is calculated. But on to your checklist:</p>\r\n<ol>\r\n<li>Before doing anything else, please check our <a href=\"../wikipage?title=FAQ&referringTitle=IDontUnderstandWhy\">FAQ</a>, and don't forget to check for model-specific issues. (Done)</li>\r\n<li>Search for an existing entry in the Issue Tracker for the issue you're experiencing. (I checked and could find nothing back to June, even though this problem seemed to occur within the last week.)</li>\r\n<li>Read the <a href=\"../wikipage?title=BugReportingFormatGuide&referringTitle=IDontUnderstandWhy\">Bug Reporting Format Guide</a>.</li>\r\n<li>Post a bug report describing the issue.</li>\r\n<li><strong>Attach your character file to that issue.</strong></li>\r\n</ol>\r\n<p>Apparently this issue is too ambiguous for me to explain, so I'll just use the PC version for now. I had two other mages in my guild check and the same thing was occurring for them. But since I can't get you the details you need, I'll just stick with what's working. Thank you anyway for the response, I really do enjoy the program!</p>",
    "PostedDate": "2010-08-26T01:35:32.13-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "485276",
    "ThreadId": "224898",
    "Html": "<p>I'm sorry, it sounds like you may have misunderstood.</p>\r\n<p>&nbsp;</p>\r\n<p>We want to help you. In order to do so, we need you to provide an actual error report, including a character file reproducing the issue. Please provide that, so that we can help resolve this, especially if there is a bug.</p>",
    "PostedDate": "2010-08-26T09:42:30.76-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "488462",
    "ThreadId": "224898",
    "Html": "<p>I apologize, I did misunderstand the nature of your first post. I have submitted an item in the Issue tracker with what I hope is enough data to isolate the issue.</p>\r\n<p>Thank you very much for your work, I truly appreciate it!</p>",
    "PostedDate": "2010-09-02T13:06:39.377-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]