[
  {
    "Id": "487337",
    "ThreadId": "225554",
    "Html": "<p>Perhaps this is an intensely stupid question, but several permutations on search terms turned up no thread pertaining to this issue.</p>\r\n<p>What's the &quot;right&quot; way to update Rawr when a new version is released, without nuking custom filters and program settings?&nbsp; Every time I unzip the release and overwrite all of what's in there, my settings revert to default (as one would expect).&nbsp; I'm curious about what files, if any, I should selectively ignore when unizpping.</p>\r\n<p>Thanks!</p>",
    "PostedDate": "2010-08-31T20:48:27.15-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "487349",
    "ThreadId": "225554",
    "Html": "<p>The .xml files in the Data folder are all you can copy over from previous versions, and if you do so, you don't get any changes we've made to them since the last version. So, do so at your own risk. They're pretty self evidently named; ItemFilter.xml is the filters, for example. The 'settings' like things in the options dialog are not possible to copy over between versions.</p>",
    "PostedDate": "2010-08-31T21:41:38.133-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "487623",
    "ThreadId": "225554",
    "Html": "<p>Thanks for clearing that up, Astrylian.&nbsp; In the latest update, I unzipped everything *but* the ItemFilters.xml file (assuming what you said in your reply would be the case) and it preserved them.&nbsp;</p>\r\n<p>Are there any plans to include configuration propagation into Rawr in the future?&nbsp; It seems like breaking out the various things in the Options file and ItemFilters/etc. into config/ini files would be a fairly straightforward endeavor.</p>",
    "PostedDate": "2010-09-01T07:50:35.943-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "487705",
    "ThreadId": "225554",
    "Html": "<p>Already done, settings are preserved between versions in Rawr3.</p>",
    "PostedDate": "2010-09-01T09:50:33.227-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]