[
  {
    "Id": "487982",
    "ThreadId": "225730",
    "Html": "<p>Noob Question:</p>\r\n<p>How do you ensure that a certain talent (Readiness) is included in your build? &nbsp;I've tried using the Additional Requirements feature with values set to &gt;0.00, &gt;1.00, and &lt;0.00 just for good measure but it keeps passing up the talent. &nbsp;Is this a glitch, or am I doing it wrong?</p>",
    "PostedDate": "2010-09-01T21:34:08.627-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "488321",
    "ThreadId": "225730",
    "Html": "<p>Most of the time, Optimizing talents rare gives an actualized talent spec that works as expected.&nbsp; The unfortunate problem is that sometimes different talent trees play out very differently, or some talents don't have any numerical value though still provide significant utility.&nbsp; This is one of those situations where an &quot;optimized&quot; hunter tree doesn't really live up to expectations.&nbsp; It's usually better to build your spec, or have 2-3 different specs and optimize Specs.</p>",
    "PostedDate": "2010-09-02T08:49:23.557-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "488435",
    "ThreadId": "225730",
    "Html": "<p>Is there really a plan to continue the Optimize Talent option going into Cata? &nbsp;Since most of the talents are being changed to utility-types and the pure DPS/HPS talents are out, I think the devs would be hard pressed to have to find a formula for every single talent in every single tree for all 10 classes.</p>",
    "PostedDate": "2010-09-02T12:14:27.713-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "488479",
    "ThreadId": "225730",
    "Html": "Possibly. The issue with optimizing talents is that the model must value every talent, at least as an optimizable value. That's a lot of work. The benefit is primarily centered around talents that you may put more or less points into, depending on gear, mostly +Hit talents. With those being removed, most of the benefit disappears. ",
    "PostedDate": "2010-09-02T13:39:10.29-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "488485",
    "ThreadId": "225730",
    "Html": "<p>There are special talent constraints you can put to the optimizer that lets you force it to use a specific talent that the model gives no value but has other utility value that you want. Just select Talent in first dropdown and select the specific talent and set how many talent points you want in it. Another option would be to set up complete talent trees and save them in presets and then just optimize talent specs, but not talents.</p>",
    "PostedDate": "2010-09-02T13:46:34.453-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "488545",
    "ThreadId": "225730",
    "Html": "<p>Yeah, really the only place the talent optimiser would be very useful is trying to work out whether to take 1,2 or 3 points of that +Hit talent and then gear accordingly, so Kavans suggestion works (if you set up a spec for each option) but the usefulness of that also comes down to how many other preset talent specs are in the model and if you can tell the optimiser to ignore some of them (because maybe I want to be an Arcane Mage not a Fire Mage).</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-09-02T15:58:03.167-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "488562",
    "ThreadId": "225730",
    "Html": "<p>Even if presets aren't provided to you, you can save your own.</p>",
    "PostedDate": "2010-09-02T16:50:32.277-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "489047",
    "ThreadId": "225730",
    "Html": "<p>I believe the use for talent optimization is still there. &nbsp;The current cata Resto Druid choices include 51 points that either</p>\r\n<p>1) Increase throughput</p>\r\n<p>2) Improve the mana situation</p>\r\n<p>or</p>\r\n<p>3) are a prerequisite for one of the above.</p>\r\n<p>That doesn't sound like what Blizzard said they'd do, but if it doesn't get better, players will have plenty of opportunities to make mistakes.</p>",
    "PostedDate": "2010-09-03T13:16:22.793-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "489199",
    "ThreadId": "225730",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>Erdluf wrote:</strong><br>\r\n<p>I believe the use for talent optimization is still there. &nbsp;The current cata Resto Druid choices include 51 points that either</p>\r\n<p>1) Increase throughput</p>\r\n<p>2) Improve the mana situation</p>\r\n<p>or</p>\r\n<p>3) are a prerequisite for one of the above.</p>\r\n<p>That doesn't sound like what Blizzard said they'd do, but if it doesn't get better, players will have plenty of opportunities to make mistakes.</p>\r\n</blockquote>\r\n<p>I'm not denying that it's a good idea, but if all the devs aren't on-board with it and implement it equally, meaning they all have to take the time to crunch the numbers and figure out all their talents, why bother?</p>",
    "PostedDate": "2010-09-04T03:20:45.343-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "489272",
    "ThreadId": "225730",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>luckton wrote:</strong>\r\n<p>I'm not denying that it's a good idea, but if all the devs aren't on-board with it and implement it equally, meaning they all have to take the time to crunch the numbers and figure out all their talents, why bother?</p>\r\n</blockquote>\r\n<p>I think it is a pretty safe bet that the devs will crunch the numbers (or use numbers crunched by others), at least for the things that relatively straightforward (what is the impact Hot Streak on a Patchwerk fight?)</p>\r\n<p>There are things that are much more difficult to measure in a way that the entire community believes (impact of latency, FPS, lag spikes). &nbsp;Even things like the relative value of health vs. avoidance for a tank would (in the strictest sense) require modelling the boss, your healers and your off tank in more detail than anyone is currently doing (at least to my knowledge).</p>\r\n<p>I'd expect most crunchable numbers to be known to within a fraction of a percent. &nbsp;For instance the casting-druid community knows for sure that they get Clearcasting procs from about 6% of their single target spells. &nbsp;It is widely believed that the actual number is 3.5/60, or about 5.83%, which would match a cat's proc rate (3.5 ppm, with a 1s swing). &nbsp;Some tools use 6%, and some tools use 3.5/60. &nbsp;The difference amounts to about one sneeze during a 10 minute fight. &nbsp;Either way, it is a much better answer than you realistically need.</p>\r\n<p>I think we're likely to see more shortcuts taken evaluating the interaction between procs and cooldowns. &nbsp;Evaluating how procs interact is usually not difficult, but it tends to get very expensive as the number of possible procs goes up. &nbsp;A lot of users would prefer an answer, accurate to 1%, and reported in 1 minute, over an answer accurate to 0.1%, reported in one hour.</p>",
    "PostedDate": "2010-09-04T11:15:49.65-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "489293",
    "ThreadId": "225730",
    "Html": "<p>Ummm, the above implies that we are assigning values to talents based on massive number crunching... that's not right at all.</p>\r\n<p>If the talent gives you 5% crit, its value comes from the 5% crit, not because we assigned Talent X to have 320 DPS.</p>\r\n<p>All values in Rawr are based on how they affect the overall character, from taking it off to putting it on.</p>",
    "PostedDate": "2010-09-04T13:34:20.833-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "489317",
    "ThreadId": "225730",
    "Html": "<p>Erdluf, you're missing the point. The talents you're describing are all modeled (of course, how could Rawr be accurate without them being modeled). We're talking about the things that don't have direct impacts on performance. Things like snaring the target, or increased range, or increased healing received (for a non-tank), or the ability to remove magic effects, etc. These aren't things that have a performance value to them. But in some cases, they're important to raiding, or at least people want to have them anyway. To support those in talent optimization, we have to model all of those, not as a performance improvement, but as just an extra stat that you can apply an optimization requirement to. So that users can optimize talents, with additional requirements of &quot;Can Cleanse Magic Effects &gt;= 1&quot; and &quot;Mushroom Explosions Snare Targets &gt;= 1&quot;, etc.</p>\r\n<p>However, the feature that Kavan mentioned, that's in Rawr3, that allows users to just set optimization requirements by individual talent points, should allow it to be fine without us actually modeling all of those.</p>",
    "PostedDate": "2010-09-04T15:38:50.74-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "489540",
    "ThreadId": "225730",
    "Html": "<p>I was really replying to Rarebeast's post (and to a lesser extent Astrylian's first reply in this thread), which to a greater or lesser extent implied that the only throughput talents you might not max out are +hit talents.</p>\r\n<p>I'm aware that there are talent comparisons that look like the Tuskar's vs. Icewalker choice. &nbsp;One would increase my Rawr score, the other is a better choice because of something that Rawr didn't model.</p>\r\n<p>I was just pointing out that at least one Cata healing tree has 51 throughput or mana talents. &nbsp;It would benefit from optimization in the traditional sense (no manual constraints).</p>\r\n<p>I see your point though, there will be talents that Rawr may not bother to model because they don't directly change DPS (say Fungal Growth) that a user may still want included. &nbsp;It is good that those choices will be supported (just like I can tell the current Rawr that I do want Tuskar's).</p>",
    "PostedDate": "2010-09-05T19:32:37.647-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "489920",
    "ThreadId": "225730",
    "Html": "<p>Just pointing out that talent constraints are available in Rawr2 also.</p>",
    "PostedDate": "2010-09-06T21:36:29.8-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]