[
  {
    "Id": "489345",
    "ThreadId": "226097",
    "Html": "<p>We're getting a rash of people that apparently can't follow the Posting Guidelines:</p>\r\n<h1><strong>Posting Guidelines</strong></h1>\r\n<p>In order to streamline the communication between you (the end user) and us (the Rawr developers), we've setup these posting guidelines. When posting to our Discussion board, we ask the following things from you:</p>\r\n<ol>\r\n<li><span style=\"color:#ff0000\"><strong>You put as much time and effort into searching previous issues and discussion topics as you want us to spend addressing your issue.</strong></span> A large number of the questions that are asked have already been answered when they were asked previously. Not only will it save us the time of readdressing the issue repeatedly, you can typically the information in much less time.</li>\r\n<li>You make an effort to use proper English, including correct capitalization and punctuation. Avoid &quot;leet speak&quot;, excessive non-traditional abbreviations, and other such nonsense. We understand that not all Rawr users are native-English speakers, and will do our best to understand you, when you do your best to be understood.</li>\r\n<li><span style=\"color:#ff0000\"><strong>You keep your conversation civil and polite.</strong></span> If you disagree with something that has been posted, support your point of view with analysis, extensive testing to prove you've put some time and thought into it.</li>\r\n<li>You only create a new post if you have something to discuss. If a topic has been spoken about previously, please post in the existing thread rather then starting a new one.</li>\r\n<li>If you are having general problems with Rawr, such as it not launching, Armory import issues, etc., please read this: <a href=\"../wikipage?title=Troubleshooting&referringTitle=PostingGuidelines\">Troubleshooting</a></li>\r\n<li>If you are reporting a bug, follow the bug report format found here: <a href=\"../wikipage?title=BugReportingFormatGuide&referringTitle=PostingGuidelines\">Bug Reporting Format Guide</a></li>\r\n<li>If you are requesting a feature, follow the feature request format found here: <a href=\"../wikipage?title=FeatureRequestFormatGuide&referringTitle=PostingGuidelines\">Feature Request Format Guide</a></li>\r\n<li>If you don't understand why Rawr is telling you to gem, enchant or gear a certain way, please read this: <a href=\"../wikipage?title=IDontUnderstandWhy&referringTitle=PostingGuidelines\">I Don't Understand Why...</a></li>\r\n</ol>\r\n<h1>Bug Reports go in the Issue Tracker!</h1>\r\n<p>We want the discussion boards here to be a forum for discussion on theorycrafting, programming and well, Rawr. By following the above guidelines, hopefully your questions will be answered quickly and effectively. Failure to abide by these rules will result in your posts being linked to this page as a response and being otherwise ignored by the staff of this project.</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<h1>PLEASE FOLLOW THEM, SERIOUSLY</h1>",
    "PostedDate": "2010-09-04T18:59:08.29-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "489348",
    "ThreadId": "226097",
    "Html": "<p>Seriously. People, the posting guidelines are for your own benefit. Even if it's your first time here, and you just want to let us know about something, or ask something, or think you're being helpful or reasonable... You're not, if you don't follow the posting guidelines. We really do need you to follow them, in order to help you.</p>",
    "PostedDate": "2010-09-04T19:44:11.72-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "489493",
    "ThreadId": "226097",
    "Html": "<p>In case you guys don't believe me, here's an example of what we're talking about:</p>\r\n<p>Shadow Priests in the current version have an issue with the Spell Hit Calculations. The percentage is wrong due to a formula change. Now we've <strong>already fixed this</strong> but here are each of the tickets that have been created regarding this issue:</p>\r\n<p>http://rawr.codeplex.com/workitem/18564<br>http://rawr.codeplex.com/workitem/18642<br>http://rawr.codeplex.com/workitem/18644<br>http://rawr.codeplex.com/workitem/18673<br>http://rawr.codeplex.com/workitem/18686</p>\r\n<p>That's 5 separate tickets because people didn't search both open and closed tickets for the same issue. The original (18564) was marked as fixed on the 26th, but they just kept on coming.</p>\r\n<p>Remember, the more time we spend going through stuff like this, the less time we have for actual development and issue resolution.</p>",
    "PostedDate": "2010-09-05T14:34:18.723-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "489518",
    "ThreadId": "226097",
    "Html": "<p>Maybe it would be a good idea to keep an upcoming fixes log?&nbsp; You know, besides looking at the Source Code page and having to search through that...or something :P&nbsp; I dunno..yeah, there is the Source Code page that says what's getting fixed/changed/etc, but since it's called the &quot;Source Code&quot; page, it's not really the go-to place for those things.</p>\r\n<p>Also, I don't know how hard it is, but maybe doing weekly compiles and releasing a new version would help calm things down.&nbsp; The last version was released on 8/23 (Mon), bug fixed on 8/26 (Thur), and those four dup. reports all came out after 8/29, which would have been one week after the last full build release.</p>\r\n<p>There's no denying that the program is popular, but some bugs really do make the program useless until we get the next version.&nbsp; The Priest spell hit thing being one...no sense in trying to Optimize for the proper hit gear and maximizing DPS if the thing's broke.&nbsp; You can't limit pushing out immediate updates just on program crashing bugs alone...if a module is broken in such a way that it defeats it's purpose, there should be an almost immediate turn around on pushing out a fix and releasing it.</p>",
    "PostedDate": "2010-09-05T16:52:01.77-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "489528",
    "ThreadId": "226097",
    "Html": "<p>We pretty typically release every 2 weeks.</p>",
    "PostedDate": "2010-09-05T18:09:20.63-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]