[
  {
    "Id": "490937",
    "ThreadId": "226534",
    "Html": "<p>I have tanked as a bear since Kara, and have used Rawr for most of my gear selection, however I have always used the OT setting, mostly because it suits me and my style of tanking and allows me to switch to kitty in a fight and do a fair amount of damage if I am not tanking.&nbsp; Despite disparaging comments about my relatively low health (compared to other raid tanks) occasionally referenced by pugs, my guild still likes my tanking and honestly our healers don't complain.&nbsp; I had been playing with the &quot;custom settings&quot; moving up towards the MT side of things but have not really found a good in between number to use, it almost seems that you simply reach a tipping point between OT, gear selection and MT gear selection with very little really in between.&nbsp; Instead I have started simply working on a &quot;survival&quot; set in those very rare cases that I am having difficulties with my current gear.&nbsp;&nbsp; What is the general suggestion there?&nbsp;&nbsp; I certainly have great threat and do quite good DPS even while tanking but get so many questions or comments like &quot;You don't stack stam?&quot;&nbsp; Honestly even while using the MT settings I really don't see much recommendation to gem Stam over Agility.&nbsp;  Any advice or even comments are welcomed.&nbsp;&nbsp;</p>\r\n<p>My Main is Hotaharn on the Trollbane server, If you look and I am in boomkin gear, look again after this evening :)</p>\r\n<p>&nbsp;</p>\r\n<p>Thanks in Advance!</p>\r\n<p>Hot</p>",
    "PostedDate": "2010-09-08T15:04:30.707-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "490946",
    "ThreadId": "226534",
    "Html": "<p>Well, it sounds like you're tanking successfully, but it sounds like that's due to not trying any challenging content. If people aren't pulling aggro, you don't need more threat. More damage doesn't hurt, but it's secondary to surviving. Personally, I use lower than MT threat levels (MT is 10, OT is 50, I think? I use 5-7). If you're not stacking stam in ICC, you're definitely doing something wrong. If you post your character file in the issue tracker, I can take a look and try to help identify what that is. Even for Halion, you should be stacking stam, though not to such a hard extent (ie, get a few more socket bonuses).</p>",
    "PostedDate": "2010-09-08T15:22:21.317-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "490977",
    "ThreadId": "226534",
    "Html": "<p>Thanks, I have put the file in, it is the OT settings, I simply have been cranking the setting to MT and seeing what it recommends, I get more agility but not much in the way of stam recommendations.</p>",
    "PostedDate": "2010-09-08T16:46:17.327-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]