[
  {
    "Id": "492384",
    "ThreadId": "226904",
    "Html": "<p>Here is a mock-up for a new way to select Buffs (by <a title=\"Rawr Issue 18723 &quot;Check Buffs by Group Composition&quot;\" href=\"http://rawr.codeplex.com/workitem/18723\">popular demand</a>). I'll be using the information in this thread to make the Documentation page once it goes live.</p>\r\n<p><a href=\"http://i1227.photobucket.com/albums/ee424/JamesTGray/Rawr/BuffsByRaid_02.png\"><img src=\"http://i1227.photobucket.com/albums/ee424/JamesTGray/Rawr/BuffsByRaid_02.png\" border=0 alt=\"Rawr,Rawr3,Buffs,World of Warcraft,WoW\"></a></p>\r\n<ul>\r\n<li>Many people, especially new players, don't know what classes provide what buffs</li>\r\n<li>Going through the list can be confusing to figure out who should have what</li>\r\n</ul>\r\n<p>This will <strong>NOT</strong> be replacing the current Buff Selection structure (the Tab), it will simply provide an alternate means of selecting Raid Buffs and Debuffs. Pots, Elixirs/Flasks, Set Bonuses, Temporary Buffs (ie- Chill of the Frozen Throne) will still be selected from the Buff Tab.</p>\r\n<p>What I'm looking for in this thread is immediate feedback regarding it's structure.</p>\r\n<ul>\r\n<li>Would you like to be able to save Raid Compositions?</li>\r\n<li>Do you want it to automatically fill in the first slot with your character's info?</li>\r\n<li>Do you want more anti-nub info on the tab (like the How and Limits sections)?</li>\r\n<li>Do you like the current layout?</li>\r\n<li>Would you like to see the Conflicting Buffs to what you are selecting and where they come from? For example, Battle Shout conflicting with Paladin's Blessing of Might. Subsequently, when you already have a Buff (or conflicting buff) being applied, would you like a warning that you are about to add it to no benefit?</li>\r\n</ul>",
    "PostedDate": "2010-09-11T20:19:20.83-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "492385",
    "ThreadId": "226904",
    "Html": "<p><strong>Info Specific to Warriors:</strong></p>\r\n<p>If you select <strong>Fury</strong>, it hides the <strong>Thunderclap</strong> option but shows both <strong>Buff and Debuff Shouts</strong> and a <strong>Sunder Armor</strong> box (I'm thinking of changing that to a checkbox).</p>\r\n<p>For <strong>Arms</strong> it shows <strong>Buff and Debuff Shouts</strong>, <strong>Thunderclap</strong> and <strong>Sunder Armor</strong>.</p>\r\n<p>For <strong>Prot</strong> it just shows the <strong>Buff and Debuff Shouts</strong> because <strong>Thunderclap</strong> and <strong>Sunder Armor</strong> are automatic.</p>\r\n<p>Each selection has it's <strong>Passive Buffs</strong> to be applied.</p>",
    "PostedDate": "2010-09-11T20:22:36.303-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "492634",
    "ThreadId": "226904",
    "Html": "<p>I like :)</p>\r\n<p>Just expanding on the concept a bit ... since it's a wishlist, I'll wish some more :)</p>\r\n<p>If it's possible to save raid compositions, then would it be possible to put toon names on a raid roster?&nbsp; Possibly expanding this to a list of regular raiders with checkboxes next to the composition to optimize for.<br>Theoretically an armory scrape could then grab MS/OS for each one and you could choose which spec to use in the process.<br>Theoretically you could then print out a 'shopping list' of buffs that each toon would be doing.&nbsp; This would make a raid leaders job easier by being able to 'tick off' each buff prior to the ready check.&nbsp; It would be a reminder to speak to each class to remind them of which debuffs they are expected to do and which ones they won't need to do (since other classes are providing them).&nbsp; That would be a godsend for noob pug raids when you really can't assume that anybody knows what they're doing.&nbsp; Admitedly that takes rawr off into completely different territory of adhoc raid buff organizer ... but it would be useful nonetheless in its own way.</p>\r\n<p>A big step forward from that would be to have a raid buff optimizer that took all the potential buffs/debuffs from the selected toons and ensured that the best provider of that ability was assigned it.</p>\r\n<p>The conflicting buffs point in the OP&nbsp;would be handy.</p>",
    "PostedDate": "2010-09-12T23:58:31.883-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "492714",
    "ThreadId": "226904",
    "Html": "<p>While this is probably a better way to punch in what buffs you will actually have.&nbsp; It also makes it less obvious which buffs you're missing, or which ones you have covered more than once.</p>\r\n<p>I like the idea, but I feel that it would be even better if you somehow consolidated the info you have here into the buff selection that's already in rawr, making it a more complete whole rather than 2 separate things to achieve the same goal,&nbsp;in a different way and with both systems having opposing pro's and cons.</p>",
    "PostedDate": "2010-09-13T04:47:25.98-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "492800",
    "ThreadId": "226904",
    "Html": "<p>Yes, Saving raid compositions would be nice, even if its only one raid composition.&nbsp; Making it easy to change would be important too, I think changes happen more often that having many different raid compositions.</p>\r\n<p>Yes, filling in the first slot with the players info would be nice, although I guess that it would be nice to be optional.</p>\r\n<p>Yes on the Anti-Nub, explanations on how things work is nice, even if you understand it there can be something learned there.</p>\r\n<p>Yes, I like the layout, however it would be nice where the classes are listed that the buff/debuff sections be expandable/hidden.</p>\r\n<p>On the warning, something mild would be ok, If someone didnt understand that buffs dont stack most of the time I would just want to be sure that they not think that somehow that the buff was no longer any good.</p>\r\n<p>oppylock, there is a add-on called raidbuffstatus at <a href=\"http://www.wowace.com\">www.wowace.com</a> that makes the raid leaders job easy by doing that check for you if your interested.</p>\r\n<p>I also agree that it should maybe update.... or offer to update the current raid buff tab for those curious as to what they might be missing.&nbsp; I am guessing this is a completly optional method and very nice to envision.&nbsp;&nbsp; I really like the idea and the mock layout.&nbsp; I hope to see this soon :)</p>\r\n<p>Thanks!</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-09-13T07:30:55.317-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "543461",
    "ThreadId": "226904",
    "Html": "\r\n<p><strong>Update</strong></p>\r\n<p>I just checked in the last of the class stuff for this dialog for Cataclysm (based on the info that was already in Rawr). I need people to build the source (or look at it when .15 comes out) to tell me if any buffs are missing or assigned to the wrong specs.\r\n It still doesn't actually affect your character's buffs (meaning the dialog doesn't do anything but mock up your buffs). If anyone can help verify what is placed in there and post stuff that's incorrect here, I'll get it fixed. Hopefully if you guys can sign\r\n off on it before .15 releases, I can finish getting it working for that release instead of .16.</p>\r\n",
    "PostedDate": "2011-01-03T16:48:24.7-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "544000",
    "ThreadId": "226904",
    "Html": "\r\n<p>Any plans to include Hunter Pets?</p>\r\n<p>A Feeping Creature for future implementation - allow the set to be imported from the Raid Composition tool at MMO-Champion http://raidcomp.mmo-champion.com/</p>\r\n<p>I can also add that as a Rawr.Addon future feature to be able to import Raid composition into Rawr from the addon. ie: in a Raid allow capture of raiding setup for later import into Rawr. I'll add a limiter that prevents the export whilst you are in a raid\r\n so we don't get raid leaders complaining that idiots are trying to use Rawr mid raid.</p>\r\n",
    "PostedDate": "2011-01-04T15:42:30.883-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "544028",
    "ThreadId": "226904",
    "Html": "\r\n<p>1) The Hunter section has a Pet selector, the buff it provides is based on the Pet</p>\r\n<p>2) Feeping Creature? Wtf is that? I can look at the Raid Comp Tool but I've never used it before so it'll take some time.</p>\r\n<p>3) That would be good.</p>\r\n",
    "PostedDate": "2011-01-04T16:21:07.49-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "544032",
    "ThreadId": "226904",
    "Html": "\r\n<p>2) Feeping Creature...</p>\r\n<p>Its an old programming term. Feature Creep is where you keep adding more and more extra features to a program. Therefore a Feeping Creature is a bit of a monster that takes over your life as you add more features.</p>\r\n",
    "PostedDate": "2011-01-04T16:26:51.597-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "544043",
    "ThreadId": "226904",
    "Html": "\r\n<p>OMG... I spent all that time working on this... RaidComp looks so much shinier. and then there's\r\n<a title=\"Cataclysm Raid Composer\" href=\"http://raidcomposer.com/\" target=\"_blank\">\r\nthis one</a>.</p>\r\n",
    "PostedDate": "2011-01-04T16:54:47.243-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "544054",
    "ThreadId": "226904",
    "Html": "\r\n<p>Oops soz wasn't meant to make you cry.</p>\r\n",
    "PostedDate": "2011-01-04T17:32:53.563-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "544057",
    "ThreadId": "226904",
    "Html": "\r\n<p>Now I just wanna steal theirs...</p>\r\n",
    "PostedDate": "2011-01-04T17:34:48.167-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "544059",
    "ThreadId": "226904",
    "Html": "\r\n<p>Just import from website?</p>\r\n",
    "PostedDate": "2011-01-04T17:37:18.35-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]