[
  {
    "Id": "492752",
    "ThreadId": "227015",
    "Html": "<p>So, since we've got 4.0.1 on the test server now, which 'does' include all the class changes and item updates, is there anything we can do help get Rawr ready for the incoming Cataclysm?</p>",
    "PostedDate": "2010-09-13T06:02:34.717-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "492878",
    "ThreadId": "227015",
    "Html": "<p>We're working hard on it. Nothing you can do other than promote Rawr to other Devs. We need a ton of dev power for this.</p>",
    "PostedDate": "2010-09-13T09:46:55.56-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "493706",
    "ThreadId": "227015",
    "Html": "<p>There are lots of places where you can help contribute.&nbsp; Base stats of your character for various races is one.&nbsp; Rating conversions, formulae, stat contributions to abilities.&nbsp; Fleshing out the theorycrafting more.&nbsp; There's a LOT of work behind all the numbers that you can help establish without even touching a single line of code in Rawr.</p>",
    "PostedDate": "2010-09-15T01:22:47.99-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "500517",
    "ThreadId": "227015",
    "Html": "<p>Hi,</p>\r\n<p>is there any site we can see which formulae or stats or racials ... you already got ?</p>\r\n<p>So maybe we can help you find out the missing parts.</p>",
    "PostedDate": "2010-09-30T06:58:57.837-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "500616",
    "ThreadId": "227015",
    "Html": "<p>Unfortunately no, to see what we have implemented as far as Base Stats per Race/Class you would need to look and understand the code in place for Base and various models.</p>\r\n<p>If you can do that, take a look at Rawr.Base/StatConversion.cs for regions inside #if RAWR4 statements. That will show you the ratings conversions. Also look at Rawr.Base/BaseStats.cs (at least I think that's the file name) for Race/Class base stats, however not all models use this as some prefer to localize the code into their own implementation, usually in '[ClassModel]Calculations.cs'.</p>",
    "PostedDate": "2010-09-30T10:30:08.33-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]