[
  {
    "Id": "76177",
    "ThreadId": "22789",
    "Html": "\r\nIs there a way to add specific set bonus to an item ? I've added the new t6 parts for the cat-model manually but Rawr doesnt include t6 set bonus.<br />",
    "PostedDate": "2008-02-25T04:02:07.233-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "76235",
    "ThreadId": "22789",
    "Html": "\r\nIf you loaded the item from armory it should automatically assign a set to it. If you think it's missing you can open up ItemCache.xml and look up for &lt;SetName&gt;. The set will be automatically activated when enough pieces of the set are equipped.<br />",
    "PostedDate": "2008-02-25T08:06:57.81-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "76246",
    "ThreadId": "22789",
    "Html": "\r\nIf you don't see T6 set bonuses in Rawr at all, you're using an old BuffCache. Close Rawr, delete your BuffCache.xml file, then relaunch Rawr.<br />",
    "PostedDate": "2008-02-25T08:48:33.48-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "76248",
    "ThreadId": "22789",
    "Html": "\r\nNo the problem is the new T6 pieces (belt, bracers, boots) arent on the armory yet so I had to add them manually. Rawr doesnt \"know\" that these three items belong to tier6 set. But I will take a look at itemcache.xml and try to add the new items with set bonus.<br /><br />--edit--<br /><br />Ok it worked, I've just added &lt;SetName&gt;Thunderheart Harness&lt;/SetName&gt; with a text editor ;)<br />",
    "PostedDate": "2008-02-25T08:51:59.247-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "76532",
    "ThreadId": "22789",
    "Html": "\r\nWhat are the plans for including the model for certain set bonuses on Rawr Cat?  Particularly 2T4.  What about even an \"Enforce Set Bonus\" checkbox for certain hard-to-model set bonuses, like the meta gem checkbox?  It would make it a lot easier to see if it's worthwhile switching out a piece for a better one.  Or to see which 2 pieces to keep.<br />",
    "PostedDate": "2008-02-26T10:50:14.22-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "76545",
    "ThreadId": "22789",
    "Html": "\r\nI'm not exactly clear on what you're asking, Darksheer, but I plan to add an option to choose whether to automatically or manually calculate set bonuses at some point.<br />",
    "PostedDate": "2008-02-26T11:51:04.163-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "76620",
    "ThreadId": "22789",
    "Html": "\r\nI'm referring in particular to the 2T4 set bonus of +energy proc, which translates to quite a large increase in overall dps, but isn't reflected in regular stats.  Currently it doesn't appear that Rawr Cat recognizes the benefit of this set bonus, and only compares the particular piece based on its own stats, not on gaining or losing the set bonus.  I was just wondering if it was already in there somehow and I was missing it, or if not what the plans are for adding that kind of set bonus recognition to the program?  The current \"Enforce Meta Gem\" option seems to do something similar, weighting pieces more heavily based on whether they cause the meta gem to be active/inactive, but instead weighting the set pieces more heavily based on whether they cause you to gain/lose the set bonus.<br />",
    "PostedDate": "2008-02-26T18:24:15.697-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "76709",
    "ThreadId": "22789",
    "Html": "\r\nDarksheer, Rawr.Cat calculates the 2T4 bonus set. Is pretty easy to see:<br /><br />Equip a single piece of Tier 4.<br />Select another slot where you can equip another T4 piece for gear comparing.<br />You will see the T4 item over almost any other item in the game.<br />",
    "PostedDate": "2008-02-27T03:58:36.133-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "77125",
    "ThreadId": "22789",
    "Html": "\r\nIt doesn't look like it's doing that for me.  For example the T4 gloves are rated below the Wastewalker ones whether I have 2, 1, or 0 other pieces of T4 equipped.  Is that feature in Beta 11, or is it still in a development version?<br />",
    "PostedDate": "2008-02-28T10:31:06.263-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "77282",
    "ThreadId": "22789",
    "Html": "\r\nb11 works as I said for me. A corrupted itemcache or something like that?<br /><br />Example:<br /><br /><a href=\"http://img89.imageshack.us/img89/5351/t4xb7.jpg\" class=\"externalLink\">http://img89.imageshack.us/img89/5351/t4xb7.jpg<span class=\"externalLinkIcon\" style=\"font-family:Consolas, Courier New, Courier, Monospace;\"></span></a><br />",
    "PostedDate": "2008-02-29T00:35:14.567-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "77403",
    "ThreadId": "22789",
    "Html": "\r\nThanks for your help!  It wasn't a corrupted itemcache, since i tried replacing that earlier, but I deleted everything except my profile files in my Rawr folder and re-extracted the newest original files and now it works fine.  I'm not sure what the problem was but it looks like it was something from a previous version left over causing it.<br />",
    "PostedDate": "2008-02-29T08:22:58.583-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]