[
  {
    "Id": "496887",
    "ThreadId": "228118",
    "Html": "<p>Hey all,</p>\r\n<p>&nbsp;</p>\r\n<p>just a short note from me. I've stopped playing WoW for a few months now and right now I like the new situation, so....</p>\r\n<p>I've enjoyed working on Rawr.Tree (and touches of Rawr.Elemental) but without an active account I can hardly continue.</p>\r\n<p>Working on Rawr taught me some of the basics of C#, which is nice because I never worked on a C# project before, being spoonfed Java at the university...</p>\r\n<p>Good luck with Rawr. Keep it up guys!</p>\r\n<p>&nbsp;</p>\r\n<p>Bye!</p>\r\n<p>-Trolando</p>",
    "PostedDate": "2010-09-22T01:15:29.033-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "497078",
    "ThreadId": "228118",
    "Html": "<p><img src=\"http://knowyourmeme.com/i/000/039/413/original/no-darth_vader.jpg\" alt=\"NOOOOOOOOOOOOOOOOOOOO!\">.</p>",
    "PostedDate": "2010-09-22T09:46:11.613-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "497427",
    "ThreadId": "228118",
    "Html": "<p>Have a nice time.</p>",
    "PostedDate": "2010-09-23T02:01:55.21-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "497451",
    "ThreadId": "228118",
    "Html": "<p>I'm in a similar sort of position myself. I haven't raided seriously since January, I had a few long breaks and occasionally popped back to the game with the longest stint in May-June. Since then I levelled a Moonkin druid and enjoyed that to the point of actually pugging ICC (I DETEST pugs so that was quite a feat). However with the seemingly iminent arrival of patch 4.0 and the triumph badges = frost badges for Justice Points I just think WTF is the point suffering pugs and spending badges on gear that will be obsolete very soon.</p>\r\n<p>So I just haven't the motivation to know what I'll do come cata. I've got a beta invite but can count on the fingers of one hand the number of times I've bothered to login to beta, With previous expansions &amp; ptr patches I'd have been busy testing all my addons to work out what works and what needs fixed (both ones I author and ones I use). This time round I just haven't been bothered to even do that.</p>\r\n<p>I suspect a big part of that is that the core group of friends I've played with for 4 years have drifted apart over the last year and I don't know if they will be around in Cata. Can I be bothered trying to form a new guild and rebuilding in Cata? Since I've always been an organiser/Raid Leader/Officer type, joining someone else's guild and being told what to do doesn't come easy.</p>\r\n<p>The practical upshot of this is I don't know whether I'll be around for Cata, I don't know whether I'll bother with my Enhancement Shaman as my main or switch to my Moonkin Druid if I do decide to purchase the expansion. The motivation to do anything with ShockAndAwe (my Enhancement Shaman addon) or EnhSim (Enhancement Shaman Simulator) or Rawr.Enhance is just not present. Sorry.</p>\r\n<p>So I'd recommend that in addition to Rawr.Tree that you advertise Rawr.Enhance as requiring a developer. Now it may well be that if my mate who was the GM shows up again and the other mate who started a new job finds time to join us that I'll get all fired up and want to get stuck right back into updating Rawr. For now however I cannot give that commitment.</p>\r\n<p>If I may I'd like to stay flagged as a developer, as that at least would allow me to get back into things if/when I get the motivation and decide to pick it up again. ie: If I play my shaman in ernest you can be pretty certain I'll want the Rawr.Enhance model to be spot on. Its a bit like my Super Moderator status on MMO-Champion. If I lost that status I'd likely never play the game again, as you get used to being a part of a closed community and being an outsider again means you steer clear, rather than getting frustrated that you can't do what you used to do.</p>\r\n<p>I'd be happy meantime to give any help and support, to explain the rational behind coding I did, etc to any potential replacement so that they don't have such a steep learning curve.</p>\r\n<p>Best of luck for Rawr 4, and hopefully it won't be too long before I find my motivation to be back assisting again.</p>",
    "PostedDate": "2010-09-23T03:12:30.5-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]