[
  {
    "Id": "500265",
    "ThreadId": "229090",
    "Html": "<p>The title.</p>\r\n<p>&nbsp;</p>\r\n<p>How do I convert my latency from WoW latency to Rawr latency?</p>\r\n<p>&nbsp;</p>\r\n<p>Because if I put it at 250 like mine really is, my dps goes up.</p>\r\n<p>&nbsp;</p>\r\n<p>How can I find out my actual latency and how should I put it in rawr.</p>",
    "PostedDate": "2010-09-29T15:55:43.557-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "500266",
    "ThreadId": "229090",
    "Html": "<p>If your latency went up, it could mean that the developer for the module your working on has set the default latency at a higher setting than what you have it at. If not then I would suggest putting in a ticket with your Rawr file attached so that we can look at it.</p>",
    "PostedDate": "2010-09-29T15:58:54.98-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "500284",
    "ThreadId": "229090",
    "Html": "<p>If DPS is going up as you increase latency, that's <em>probably</em>&nbsp;a bug, though not 100% necessarily. Please follow our bug reporting guidelines on that one.</p>\r\n<p>As for how to tell your latency, you're looking for the time between when your client tells the server to perform some action, and that action actually occurring. That is<em>&nbsp;<strong>not</strong>&nbsp;</em>the same as just looking at the latency on the system menu button tooltip in WoW. The best way to find what you're looking for is to use a cast bar mod like Quartz, which includes the latency in the cast bar. Cast a bunch of spells <strong><em>without using spell queuing</em><span style=\"font-weight:normal\">,&nbsp;</span></strong>and look at the latency on the cast bar each time, and average the results.</p>",
    "PostedDate": "2010-09-29T17:16:15.99-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "500647",
    "ThreadId": "229090",
    "Html": "<p>Actually that's not the latency that all models are using. Mage model for example uses effective latency, that is how much longer spells take to cast when chain casting with spell queueing compared to the tooltip cast time.</p>",
    "PostedDate": "2010-09-30T11:31:14.383-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]