[
  {
    "Id": "76747",
    "ThreadId": "22948",
    "Html": "\r\nIn my opinion Rawr is unnecessary complicated with handling gems. I dont see the point why you have to create item duplicates to try out different gems.<br /><br />My suggestion would be:<br />-Add small icons next to the item, if it has gem slots<br />-Let the user select the gems exactly like the items, ordered by their dps increase<br /><br />That would allow to try out different gemming without much effort and see the result instantly on the spreadsheet.<br /><br />I've drawn a little picture to make my idea more clear:<br />http://img341.imageshack.us/my.php?image=interfacegemsqs1.jpg<br />",
    "PostedDate": "2008-02-27T06:32:25.16-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "76792",
    "ThreadId": "22948",
    "Html": "\r\nThe problem there is just how you would then compare different gemmings in the charts.<br /><br />The current solution is not great, but it is fully functional, and it's fast and easy (Right click on an item, and choose edit, if you haven't found that already), so I don't want to make any changes until we have a really solid, great, system for handling gems. Perhaps in a few versions.<br />",
    "PostedDate": "2008-02-27T08:29:53.893-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "76804",
    "ThreadId": "22948",
    "Html": "\r\nWhy not add a new item to the right-click menu that allows to safe the current gemming. It then automatically creates an item duplicate with the current selection of gems and adds this to the charts. This would still make it easier to play around and you wouldnt have to bother with the item edit tool.<br />",
    "PostedDate": "2008-02-27T09:21:10.657-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "76816",
    "ThreadId": "22948",
    "Html": "\r\nLike I said, I don't want to frell with the gem system until I've got a truly great system. It's at least simple, understandable, easy, albeit 'dumb', right now, and I want to preserve that until we've got a really good plan for how the gem system should work. You can already do anything you want to do with gems, it's just not predictive or suggestive, which I'm fine with for now.<br />",
    "PostedDate": "2008-02-27T09:38:54.68-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "76859",
    "ThreadId": "22948",
    "Html": "\r\nOk. I'm sure you'll come up with some good ideas... great work so far.<br />",
    "PostedDate": "2008-02-27T12:00:24.837-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "76971",
    "ThreadId": "22948",
    "Html": "\r\nMaybe not the best option, but an idea I had I would like:<br /><br />That you could right click on an item and select \"View Gem Options for This Item\" (or whatever), and the items opens in the gear comparison, but only with all the gemming posibilites (with relevant stats) of that item, listed by the same parameters (dps, mitigation...). In that list your only options is \"Copy this item to gear comparison\" or \"Return to gear comparison\".<br /><br />That could be easily done with a new Gear Comparison subsection named different...<br />",
    "PostedDate": "2008-02-27T23:24:28.817-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]