[
  {
    "Id": "508566",
    "ThreadId": "231250",
    "Html": "<p>Ok, even if the stats don't match up, is there any issue still using Rawr to look for the best upgrades.&nbsp; I'm lvling a warrior (mostly fury through quests) and I'm getting alot of instance gear.&nbsp; I'm using Pawn right now for stats on upgrades.&nbsp; At what lvl should I stop using heirlooms, or at least start keeping blues from instances?&nbsp; Pretty much the same set of items that were good in instances and heroics are gonna still be pretty good upgrades, right?&nbsp; Right now I'm working on my alts to 80, and I've only got 4 to go.&nbsp; Statscore is the addon I used before, but it's not working right now (by Tuesday the author says).&nbsp; I don't think I'll be gemming anything for now, or enchanting, since they're alts.&nbsp; My mains are both icc geared so I'm not worrying about upgrading them either until cata.&nbsp; Seems I got off topic abit.</p>\r\n<p>Basically</p>\r\n<p>﻿﻿﻿﻿﻿<br>At what lvl should I stop using heirlooms, or at least start keeping blues from instances?</p>\r\n<p>What addons do yall use for ingame gear scoring (pawn, statscore)?</p>",
    "PostedDate": "2010-10-17T17:16:25.36-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "508567",
    "ThreadId": "231250",
    "Html": "<p>Just make intelligent decisions. Rawr will somewhat help you for leveling, but any time you spend using Rawr instead of actually leveling is a net loss in leveling speed.</p>",
    "PostedDate": "2010-10-17T17:20:55.337-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "508798",
    "ThreadId": "231250",
    "Html": "<p>Heirlooms stats work out to about i187ish.&nbsp; With that in mind, if you get an i200 drop of the appropriate type, it will probably be better.&nbsp; Otherwise, stick w/ the heirloom.</p>",
    "PostedDate": "2010-10-18T06:30:41.44-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "508925",
    "ThreadId": "231250",
    "Html": "<p>I'm a big fan of Pawn, for giving me real 0-minute stat breakdowns, and for gearing characters while leveling.&nbsp; Not a chance in hell that I'd use it as a max-level gearing tool, but for those purposes, it's great.</p>",
    "PostedDate": "2010-10-18T12:04:58.54-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "509012",
    "ThreadId": "231250",
    "Html": "<p>Yeah, Pawn is fantastic as a quick and nasty tool while leveling.&nbsp;&nbsp; I still use it on my druid as a &quot;double-check&quot; that I haven't missed something in Rawr (like trash drops which are easy to forget about in your planning).&nbsp;&nbsp;&nbsp; With so many alts it is really useful to name my scales as well - like &quot;Feral 247/200&quot; which reminds me of my hit and expertise caps for each toon &amp; spec :)</p>\r\n<p>That and the fact that with the change in mechanics with the latest patch, Rawr is only of limited use and Pawn is much faster to use :)</p>\r\n<p>&nbsp;</p>\r\n<p>Looking forward to Rawr 4</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-10-18T14:51:36.64-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]