[
  {
    "Id": "511143",
    "ThreadId": "231972",
    "Html": "\r\n<p>Hello.</p>\r\n<p>I always used and enjoyed Rawr but I also felt frustrated because it was build atop this ground principle : &quot;find the immediate upgrades for a given slot with your current itemization&quot;. As a result, it's not as good as it could have been for manually assembling\r\n whole items sets.</p>\r\n<p>As an example, since we're not able to sort items by ilvl, and since Rawr displays so many variations per item, it's difficult to enumerate the 2 or 3 items of interest per slot in a raid tier. Instead of that, we have to look at dozens of entries because\r\n some good items can be deep down in the list (those with overcapped stats). It's easier to use wowhead (sorting by stats weighting or ilvl) to look at items of interest and imagine a couples of items sets before we come back to Rawr to test them. Sure, there\r\n is the automatic optimizer but... It's often sub-optimal, it can takes a long time and we have to manually toggle every item for every slot. Plus, I like to craft my own optimal set rather than waiting for a magic answer. The optimizer is good to refine things\r\n though.</p>\r\n<p>And now that reforging has been introduced, now that it's easy and cheap to lose 500 hit to gain 500 crit, I think Rawr must, more than ever, take distances with its original ground principle and shift its perspective. Does the user really wants Rawr to\r\n underrate some gloves with hit because he already reached his hit cap while it costs 10g to remove some hit from his current items ? &quot;Best immediate upgrade&quot; should still be an important use case though.</p>\r\n<p>&nbsp;</p>\r\n<p>So, I wondered if you planned any changes in that direction. If you didn't, may I suggest some ideas ?</p>\r\n<p>* Allow us to sort items by ilvl. It looks to me as an absolute must-have. Yes, some people will use it without understanding it and it will lead them to do mistakes. But is it a reason to limit other users ?</p>\r\n<p>* Allow us to not display variations, only the raw items, so that I can quickly look at the 2 or 3 helms of interest to me (rather than 50 entries) in this raid tier and decide which ones I could use.</p>\r\n<p>* Display, right on the items list, the reforgeable stats and the ilvl for every item, do not force us to look a the tooltips.</p>\r\n<p>* Maybe leverage the &quot;immediate upgrade&quot; feature to take into account reforging on the whole equipment. Today, in the items list, you display variations of a same item (with different gems and enchants). You could also display variations such as &quot;with six\r\n reforged items&quot; (not just reforged variations of the given item). Achieving a fast enough algorithm would be a challenge though.</p>\r\n<p>* Create a mass reforging table. For example, imagine a screen where we could pick stats on the top, above the table. Let's say we firt pick&quot; hit&quot; : it would then display on the first line all the possible gains and losses we could achieve through reforging\r\n for hit : -372 ; -343 ; -297 ; ... Then, let's say we pick another start, &quot;expertise&quot;. When hovering or selecting one of the values for &quot;hit&quot;, achievable values for expertise (taking the hit constraint into account) would be displayed on a second line. And\r\n so on...</p>\r\n<p>* Maybe drop the current layout: make the left pane larger, making it very quick to reforge/regem items; add a &quot;quick reforge&quot; button on the top, to act as a light and fast optimizer (no options, shorter than 1s) based on reforging only; make items sorted\r\n by ilvl by default.</p>\r\n<p>&nbsp;</p>\r\n<p>I'm sorry, those kind of requests are kinda the worst. So much work to do and, there, some guy comes in and ask for ten times more, something that would change your core user experience. All of that with funky grammar. ;=)</p>\r\n<p>But reforging really changes things a lot.</p>\r\n<p>&nbsp;</p>\r\n<p>EDIT : tried to clarify things a bit given your answer. Sorry about that.</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n",
    "PostedDate": "2010-10-22T08:27:38.32-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "511147",
    "ThreadId": "231972",
    "Html": "I'll respond more when we're not so busy with BlizzCon, but... You, sir, are very confused\r\n",
    "PostedDate": "2010-10-22T08:34:42.62-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "511344",
    "ThreadId": "231972",
    "Html": "\r\n<p>In the options, under 'default gemming templates' you can set the number of variations to show to 1.&nbsp; That way each item will only appear in the list once.&nbsp;&nbsp; The filters can be used to limit the iLvls shown, although perhaps this could be\r\n modified a little to allow the user to have greater control - I ended up going in and modifying the different iLvl ranges in the filters to suit me better.</p>\r\n<p>What I do agree with however (and it may be more important in cataclysm with reforging allowing us to drop a lot of hit etc easily) is that it would be nice to be easily able to see those items with capped stat on them that aren't being counted.&nbsp; ie.\r\n if I have loot from a single boss showing, it shows all the direct upgrades as usual in the comparison pane, but it also shows other items the boss drops with a different highlight/colour/marking if there are stats on it that are currently &quot;capped&quot;.&nbsp;&nbsp;\r\n Then I would know that I should build an upgrade list to check to see if those items are actually an upgrade.</p>\r\n<p>I know all this is unlikely, as there are so many complications involved like multiple crit caps for different abilities, Agi only partly being affected by crit caps, toons needing different hit caps for white, spell and special attacks.&nbsp;&nbsp;&nbsp;\r\n It is just frustrating that what may be a big upgrade may not be appearing on the comparison pane at all - so often I end up running upgrade lists before every boss in ICC to be on the safe side.</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n",
    "PostedDate": "2010-10-22T15:10:23.333-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "511456",
    "ThreadId": "231972",
    "Html": "\r\n<p>&nbsp;</p>\r\n<p>Let me see if I can go through some of this for you. &nbsp;As to your idea in the beginning, that's a bit off. &nbsp;There are two grounds there, that the dropdown is the quick change per slot (the by hand way), but the optimizer is the way to get as close\r\n as you can to what you need (Min-maxxing). Also, the item with a large amount of hit would show up in one of the drop-downs if you can reforge the hit into something useful. &nbsp;That said, items from the dropdown are single changes, they don't take into\r\n changing other pieces of gear into account. &nbsp;This is quite an intensive feature, which is why it's done by the optimizer by either optimizing or building an upgrade list. &nbsp;Another issue would be this, that the 100 hit rating on those gloves, if you\r\n are above cap, will still be 60 wasted hit rating after reforge, and continue to be under-valued for that reason. &nbsp;</p>\r\n<p>Also, please remember your words. &nbsp;'Now it is easy and cheap'. <strong>&nbsp;'Now'.</strong> &nbsp;Do not expect this to always be true. &nbsp;We could go to reforge our first raid epics from cata to find out it's 500g a pop. &nbsp;Beta is beta and\r\n subject to change at a moment's notice.</p>\r\n<p>First, as RareBeast puts it, you can filter by item level. &nbsp;Sorting by item level, however, is most likely not something I would personally ever do. &nbsp;It's completely opposite the idea of at least my model, to add in such a thing would require Ilvl\r\n itself to have a weight above and beyond all other things, and this in itself would lead users to error. &nbsp;Sometimes, simplist is best.</p>\r\n<p>Second, and as RareBeast said again, you can refine gemming templates to only show 1 of each item. &nbsp;</p>\r\n<p>To your third point, 'if' an item has a reforge available that is an increase in it's value, it gets a second item in the list with the reforge show. &nbsp;While you might want to see every reforgable stat in the drop-down, that would severely clutter said\r\n dropdown, hence why tooltips exist. &nbsp;</p>\r\n<p>Fourth, if you include regemming/reforging the entirety of your gear, then it's no longer an 'immediate' upgrade is it? &nbsp;This is actually already created in building an upgrade list for this functionality.</p>\r\n<p>Fifth, this sounds more like you would like to do the work instead of Rawr's models. &nbsp;Doing this wouldn't change anything in how Rawr chooses gear, which I believe might be what you are wanting, a way to prefer reforge changes over gem changes.</p>\r\n<p>On your sixth point, if you've looked at the current v4 client anywhere, you'd notice the gemming is a lot easier in the way you say already. &nbsp;Reforging may/may not be on the way in the same type, this isn't my area of expertise and someone working\r\n on that part would have to answer as to the plans.</p>\r\n<p>It sounds as if you are a power user that would like more options for power users. &nbsp;That's not to say the ideas are bad, but we have to weigh how many people they benefit vs the amount of time involved. &nbsp;And a final note. &nbsp;If you believe the\r\n optimizer to be sub-optimal, or beyond slow, then by all means, put in a ticket with some character files and data to back it up. &nbsp;If it's an error on our end, we'll usually work on it. &nbsp;</p>\r\n",
    "PostedDate": "2010-10-23T02:17:54.21-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "511583",
    "ThreadId": "231972",
    "Html": "\r\n<p>@RareBeast</p>\r\n<p>Thank you for the tip regarding the gemming templates, I admit I never took time to browse that option and it will make things better. :)</p>\r\n<p>&nbsp;</p>\r\n<p>@Antivyris</p>\r\n<p>Thank you for your answer, you made many good points (reforged variations being rated higher than they are today, the fact that reforging could become more expensive, emphasizing many of my propositions' weaknesses, etc). However, I would like to ask you\r\n three questions :</p>\r\n<p>* Don't you think that, between the &quot;immediate upgrade&quot; and &quot;optimizer&quot; use cases, there are some shades of gray which are insufficiently covered and may be important to a lot of users, maybe most of your users base ? Especially since the optimizer requires\r\n a long setup (checking every slot to check which items you toggled or not can be long and painful). And this problem is especially important to non-power users : those users who never took time to properly configure Rawr to their needs, adjust filters, or\r\n who have twenty toggled items per slot because they started using Rawr a long time ago and never cleaned it up.</p>\r\n<p>* Don't you think it's kinda strange and troublesome that Rawr is unable to just list items in a compact and rich way so that you can quickly look at every item and their stats, source and ilvl ? This very feature would serve many use cases.</p>\r\n<p>* Don't you think that, with reforging, itemization budget (hence ilvl) is now more important than ever (and it was already : about every bises set has at least 80% of 277&#43; items) ?</p>\r\n<p>&nbsp;</p>\r\n<p>Now, I'm sad to learn you're against a &quot;sort by ilvl&quot; feature since I think it could be so useful. I understand the &quot;don't risk to mislead users&quot; argument but I can only disagree with it. Aside of that, regarding the display of more informations on the items\r\n comparisons list, I can only agree unfortunately. So, instead, could it be possible to &quot;just&quot; add a simple items table with sortable columns for name, source, ilvl (^^), and every one of the relevant stats for the selected model ? Preferably on the main window,\r\n on the right panel : there could be two tabs : &quot;items comparisons / items list&quot;. All of that with the same filters choices than you use today for items comparisons.</p>\r\n<p>&nbsp;</p>\r\n<p>Finally a couple of notes :</p>\r\n<p>* I don't think I am a Rawr's power user. Although I have more than one year of experience with it (at first during BC, then for the last 8 months), there are still things I discover about it (just found out recently how to display leather items for my warrior;\r\n before that I used to edit xml files to equip them) and some features I never took time to investigate. However, I am indeed someone who seeks a perfect optimization. I use the optimizer here and there but, most of the time, I just toy out with new items combinations.\r\n Surprisingly, most of the time the items comparisons list is just a weird and poor items list for me. All in all, Rawr is, for me and first and before a tool to quickly edit items combinations and rate them. Mostly a spreadsheet, without the need to pay 140&euro;\r\n for Office to use it (burn proprietary formats, burn !). :-P</p>\r\n<p>* The next time I encounter a sub-optimal solution with the optimizer, I will file a ticket about it. Regarding the long computation time, I don't think that one to five minutes is abnormal, is it ? Finally, those kind of algorithms are never perfect anyway,\r\n you have to cut some branches early.</p>\r\n<p>* I couldn't find any binaries or sources for the v4, nor screenshots, but I'm glad to learn you've made improvements to gemming. Btw, I just gave another try to the v3 (only tried the first beta before that) and it's an excellent job. :)</p>\r\n",
    "PostedDate": "2010-10-23T13:52:47.027-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]