[
  {
    "Id": "515068",
    "ThreadId": "232935",
    "Html": "\r\n<p>Hi,</p>\r\n<p>&nbsp;</p>\r\n<p>Rawar has not been updated for Warlock 4.0.1, when can we expect that?</p>\r\n<p>&nbsp;</p>\r\n<p>Thanks</p>\r\n",
    "PostedDate": "2010-10-31T01:04:36.273-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "515075",
    "ThreadId": "232935",
    "Html": "\r\n<p>Please see:</p>\r\n<p><a href=\"http://rawr.codeplex.com/Thread/View.aspx?ThreadId=230507\">http://rawr.codeplex.com/Thread/View.aspx?ThreadId=230507</a></p>\r\n<p>&nbsp;</p>\r\n",
    "PostedDate": "2010-10-31T01:42:14.06-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "531512",
    "ThreadId": "232935",
    "Html": "\r\n<p>We should have a public beta of Rawr 4 available fairly soon. When that happens, the warlock model will be ready for testing (though rough). Please see the list of known issues on the\r\n<a href=\"http://rawr.codeplex.com/wikipage?title=Rawr.Warlock\">model documentation page</a>.</p>\r\n",
    "PostedDate": "2010-12-05T18:25:34.83-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "545369",
    "ThreadId": "232935",
    "Html": "\r\n<p>Any update for our Lock? :D</p>\r\n",
    "PostedDate": "2011-01-07T06:16:25.24-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "545652",
    "ThreadId": "232935",
    "Html": "\r\n<p>I would also love to know if there are any updates as the Model Status has not changed in a while. I check here daily for any updates and appreciate all the hard work everyone is putting into this project!</p>\r\n",
    "PostedDate": "2011-01-07T13:22:26.883-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "545658",
    "ThreadId": "232935",
    "Html": "\r\n<p>You can find this in several places:</p>\r\n<ul>\r\n<li>In the <strong>Rawr Welcome Window</strong> you can view the <strong>Version Notes</strong> up to the version released\r\n</li><li>In the <strong>Source Code Tab</strong> on this site, you can Read the <strong>\r\nCommit Notes</strong> for all time </li><li>In the <strong>Documentation Tab</strong> on this site, there is a <strong>Version Notes</strong> link\r\n</li><li>In the <strong>Documentation Tab</strong> on this site, there is a <strong>Models Status Page</strong> with a general status and that page has a\r\n<strong>Rawr.Warlock</strong> link which provides more details </li></ul>\r\n<p>I can tell you that Warlock isn't being worked on fast enough to have to check this page daily. You'd be better off checking Weekly or just looking at it when a new version comes out.</p>\r\n<p>Lets not let this asking for Warlock status turn into what it did last year when people were at one point constantly bitching at us about Warlock not working. (I'm not saying either of you two are at this point, but I'm nipping it in the bud now.)</p>\r\n",
    "PostedDate": "2011-01-07T13:30:12.707-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "546410",
    "ThreadId": "232935",
    "Html": "\r\n<p>Hi guys I know we don't see the massive amounts of work that goes on in the background but has the RAWR project stalled?</p>\r\n<p>I'm not a programer but is there anything that we can do to help?</p>\r\n<p>If we could get a beta online that atleast can load your character and tinker with the gear would be awesome.</p>\r\n<p>If&nbsp;the beta&nbsp;doesn't have all the gear or even look at offering what are upgrades i think a lot of people would be very happy due to there being no other alternatives around.</p>\r\n<p>I really think that rawr is one of the best tools for wow on the net especially for tinkering with your gear its getting anoying to have to do all the math for reforges and regemming and if you mess up the calcs can be very expesive especially atm with gear\r\n changes quite often.</p>\r\n",
    "PostedDate": "2011-01-09T18:20:59.04-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "546412",
    "ThreadId": "232935",
    "Html": "\r\n<p>Rawr is definitely not stalled, there is a beta online, and tons of people are using it. If you're asking about the Warlock model in particular, yes, that does seemed to be stalled due to lack of developers on it.</p>\r\n",
    "PostedDate": "2011-01-09T18:26:05.143-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "546414",
    "ThreadId": "232935",
    "Html": "\r\n<p>So anything we can do or do we need to wait till a program developer can give us some time</p>\r\n",
    "PostedDate": "2011-01-09T18:34:04.183-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "546415",
    "ThreadId": "232935",
    "Html": "\r\n<p>Timmhay did you read any part of the site before posting? We've got notices that Rawr4 is already posted online all over this site.</p>\r\n<p>Erstyx is the current Warlock Dev and he's checking things in sparingly. If someone has C# Dev experience and has a level 85 Warlock and wants to help out on the project they can check out the Development Applications link (shown on the main page).</p>\r\n",
    "PostedDate": "2011-01-09T18:37:51.203-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "546418",
    "ThreadId": "232935",
    "Html": "\r\n<p>Yes i have read the site and i also note that nothing has changed for the warlock module since 5th Dec 2010 5 weeks ago. The rawr 4 warlock module doesn;t let you do anythign its crashes as soon as you load your chracter.</p>\r\n<p>Bug report: Open application</p>\r\n<p>click load character from armoury</p>\r\n<p>enter chracter details</p>\r\n<p>click import</p>\r\n<p>application crashes.</p>\r\n<p>This module isn't even aplha status really its a completely usesless module. This hasn;t changed since version 4. There have been 14 updetes since then and nothing has changed.</p>\r\n<p>I understand people are busy but it seams nothing is being put into the warlock module at all.</p>\r\n<p>Atleast make it so we can load with out crashing. All i am asking for is the ability to load my chacter and tinker with my gear I don't care if it optimisees anything or sugests gear I can work that out but the ability to change an item reforge and regem\r\n don;t care if it ins't acurate on dps. Something please</p>\r\n",
    "PostedDate": "2011-01-09T18:46:29.32-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "546420",
    "ThreadId": "232935",
    "Html": "\r\n<p>See now <strong>that</strong> is the kind of stuff we ran into last year with people bitching about Warlock not working.</p>\r\n<ul>\r\n<li>Making it just barely capable of loading your character is really a disservice because the numbers are\r\n<em><strong>totally wrong</strong></em> and <em><strong>many</strong></em> users will immediately say &quot;Hey it works now, it must be gospel!&quot; instead of actually reading the status message which says &quot;This thing doesn't work for Cataclysm yet&quot;\r\n</li><li>Just getting your character loaded in to tinker with gear? What purpose does that serve? Rawr is for calculating your DPS as a Warlock, just getting the character in with wrong numbers would result in you choosing something over something else when none\r\n of the values actually matter. </li></ul>\r\n<p>Point is, be patient, either Erstyx will pick up his development or someone who can actually code on a very active basis will volunteer to pick up the slack. Until then, it's not going to work, period.</p>\r\n",
    "PostedDate": "2011-01-09T19:01:56.023-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "546421",
    "ThreadId": "232935",
    "Html": "\r\n<blockquote style=\"border:solid .1em #ccc; font-style:italic; margin:.25em 1em 0 1em; padding:0 .25em 0 .25em\">\r\n<strong>timmhay wrote:</strong><br>\r\n<p>Yes i have read the site and i also note that nothing has changed for the warlock module since 5th Dec 2010 5 weeks ago. The rawr 4 warlock module doesn;t let you do anythign its crashes as soon as you load your chracter.</p>\r\n<p>Bug report: Open application</p>\r\n<p>click load character from armoury</p>\r\n<p>enter chracter details</p>\r\n<p>click import</p>\r\n<p>application crashes.</p>\r\n<p>This module isn't even aplha status really its a completely usesless module. This hasn;t changed since version 4. There have been 14 updetes since then and nothing has changed.</p>\r\n<p>I understand people are busy but it seams nothing is being put into the warlock module at all.</p>\r\n<p>Atleast make it so we can load with out crashing. All i am asking for is the ability to load my chacter and tinker with my gear I don't care if it optimisees anything or sugests gear I can work that out but the ability to change an item reforge and regem\r\n don;t care if it ins't acurate on dps. Something please</p>\r\n</blockquote>\r\n<p>Please read before responding. Do not reverse the order of this.</p>\r\n<p>Rawr itself is released in beta form. Some models are not ready, including Warlock. It seems like nothing is being put into the warlock model at all, precisely because\r\n<em>nothing is being put into the warlock model at all.</em>&nbsp;We don't have any warlock devs. WTB Warlock devs. What\r\n<em>you</em>&nbsp;can do is what you've always been able to do: spread the word to the warlock theorycrafting community that Rawr needs support from it.</p>\r\n",
    "PostedDate": "2011-01-09T19:03:00.047-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "546449",
    "ThreadId": "232935",
    "Html": "\r\n<blockquote style=\"border:solid .1em #ccc; font-style:italic; margin:.25em 1em 0 1em; padding:0 .25em 0 .25em\">\r\n<strong>timmhay wrote:</strong><br>\r\n<p>Yes i have read the site and i also note that nothing has changed for the warlock module since 5th Dec 2010 5 weeks ago. The rawr 4 warlock module doesn;t let you do anythign its crashes as soon as you load your chracter.</p>\r\n<p>&lt;snip&gt;</p>\r\n<p>This module isn't even aplha status really its a completely usesless module. This hasn;t changed since version 4. There have been 14 updetes since then and nothing has changed.</p>\r\n</blockquote>\r\n<p>I feel your pain I have 4 level 85 toons and love using Rawr to help guide me with gear/forge/gem/enchant selection even guiding me sometimes to which instances will help me the most gearwise. However Rawr currently helps &quot;Mostly&quot; on 1 Main spec, &quot;Partially&quot;\r\n on 2 Off specs and the rest sit at &quot;Non&quot; so I check often (maybe too often) hoping for changes but they are slowly coming along sometimes in leaps sometimes in crawls but they are still coming. If you had been checking the Source code tab&nbsp;for pertinent\r\n check-ins you would have seen 5 Warlock module check-ins (all since right after Christmas) trying to accomplish just what you are asking for which is alot better than the Ret-pallies who are currently without a developer till sometime in Feb. (yes still another\r\n 5 weeks or so :( )</p>\r\n<p>Along the lines of what Jothay was talking about: If the warlock model loads but doesn't consider Mastery at all and mis-calculates yuor haste and crit ratings; How on earth would you know which stats to reforge into what other stat and for that matter which\r\n of the new talents/glyphs will give you the most&nbsp;(if any) bang for your buck</p>\r\n",
    "PostedDate": "2011-01-09T21:08:19.48-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "546605",
    "ThreadId": "232935",
    "Html": "\r\n<blockquote style=\"border:solid .1em #ccc; font-style:italic; margin:.25em 1em 0 1em; padding:0 .25em 0 .25em\">\r\n<strong>timmhay wrote:</strong></blockquote>\r\n<blockquote style=\"border:solid .1em #ccc; font-style:italic; margin:.25em 1em 0 1em; padding:0 .25em 0 .25em\">\r\nI understand people are busy but it seams nothing is being put into the warlock module at all.</blockquote>\r\n<p>You are misunderstanding how the Rawr project works. No one on the project is paid or gets any financial reward from working on the project we all just help out because we want the project to succeed. Each model has its own developer, why does that person\r\n develop for that model, well usually because their main character in game is that spec and they want the results to be really accurate for their own character. That's what drives people a deep knowledge of their own class and a desire to see the program as\r\n good as it can be for their class.</p>\r\n<p>There is NO time allocated to any particular module. So it isn't that we are ignoring the warlock module and concentrating on other things it is that the guy working on the warlock model hasn't done a lot lately. Developers work on a SINGLE model that they\r\n know really well, they DO NOT jump around model to model making changes here and there.</p>\r\n<p>So if the warlock guy hasn't made changes lately (which actually he has so you are completely wrong in suggesting nothing has happened since 5th Dec) then you just have to live with that or actually contribute yourself rather than moaning from the sidelines\r\n because a FREE program hasn't been updated.</p>\r\n<p>As others have said it is utterly pointless to implement your suggestion and get something that loads your character, if the mechanics of the class are broken and its doing all the wrong calculations then there is no point in being able to load the character.\r\n So be patient and stop bugging the developers. It will happen when it happens and no amount of crying is going to make it happen faster.</p>\r\n",
    "PostedDate": "2011-01-10T04:58:20.88-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "547603",
    "ThreadId": "232935",
    "Html": "\r\n<p>Sorry for the confusion on the status of the Warlock module. Keep in mind that the &quot;last checkin date&quot; on that status table is maintained by hand -- it doesn't magically update itself.</p>\r\n<p>Here's where we stand:</p>\r\n<ul>\r\n<li>Anything that was modeled in Xemnocyst's last release of Rawr 4 is still modeled, with updated numbers.\r\n</li><li>All simple mechanics are modeled (e.g. talents or glyphs providing unconditional increases).\r\n</li><li>Mastery and spec bonuses are modeled. </li><li>The effect of haste and crit on DOTs is modeled. </li><li>Several more complex mechanics new to Cataclysm are not yet modeled (see list of Known Issues on the model documentation page).\r\n</li></ul>\r\n<p>My goal was to get to something that I could start asking people to test. Unfortunately the version of the model in 4.0.14 had a crippling bug, and I apologize for that. That's been fixed now, and you can explore what we currently have in 4.0.15. You'll\r\n notice that you can't model the complete priority list for any spec right now; all three are missing at least once piece. I think affliction is closest to being ready.</p>\r\n<p>We also have the same haste problem that's plagued most of the caster models at one time or another, where haste increases are naively reported as DPS decreases. Something similar seems to be tied to stamina -- an increase in stamina means Life Tap returns\r\n more mana per cast, so fewer Life Taps are needed over the course of a fight, and there are fewer chances for an on-cast trinket or effect to proc.</p>\r\n<p>So the question I'm dealing with at this point is whether Xemnocyst's current model is salvageable and can be fixed to avoid these problems or whether it would make more sense to port a more sophisticated model from another class instead (opinions from other\r\n Rawr developers quite welcome :) I hope you can see that fleshing out the simulation with the remaining mechanics will have to wait until after that decision's been made.</p>\r\n<p>What can you do in the meantime? If you're not a coder or a modeler, test out the model in its current limited state and open issues if you find anything that isn't already reported (following the posting guidelines, of course). If you have the time and\r\n the skills to send more detailed feedback, that's welcome too.</p>\r\n<p>It's important to keep in mind that Rawr has never really had a complete working warlock model. It's an important goal, but it won't happen overnight.</p>\r\n",
    "PostedDate": "2011-01-11T14:11:36.107-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "547647",
    "ThreadId": "232935",
    "Html": "Il 11/01/2011 23:11, erstyx ha scritto:<br>\r\n&gt; From: erstyx<br>\r\n<br>\r\nThanks for this update on your work ;)",
    "PostedDate": "2011-01-11T15:34:36.833-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "548138",
    "ThreadId": "232935",
    "Html": "\r\n<p>I would also like to thank you for stopping by in this post and updating us Warlocks! Thanks for the work you are putting into this =D</p>\r\n<p>&nbsp;</p>\r\n<p>I did have one question that I can't seem to find a definite answer for (I may just be blind) but I play Affliction, and really I only use Rawr to optimize current gear with Reforges/Hit Cap etc. Is the model reliable enough for only optimizing current gear\r\n stats? Or should I wait until a later update?</p>\r\n<p>Thanks!</p>\r\n<p>&nbsp;</p>\r\n",
    "PostedDate": "2011-01-12T10:01:49.467-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "548424",
    "ThreadId": "232935",
    "Html": "\r\n<p>Yeah sorry if it sounds like a big bitch what i have been posting. Its not, but atleast we now know where things are at.</p>\r\n<p>The main reason for RAWR as far as i have ever been aware is that it is a gear optimisation tool. Sorry guys but&nbsp;personally I don't&nbsp;use it for dps calcs then there are better tools. Simcraft is far ahead and more acurate than RAWR for that. Sorry\r\n but its true. RAWR has and as far as I'm aware is the only gear optimisation tool we have. Nothing else works as well, simcraft is an absolute pain to change stuff (unless you have a RAWR save file). To be honest&nbsp; I never even look at the dps numbers\r\n at the bottom. I purely use it for the rear and how we gem, chant, and now reforge.</p>\r\n<p>Erstyx Thanks heaps for your help mate if you need any hard data / combat logs let me know and i will be happy to provide them if they can help you out.</p>\r\n",
    "PostedDate": "2011-01-12T20:10:02.543-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "549006",
    "ThreadId": "232935",
    "Html": "\r\n<blockquote style=\"border:solid .1em #ccc; font-style:italic; margin:.25em 1em 0 1em; padding:0 .25em 0 .25em\">\r\n<strong>timmhay wrote:</strong></blockquote>\r\n<blockquote style=\"border:solid .1em #ccc; font-style:italic; margin:.25em 1em 0 1em; padding:0 .25em 0 .25em\">\r\nSorry guys but&nbsp;personally I don't&nbsp;use it for dps calcs then there are better tools. Simcraft is far ahead and more acurate than RAWR for that. Sorry but its true. RAWR has and as far as I'm aware is the only gear optimisation tool we have. Nothing\r\n else works as well, simcraft is an absolute pain to change stuff (unless you have a RAWR save file). To be honest&nbsp; I never even look at the dps numbers at the bottom. I purely use it for the gear and how we gem, chant, and now reforge.</blockquote>\r\n<p>The point is though if ANY model doesn't have accurate DPS, tanking, healing numbers then by definition the gearing, gemming, enchanting and reforging answers its giving you aren't going to be accurate either. It really doesn't matter if you look at the\r\n numbers or not, if they are inaccurate then the gearing, gemming, enchanting and reforging suggestions are going to be bad.</p>\r\n<p>So instead of digging your head in the sand you could help the model developer by logging tickets of what isn't right they can then look at fixing things. So if for instance (and I've not looked at the warlock model so I've no idea) you look at Shadow Bolt\r\n damage and notice if I add an extra X spellpower I'm not seeing an increase in Shadow bolt damage by Y damage. Its very specific very useful info.</p>\r\n<p>Also if there is a specific sim out there that can be used to directly compare output that is a blessing and\r\n<strong>you could be helping the model developer by running the sim and actually testing different things</strong> by comparing sim output vs Rawr output numbers. When I did the Enhance model there was, and still is, the EnhSim project. It was great when people\r\n could export config files to that project and then say things like &quot;the damage of flametongue weapon seems high it looks like the damage isn't being reduced by boss fire resistance&quot; I could take the information people had provided from their tests and amend\r\n the model.</p>\r\n<p>It meant I as <strong>the developer could spend time programming whilst the users spent time testing.</strong> It meant\r\n<strong>the model was far more accurate, far more quickly.</strong></p>\r\n<p>You and others could do this for the warlock model. Use the accurate sim to find the issues in the model and post specific results (in the issues section not the discussions please) so that the developer doesn't have to waste his time finding these flaws\r\n he can concentrate on applying the fixes. If Rawr.Warlock gives accurate dps results the gearing, gemming, enchanting and reforging will be accurate too. Otherwise its random and you are possibly spending gold on gearing, gemming, enchanting and reforging\r\n that is reducing not increasing your dps.</p>\r\n",
    "PostedDate": "2011-01-13T15:11:12.627-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]