[
  {
    "Id": "522590",
    "ThreadId": "234858",
    "Html": "\r\n<p>Does anyone know when Rawr for Cataclysm will be released? (if not at least if it will be before or after the actual release date of Cataclysm)</p>\r\n",
    "PostedDate": "2010-11-16T02:46:38.973-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "522781",
    "ThreadId": "234858",
    "Html": "\r\n<p>&nbsp;</p>\r\n<p>http://rawr.codeplex.com/Thread/View.aspx?ThreadId=230507</p>\r\n",
    "PostedDate": "2010-11-16T09:19:59.793-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "522831",
    "ThreadId": "234858",
    "Html": "\r\n<p>Thank you for the response.</p>\r\n<p>And furthermore thank you for your awesome job in making Rawr the best tool for WoW there is, I really admire that.</p>\r\n<p>&nbsp;</p>\r\n<p>Though the link you have given me didn't answer my question. Aside from the fact the last thread is from October 21th (and we are now at November 16th), there is no connection to my question as to the approximate release date of Rawr for Cataclysm or even\r\n if it will turn up before or after Cataclysm is released.</p>\r\n<p>&nbsp;</p>\r\n<p>Thank you in advance.</p>\r\n",
    "PostedDate": "2010-11-16T10:31:51.45-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "522843",
    "ThreadId": "234858",
    "Html": "\r\n<p>It will be released for Cataclysm. Unsure on exact timing, but it will be within a day or two, either direction.</p>\r\n",
    "PostedDate": "2010-11-16T10:55:05.5-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "523103",
    "ThreadId": "234858",
    "Html": "\r\n<p>Whoo, can't believe you guys are releasing it an approximate of maximum 2 days after Cataclysm is released.</p>\r\n<p>Really great job guys, you are doing an amazing job in making our life better in the fastest time possible :)</p>\r\n<p>Thank you very much for your reply keep doing the good work :)</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n",
    "PostedDate": "2010-11-17T01:27:41.59-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "523125",
    "ThreadId": "234858",
    "Html": "\r\n<p>It won't be perfect, or even remotely complete, but we'll be releasing what we've got, steadily. I think the thing we'll probably wait for is the armory/battle.net import, which we might not be able to do until after Cata is released; we'll see.</p>\r\n",
    "PostedDate": "2010-11-17T02:22:55.25-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "523174",
    "ThreadId": "234858",
    "Html": "\r\n<p>No matter when ya guys put it out Ast, we know u guys will do a awesome job.&nbsp; Thank you very much for all you guys have, and continue to do, its much appreciated, cannot wait to get my hands on Rawr again.</p>\r\n<p>&nbsp;</p>\r\n<p>FYI, holler to u and Raeina :)&nbsp; Raided with ya guys back in BC in Second Attempt, where I got hooked on Rawr, and ty to this day for getting me hooked on it :)</p>\r\n<p>&nbsp;</p>\r\n<p>Best Wishes to ya guys from Nightbound :)</p>\r\n",
    "PostedDate": "2010-11-17T04:19:39.48-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "523356",
    "ThreadId": "234858",
    "Html": "\r\n<p>Haha, Nightbound! Good to hear from ya! :)</p>\r\n",
    "PostedDate": "2010-11-17T09:28:38.007-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "523856",
    "ThreadId": "234858",
    "Html": "\r\n<p>GL to the level 85's within a day or two of cataclysm release date :p</p>\r\n",
    "PostedDate": "2010-11-18T07:58:42.06-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "525622",
    "ThreadId": "234858",
    "Html": "\r\n<p>Yay for Rawr!! Can't wait. &lt;3 you guys, keep up the good work.</p>\r\n",
    "PostedDate": "2010-11-22T18:37:11.503-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "526112",
    "ThreadId": "234858",
    "Html": "\r\n<p>I'm not worried about blasting to 85 within a day or two of Cataclysm release--I'm more concerned with having at least this kind of preliminary version out, to know ABOUT when, which is to say what stat levels, it'll be worth it to break T10 bonuses and\r\n replace 277 gear with quest blues or greens. Based on what people were saying in beta, I'm guessing that'll happen around level 82 or even late 81, but I want to be sure before I replace ICC stuff.</p>\r\n<p>Of course, I DO so hope I can quickly replace my headpiece with Agile Bio-Optic Killshades. Because engineer goggles look so much cooler than the T10 druid helm.</p>\r\n<p>And I'm very pleased to hear that it'll be out within a few days. Three cheers for the Rawr team!! &lt;3</p>\r\n",
    "PostedDate": "2010-11-23T14:20:41.607-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "526116",
    "ThreadId": "234858",
    "Html": "\r\n<p>Well, I'm in the final phase of updating the item cache with 359 epics. That should be uploaded tonight sometime (either before or after my Harry Potter movie run [most likely after]). As for ilvl 333 Heroic dungeon gear though that SHOULD be next on my\r\n agenda with 272 Heroic T11 gear after that. As far as your T10 gear, that SHOULD be getting rid of by&nbsp; Deepholm or Uldum. If you still have gear from ICC by the time your done with Twilight Highland, you're probably doing something wrong. I will keep\r\n ICC gear in the Item Cache JUST in case someone is still holding onto it, but in all reality I really don't think you should hold onto the gear.</p>\r\n<p>As for the T10 Helm yea never really liked that tier set. I much preferred the T8 set. ;) Though I am so keeping the T11 tier set since I'm sorry I love it when Blizzard uses Birds as their base look for Druids (*caugh*T6*Caugh*)</p>\r\n",
    "PostedDate": "2010-11-23T14:26:11.273-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]