[
  {
    "Id": "527800",
    "ThreadId": "236261",
    "Html": "\r\n<p>With the release of Cataclysm comes the daunting task up updating the Item Cache to accommodate the release of hundreds of new items. Over the last week, with the help of Jothey, I've been able to update the item cache for Rawr 4 to include as many of the\r\n new items as I can.&nbsp; The total stands at around 1700 new items in the cache making for one large file. In doing so, we now have almost every item from ilvl 333 (Blue gear users will get from Quests in Twilight Highlands and normal 85 dungeons), ilvl 346\r\n Heroic Dungeon Gear, ilvl 352/365 Bloodthirsty/Vicious Gladiator gear, ilvl 359 T11 gear and ilvl 372/379 Heroic T11 gear.</p>\r\n<p>Even though the gear is in a few pieces of warnings need to go out at this time</p>\r\n<p>a) Some models are not done at this time or cannot load at all so be careful on the what model you are trying to look up</p>\r\n<p>b) Trinket procs are not final. I've manually edited each and every new trinket. Most&nbsp; have yet to be modeled within the back-end; which I will be getting to soon (tm). What this also means is that some procs are close to what they should be modeled\r\n as but not quite. One example of this is the <strong>Jar of Ancient Remedies</strong><strong> (</strong>http://www.wowhead.com/item=59354). At this time I am currently unsure of how to model a proc to stop working for 30 seconds (a stacking proc to boot) while\r\n the on use effect is active. I'll figure this out eventually but I'm just trying to give people a heads up that the modeling for some of these trinkets are &quot;CLOSE&quot; but just enough to get a general idea on their usefulness.</p>\r\n<p>c) The item cache is right now HUGE in size. We are talking about a cache that has not only the Cata gear but also everything from Wrath, which is about several thousands of items in that list. This also in turn is causing Rawr to slow down while it is trying\r\n to read through everything. I'm planning over the course of next week to bring that total number of items down to a more manageable size. Meaning, I will be getting rid of everything from ilvl 150 Venture Bay gear all the way to heroic T9 gear. I will hold\r\n onto the T10 gear and Wrathful PvP gear, but in all honesty, 99% of even that will probably be useless come Heroic Dungeons of Cataclysm.</p>\r\n<p>d) If you find any items that were missed please put in a ticket in the Issue Tracker and I'll see about adding them in. Right now I purposely left out any &quot;Random Enchant&quot; items since at this time Rawr has no way of importing them. Others, such as DONTUSEFury\r\n of Angerforge (http://www.wowhead.com/item=65015), I'm taking a wait-and-see on whether to add it or not. Because who would proudly say they have an item that says &quot;DON'T USE&quot; as part of it's title?</p>\r\n<p>&nbsp;</p>\r\n",
    "PostedDate": "2010-11-27T23:12:55.323-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "528097",
    "ThreadId": "236261",
    "Html": "\r\n<p>Since rawr aims at end level 85 gearing, all wrath gear can be removed imho.</p>\r\n<p>Even ICC epics get replaced before you hit 85.</p>\r\n<p>A shadowmourne is a bit trickier, but even that one gets replaced with drops from dungeons (or with the archaeology 2h).</p>\r\n",
    "PostedDate": "2010-11-29T01:42:57.03-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "528135",
    "ThreadId": "236261",
    "Html": "\r\n<p>Yes, but its all the idiots loading their toons in between 80 and 85 with all that ICC gear and complaining because its not in there by default... I don't wanna be closing issue after issue for &quot;this item is missing&quot;.</p>\r\n",
    "PostedDate": "2010-11-29T03:11:39.477-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "528206",
    "ThreadId": "236261",
    "Html": "\r\n<p>With regards to random enchants, is there a plan to support them? &nbsp;Apparently Cata raids are going to dropping Epic-level randomly enchanted gear..</p>\r\n<p>&nbsp;</p>\r\n<p><a href=\"http://www.wowhead.com/items?filter=qu=4;minle=359;cr=13;crs=1;crv=0\">http://www.wowhead.com/items?filter=qu=4;minle=359;cr=13;crs=1;crv=0</a></p>\r\n<p>&nbsp;</p>\r\n<p>Because we have Reforging, these items can be actually quite decent depending on what you get.</p>\r\n<p>Also, will it still be possible to import gear manually from Wowhead/Armory?&nbsp;</p>\r\n",
    "PostedDate": "2010-11-29T05:19:03.553-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "528213",
    "ThreadId": "236261",
    "Html": "\r\n<p>Yes, you can import gear BUT not the random enchant ones, those will not load in (because we blocked them until we can set up a way to handle them).</p>\r\n",
    "PostedDate": "2010-11-29T05:26:21.673-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]