[
  {
    "Id": "530972",
    "ThreadId": "237103",
    "Html": "\r\n<p>You may be noticing that Discussions are now being broken out into Categories. Now, whenever you create a new Discussion you will be required to assign Category Tags to it. The post will then show up in each of the categories you have selected.</p>\r\n<p><strong>DO NOT ABUSE THIS NEW POWER.</strong></p>\r\n<p>If we find that a ton of people are just clicking the first one because they can or are selecting all of them to get their post noticed will have the post\r\n<strong>DELETED</strong>.</p>\r\n<p>We're sorry for any inconvenience this causes in the interim while we set it up.</p>\r\n",
    "PostedDate": "2010-12-03T16:16:55.53-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "532168",
    "ThreadId": "237103",
    "Html": "\r\n<p>This new functionality is <em>REMARKABLY</em> annoying, after trying to use the site over the last few days.&nbsp; This is more than just a &quot;tagging&quot; - this controls the entirety of the display and access to each individual thread.&nbsp; Sure, it's nice\r\n to be able to tag threads according to its applicability to various components of the program.&nbsp; But not being able to view all threads at a glance, and not being able to quickly skim to see only the most recent changes is a royal PITA.</p>\r\n<p>Potential solutions, so I'm not seen as a &quot;doom and gloom naysayer&quot;:</p>\r\n<ul>\r\n<li>Enable a post access interface similar to previous functionality as an optional (but default) browsing experience - essentially, relegating these classifications to being merely tags.\r\n</li><li>Lobby for changes to the interface drastic enough so as to make it doable.&nbsp; (This seems like quite the stretch, and is more involved than the previous recommendation.)\r\n</li><li>Create a separate but intrinsically connected official Rawr forum, as has been discussed sporadically in the past.&nbsp; This would instantly and drastically improve the user and developer communication and information experience, with the minor cost of\r\n using one site (rawr.codeplex.com) for code and bug reports, and another (hypotheticalrawrforum.com - NO STEALING MY SITE NAME IDEA!) for intellectual collaboration.&nbsp; There are further pros and cons when it gets down to the nitty gritty details (mostly\r\n stemming from the ties between the different areas of the CodePlex site), but this could more than be made up for through the use of solid external integration with sharp use of forum-side coding to help bridge the two sites.\r\n</li></ul>\r\n<p>As you can see, even just replying to this post has put the entire discussions section of the site into absolute disarray.&nbsp; And this is more than just acclimation or reorganization that can be remedied by time and experience, it's the structure and\r\n flow of the site at its base level.&nbsp; That's absolutely unacceptable from a user experience (talking to end users and developers alike) perspective.&nbsp;\r\n<strong>As such, any discussion as to this issue and the brainstorming of potential solutions should be directed to a yet-to-be-created thread in the new Rawr.General, entitled &quot;Rawr Discussions Meta Discussion&quot;.\r\n</strong></p>\r\n<p>[edit] Make that Rawr.Base, as there doesn't seem to be any more applicable place to put the thread, at least in terms of public access; thread located at\r\n<a href=\"http://rawr.codeplex.com/Thread/View.aspx?ThreadId=237397\">http://rawr.codeplex.com/Thread/View.aspx?ThreadId=237397</a> .<strong>\r\n</strong></p>\r\n",
    "PostedDate": "2010-12-07T01:04:28.833-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "532595",
    "ThreadId": "237103",
    "Html": "\r\n<p>Yeah, this new system has its problems. We're evaluating things.</p>\r\n<p>&nbsp;</p>\r\n<p>EDIT: Changed it back to the old style, but with tags still; please use the tags so that filtering and searching is easier, but viewing will no longer be so awkward.</p>\r\n",
    "PostedDate": "2010-12-07T16:10:48.36-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]