[
  {
    "Id": "531631",
    "ThreadId": "237262",
    "Html": "\r\n<p>After the quick creation of a new and highly top secret &quot;Rawr.Server&quot; module I am pleased to announce that this is the QA sign off for Rawr 4.0.4, our first public build of Rawr fully ready for Cataclysm.</p>\r\n<p>&nbsp;</p>\r\n<p>Developers: Thank you all for your hard working getting your models ready for Cataclsym.</p>\r\n<p>Users: Please note that not all models will function at the polished level they did toward the end of WotLK. &nbsp;Not all of our developer staff had beta keys and was able to test the mechanics at 85 to finish their models. &nbsp;Please be understanding\r\n in this regard.</p>\r\n<p>&nbsp;</p>\r\n<p>And with that? &nbsp;JFLI.</p>\r\n",
    "PostedDate": "2010-12-06T02:03:05.943-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "531882",
    "ThreadId": "237262",
    "Html": "\r\n<p><span style=\"color:#808080\"><em>(repost from original Rawr3 thread, edited for new content)</em></span></p>\r\n<p>We're pleased to announce that, after long last, <strong>Rawr4</strong> has entered public beta. Do NOT continue to use Rawr2 as it is both no longer supported and REALLY out of date.</p>\r\n<p>Rawr4 is a port of Rawr to Silverlight, which means:</p>\r\n<ul>\r\n<li>You can run Rawr4 <strong>in your web browser</strong>, Internet Explorer, Firefox, Opera, Safari, etc\r\n</li><li>It runs on <strong>Mac OS X</strong> (Intel) in addition to <strong>Windows</strong>. Welcome to Rawr, Mac users!\r\n</li><li>No need to download or install anything. </li><li>You can optionally install it locally with 2 clicks from the web version, if you want to have it locally for offline use.\r\n</li><li>Lots <strong>more.</strong> </li></ul>\r\n<p>So give <strong>Rawr4</strong> a try today! Get started at: <strong><a title=\"http://elitistjerks.com/rawr.php\" href=\"http://elitistjerks.com/rawr.php\">http://elitistjerks.com/rawr.php\r\n</a></strong></p>\r\n<p>Please remember that it's still a beta, though, so lots of things are likely to be buggy or incomplete!</p>\r\n<p>For questions on the <strong>Development Status</strong> for a particular model, there is a new\r\n<strong>status bar message</strong> in the lower right hand corner of the application. You can also view the\r\n<a title=\"Model Status / Current Developers\" href=\"http://rawr.codeplex.com/wikipage?title=Models&referringTitle=Documentation\" target=\"_blank\">\r\nModel Status</a> Page.</p>\r\n",
    "PostedDate": "2010-12-06T10:51:24.253-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "532004",
    "ThreadId": "237262",
    "Html": "\r\n<h2>&gt;&gt;ISSUES SHOULD BE POSTED IN THE <a title=\"Issue Tracker\" href=\"http://rawr.codeplex.com/WorkItem/AdvancedList.aspx\" target=\"_blank\">\r\nISSUE TRACKER</a> PER THE <a title=\"Posting Guidelines\" href=\"http://rawr.codeplex.com/wikipage?title=PostingGuidelines\" target=\"_blank\">\r\nPOSTING GUIDELINES</a>&lt;&lt;</h2>\r\n<p><strong>These Issues are preventing people from running Rawr4, follow the advice and you won't see the same problems.</strong></p>\r\n<p><strong><span style=\"color:#ff0000\">THE MOST COMMON ISSUE IS USING AN OUT OF DATE SILVERLIGHT (AKA SILVERLIGHT 3 OR EARLIER) YOU NEED SILVERLIGHT 4.</span><br>\r\n</strong></p>\r\n<ol>\r\n<li>Windows update may not be enough to get you the current Silverlight version, which is what we are using for Rawr4.<br>\r\n- Go to the Silverlight download page so you can be prompted to get the latest version:\r\n<a title=\"Microsoft Silverlight Website\" href=\"http://www.microsoft.com/getsilverlight/Get-Started/Install/Default.aspx\" target=\"_blank\">\r\nhttp://www.microsoft.com/getsilverlight/Get-Started/Install/Default.aspx</a><br>\r\n- <strong>FIXED:</strong> You should be getting appropriately popped for SL4 now </li><li>Cannot Launch Rawr because of a <strong>Parser Error</strong><br>\r\n- See #1 </li><li>Cannot Launch Rawr because of an <strong>IsolatedStorage_Operation_ISFS</strong><br>\r\n- You denied Rawr the ability to make a Cache/Use Storage. Go into Silverlight settings and allow it.\r\n</li><li>Cannot Launch Rawr because the <strong>ItemCache </strong>loads in and breaks due to\r\n<strong>HolyShield being a bad Trigger</strong> (or some other similar nonsense)<br>\r\n- You need to delete your Rawr3 saved caches, Right-click the window, choose Silverlight go to the last tab (named Application Storage) and select elitistjerks.com then click the Delete button, then Relaunch Rawr (or refresh the browser page)\r\n</li><li>You got into Rawr but there are <strong>no Items present</strong><br>\r\n- Your ItemCache didn't load for whatever reason. Go to Tools &gt; Reset All Caches to redownload the new data<br>\r\n- DPSDK also had this issue specifically, this was a filtering bug and has been fixed for 4.0.11 (current release 4.0.10)\r\n</li><li><strong>Install Offline</strong> button <strong>doesn't work</strong><br>\r\n- You probably already installed it offline, right click anywhere and it will tell you &quot;Remove Application&quot; in the menu if you have\r\n</li><li><strong>Google Chrome Users</strong>, it looks like you need to force the browser to refresh the page instead of running the cached version using\r\n<strong>Shift&#43;F5</strong>. Otherwise you will see the old version and that can cause other crashes since new data files have been posted.\r\n</li></ol>\r\n<p><strong>We also have a Troubleshooting page which outlines a series of things for you to attempt BEFORE posting an issue:</strong><br>\r\n<a title=\"Troubleshooting\" href=\"http://rawr.codeplex.com/wikipage?title=Troubleshooting\" target=\"_blank\">http://rawr.codeplex.com/wikipage?title=Troubleshooting</a></p>\r\n",
    "PostedDate": "2010-12-06T15:11:43.057-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "532334",
    "ThreadId": "237262",
    "Html": "\r\n<p>For those who need it, Silverlight 4 can be loaded without admin privileges:</p>\r\n<p>1. Get Portable Firefox from <a href=\"http://portableapps.com\">Portable Apps</a></p>\r\n<p>2. Download the <a href=\"http://www.google.com/url?sa=t&source=web&cd=4&ved=0CDsQFjAD&url=http%3A%2F%2Fwww.microsoft.com%2Fdownloads%2Fdetails.aspx%3FFamilyID%3D298170d6-567c-4b90-9917-490ffcddba87&rct=j&q=silverlight%204%20SDK&ei=91v-TLrsCsGB8ga_3eCvBw&usg=AFQjCNH7PDQqJc4q3ZOrmlZdnXPv9DVayg&cad=rja\">\r\nSilverlight 4 SDK</a></p>\r\n<p>3. Extract the SDK with something like WinRar or 7-Zip, you should see a silverlight_sdk.cab file</p>\r\n<p>4. Extract the .cab file</p>\r\n<p>5. Copy everything from the .cab file into the plugins directory of Portable Firefox (You probably don't need all the files, but I know that works)</p>\r\n<p>6. Start (or restart) Portable Firefox, and check to make sure Silverlight is loaded as a plugin (Add-ons-&gt;Plugins)</p>\r\n<p>&nbsp;</p>\r\n",
    "PostedDate": "2010-12-07T08:16:23.16-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "536961",
    "ThreadId": "237262",
    "Html": "\r\n<p>*sigh* So apparently a lot of users can't run Rawr4 according to the reviews of this release.</p>\r\n<p>Before you go getting pissy with us in the reviews, I would like to remind you:</p>\r\n<ul>\r\n<li>We posted a <strong>FRELLING <span style=\"color:#ff0000\">BETA</span> RELEASE, keyword\r\n<span style=\"color:#ff0000\">BETA</span></strong>. So of course its likely to be slower than the eventual result and with lots of Bugs. We tell you this all over the program.\r\n</li><li><strong>MOST</strong> people's issues isn't really the speed, it's that they can't load their toon in from the Armory and have to manually set it up.\r\n<strong>QQ MOAR PLZ</strong>. We will have that fixed as soon as Astrylian has the time to do it.\r\n</li><li><strong>MANY</strong> of the bugs that people are reporting and complaining about have since been fixed, we've just been waiting to fix more before posting another new release.\r\n</li><li><span style=\"color:#008080\"><strong>We want to play the game too, you know...</strong></span>\r\n</li><li>If you would follow the instructions that we have already laid out above, updating silverlight, deleting the old caches, etc. you could avoid a LOT of issues.\r\n</li></ul>\r\n",
    "PostedDate": "2010-12-16T12:52:12.197-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "536996",
    "ThreadId": "237262",
    "Html": "\r\n<p>Hey Jothay :)</p>\r\n<p>We understand that it's a beta - but even in beta phase I would expect to at least be able to run the application on my computer... The reviews aren't trying to attack you guys as developers, but I can see how you might take it defensively considering all\r\n of the time and energy that has been put into this silverlight version of the application.&nbsp; If you really think the speed and performance issues are simply due to it's being a beta, and you know there are ways to improve performance easily, then by all\r\n means - let us know that, but a lot of the times these kinds of fixes are a lot more time consuming and sometimes outright impossible without an overhaul of the system.</p>\r\n<p>When you say &quot;Most people's issues isn't really speed, it's that they can't load their toon from the Armory&quot;, I'd have to strongly disagree.&nbsp; The majority of the reviews reference speed as debilitating factors in the usability of the application, and\r\n only a few of them make mention of &quot;missing features.&quot;&nbsp; I don't particularly mind if specific features are missing - that's fine and those sorts of things are easily implemented and basically expected for a beta release.&nbsp; The thing that I really\r\n struggle with here is the fact that when I try to open up rawr on the same computer I play WoW on - it literally takes 3-5 seconds for it to register clicks on each talent point.&nbsp; It then took 5-8 seconds to start selecting my head item, and by the time\r\n I got to gloves it was taking 30&#43; seconds to open the item dropdown dialog.&nbsp; When I clicked on the belt the application hung for about a minute, and then crashed.&nbsp; I believe I was on the mage - arcane model.&nbsp; Maybe I will try again using mage\r\n - fire since I've respecced.</p>\r\n<p>Don't get us wrong please :)&nbsp; I love rawr, and I think the development you guys do is awesome for the community.&nbsp; It has got to be one of the best tools available for the community at large.&nbsp; I also understand that you guys play the game also\r\n ;)&nbsp; It's not like this is your full-time job, that's fine.&nbsp; But I'm starting suspect that the move to silverlight was simply a bad decision.&nbsp; Nothing against Microsoft (I hate microsoft), but I have not seen very much good come out of the silverlight\r\n dev kit yet.&nbsp; Unless you know exactly what is causing performance issues (I run a quad-core 2.5 ghz processor) and know what can be done to address them, I think you might want to just go back to the desktop application and let mac users figure out ways\r\n to use parallels or some other emulation software to run it.</p>\r\n<p>Your last bullet point seems a little condescending to me =\\&nbsp; When I first saw a couple of issues the first thing I did was completely re-install silverlight, delete the caches, and anything else that first post mentioned might fix problems.&nbsp; But\r\n none of those things affects the speed/performance issues I've been experiencing.</p>\r\n",
    "PostedDate": "2010-12-16T13:50:53.033-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "537016",
    "ThreadId": "237262",
    "Html": "\r\n<p>Zifnab and others, please see my new thread about these issues:&nbsp;<a href=\"http://rawr.codeplex.com/Thread/View.aspx?ThreadId=238675\">http://rawr.codeplex.com/Thread/View.aspx?ThreadId=238675</a></p>\r\n",
    "PostedDate": "2010-12-16T14:39:33.33-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "538043",
    "ThreadId": "237262",
    "Html": "\r\n<p>Latest release is, at least, usable. We really appreciate that.</p>\r\n<p>Thanks for everything you do!</p>\r\n<p>&nbsp;</p>\r\n",
    "PostedDate": "2010-12-19T14:40:52.54-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "538049",
    "ThreadId": "237262",
    "Html": "\r\n<p>Very glad to hear it.</p>\r\n",
    "PostedDate": "2010-12-19T15:20:39.1-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "540340",
    "ThreadId": "237262",
    "Html": "\r\n<p>Might be a mis-understanding on my part but back when we had Rawr3, I was under the impression that the check-ins by developers updated the online Sivlerlight version. Was wondering if that held true for Rawr4 or if you needed to release updates &quot;manually&quot;?\r\n Some of the check-ins are worded such that I get the impression some models are nt quite so &quot;broken&quot; any more. With near 75 updates, is it possible to get an updated version out soon? I and the rest of the users appreciate your time and effort, Thanks again\r\n for the great work.</p>\r\n",
    "PostedDate": "2010-12-24T17:31:07.51-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "540346",
    "ThreadId": "237262",
    "Html": "\r\n<p>It has not and AFAIK will never do that. We still have to generate the build and post it the server that the EJ portal reads Rawr from.</p>\r\n",
    "PostedDate": "2010-12-24T17:52:46.863-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "540363",
    "ThreadId": "237262",
    "Html": "\r\n<p>Reason being, sometimes an intended fix or improvement might accidentally break something. &nbsp;So, it's worth our checking manually for effectiveness before compiling and shipping it out the door.</p>\r\n",
    "PostedDate": "2010-12-24T21:42:25.79-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "540370",
    "ThreadId": "237262",
    "Html": "\r\n<p>I was pretty sure I was mis-understanding that but thanks for the quick clear-up. I know everyone's busy with the holiday but a new release would be appreciated before the next holiday (if anyone can find the time). Enjoy your gifts or whatever it is you\r\n do this time of year and once again thanks for your efforts.</p>\r\n",
    "PostedDate": "2010-12-24T23:56:17.233-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "540430",
    "ThreadId": "237262",
    "Html": "Yup, we'll have a new version Soon. (Not Today)",
    "PostedDate": "2010-12-25T10:37:05.217-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "540434",
    "ThreadId": "237262",
    "Html": "\r\n<blockquote style=\"border:solid .1em #ccc; font-style:italic; margin:.25em 1em 0 1em; padding:0 .25em 0 .25em\">\r\n<strong>Astrylian wrote:</strong><br>\r\nYup, we'll have a new version Soon. (Not Today)</blockquote>\r\n<p>Absolutely enjoy your Xmas Astrylian.</p>\r\n<p>Can I ask that the export to Rawr.Addon is in before the new version is posted so that people can test and provide feedback on the display of Rawr data in game. See my developer thread request http://rawr.codeplex.com/Thread/View.aspx?ThreadId=239401 for\r\n details. I could do that myself but very nervous about touching the Main Form.xaml</p>\r\n",
    "PostedDate": "2010-12-25T10:47:26.13-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "540455",
    "ThreadId": "237262",
    "Html": "\r\n<p>I'll try getting it tonight.</p>\r\n",
    "PostedDate": "2010-12-25T14:10:51.56-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "540828",
    "ThreadId": "237262",
    "Html": "\r\n<p>hi, my first time here, i have download silverlight, but i haven't found download for rawr anywhere, can same one help me?</p>\r\n",
    "PostedDate": "2010-12-27T07:19:04.87-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "540831",
    "ThreadId": "237262",
    "Html": "\r\n<p>Dryden, go back and read the opening posts of this thread again.</p>\r\n",
    "PostedDate": "2010-12-27T07:22:00.97-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "540876",
    "ThreadId": "237262",
    "Html": "\r\n<p>I have to admit I can't find the way to get access to RAWR 4 either -- from above, the opening posts say &quot;Get started today at: http//elitistjerks.com/rawr.php&quot;. If you follow this link, it says to install Silverlight (which I ve done) and then provides\r\n a number of &quot;Important Links&quot; -- one does allow downloading RAWR 2 (but foolowing it takes you to a non-existent page with a redirection to the 4.0.12b view) , but no actual pointers to RAWR 4.0 other than the development site.&nbsp;Downloading and compiling\r\n the source code&nbsp;doesnt seem like&nbsp;the right path -- can you provide a few more hints&nbsp;to the magic path here? Thanks!!</p>\r\n",
    "PostedDate": "2010-12-27T09:52:39.233-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "540877",
    "ThreadId": "237262",
    "Html": "\r\n<p><em>http://elitistjerks.com/rawr.php</em>&nbsp;&nbsp;<strong>IS </strong>Rawr4. There is no download. That is Rawr4. Rawr4 is&nbsp;<em>http://elitistjerks.com/rawr.php</em>, and&nbsp;<em>http://elitistjerks.com/rawr.php</em>&nbsp;is Rawr4.</p>\r\n<p>You have to install Silverlight, and once you do, there will be Rawr4. If you don't see Rawr4, you haven't installed Silverlight.</p>\r\n<p>EDIT: Wow, I shouldn't type URLs from my phone. Forgot the : after http. :P</p>\r\n",
    "PostedDate": "2010-12-27T09:54:55.3-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "540925",
    "ThreadId": "237262",
    "Html": "\r\n<p>&nbsp;it appears that is your standard 404.&nbsp; I have tried going there and all I get is page not found or redirected to one of those crappy linking sites.</p>\r\n<p>Silverlight demo works just fine on the MS page.&nbsp; Neither can I find anylinks to it on the actual elitistjerks.com page.</p>\r\n<p>&nbsp;</p>\r\n<p>thanks</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n",
    "PostedDate": "2010-12-27T12:50:36.687-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "540930",
    "ThreadId": "237262",
    "Html": "\r\n<blockquote style=\"border:solid .1em #ccc; font-style:italic; margin:.25em 1em 0 1em; padding:0 .25em 0 .25em\">\r\n<strong>butcher99 wrote:</strong><br>\r\n<p>&nbsp;it appears that is your standard 404.&nbsp; I have tried going there and all I get is page not found or redirected to one of those crappy linking sites.</p>\r\n<p>Silverlight demo works just fine on the MS page.&nbsp; Neither can I find anylinks to it on the actual elitistjerks.com page.</p>\r\n<p>&nbsp;</p>\r\n<p>thanks</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n</blockquote>\r\n<p>I obviously forgot the : after http. Fixed. It's still the same link that's in just about every post or page about the subject.</p>\r\n<p>&nbsp;</p>\r\n<p>I seriously don't get why this ends up being rocket surgery. It's web-based now. It's a frelling URL you click on. Sigh.</p>\r\n",
    "PostedDate": "2010-12-27T12:57:16.39-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "540932",
    "ThreadId": "237262",
    "Html": "\r\n<p>sorry missed that.&nbsp;&nbsp; I looked at it and looked at it but missed it.&nbsp;&nbsp; the link up top works anyway.&nbsp;&nbsp;&nbsp; You just got to it before I could log back in and correct my mistake.</p>\r\n<p>&nbsp;</p>\r\n<p>thanks for the fast action.</p>\r\n<p>I understand your frustration</p>\r\n<p>&nbsp;</p>\r\n",
    "PostedDate": "2010-12-27T13:01:57.337-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "541125",
    "ThreadId": "237262",
    "Html": "\r\n<p>OK tx guys, now i have understand and it work well. Nice job</p>\r\n",
    "PostedDate": "2010-12-28T03:28:30.073-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "541280",
    "ThreadId": "237262",
    "Html": "\r\n<p>*Thanks much* for the clarification on the procedure. I had in fact used the &quot;install Silverlight&quot; link on the rawr.php and gone through the installation process previously, and even went to the MS website afterwards&nbsp;to do the required version update.\r\n Not quite sure what got bolloxed up, but&nbsp;apparently it didn't work&nbsp; the first time&nbsp;since I&nbsp;was still getting the same 'click here to install silverlight' splash --&nbsp;hence&nbsp;the confusion. Based on your info, I redid&nbsp;the Silverlight\r\n installation&nbsp;procedure and everything now seems to work well. Nice job folks, this looks excellent!</p>\r\n",
    "PostedDate": "2010-12-28T10:04:52.3-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "541294",
    "ThreadId": "237262",
    "Html": "\r\n<p>Last night, I Launched IE on a new PC, and installed Silverlight per above, only to have the page continue to insist that I must install Silverlight.&nbsp; it wasn't till a few more tries before i releiased I was using IE-64.&nbsp; I changed to the IE-32\r\n and everything worked PERFECTLY.,&nbsp; Please note that at no point did the <strong>\r\n<a title=\"http://elitistjerks.com/rawr.php\" href=\"http://elitistjerks.com/rawr.php\">http://elitistjerks.com/rawr.php\r\n</a></strong>nor any point of the Silverlight install mention that runing on IE-64 would be a problem. No Error message of any kind.</p>\r\n<p>Again, it works perfectly in IE-32.&nbsp; Just wanted to point this out for people that might be having issues.</p>\r\n",
    "PostedDate": "2010-12-28T10:24:27.15-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "541326",
    "ThreadId": "237262",
    "Html": "\r\n<p>Ah, yes, thanks for pointing that out. Silverlight doesn't work in IE64 on some computers, no idea why. (<em>That</em>, however, is a Silverlight issue, not Rawr)</p>\r\n",
    "PostedDate": "2010-12-28T11:50:08.663-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "541351",
    "ThreadId": "237262",
    "Html": "\r\n<p>Within the past week Rawr4 next release was waiting on some Rawr Addon updates/fixes. Now: &quot;To be clear Addon version 0.21&#43; REQUIRES Rawr 4.0.13 or above to be on the website. That isn't the case at the time of writing.&quot; I understand all of you are working\r\n hard to help us and play the game as well but with over 100 updates since last release (and many highly needed) but a new release would be very much appreciated. Besides it might cut down some on the &quot;already fixed&quot; and duplicate items in the Issue Tracker.\r\n Thanks again for your hard work and time.</p>\r\n",
    "PostedDate": "2010-12-28T12:47:54.26-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "541384",
    "ThreadId": "237262",
    "Html": "\r\n<p>Yes, we know a new release is desired, and will be making one Soon.</p>\r\n",
    "PostedDate": "2010-12-28T14:33:49.617-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "541440",
    "ThreadId": "237262",
    "Html": "\r\n<p>To be clear it is holiday time and developers ought to be able to spend time with their friends and family without hassles on releasing new software. As it happens for myself I have free time just now as am on holiday until 10th January and so have been\r\n able to put in a lot of time to the addon. However a lot of the changes to the addon require the new release. This WILL HAPPEN IN TIME.</p>\r\n<p>Please understand that we all want an improved Rawr but rushing new releases is never good and the holiday period is a bad time to be putting pressure on people to release something that might need big fixes later.</p>\r\n<p>Also please understand that the Rawr.Addon is a very new project and as such has only minimal features at present. We welcome your suggestions but please don't expect a finished product at this stage. It is very much a work in progress.</p>\r\n",
    "PostedDate": "2010-12-28T18:07:53.733-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "541606",
    "ThreadId": "237262",
    "Html": "\r\n<p>Google Chrome Users, it looks like you need to force the browser to refresh the page instead of running the cached version using Shift&#43;F5. Otherwise you will see the old version and that can cause other crashes since new data files have been posted.</p>\r\n",
    "PostedDate": "2010-12-29T04:00:55.913-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "541995",
    "ThreadId": "237262",
    "Html": "\r\n<p>Thank you guys very much for the new releases to both Rawr4 (.13b)&nbsp;and Rawr.addon (.22), it is extremely appreciated. I do apologize if&nbsp;I sounded like I was pressuring you for these much needed updates. Hopefully these will slow some of Issue Tracker\r\n bugs as well and again, thanks for your free time and hard work.</p>\r\n",
    "PostedDate": "2010-12-29T20:22:35.337-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "542604",
    "ThreadId": "237262",
    "Html": "\r\n<p>Thanks for all you do with RAWR. I was wondering if I could get some help with an issue. When I load my character (Mage) the dps on items dissappears and only survivability shows on the item list, any suggestions?</p>\r\n<p>&nbsp;</p>\r\n<p>Thanks</p>\r\n<p>&nbsp;</p>\r\n",
    "PostedDate": "2010-12-31T18:55:10.603-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "542605",
    "ThreadId": "237262",
    "Html": "\r\n<p>there is already an issue in the issue tracker for that, with a fix. if its not the same thing, open a new ticket</p>\r\n",
    "PostedDate": "2010-12-31T18:58:27.237-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "544561",
    "ThreadId": "237262",
    "Html": "\r\n<p>This thread is linked to as the &quot;release notes for 4.0.14b&quot; but doesn't actually have any release notes.&nbsp; I have found the changelist in Rawr itself but it is a very detailed list and not very user friendly.&nbsp;&nbsp; It would be nice to have a thread\r\n or link to the main changes in a version like we used to for Rawr2.&nbsp; Particularly if there are any updates on models that are not currently Cata ready.</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n",
    "PostedDate": "2011-01-05T14:25:22.2-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "544569",
    "ThreadId": "237262",
    "Html": "\r\n<p><a title=\"Version Notes\" href=\"http://rawr.codeplex.com/wikipage?title=VersionNotes\" target=\"_blank\">http://rawr.codeplex.com/wikipage?title=VersionNotes</a></p>\r\n<p>Can you tell me what about the Version Notes tab in the Welcome Window is not user friendly? I tried to make it as simple as possible and to show all the version notes so everyone can see everything related to both base and their model that changed.</p>\r\n",
    "PostedDate": "2011-01-05T14:47:40.933-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "544666",
    "ThreadId": "237262",
    "Html": "\r\n<p>For the size of the box you have to put them in they aren't bad at all in the welcome screen - certainly better than I remember them when I looked at them late the other night.&nbsp;&nbsp; I do find it easier to read on the website and previously couldn't\r\n find them.&nbsp;&nbsp; Was that link on the documentation there before or was I blind?&nbsp;&nbsp;&nbsp; Certainly at work where I read through these and other boards it is much nicer to check the new features rather than having to load up Rawr to see what\r\n is new.</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n",
    "PostedDate": "2011-01-05T23:13:19.393-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "544667",
    "ThreadId": "237262",
    "Html": "\r\n<p>I made that page today</p>\r\n",
    "PostedDate": "2011-01-05T23:15:21.33-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "549548",
    "ThreadId": "237262",
    "Html": "\r\n<p>Deleted the crap comments.</p>\r\n<p>If you have a problem with getting Rawr in Silverlight to work, post an issue with your exact problem and how to replicate it. If you can't do that, we can't help you. Rawr works fine now that we've had several revisions and fixed the major bugs (except\r\n specific models being inoperable because they are out of date).</p>\r\n<p>QQ'g and begging for a download-able release isn't helping anyone and we have plenty of those posts already.</p>\r\n<p><em>yehlan:</em> I <strong>just</strong> said to follow the posting guidelines and post in the issue tracker with problems like that.</p>\r\n",
    "PostedDate": "2011-01-14T11:31:49.393-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "550441",
    "ThreadId": "237262",
    "Html": "\r\n<p>Is it possible to have the Version Notes page updated for this version? Would be awesome to have something to read this boring monday!</p>\r\n<p>Edit: or I could just read it in Rawr itself. Sorry for bothering!</p>\r\n",
    "PostedDate": "2011-01-17T03:32:01.553-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "550538",
    "ThreadId": "237262",
    "Html": "\r\n<p>I am travelling this week but i will try and update it soon. unless someone beats me to it.</p>\r\n",
    "PostedDate": "2011-01-17T06:17:49.097-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "579280",
    "ThreadId": "237262",
    "Html": "<p>Any reason the codeplex says 4.1 is released, but we still only have 4.0.20?&nbsp;&nbsp;&nbsp; Did someone forget to flick the switch to live or jump the gun on the website change?</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2011-03-11T14:30:35.617-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "579286",
    "ThreadId": "237262",
    "Html": "<p>not to mention that this Thread itself says 4.4.0 (but thats a different issue) lol</p>",
    "PostedDate": "2011-03-11T14:45:45.78-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "579331",
    "ThreadId": "237262",
    "Html": "<p>Thread name fixed.I cant look into the version not updating until i get back to my hotel.</p>",
    "PostedDate": "2011-03-11T17:03:40.87-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "579470",
    "ThreadId": "237262",
    "Html": "<p>This thread has been retired, please see <a href=\"http://rawr.codeplex.com/discussions/249429\" target=\"_blank\">http://rawr.codeplex.com/discussions/249429</a> for continued discussions.</p>",
    "PostedDate": "2011-03-12T07:23:27.22-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]