[
  {
    "Id": "79606",
    "ThreadId": "23748",
    "Html": "\r\nHi i just tried this awesome programme by recommendation of a guild mate. So far im loving it, its very well structured and gives you very clear information.<br /><br />Now one thing that has big influence on damage output for Mages in the program, are the variations in DPS time and Interrupt frequency. For example if you put no Interruption and 1 (or 100%) Dps all your items with mana  or mps <b>gems</b> will show has the best DPS option which we now its not true. I tried to look for a help file to help explain the concept of Interruption and DPS time, but couldn't find one.<br /><br />With the interruption i am inputting a value between 10 and 20 because i assume its the number of interruptions over a 600 sec (10min) encounter. DPS time i have no idea how to interpret that variable, it gives a scale of 0-1 but i don't understand what this means, so i input a 0.7 value, and seem to get more accurate values with damage gems outputting more damage then mana gems, and the same with mage armor and Molten armor.<br /><br />If someone fully understands this two variables and could give an explanation it would be great, has they assume a big importance on ranking the several upgrades in terms of output dmg<br /><br />Once again congratz for a brilliant tool.<br /><br />PS: corrected the original post error in bold, its gems that i mean not shards<br />",
    "PostedDate": "2008-03-10T22:58:43.117-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "79663",
    "ThreadId": "23748",
    "Html": "\r\nWhat exactly do you mean by items with mana shards? It seems like the way you set things up you're in a mana limited situation. Did you just load your character from armory and set up raid buffs? If you could be more specific about what you used that would help track down the problems you're having.<br /><br />Dps time is the ammount of time spent dpsing. It's about the same as the dps time you see in WWS reports. If you set dps time to 1 (= 100%) that means you're able to dps for the full duration. If you set it to 0.8 for example that means 80% of the time you're dpsing and the rest of the fight you spend moving/running around/waiting.<br /><br />Interruption frequency is entered as number of interrupts per second (taking damage that causes pushbacks). So the numbers you used are a bit extreme. A realistic number for a fight light Teron Gorefiend would be around 0.05-0.1 for example.<br />",
    "PostedDate": "2008-03-11T03:39:10.15-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "79671",
    "ThreadId": "23748",
    "Html": "\r\noh sorry its a mistake there, i meant gems instead shards oops :) that must have confused you, sorry.<br /><br />Anyway i set the DPS time for 0.8 and the interrupt frequency for 0.1 to use has average values, and the results i am getting don't make sense.<br /><br />What i mean is for example,  collar of the Aldor with a +8 spirit blue gem, does more damage then with a +5 spell dmg, +6 stam gem!! In the Meta gems a +12 Intellect +15 Mana p/cast has a bigger dmg output then a 3% Spell Crit Dmg +12 spell crit.<br /><br />All the spirit based items are doing  more damage then the +spell damage ones, because the tool is calculating too much time on dps without interruption i guess.<br /><br />So i think is the interruption frequency value that is not right. You say that in a Teron Gorefiend fight you would set arround 0.05-0.1 Has i said with this values all the spirit based items damage go up the roof to unreal values in my opinion.<br /><br />I never done Gorefiend, but lets say Void Reaver,  he almost never interrupts any damage, you have to stop casting sometimes and do a lot of running. DPS time in this fight is, i would say 60% = 0.6  So, what sort of interruption frequency would you input for this fight?<br />",
    "PostedDate": "2008-03-11T04:51:30.56-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "79722",
    "ThreadId": "23748",
    "Html": "\r\nRawr.Mage is written for WoW 2.4, which is on the test realms. Int and Spr have been buffed significantly. So yes, spr and int gems will provide you more dps on long fights.<br />",
    "PostedDate": "2008-03-11T08:12:13.48-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "79852",
    "ThreadId": "23748",
    "Html": "\r\nPyro could you tell me which character you pulled from armory and what buffs and options you set at. I'd like to reproduce your situation to better see what is happening. You can also just save your character and upload the xml here.<br />",
    "PostedDate": "2008-03-11T15:47:19.527-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "80635",
    "ThreadId": "23748",
    "Html": "\r\nHi there, here is my specc has required <br /><br />http://www.mediafire.com/?d1yjmkxg1ij<br /><br />Only using the regular buffs, Intel, oils, pots.<br /><br />Still not sure which average values to use, get very different values when i tweek with the options.<br /><br />Still getting more damage from Mage armor, and form mana, Intel meta gems. Also the option AB cycles makes big changes, currently not using it, although in the game i rotate this spell<br />",
    "PostedDate": "2008-03-14T08:50:49.497-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "80701",
    "ThreadId": "23748",
    "Html": "\r\nI don't see why you're surprised with the settings you used. You have a 10 minute fight, no raid support buffs, with arcane spec, and don't want it to use AB cycles, which are the most efficient way to deal damage as arcane spec. It's clear you'll have mana issues, that's why those options give you more damage. Also for arcane specs mage armor will always do more damage than molten armor.<br />",
    "PostedDate": "2008-03-14T13:35:56.113-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]