[
  {
    "Id": "534473",
    "ThreadId": "238035",
    "Html": "\r\n<p>Hey I see that manually editing the item cache in the UI in rawr4 is NYI.&nbsp; Is there a location where it stores the XML files that I can manually go in and adjust/change/add items?</p>\r\n",
    "PostedDate": "2010-12-11T14:12:56.617-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "534477",
    "ThreadId": "238035",
    "Html": "\r\n<p>If you are using Windows Vista or 7, you use the following link</p>\r\n<p>C:\\Users\\[Username]\\AppData\\LocalLow\\Microsoft\\Silverlight\\is\\</p>\r\n<p>From there look into the folders eventually you should see an &quot;f&quot; folder that holds the cache files. To reset them you use the reset cache in the program and that will redo anything you edited.</p>\r\n<p>As for Adding items, the Wowhead import feature does work. Only issue we currently have with it is source information.</p>\r\n",
    "PostedDate": "2010-12-11T14:30:42.153-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "534481",
    "ThreadId": "238035",
    "Html": "\r\n<p>Why are you needing to edit it manually? In the Tools &gt; Edit Items dialog you can add items there or if you are wearing them at time of armory pull they will be added automatically.</p>\r\n",
    "PostedDate": "2010-12-11T14:38:41.233-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "534489",
    "ThreadId": "238035",
    "Html": "\r\n<blockquote style=\"border:solid .1em #ccc; font-style:italic; margin:.25em 1em 0 1em; padding:0 .25em 0 .25em\">\r\n<strong>Jothay wrote:</strong><br>\r\n<p>Why are you needing to edit it manually? In the Tools &gt; Edit Items dialog you can add items there or if you are wearing them at time of armory pull they will be added automatically.</p>\r\n</blockquote>\r\n<p>Tools-&gt;Edit Add doesn't work yet.&nbsp; If you choose Wowhead it throws errors.&nbsp; If you don't choose Wowhead nothing happens...no item gets added.&nbsp; If you try the old tricks that worked in the old Rawr where you say add item -1 and want it to\r\n prompt you to manually enter it just says cannot find -1.</p>\r\n<p>Armory pulling is also NYI.&nbsp; Options-&gt;Reload from armory also says NYI and nothing happens when you do it.&nbsp;</p>\r\n<p>So I'm stuck with manually adding them to the XML files.&nbsp; Maybe you have a newer version than me Jothay heh...</p>\r\n",
    "PostedDate": "2010-12-11T15:10:13.787-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "534490",
    "ThreadId": "238035",
    "Html": "\r\n<p>Interesting.&nbsp; I retried with the online version instead of the offline version and it lets me import items from wowhead.&nbsp; When I click the offline version button however nothing happens.&nbsp; It doesn't prompt me to update or redownload.</p>\r\n<p>The online version is amazingly frustratingly slow compared to offline.&nbsp; But I guess if that's the only way I can import items I will keep trying it...</p>\r\n",
    "PostedDate": "2010-12-11T15:13:18.533-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]