[
  {
    "Id": "534491",
    "ThreadId": "238041",
    "Html": "\r\n<p>I did a few google searches on parry haste in cata and I can't find anything current.&nbsp; There's a ton of posts from back in Oct that say they were removing parry haste in general from the game or at least considering it.&nbsp; Does anyone know for sure\r\n the end state?&nbsp; Does parry haste still exist?</p>\r\n<p>Rawr bear is completely NUTS for expertise.&nbsp; It wants it on everything everywhere.&nbsp; I suspect most of this desire is due to the parry haste cehckbox.</p>\r\n",
    "PostedDate": "2010-12-11T15:20:58.02-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "534524",
    "ThreadId": "238041",
    "Html": "\r\n<p>I'm like 90% certain that parry haste was removed for Cataclysm as a &quot;too confusing mechanic&quot;.</p>\r\n",
    "PostedDate": "2010-12-11T17:53:36.527-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "536719",
    "ThreadId": "238041",
    "Html": "\r\n<p>Tests on beta were showing that at least none of the bosses in the first raid instance parry haste at all, so it's probably a fair assumption to say that it's gone from a practical perspective.</p>\r\n<p>I saw testing on Maintankadin forums that seemed to indicate that Parry Hasting was still in the game mechanically for players, though. But it does appear that currently all bosses have it disabled.</p>\r\n",
    "PostedDate": "2010-12-16T05:06:38.77-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "536853",
    "ThreadId": "238041",
    "Html": "\r\n<p>I'm causious on saying it is completely gone. I know in Wrath, Parry Haste didn't show up till Algalon. So I would not count it out until the T12 comes out. What we CAN do is have a feature in the Boss Handler that says if the boss Parry Hastes or not.&nbsp;\r\n Let it default to False and only go true once we find bosses that do Parry Haste.</p>\r\n",
    "PostedDate": "2010-12-16T09:08:39.903-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "536944",
    "ThreadId": "238041",
    "Html": "\r\n<p>I'm pretty sure that it already does that. If it's missing let me know.</p>\r\n",
    "PostedDate": "2010-12-16T12:21:34.267-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "536965",
    "ThreadId": "238041",
    "Html": "\r\n<p>Parry haste is already available attribute of the BossHandler/Option structure.&nbsp; I have code in TankDK that checks for it.&nbsp; Might be commented out at the moment to deal w/ more pressing issues, like the rotation bits, but otherwise, it's definitely\r\n in there.</p>\r\n",
    "PostedDate": "2010-12-16T12:58:23.877-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]