[
  {
    "Id": "535090",
    "ThreadId": "238207",
    "Html": "\r\n<p>Hey I've been using the new Rawr and I have to say I really like it.&nbsp; The interface is familiar enough while feeling overall a little better.&nbsp; Anyhow.</p>\r\n<p>I noticed Bear says &quot;mostly&quot; cata ready and I simply wanted to know what the &quot;mostly&quot; part was.&nbsp; I was wondering if there were still some issues with the actual model or just small cleanup stuff left to keep it from being fully &quot;ready&quot;.&nbsp; Mostly\r\n it's telling me things I want to hear but even with the survival soft cap on the heroic setting (999999) it has me gemming AGI with 130k life.&nbsp; It's very surprising and makings me wonder if &quot;mostly&quot; means there are model kinks to work out still that may\r\n be over-favoring AGI.</p>\r\n<p>The other reason I ask is that I noticed on your armory you are reforging everything to dodge and using the stamina enchants for chest/head/shoulder.&nbsp; Rawr currently strongly favors all reforges to go crit/mastery and favors the agi head/shoulder and\r\n 20 stats chest.&nbsp; That you are diverging so strongly made me wonder more.</p>\r\n",
    "PostedDate": "2010-12-13T09:18:15.5-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "535112",
    "ThreadId": "238207",
    "Html": "\r\n<p>http://rawr.codeplex.com/wikipage?title=Models&amp;referringTitle=Home</p>\r\n<ul>\r\n<li><strong>Fully Functional</strong> means that every model-able method relevant to this Model has been implemented. The model is in Maintenance mode and will only change if a Bug is identified or the Theorycrafting Community discovers new information that\r\n will impact calculations, such as a more powerful rotation or a Blizzard Ability Bugfix.\r\n</li><li><strong>Mostly Functional</strong> means that the model will be largely accurate but there could be certain abilities or talents that have not been fully modeled yet. The model should be in active development to complete these tasks.\r\n</li><li><strong>Partially Functional</strong> means that the model's calculations should be taken as 'suspect' and not solely relied on without external sources to back up its recommendations. The model should be in significant development to show major changes\r\n between version releases. </li><li><strong>Non-Functional</strong> means that there have been significant changes in the game that have not made it into the Model, such as a Major Patch (like Cataclysm). The model should not be used for gear recommendations until it leaves this status.\r\n</li></ul>\r\n",
    "PostedDate": "2010-12-13T10:25:21.217-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "535162",
    "ThreadId": "238207",
    "Html": "\r\n<p>My apologies.&nbsp; I didn't realize these were officially codified terms.&nbsp; They read to a end user as simply a general status not something officially defined and mousing over the &quot;mostly&quot; text didn't provide any detail.</p>\r\n<p>The specifics around what is currently not working exactly right would be interesting to know if Astrylian is interested in divulging that.&nbsp; If not that's cool; thanks for your time and thanks for the great tool!</p>\r\n",
    "PostedDate": "2010-12-13T12:20:23.2-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "535255",
    "ThreadId": "238207",
    "Html": "\r\n<p>On the welcome screen, we list the Model Status page and its link and state that model status shows in the status bar and on the web page both. We hope that users would read that and look in both places.</p>\r\n",
    "PostedDate": "2010-12-13T16:07:21.79-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "535365",
    "ThreadId": "238207",
    "Html": "\r\n<blockquote style=\"border:solid .1em #ccc; font-style:italic; margin:.25em 1em 0 1em; padding:0 .25em 0 .25em\">\r\n<strong>Jothay wrote:</strong><br>\r\n<p>On the welcome screen, we list the Model Status page and its link and state that model status shows in the status bar and on the web page both. We hope that users would read that and look in both places.</p>\r\n</blockquote>\r\n<p>Understood.&nbsp; My apologies again.&nbsp; It was long after opening and using the program for several hours that I noticed the verbiage &quot;Mostly&quot; in the lower right.&nbsp; It didn't strike me as a term that would have a codified meaning.&nbsp; I was wrong.</p>\r\n<p>My first steps on coming to the website after seeing it were to do a search on all recent bear flagged discussions and all recent bear flagged issues.&nbsp; I tried searching on the keyword bear as well in case things weren't flagged right.&nbsp; I didn't\r\n find anything in there that had anything about the model and what were the remaining current issues (which the model page doesn't have either).&nbsp;</p>\r\n<p>My next step was to look on Astrylian's armory to see if he was following what the model was currently doing.&nbsp; I figured if he was following it to a T then it must be pretty close to done and the remaining issues just things like glyphs.&nbsp; When\r\n I saw he was diverging from the model in his own gearing I figured a post was the best way to reconcile and figure out what was what.</p>\r\n",
    "PostedDate": "2010-12-13T22:50:18.923-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]