[
  {
    "Id": "536263",
    "ThreadId": "238499",
    "Html": "\r\n<p>Is there anyway to speed up the online version? &nbsp;It's all but unusable for me right now. &nbsp;I'm not talking about running the optimizer, I'm just talking interacting with the interface is VERY sluggish and unresponsive.</p>\r\n<p>Sometimes it is taking in excess of 10-15 seconds for what should be relatively simple dialogs to appear after clicking on things.</p>\r\n<p>I'm just wondering what other people's experiences are and if there is anything I can do to improve it. &nbsp;I know the offline version is supposed to be faster.</p>\r\n",
    "PostedDate": "2010-12-15T10:42:51.04-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "536401",
    "ThreadId": "238499",
    "Html": "\r\n<p>What's your system specs look like?&nbsp; I know that some of us may be working w/ gaming rigs that are pretty speedy so we may not notice the lag.</p>\r\n",
    "PostedDate": "2010-12-15T13:41:11.737-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "536402",
    "ThreadId": "238499",
    "Html": "\r\n<p>This will very much depend on the model you're using. I know at least arcane model can be very slow at times because of the complex calculations needed. Hopefully some of that will be resolved with the WPF version. If you tell us which model you're using\r\n it might be possible to change some settings to improve performance at the cost of some accuracy.</p>\r\n",
    "PostedDate": "2010-12-15T13:41:39.08-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "536425",
    "ThreadId": "238499",
    "Html": "\r\n<p>Right now I'm on my work laptop, which I know isn't ideal, but my gaming rig at home is feeling the pain as well. &nbsp;Probably not nearly as bad, but still pretty painful.</p>\r\n<p>I'm using the Druid bear model right now.</p>\r\n<p>&nbsp;</p>\r\n<p>Laptop specs are a Dell Latitude E6400</p>\r\n<p>Intel Core2 Duo 2.4 Ghz</p>\r\n<p>4 gigs of memory</p>\r\n<p>32-bit Windows 7</p>\r\n<p>&nbsp;</p>\r\n<p>Gaming rig</p>\r\n<p>AMD 9850 Black quad-core 2.5Ghz</p>\r\n<p>4 gigs of memory</p>\r\n<p>64-bit Windows 7</p>\r\n",
    "PostedDate": "2010-12-15T14:12:59.967-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "536484",
    "ThreadId": "238499",
    "Html": "\r\n<p>Okay I want to correct myself and say that my gaming rig it seems to run fairly well on. &nbsp;I was remembering the delays being longer.</p>\r\n<p>Anyways...it seems like this takes a fairly hefty machine to run smoothly. &nbsp;The old standalone non-silverlight version wasn't nearly this laggy.</p>\r\n<p>&nbsp;</p>\r\n<p>Hopefully the new offline version will be better otherwise I'll just have to logmein to my home machine when I want to slack at work :)</p>\r\n<p>&nbsp;</p>\r\n",
    "PostedDate": "2010-12-15T16:48:19.667-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "536521",
    "ThreadId": "238499",
    "Html": "\r\n<p>There's some significant performance issue in the current version. I've been trying to track it down, and just don't have time lately (yay dozens of heroics a day).</p>\r\n",
    "PostedDate": "2010-12-15T19:45:15.223-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "536829",
    "ThreadId": "238499",
    "Html": "\r\n<p>On a somewhat related note, is there going to be another release sometime soon? There are a few bugs which have been fixed that are negitivly effecting my ability to work with my character and do upgrade list building, so a new release would be very helpful.</p>\r\n<p>~Droid</p>\r\n",
    "PostedDate": "2010-12-16T08:35:07.57-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]