[
  {
    "Id": "538911",
    "ThreadId": "239153",
    "Html": "\r\n<p>Sad, sad times...Rawr seems to be showing the arena/rated set is once again top gear for tanking (depending on settings).&nbsp;</p>\r\n<p>So what are people doing?&nbsp; Personally I can't decide...I am worried a bit at using it for tanking as my DPS and threat will be lower than a PvE gear set.&nbsp; Tank DPS seems to matter now, especially in 10m content which will be most of what I am running.&nbsp;\r\n Threat so far doesn't seem an issue but scaled up, who knows.</p>\r\n<p>So other bears....are you going to tank in Vicious Gladiator? or just stick to PvE gear?</p>\r\n<p>*Note the above is based on setting the &quot;target damage (raw)&quot; setting up a few notches.&nbsp; It's set at 57,000 default for heroics but this seems a bit low for raid content.&nbsp; I may in fact have it set up too high, honestly.&nbsp; I note Astrylian\r\n is running sta trinkets, sta enchants, but not gemming sta (gemming agi mostly).&nbsp; There is no setting in rawr that I can find that makes the optimizer use this sorta path but to get it to even consider stamina enchants/trinkets as worthwhile the target\r\n damage needs to be quite high.</p>\r\n",
    "PostedDate": "2010-12-21T12:03:19.983-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "538977",
    "ThreadId": "239153",
    "Html": "\r\n<p>I'm personally optimizing mitigation for the most part. I don't believe that I'm enchanting stamina anywhere that there's a viable Agi equivalent. I'm very agi centric. I have one Sta trinket that I just got last night and was trying out. The PvP gear is\r\n indeed better, almost entirely due to the ilvl difference, but is significantly worse on threat/damage, if you're in a situation where you care about that (and you typically should).</p>\r\n",
    "PostedDate": "2010-12-21T13:42:59.33-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "539009",
    "ThreadId": "239153",
    "Html": "\r\n<p>Hrm, you don't like the agi head/shoulder?&nbsp; I also noted you were going dodge reforges.&nbsp; Rawr likes dodge reforging pretty much only when incoming raw dmg is high enough that it also likes sta over agi.</p>\r\n<p>Are there specific values you are using that lead the optimizer to this or is it less of a science and more of a style in your case?</p>\r\n",
    "PostedDate": "2010-12-21T14:37:51.887-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "539040",
    "ThreadId": "239153",
    "Html": "\r\n<p>Well, it's pretty scientific (other than the trinkets which I have about a dozen of which I swap around depending upon the fight), but also a good bit freeform in that I've been so busy actually playing, or busy working, or busy working on Rawr, that I haven't\r\n had time to fully reoptimize everything after each upgrade I get. So several items are somewhat subparly reforged/gemmed &nbsp;as far as what I currently have available, just because that's what was optimal at the time that I got them, and I haven't had a\r\n chance to go back and revise them. Or, in the case of the shoulders, I think I just missed that the dps enchant was actually really good now. Oops. Easy fix there.</p>\r\n<p>Here's my current fully optimal character file:&nbsp;<a href=\"http://dl.dropbox.com/u/38028/Astryl.Bear.xml\">http://dl.dropbox.com/u/38028/Astryl.Bear.xml</a></p>\r\n<p>I expect the important setting there that changes things significantly is the survival softcap I have set (450k). Also note that the threat value in that file is set to 100, to account for the fact that the current live version of Rawr has a bug that makes\r\n you have to enter a threat value of 10x what you really want to get the results you want; I normally use a threat value of 10 (or sometimes 5-7 for really hard hitting bosses that I absolutely don't care about threat on).</p>\r\n",
    "PostedDate": "2010-12-21T15:33:57.32-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "539104",
    "ThreadId": "239153",
    "Html": "\r\n<p>We run similar specs.&nbsp; I take the 6% reduced spell dmg in resto vs your full stampede and 2 KotJ.</p>\r\n<p>The 450,000 softcap and the target raw damage are our main differences, yes.&nbsp; The drop down for softcap apparently misled me when it filled in 999,999 for &quot;Heroic Dungeons&quot; heh.</p>\r\n<p>Given that you have a pile of purples already I'm going to trust your settings and start using them.&nbsp; I've never been entirely sure what the &quot;right&quot; values for them were...though for the softcap of course it's a bit more feel than right/wrong as always.</p>\r\n<p>Thanks again for all your hard work on this program.&nbsp; I'd be lost in a pile of spreadsheets without it and hate my life haha.&nbsp; I've been using this since...wow I don't even know how long.&nbsp; Since BC sometime.&nbsp; It's one of the best open\r\n source projects I have had the pleasure of using.</p>\r\n",
    "PostedDate": "2010-12-21T19:00:56.057-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "539237",
    "ThreadId": "239153",
    "Html": "\r\n<p>I just submitted a issue ticket regarding this but you may want to manually adjust your trinkets to the correct proc rate per: &#65279;&#65279;&#65279;&#65279;<a href=\"http://elitistjerks.com/f78/t105429-cataclysm_mechanics_testing/\">http://elitistjerks.com/f78/t105429-cataclysm_mechanics_testing/</a></p>\r\n<p>Proc trinkets seem to have an ICD that is always 5x the buff duration.&nbsp; This brings the value of the two trinkets you have equiped WAY down...though they are still quite good.</p>\r\n",
    "PostedDate": "2010-12-22T02:20:00.717-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "539382",
    "ThreadId": "239153",
    "Html": "\r\n<p>Yea I am currently in the process of updating the trinket ICDs. I have currently gotten the ones in that listing already. Just working on the ones that are not in there. When I first put in those cooldown, I knew I would have had to gone back and update\r\n them. I just wanted to get a CLOSE representation at the starting line and correct them if needbe. That and 45 second ICD is the most common ICD in the game so I went with what is most likely the case.</p>\r\n",
    "PostedDate": "2010-12-22T07:42:36.613-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "539387",
    "ThreadId": "239153",
    "Html": "\r\n<p>Astrylian,</p>\r\n<p>I took a look at your .xml and I have a few questions. I was coming up with strange recommendations for reforging and I was going to make a post of my own, but this seems like a good place so... Why are you completely ignoring exp/hit? What is the realistic\r\n target for those numbers in order to raid? I was attempting to cap both hit and exp (dodge) numbers and you seem to be hundreds of rating points below. On EJ there are a few posts with widely differing arguements about mastery vs. dodge vs. exp/hit as to which\r\n is more important for mitigation/survival. Everyone seems to agree that threat is largely irrelevant, but the arguement is that the more likely you are to hit, the more likely you are to gain the absorb. Therefore, capping exp/hit should be priority before\r\n adding dodge. Others are saying mastery still is more effective in adding to that absorb amount.&nbsp; I dont really know what to believe, I dont think mastery is the best, but I also have a hard time believing that dodge is the best thing to reforge to and\r\n especially to remove hit or EXP for dodge which is what Rawr is recommending.</p>\r\n<p>Certainly, Im not saying it is wrong, just that it goes against all that I have learned prior when I see that hit cap and expertise (dodge) cap are completely disregarded. Obviously it is working for you though. Do you often have misses or dodges? Has it\r\n been a problem at all?</p>\r\n",
    "PostedDate": "2010-12-22T07:59:04.977-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "539447",
    "ThreadId": "239153",
    "Html": "\r\n<p>The realistic target for how much exp/hit you <strong>need</strong> in order to raid is 0. Even with no hit/exp, your sustained TPS is more than enough, even if you're being lazy about thrash/pulverize usage. The only issue is burst TPS, which is smoothed\r\n over by misdirect/tricks, or DPS waiting about 2 GCDs before DPSing. More exp/hit is definitely\r\n<strong>nice to have</strong>&nbsp;though. Its impact on Savage Defense proc rate is definitely noticeable, but that benefit is simply not as strong as simply dodging more.</p>\r\n<p>&nbsp;</p>\r\n<p>EDIT: Regarding trinkets, I think I'm typically going with Tia's&#43;Rahj right now. Got a bunch of upgrades last night, here's my latest character:&nbsp;<a href=\"http://dl.dropbox.com/u/38028/Astryl.Bear2.xml\">http://dl.dropbox.com/u/38028/Astryl.Bear2.xml</a></p>\r\n<p>I have both of the 482sta trinkets as well, Sta is just too weak to use them right now though. Note that in my itemcache, I've fixed the procs for those trinkets, and that the belt is the 232agi, 380sta, 160crit, 160mastery one. And I still need to add a\r\n buckle to it, I think...</p>\r\n",
    "PostedDate": "2010-12-22T09:57:10.07-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "539463",
    "ThreadId": "239153",
    "Html": "\r\n<blockquote style=\"border:solid .1em #ccc; font-style:italic; margin:.25em 1em 0 1em; padding:0 .25em 0 .25em\">\r\n<strong>Hinalover wrote:</strong><br>\r\n<p>Yea I am currently in the process of updating the trinket ICDs. I have currently gotten the ones in that listing already. Just working on the ones that are not in there. When I first put in those cooldown, I knew I would have had to gone back and update\r\n them. I just wanted to get a CLOSE representation at the starting line and correct them if needbe. That and 45 second ICD is the most common ICD in the game so I went with what is most likely the case.</p>\r\n</blockquote>\r\n<p>I haven't seen any theorycrafting on the PVP ones, have you?&nbsp; They are currently modeled as 20s/45s which is probably wrong but they have such a lower value of agi than similar pve trinkets...so that makes me wonder if they have a lower ICD.</p>\r\n<p>Key [346]: 285 hit, 1710agi 15s/75s</p>\r\n<p>Honor Insignia [352]: 301 resil, 912agi 20s/??s</p>\r\n<p>It just seems like with such a HUGE hit on the agi value maybe it was made up for in ICD, especially given the higher ilvl.&nbsp; Unless resil is just that expensive on item value.&nbsp; I don't have enough honor to buy one to test or I would.</p>\r\n",
    "PostedDate": "2010-12-22T10:13:33.447-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "540068",
    "ThreadId": "239153",
    "Html": "\r\n<blockquote style=\"border:solid .1em #ccc; font-style:italic; margin:.25em 1em 0 1em; padding:0 .25em 0 .25em\">\r\n<strong>Astrylian wrote:</strong>EDIT: Regarding trinkets, I think I'm typically going with Tia's&#43;Rahj right now. Got a bunch of upgrades last night, here's my latest character:&nbsp;<a href=\"http://dl.dropbox.com/u/38028/Astryl.Bear2.xml\">http://dl.dropbox.com/u/38028/Astryl.Bear2.xml</a>\r\n<p>I have both of the 482sta trinkets as well, Sta is just too weak to use them right now though. Note that in my itemcache, I've fixed the procs for those trinkets, and that the belt is the 232agi, 380sta, 160crit, 160mastery one. And I still need to add a\r\n buckle to it, I think...</p>\r\n</blockquote>\r\n<p>All the top trinkets seem to provide right around 340 average AGI so they should all be affected about equally by the armor agi proc bug.&nbsp; Your twilight scale 284 will resume top spot but otherwise the rest should be mostly the same order I'm thinking.</p>\r\n",
    "PostedDate": "2010-12-23T13:38:44.69-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "543403",
    "ThreadId": "239153",
    "Html": "\r\n<blockquote style=\"border:solid .1em #ccc; font-style:italic; margin:.25em 1em 0 1em; padding:0 .25em 0 .25em\">\r\n<strong>khanthal wrote:</strong><br>\r\n<blockquote style=\"border:solid .1em #ccc; font-style:italic; margin:.25em 1em 0 1em; padding:0 .25em 0 .25em\">\r\n<strong>Hinalover wrote:</strong><br>\r\n<p>Yea I am currently in the process of updating the trinket ICDs. I have currently gotten the ones in that listing already. Just working on the ones that are not in there. When I first put in those cooldown, I knew I would have had to gone back and update\r\n them. I just wanted to get a CLOSE representation at the starting line and correct them if needbe. That and 45 second ICD is the most common ICD in the game so I went with what is most likely the case.</p>\r\n</blockquote>\r\n<p>I haven't seen any theorycrafting on the PVP ones, have you?&nbsp; They are currently modeled as 20s/45s which is probably wrong but they have such a lower value of agi than similar pve trinkets...so that makes me wonder if they have a lower ICD.</p>\r\n<p>Key [346]: 285 hit, 1710agi 15s/75s</p>\r\n<p>Honor Insignia [352]: 301 resil, 912agi 20s/??s</p>\r\n<p>It just seems like with such a HUGE hit on the agi value maybe it was made up for in ICD, especially given the higher ilvl.&nbsp; Unless resil is just that expensive on item value.&nbsp; I don't have enough honor to buy one to test or I would.</p>\r\n</blockquote>\r\n<p>It looks like the bear model is still calculating a reduction in crits taken from resilience. &nbsp;This shouldn't be a problem if you have the thick hide talent maxxed out, but if not (I was accidentally using my cat talents) , resilience gear will be given\r\n a large bump.</p>\r\n",
    "PostedDate": "2011-01-03T14:13:15.083-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]