[
  {
    "Id": "539045",
    "ThreadId": "239183",
    "Html": "\r\n<p>Curious what people are using for the Target parameters. If left on custom it puts the Target Damage (raw) at 100,000 which seems to suggest gemming towards stamina. But when i put it on Heroics it goes into an all out Agility gemming/enchanting etc. Just\r\n curious what people are using for values in stepping into raiding.</p>\r\n",
    "PostedDate": "2010-12-21T15:49:07.343-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "539047",
    "ThreadId": "239183",
    "Html": "\r\n<p>I'm currently using 120k, for my focus on raiding. 100k may be more appropriate for heroics. The more important value though is the survival softcap. I don't think I have very good defaults in there for that yet; I use 450k for raiding, more like 350k for\r\n Heroics. If that results in Agi being favored, that means you're probably doing it right; Agi should be heavily favored over Sta for almost all bears attempting reasonable content for their gear level at this point. There's almost no danger of getting 'blown\r\n up', so reducing the damage you take becomes much more important.</p>\r\n",
    "PostedDate": "2010-12-21T15:53:27.193-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "539155",
    "ThreadId": "239183",
    "Html": "\r\n<p>Well, from what I've been seeing, tanks are getting hit for about 20k damage in Heroics and 25 - 30k Damage in T11 raids (with at 60k spike are the Blind Boss [Forget his name off-hand] ). What this means and what I've currently set up in the Boss handler\r\n is:</p>\r\n<p>90k for Heroic Dungeons<br>\r\n100k if your in 10man normal T11 Raids<br>\r\n110k if your in 25man normal T11 Raids or 10man heroic T11 Raids<br>\r\n120k if your in 25man heroic T11 Raids.</p>\r\n<p>Once I see more Parses and once I can gather how much tanks are mitigating, then I'll adjust those numbers.</p>\r\n",
    "PostedDate": "2010-12-21T22:51:43.843-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "539634",
    "ThreadId": "239183",
    "Html": "\r\n<p><a href=\"http://s3.amazonaws.com/theoatmeal-img/comics/misspelling/your.png\">For Hina</a></p>\r\n<p>&lt;3</p>\r\n",
    "PostedDate": "2010-12-22T16:10:54.07-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "557026",
    "ThreadId": "239183",
    "Html": "\r\n<p>Rather than start a new thread, thought I'd just reply on this one since its along the same lines.</p>\r\n<p>I was wondering what kind of value people were using for survival softcap for HC's (25's in my case)? The default is pretty high I think but since my guild has only downed halfus on 25hc so far and given our strategy only requires a tank holding 1 drake\r\n and possibly some whelps (if it were even possible to aoe threat them off warrior tanks), survival isnt a huge issue that fight. However I want to be prepared for harder hitting hc content so wondered what people like Astrylian in high ranking guilds were\r\n using as a value? Currently sitting just above 550k survival (647k Mitigation, 654k if I make myself use Earthen Guardian rather than Symbiotic worm. Still have some wotlk tendencies I havent totally gotten rid of and using a blue&nbsp;JC item over something\r\n I paid DKP for makes me sad).</p>\r\n<p>Thanks for the info.</p>\r\n<p>&nbsp;</p>\r\n",
    "PostedDate": "2011-01-28T11:13:50.187-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "557067",
    "ThreadId": "239183",
    "Html": "Varies by the fight. I optimize with a surv soft cap of 525, with both stam trinkets, and then swap to mitigation trinkets for certain fights.\r\n",
    "PostedDate": "2011-01-28T12:22:56.053-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "557079",
    "ThreadId": "239183",
    "Html": "\r\n<p>Thanks for the number Astrylian. Well above that already and only using 3 gems that even have stamina on (purples for agi socket bonuses). Guess it actually does make sense for me to use Earthen fulltime over Symbiotic. Its a shame symbiotic is one of those\r\n irritating 35% health procs otherwise it would probably be quite valuable. Even the 372 version doesnt rate as well as the JC trinket for bears at the moment which is a bit crazy.</p>\r\n<p>Anyway cheers for the info.</p>\r\n",
    "PostedDate": "2011-01-28T12:39:04.107-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]