[
  {
    "Id": "538817",
    "ThreadId": "239138",
    "Html": "\r\n<p>How ready is this model for use? It seems to really give some strange results in the Optimizer. I am starting to suspect something is wrong, as no values show for up at all for Crit or Mastery in the Relative Stat Values area, so maybe it's not calculating\r\n those stats for the model? I'm not really&nbsp;knowledgeable&nbsp;enough about the inner workings to make that judgement but that's what it appears.</p>\r\n<p><a href=\"https://dl.dropbox.com/u/5718595/rawr_shadow1.jpg\">https://dl.dropbox.com/u/5718595/rawr_shadow1.jpg</a></p>\r\n",
    "PostedDate": "2010-12-21T08:42:08.593-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "538858",
    "ThreadId": "239138",
    "Html": "\r\n<p>Per&nbsp;http://rawr.codeplex.com/wikipage?title=Models&amp;referringTitle=Documentation, it's only partially ready. ie, it's not really ready for accurate use.</p>\r\n",
    "PostedDate": "2010-12-21T10:36:50.567-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "538984",
    "ThreadId": "239138",
    "Html": "\r\n<p>Last check in: &#65279;11/19/2010. Sadface. Any idea when it'll be worked on again? How high are Shadow Priests on your guys' priority list? I'll continue to check in for updates of course, but can I ask when you expect it'll be finished? Excited. Excited. Excited!\r\n Keep up the great work team.</p>\r\n",
    "PostedDate": "2010-12-21T13:52:36.01-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "538989",
    "ThreadId": "239138",
    "Html": "\r\n<p>Most models (including ShadowPriest) are handled by individual devs, whom that is their only priority. TNSe, any status updates?</p>\r\n",
    "PostedDate": "2010-12-21T13:59:05.817-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "540343",
    "ThreadId": "239138",
    "Html": "\r\n<p>I am currently enjoying all the content, yes the model still needs alot of work the spells should almost be there but there is no mastery calculations taking place at the moment, i should get one or two day between christmas and new year but i dont know\r\n how much i will get done im afraid. I should get some more time in january when i get back to work, been having a nice long holiday!</p>\r\n",
    "PostedDate": "2010-12-24T17:47:08.31-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "556192",
    "ThreadId": "239138",
    "Html": "\r\n<p>Any change about this status report ? even some little improvment wiil help, if not possible, I understand any people has his own worries, someone knows another damage simulator?</p>\r\n<p>Thanks!</p>\r\n",
    "PostedDate": "2011-01-27T05:23:05.207-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "558457",
    "ThreadId": "239138",
    "Html": "\r\n<p>&#65279;&#65279;Ooooor.. can we perhaps get someone else to pick up the Shadow Priest project? No offense.. but waiting and waiting for not a single update concerning Spriests is getting lame. It's February already and it seems the developer may have abandoned the project;\r\n considering he hasn't touched it since Dec 19th 2010. ;;__;;;</p>\r\n",
    "PostedDate": "2011-01-31T20:31:02.83-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "558466",
    "ThreadId": "239138",
    "Html": "\r\n<p>You're asking us to do what we're already doing.&nbsp;We're always looking for new developers to help out.</p>\r\n",
    "PostedDate": "2011-01-31T21:08:08.613-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "558568",
    "ThreadId": "239138",
    "Html": "\r\n<p>I would love to be spending time on this but am having a serious lack of time at the moment, i had december off work for Cata launch/a holiday to see family etc. I was hoping to do some work on this in January but we had someone leave my team at work and\r\n the other sent off on site work so im left doing the work of 3 people at the moment. unfortunatly this dosnt leave me with alot of time. If any one would like to pick up the&nbsp;model&nbsp;that would be great, I&nbsp;will be about on IM to help when i can\r\n unfortunatly until we get someone hired this leaves me with little to no time to do work on the model.</p>\r\n<p>I&nbsp;appologise to everyone who has been waiting for this&nbsp;and i too would love to have this working for my own gear but until my real life calms down a bit i am unable to do alot.</p>\r\n<p>Shep</p>\r\n",
    "PostedDate": "2011-02-01T03:03:57.14-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "559825",
    "ThreadId": "239138",
    "Html": "\r\n<p>Taking care of yourself always comes first! So, no need to apologize Shep', it's alright if you aren't available to work on the program.&nbsp;&nbsp;I'm sorry to hear that you're going through a rough patch and hope things get better for you. ^.^</p>\r\n<p>As for the model, it seems finding talented developers are hard to find these days. I feel guilty, &nbsp;I wish I could help.. xD I know html pretty well. &gt;.&gt; If it's a matter of&nbsp;just typing in a million numbers then I could offer you my time\r\n and help out. Other then that.. I'm pretty worthless to you guys. Anyways, thanks for replying atleast and&nbsp;letting your fan base know the down-low. Much respect!</p>\r\n",
    "PostedDate": "2011-02-02T19:47:59.23-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "561243",
    "ThreadId": "239138",
    "Html": "\r\n<p>I added a patch to&nbsp;<a href=\"http://rawr.codeplex.com/workitem/19331\">http://rawr.codeplex.com/workitem/19331</a>&nbsp;for removing the Glyphs that are currently not in the game anymore.</p>\r\n<p>I'm trying to figure out how to investigate&nbsp;<a href=\"http://rawr.codeplex.com/workitem/19505\">http://rawr.codeplex.com/workitem/19505</a>&nbsp;but I'm completely at lost at the inner workings and interfaces of Rawr in order to understand where I should\r\n start looking at.</p>\r\n<p>I'm guessing that the optimizer doesnt know (anymore?) that hit should be kept to a certain amount, but where and how is this determined? And how can I influence this behaviour from the ShadowPriest model?</p>\r\n",
    "PostedDate": "2011-02-05T08:06:25.767-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "562220",
    "ThreadId": "239138",
    "Html": "\r\n<p>I cann't say for sure, but does Hit effect the ShadowFiend, while Spirit does not? ... Boomkin has this issue with with Trees, and thus, Hit has a Slight advantage to DPS (and mana return) over pure spirit.</p>\r\n<p>&nbsp;</p>\r\n",
    "PostedDate": "2011-02-07T14:04:37.03-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "562243",
    "ThreadId": "239138",
    "Html": "\r\n<blockquote style=\"border:solid .1em #ccc; font-style:italic; margin:.25em 1em 0 1em; padding:0 .25em 0 .25em\">\r\n<strong>japj wrote:</strong><br>\r\n<p>I added a patch to&nbsp;<a href=\"http://rawr.codeplex.com/workitem/19331\">http://rawr.codeplex.com/workitem/19331</a>&nbsp;for removing the Glyphs that are currently not in the game anymore.</p>\r\n<p>I'm trying to figure out how to investigate&nbsp;<a href=\"http://rawr.codeplex.com/workitem/19505\">http://rawr.codeplex.com/workitem/19505</a>&nbsp;but I'm completely at lost at the inner workings and interfaces of Rawr in order to understand where I should\r\n start looking at.</p>\r\n<p>I'm guessing that the optimizer doesnt know (anymore?) that hit should be kept to a certain amount, but where and how is this determined? And how can I influence this behaviour from the ShadowPriest model?</p>\r\n</blockquote>\r\n<p>Think of it like this...</p>\r\n<p>In the base code of Rawr it generates a Stats object that contains all the stats that the program wants the model to evaluate. The model takes the Character object (for things like checking talents) and the Stats object with the stats set to evaluate and\r\n throws it at the model (in CalculationsModelName class).</p>\r\n<p>The model then implements a calculation routine and spits out an object that has the Overall value and any sub values the model wants to define (eg: normal vs burst dps).</p>\r\n<p>So its a black box - the optimiser simply throws LOTS (thousands) of Stats objects at the model and says give me a result it then keeps going swaping things out trying to get a higher and higher number.</p>\r\n<p>Therefore when looking at the code you do not really need to know ANYTHING about how the optimiser works nor anything about how it calculates the Stats or clicks buttons or any interface stuff. All you need to look at is &quot;does the calculation take the Stats\r\n and give a sensible result&quot;.</p>\r\n<p>&nbsp;</p>\r\n<p>So for ShadowPriest - the optimiser IS NOT LOOKING AT ANYTHING AT ALL. It is the model calculation code that is simply spitting back at the optimiser a number for the dps done for that set of Stats. If the hit rating is wrong it is likely to be how it is\r\n calculated. For example if it is using the level 80 numbers. So all you need to do is investigate the Calculations class in Shadow Priest model and see if all the formulae are actually correct. As you change formula the results get better.</p>\r\n<p>So to get a working model really you should do the following...</p>\r\n<p>1) Review the code and change any obvious level 80 stuff to level 85 stuff</p>\r\n<p>2) Load up various characters and check that the display values of things like hit %, crit% etc etc all match what is on the paper doll in game. If not find the error and fix (remember to remove buffs when checking).</p>\r\n<p>3) Play with talents make sure that adding or removing a talent correctly influences output</p>\r\n<p>4) Review the dps calcs is the model giving sensible outputs for each ability - if not why not.</p>\r\n<p>Fix as you go - having fixed the display values it makes it easy to test to see if changing something by a small amount actually reflects accurately in the output stats - eg: adding extra spellpower do all the dps abilities go up by the right amounts.</p>\r\n<p>If you get into it and want to help further apply to the co-ordinators to be granted developer status. We can then advise further.</p>\r\n<p>&nbsp;</p>\r\n<p>Enjoy.</p>\r\n",
    "PostedDate": "2011-02-07T14:32:54.28-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "562246",
    "ThreadId": "239138",
    "Html": "\r\n<p>By thousands, he actually means <em><strong>millions</strong></em>.</p>\r\n",
    "PostedDate": "2011-02-07T14:36:22.177-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "562587",
    "ThreadId": "239138",
    "Html": "\r\n<p>My understanding of the Genetic Algorithms in use by the Optimiser is that it does the generations and mutations in such a way as to avoid having to do Millions of calls to the model. ie: it doesn't have to consider all possible options as that sort of brute\r\n force attack is not how a GA works. I've not investigated the sort of GA in use but I'd imagine it is using some sort of hill climber methodology, with random mutations.</p>\r\n<p>&nbsp;</p>\r\n<p>Edit: In any case the model developers don't need to worry about how the optimiser works all they need to know is that if a block of stats is thrown their way all they need do is return what is the expected dps total for that stats. If the model developer\r\n thinks of it as the model takes a simple input of stats processes them and throws out a number and thats all they worry about then it gets them started.</p>\r\n",
    "PostedDate": "2011-02-08T05:02:08.24-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "562917",
    "ThreadId": "239138",
    "Html": "\r\n<p>Millions probably isn't far off. A typical Rawr model can do about 10-100k calculations per second.</p>\r\n",
    "PostedDate": "2011-02-08T13:52:46.407-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "562936",
    "ThreadId": "239138",
    "Html": "\r\n<p>According to my last round of tests, 20k calculation runs for most models were in the half second range. The slowest ran at 2-3 seconds and fastest at about a tenth of a second. With the VS2010 SP1 install, there's silverlight profiling so I was able to\r\n find out one of the big reasons DPSWarr was going so slowly. I chopped off like 66% of the slowness with 2 simple fixes.</p>\r\n<p>Edits: So at an average of 20k per 0.5 sec, running an optimize taking 5 minutes exactly: (5*60)*(2*20,000) = 12,000,000 combinations of gear run through a single calc to determine it's DPS/Tanking/Healing whatever scores. It starts with a giant negative\r\n number (something like -10 * 10^13th), then processes the first set of gear, which will always be higher than than giant negative. As it runs, it throws out gear combinations with a lower score than than that first set and each time it finds a set with a higher\r\n number, it makes that the new baseline (new sets after that have to be higher than that one). It does this until it runs out of\r\n<em>likely</em> combinations. The <em>likely</em> part is where Kavan's awesome shiny-ness comes in, he created some algorithms that allows us to limit the gear combinations to a much smaller number, where all the least likely combinations are thrown out before\r\n being processed. I don't know the details on this, I guess I should read the code in there more thoroughly at some point.</p>\r\n",
    "PostedDate": "2011-02-08T14:25:42.547-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "562972",
    "ThreadId": "239138",
    "Html": "\r\n<p>I guess it would be interesting to some to know a bit more what's happening under the hood so here it goes.</p>\r\n<p>In short the optimizer uses a variation of&nbsp;island based genetic algorithm. For a good analogy you can imagine there being many islands that are initially populated with 20 characters each. Each character does their job (dps, heals, tank) and gets a\r\n score, taking into account any constraints in form of penalties. The scores on each island&nbsp;are then&nbsp;compared and each character on the island is given a probability of being selected for succession, higher scored characters having a higher chance.\r\n When the new generation of population on the island is constructed the best character on the island always survives while the rest are generated by genetic operations. First there is a small chance of inserting a completely new random character. Next there\r\n is a chance that a character is generated with a crossover operation, this takes two parent characters and generates a new ones by taking some gear from each of them. Finally a new character can be created through mutation. In this case there is only one parent\r\n character which is modified by either changing some items, changing some gems or swapping some gems around. The island approach comes into play if there is no improvement for some time. If an island doesn't see any improvement in 50 generations it becomes\r\n open to outside pressure and when selecting parents for genetic operations they can be chosen from other islands also.</p>\r\n<p>One slightly problematic issue when trying to evaluate such a system is that we're dealing with a highly random system and what might work for one model or one character might not necessarily make it good in general. We don't currently have any standardized\r\n test suite to measure the performance of the optimizer, but if someone would be interested in something like this it's quite possible that some improvement could be made just by tweaking some parameters.</p>\r\n",
    "PostedDate": "2011-02-08T15:56:30.3-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "564052",
    "ThreadId": "239138",
    "Html": "\r\n<p>I'm going a little off-topic, but, as you guys are too, i'm gonna throw a sugestion at you.</p>\r\n<p>I've downloaded rawr's code this week, and took a fast look at the tree model, trying to fix the intellect issue. My time is quite limited, and it took me too long to understand where to find the bug. I believe i found it, but i still don't know if and what\r\n else needs changes. The lack of comments on the code doesn't help either.</p>\r\n<p>I believe all models must implement a given interface, so that the optmizer can handle all the models the same way. I just took a look into a couple of them, and could easly find the pattern. But all the rest seems to be implemented at the developer's discretion.</p>\r\n<p>Creating a simple Class diagram with the relations, should help a lot ocasional fixes by the comunity, as is my case, saving a lot of troubles to the development team.&nbsp;</p>\r\n<p>I mean, if users have documentation for easly figure their way around the models (classes mainly, as i believe the core, ui, etc have stable developers), it would be easier to keep thing going, by patching, even if the model developer is short on time.</p>\r\n",
    "PostedDate": "2011-02-10T09:08:13.65-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "564053",
    "ThreadId": "239138",
    "Html": "\r\n<p>Sure, if someone wants to take the time to actually write that I'm all for it, but the devs are strained as it is to keep writing code.</p>\r\n<p>The one with the most comments currently (I think) is Bear.</p>\r\n",
    "PostedDate": "2011-02-10T09:10:14.573-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "564125",
    "ThreadId": "239138",
    "Html": "\r\n<p>I'm not sure what you mean,&nbsp;all models inherit from CalculationsBase and that is pretty well documented I believe.</p>\r\n",
    "PostedDate": "2011-02-10T11:05:17.733-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "564485",
    "ThreadId": "239138",
    "Html": "<p>Indeed it is. I was only navigating in the model itself. I guess it's due to not being that used to VS. &nbsp;</p>",
    "PostedDate": "2011-02-11T01:45:38.51-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "571918",
    "ThreadId": "239138",
    "Html": "<p>Hi Rawr,</p>\r\n<p>Do you need shadowpreist volunteers. I am by no means a programmer but i do raid 4 times a week and upload our fights to World of logs we are currently 10/12 raid boss kills.I am really missing the use of this program.</p>",
    "PostedDate": "2011-02-24T20:44:13.297-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "571929",
    "ThreadId": "239138",
    "Html": "<p>Yes, we could use another Developer to help with ShadowPriest. If you know someone, send them our way.</p>",
    "PostedDate": "2011-02-24T21:18:00.333-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "575942",
    "ThreadId": "239138",
    "Html": "<p>Any pro Developers want to take on ﻿﻿﻿﻿﻿an additional project? =3 *coughs* Shadow Priest!?</p>\n<p>Am I wrong to use the Shadow Priest model right now? Are the numbers even ﻿remotely accurate? I realize the Spriest model is disregarding hit, but it's odd that it will actually give me a little but no where near enough. Why is this?</p>\n<p>&nbsp;I can pull insane dps&nbsp;in a&nbsp;dungeon&nbsp;but on a lvl ??&nbsp;boss it's miss* miss* miss* miss*. <span style=\"color: #800000;\"><em>\"Well of course you're missing, you're way below hit cap.\" </em></span>Let me explain why I trusted the model's decision, a lot of theory crafters have been saying that being as low at ~800 hit is okay for a shadow priest since the added stats make up for the misses. I've done this for awhile now and I can't seem to determine for myself.&nbsp; Hit cap or follow rawr's partially complete model? Is there anyway I can tell the optimizer to value hit?</p>",
    "PostedDate": "2011-03-05T00:20:01.507-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "576038",
    "ThreadId": "239138",
    "Html": "<p>Hello Everyone concerned with the Shadow Priest model.</p>\r\n<p>I am a new Rawr developer assigned to work on this module. At the moment I am just confirming some of the calculations and maths involved in the model. It's going a little slower than I expected. However you can expext to see some updates and improvments coming through shortly.</p>\r\n<p>Some of the things I am working/planning on right now. Expect this list to grow.</p>\r\n<ul>\r\n<li>User Priority Adjustments.</li>\r\n<li>Spell Calculation Verification</li>\r\n<li>Add Shadow Specific Charts</li>\r\n<li>Hit % selection to optimizer.</li>\r\n</ul>\r\n<p>I am not sure the hit % is such a big problem at the moment because for the most part hit is not as important as it used to be (for shadow anyways). Of course it is a useful stat but Int is just a big contibutor of dps these days.&nbsp;Hopefully my work will confirm these facts over the next couple of&nbsp;days.&nbsp;</p>",
    "PostedDate": "2011-03-05T09:08:20.913-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "576198",
    "ThreadId": "239138",
    "Html": "<p style=\"padding-left: 30px;\">Best.</p>\n<p style=\"padding-left: 30px;\">Day.</p>\n<p style=\"padding-left: 30px;\"><em><strong><span style=\"color: #000000; text-decoration: underline;\">E V E R </span><span style=\"color: #000000;\">! ! !</span><span style=\"color: #000000;\"> =D</span></strong></em></p>\n<p><span style=\"text-decoration: underline;\">&nbsp;</span></p>",
    "PostedDate": "2011-03-05T22:12:11.213-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "576518",
    "ThreadId": "239138",
    "Html": "<p>Hey discomurray,</p>\r\n<p>That is some good news!</p>\r\n<p>I hope to be able to contribute in testing a bit, since I have a (human) shadow priest that is currently raiding. (and I can make builds from the subversion repository to check things).</p>",
    "PostedDate": "2011-03-07T01:38:31.313-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "577376",
    "ThreadId": "239138",
    "Html": "<p>Huzzah!</p>\r\n<p>This is fantastic news. &nbsp;I wish I could offer some help, but I don't have much to offer. &nbsp;Instead I'll offer encouragement: &nbsp;Thank you for taking on this project and best of luck to you! &nbsp;I hope things happen quickly!</p>",
    "PostedDate": "2011-03-08T12:44:35.493-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "610866",
    "ThreadId": "239138",
    "Html": "<p>Shadow Priest&nbsp;are not a lucky people :)&nbsp; &nbsp;</p>",
    "PostedDate": "2011-05-11T04:44:06.23-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "612531",
    "ThreadId": "239138",
    "Html": "<p>Yeah, unfortunately, I've all but given up on rawr. =(</p>",
    "PostedDate": "2011-05-13T11:27:51.66-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "612921",
    "ThreadId": "239138",
    "Html": "<p>Join the club. I've been QQing about this for awhile. Miss the old expansions when we were loved.</p>",
    "PostedDate": "2011-05-15T03:39:01.213-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "612992",
    "ThreadId": "239138",
    "Html": "<p>Why not put the word out that there are open positions on the Rawr team?&nbsp; Surely we are not the only place to learn about your class, so go to those other places and let them know that we could use developers for various models.</p>",
    "PostedDate": "2011-05-15T09:10:33.78-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "613151",
    "ThreadId": "239138",
    "Html": "<p>The site states that Elemental &amp; Hunter are looking for Devs, not Shadow Priest. It's assumed that Discomurray is the Spriest dev. He's been on in March, so maybe the model doesn't need work just a explaination. Doesn't seem ﻿﻿﻿appropriate to spam for a new Dev when we have one, right?</p>",
    "PostedDate": "2011-05-15T23:37:05.14-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "613440",
    "ThreadId": "239138",
    "Html": "<p>Discomurray is still here, but cannot dedicate enough time to work on this as we would like. So yes, we need a shadow dev that can devote several hours a week to working on Rawr.</p>",
    "PostedDate": "2011-05-16T10:00:11.023-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "613714",
    "ThreadId": "239138",
    "Html": "<p>To add to this thread, I've also started working on the shadowpriest module now, but bear in mind that its going to take a lot of changes.&nbsp; I'm new to the code base so it takes some time to get used to things.&nbsp; I've got a few changes set aside that could be pulled into a separate patch if needed, mainly around fixing spell constants for things like mana cost etc.&nbsp; The bulk of my work right now is on doing a bigger refactor, to make things a little easier to work with for the future.&nbsp; I'm blatantly borrowing a lot of structure and code from the Moonkin module, as many of the concepts are similar and it saves a lot of time.&nbsp; I'd like to hopefully have something functioning within the next week or so, pending time balancing with work on my Masters.</p>",
    "PostedDate": "2011-05-16T23:04:35.837-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "614016",
    "ThreadId": "239138",
    "Html": "<p>Fantastic, thank you for stepping up. &nbsp;I know a lot of us appreciate it and would love to have a working shadowpriest model.</p>\r\n<p>Good luck!</p>",
    "PostedDate": "2011-05-17T08:47:46.007-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "616304",
    "ThreadId": "239138",
    "Html": "<p>Great! Good luck Eitri, anything at all is very much ﻿appreciated. Much respect to Discomurray as well, it's just too bad you can't&nbsp;dedicate your entire&nbsp;life to Rawr ;] I'm wondering if either of you two could answer my question - What exactly is and isn't working currently? When I compare stats from the model to live they are the same. I notice if you optimize for burst damage you'll be given 1800+ hit and if you optimize for&nbsp;sustained you'll be given 500- hit. This seems far too low, however MB is our only CD and the model isn't stacking mastery so perhaps this isn't so bogus after all. O.e;</p>",
    "PostedDate": "2011-05-21T16:26:53.373-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "616346",
    "ThreadId": "239138",
    "Html": "<p>There are some big areas missing for Cata support.</p>\r\n<p>First off, the new way haste affects dots hasn't been updated, meaning haste scaling is off.&nbsp; This affects spell information on dots as well as dps totals.&nbsp; I've mostly got this fixed on my copy, this is probably the easiest to implement and test, as the mechanics are already modeled in other modules like Moonkin.</p>\r\n<p>Second, Improved Devouring Plague support needs to be adjusted.&nbsp; This is slightly related to the above change, but basically the way that the damage on casting Devouring Plague is calculated does some different checks than the calculations for hasting dots.&nbsp; This should not be a huge impact on numbers but needs to be handled at some point.</p>\r\n<p>Third, Shadow Word: Death is ignored for the current rotation.&nbsp; Need to implement using it during execute phase based on Boss Handler options.&nbsp; This also includes the mana gains from Masochism, double SW:D from the glyph, damage boost from Mind Melt, etc.</p>\r\n<p>Fourth, Mind Flays impact on other spells isn't implemented.&nbsp; This includes SW:P refresh chance and crits reducing shadow fiend CD.&nbsp; This should be fairly easy to implement, pending other modifications to the rotation code.&nbsp; Probably going to take the easy way out and assume 100% uptime of SW:P and model it more nicely later.</p>\r\n<p>Fifth, Dark Evangelism/Dark Archangel isn't modeled.&nbsp; Neither the dot buff from having stacks off mind flay, or the use of the dps CD for mana and the direct damage buff.&nbsp; Haven't dug into this at all, not sure how I'm going to work it out.</p>\r\n<p>Sixth, Shadowy Apparitions are ignored.&nbsp; This one is going to be complicated.&nbsp; Need to calculate the number of SW:P ticks, while adjusting for the movement % increase and the 4 apparition limit.&nbsp; Also need to implement the 4 piece damage bonus.</p>\r\n<p>Last, but certainly not least, mastery is basically ignored.&nbsp; It has no effect on rotation (in terms of adjusting mind blast usage based on number of orbs up), or in terms of the actual dps increase of empowered shadows being active.&nbsp; This obviously has a very big impact on numbers.&nbsp; My plan right now is to cheat and just add a slider for Empowered Shadows uptime to get something working, and put together a more elegant solution for calculating uptime based on actual casts later.&nbsp; In addition to general mastery implementation, Harnessed Shadows needs to be handled for its effect on orb generation.</p>\r\n<p>For \"rotation\", the first iteration will also likely just mind blast on CD, once again in the interest of time.&nbsp; Priority is assumed to be VT -&gt; DP -&gt; SW:P -&gt; SFiend -&gt; Dark Archangel -&gt; SW:D (under 25%) -&gt; Mind Blast -&gt; Mind Flay.&nbsp; Later on I'd like to try to make it a little smarter about keeping Empowered Shadows up, but for now I'm just trying to get something spitting reasonable numbers.</p>\r\n<p>I hope this doesn't scare anyone off =)&nbsp; I know its a big list, but I'm hoping to just knock things out one at a time, using estimations instead of full models as needed, and fine tune as time is available.&nbsp; Also, feel free to provide feedback if something doesn't look quite right or if my statements seem off.&nbsp; Most of my information is based on discussions from shadowpriest.com, Elitist Jerks, and howtopriest.com.</p>",
    "PostedDate": "2011-05-22T00:13:34.49-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "618430",
    "ThreadId": "239138",
    "Html": "<p>The Spriest model needs some good ole TLC it seems, thanks a ton for listing all this. I wont bug you with anymore questions as I'm sure you're busy enough as is. I've noticed a lot of the things you've mentioned myself - for instance the model would rather use both my 2 set bonuses on my pvp gear and my T11 instead of my T11 4 set. Also, sure you already know this, the trinket&nbsp;scaling is pretty whacked. Good luck dude! Willing to donate if I can actually use the Spirest model. ^^ &lt;3</p>",
    "PostedDate": "2011-05-25T21:07:42.84-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]