[
  {
    "Id": "539492",
    "ThreadId": "239293",
    "Html": "\r\n<p>Astrylian, I was curious as to when the cat model will be updated to at least mostly ready.&nbsp; I myself have noticed that the reforging seems to play more of&nbsp;a game of ping-pong.&nbsp; For example, one item is telling me to reforge Crit &gt; Haste\r\n and on the next piece of gear it tells me to reforge Haste &gt; Crit.&nbsp; Any idea why its having me ping-pong&nbsp;stats back and forth throughout my gear, seems like one change I make has me &quot;fix&quot; it on another piece.&nbsp; So how accurate is this model\r\n at least with the math. Also on Elitist Jerks Feral-Cat thread there was some concerns about the discrepencies between rawr-cat model and mew.&nbsp; Stating that rawr-cat favors&#65279;&#65279;&#65279;&#65279;&#65279;&#65279;&#65279;&#65279; haste over crit, and mew favors crit over haste.</p>\r\n<p>The response on EJ was; &#65279;<a href=\"http://elitistjerks.com/f73/t110352-feral_cat_cataclysm_release/p2\">http://elitistjerks.com/f73/t110352-feral_cat_cataclysm_release/p2</a>&nbsp; post #40</p>\r\n",
    "PostedDate": "2010-12-22T11:29:51.413-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "539519",
    "ThreadId": "239293",
    "Html": "Rawr.Cat is fully ready for use. I'm looking into the discrepancies between Rawr and Mews, but they're definitely very close, and I don't know that one is more right than the other yet. Regarding the haste/crit 'ping-ponging', thats probably due to haste\r\n softcaps. Haste has several breakpoints in it where it's actually a DPS *loss* for brief periods, due to Fury Swipes ICD.\r\n",
    "PostedDate": "2010-12-22T12:18:29.25-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "539522",
    "ThreadId": "239293",
    "Html": "\r\n<p>Thank you for the clarification with the haste info, keep up the good work!</p>\r\n",
    "PostedDate": "2010-12-22T12:22:41.943-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]