[
  {
    "Id": "539393",
    "ThreadId": "239267",
    "Html": "\r\n<p>For those of you who like having the latest version of Rawr, Kavan has been slowly implementing an off-line version of Rawr that does not use Silverlight. The format we are going to be using is Windows Presentation Foundation (WPF) format. This format is\r\n similar to how Rawr2 ran in that it is designed for Windows Operating Systems (sorry Macs). This is a concurrent project meaning people who like the Web version (or run on Macs) can continue running the Silverlight version and still have the latest updates\r\n when we post them. On the other hand people who like having their Rawr as an off-line program can use the WPF release.</p>\r\n<p>Two advantages to the WPF format are:</p>\r\n<p>a) Less stress on Rawr's server - Currently when people request Character Importing from the Armory, they have to first request the Rawr server who in turn requests the information. There are currently security features in Silverlight that obstruct us from\r\n making Silverlight make these requests. Since the WPF format is offline and does not actually use Silverlight as it's basis, users can make the armory request directly with the Armory instead of through a middle-man, resulting in less stress for us and faster\r\n armory loads for the users.</p>\r\n<p>b) Faster calculations - As people who have been using the &quot;Use Offline&quot; feature of the Silverlight format can attest, running Rawr in Offline mode does produce faster calculations then when run in a web browser. By having the WPF format as an offline only\r\n option we can be sure to have faster optimizations, calculations, etc than running Silverlight Rawr on the web browser.</p>\r\n<p>&nbsp;</p>\r\n<p>For those who wish to test the WPF format using the latest Source Code, you will need to install one more Toolkit. If you would go to http://wpf.codeplex.com/releases/view/40535 and install the msi or source code you should be able to run with no problems.</p>\r\n",
    "PostedDate": "2010-12-22T08:09:01.76-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "539456",
    "ThreadId": "239267",
    "Html": "\r\n<blockquote style=\"border:solid .1em #ccc; font-style:italic; margin:.25em 1em 0 1em; padding:0 .25em 0 .25em\">\r\n<strong>Hinalover wrote:</strong><br>\r\n<p>As people who have been using the &quot;Use Offline&quot; feature of the Silverlight format can attest, running Rawr in Offline mode does produce faster calculations then when run in a web browser.&nbsp;</p>\r\n</blockquote>\r\n<p>Just for the record, this is incorrect; Rawr4.Silverlight, running in the browser, or out of the browser (&quot;install offline&quot;) will have identical performance. But yes, Rawr4.WPF should be about 20% faster.</p>\r\n",
    "PostedDate": "2010-12-22T10:03:17.823-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "539540",
    "ThreadId": "239267",
    "Html": "\r\n<p>Ok, I installed the WPFtoolkit and downloaded the latest source code...now what? :D</p>\r\n",
    "PostedDate": "2010-12-22T12:51:36.58-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "539649",
    "ThreadId": "239267",
    "Html": "\r\n<p>Aww man! I wasn't actually ready for this, there are several opening issues with WPF that I wanted to take care of before having general public start testing it.</p>\r\n",
    "PostedDate": "2010-12-22T16:46:42.42-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "540338",
    "ThreadId": "239267",
    "Html": "\r\n<p>Sooo....I take it us normal folk can't use this yet?</p>\r\n",
    "PostedDate": "2010-12-24T17:07:58.88-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "540347",
    "ThreadId": "239267",
    "Html": "\r\n<p>No, please don't, not yet. The WPF version *theoretically* works as much as the Silverlight version does, but we don't know that for sure without playing with it some and Kavan only *just* got it compilable where other devs can start loading it and making\r\n sure nothing breaks by talking between SL and WPF with shared files. I had already hit a series of initial red flags when I first got it running and would like to resolve them before we go getting a bunch of Issues created for stuff that wasn't even ready\r\n yet, like we are now for a bunch of models that haven't been updated for Cata yet.</p>\r\n",
    "PostedDate": "2010-12-24T17:55:11.067-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "540349",
    "ThreadId": "239267",
    "Html": "\r\n<p>Dang, ah well :D &nbsp;Keep us posted...would love to have an offline non-SL version for my high-powered rig to crush numbers with.</p>\r\n",
    "PostedDate": "2010-12-24T17:58:02.79-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "542321",
    "ThreadId": "239267",
    "Html": "\r\n<p>We love you guys, thanks for your hard work!</p>\r\n",
    "PostedDate": "2010-12-30T12:54:21.497-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "542662",
    "ThreadId": "239267",
    "Html": "\r\n<p>I don't mind the offline part that much, but I would really love to be able to test more recent versions of the source code.<br>\r\n<br>\r\nIt' a little frustrating when Jothay &quot;The Rocket&quot; fixes your issue within a couple of hours and then you have to wait a week for the next release. :)</p>\r\n",
    "PostedDate": "2011-01-01T04:10:03.89-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "542718",
    "ThreadId": "239267",
    "Html": "\r\n<blockquote style=\"border:solid .1em #ccc; font-style:italic; margin:.25em 1em 0 1em; padding:0 .25em 0 .25em\">\r\n<strong>naka wrote:</strong><br>\r\n<p>I don't mind the offline part that much, but I would really love to be able to test more recent versions of the source code.<br>\r\n<br>\r\nIt' a little frustrating when Jothay &quot;The Rocket&quot; fixes your issue within a couple of hours and then you have to wait a week for the next release. :)</p>\r\n</blockquote>\r\n<p>Welcome to the club.</p>\r\n",
    "PostedDate": "2011-01-01T13:16:15.387-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "542723",
    "ThreadId": "239267",
    "Html": "\r\n<p>Anyone can run the latest version by downloading the code and compiling it with visual studio.</p>\r\n<p>And when did I get the nickname of &quot;The Rocket&quot;?</p>\r\n",
    "PostedDate": "2011-01-01T13:49:01.437-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "542752",
    "ThreadId": "239267",
    "Html": "\r\n<blockquote style=\"border:solid .1em #ccc; font-style:italic; margin:.25em 1em 0 1em; padding:0 .25em 0 .25em\">\r\n<strong>Jothay wrote:</strong><br>\r\n<p>Anyone can run the latest version by downloading the code and compiling it with visual studio.</p>\r\n</blockquote>\r\n<p>Can someone do a short tutorial of how to do this? (If it's not too complicated)</p>\r\n",
    "PostedDate": "2011-01-01T15:06:52.637-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "542756",
    "ThreadId": "239267",
    "Html": "\r\n<p>We have a thread open that states all the tools you need. once its is downloaded and opened in VS, you should be able to just compile (from the debug menu) if set everything up right. if you hit problems, use that thread to state the first couple error messages\r\n and ask for help.</p>\r\n",
    "PostedDate": "2011-01-01T15:13:18.763-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "542782",
    "ThreadId": "239267",
    "Html": "\r\n<p>Do you have a link to the thread?</p>\r\n",
    "PostedDate": "2011-01-01T18:04:06.447-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "542783",
    "ThreadId": "239267",
    "Html": "\r\n<p>Search the word Compile</p>\r\n",
    "PostedDate": "2011-01-01T18:06:04.983-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "543003",
    "ThreadId": "239267",
    "Html": "\r\n<p>Having recently over New Year setup my laptop to look at the code. I'd suggest that perhaps info from that thread could usefully be placed in documentation so that anyone who wants to compile as well as new developers have the info they need to get started.\r\n All the usual caveats about compiling from source might not work, don't post tickets about it would be added to such documentation of course.</p>\r\n<p>It took me a while to piece together the threads required and even then I still needed to install the silverlight toolkit from April which wasn't mentioned in the primary thread.</p>\r\n",
    "PostedDate": "2011-01-02T18:09:41.787-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "544269",
    "ThreadId": "239267",
    "Html": "\r\n<p>So any new updates on this for those that don't have a Master's degree in programming?</p>\r\n",
    "PostedDate": "2011-01-05T05:20:13.567-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "548807",
    "ThreadId": "239267",
    "Html": "\r\n<p>Weekly bump?</p>\r\n",
    "PostedDate": "2011-01-13T09:18:15.727-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]