[
  {
    "Id": "539662",
    "ThreadId": "239340",
    "Html": "\r\n<p>I'm so tired, so very very tired. I've been working on Rawr almost every waking hour for several weeks now (except for my commitments at work) doing everything I can to make sure that Rawr is up, ready, and easy to use for all of our Users.</p>\r\n<p>At this point, its become a bit of an obsession for me and I need to take a few days to kick back and get out of the house, see my family, go to the movies, just\r\n<strong>something</strong> else.</p>\r\n<p>I'll be back shortly, I promise. =)</p>\r\n",
    "PostedDate": "2010-12-22T17:12:08.053-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "539684",
    "ThreadId": "239340",
    "Html": "\r\n<p>A well deserved break it is, at least from where I'm sitting. &nbsp;Have a good holiday of your choice!</p>\r\n",
    "PostedDate": "2010-12-22T18:29:05.147-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "539754",
    "ThreadId": "239340",
    "Html": "\r\n<p>But but but....this needs fixing and that's still messed up and what about that and this too. oh oh oh wait the WPF stuff isn't ready for testing yet and and and you can't.......ah screw it.</p>\r\n<p>Enjoy your well deserved break Jothay!!!!</p>\r\n",
    "PostedDate": "2010-12-22T22:48:36.883-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "539765",
    "ThreadId": "239340",
    "Html": "\r\n<p>I've got your back.&nbsp; I'll be sure to have some fun posting the Posting Guidelines in your absence.&nbsp; :P</p>\r\n",
    "PostedDate": "2010-12-22T23:32:17.08-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "539869",
    "ThreadId": "239340",
    "Html": "\r\n<p>heh.<br>\r\nBeing in a bit of the same situation but the effort has all been going into work.&nbsp; With the half hour commute, and the lunch break when I check this site being the only real 'distraction' I've been getting.&nbsp;<br>\r\nAt least we're getting Xmas and newyear off...&nbsp; maybe... :p</p>\r\n<p>In any case, still stuck with work until at least the end of januari when we're getting a big product review and usability test. The results of that will determine what happens next.</p>\r\n",
    "PostedDate": "2010-12-23T05:00:08.187-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]