[
  {
    "Id": "539623",
    "ThreadId": "239332",
    "Html": "\r\n<p>Can relative stat values be altered? I have a fire mage and the stats weights on mastery are very low and I was wondering if there was a way to customize that. I am just looking to make haste and mastery closer in value.</p>\r\n<p>&nbsp;</p>\r\n<p>Thx</p>\r\n<p>-nitrax-</p>\r\n",
    "PostedDate": "2010-12-22T15:39:13.223-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "539641",
    "ThreadId": "239332",
    "Html": "\r\n<blockquote style=\"border:solid .1em #ccc; font-style:italic; margin:.25em 1em 0 1em; padding:0 .25em 0 .25em\">\r\n<strong>nitrax wrote:</strong><br>\r\n<p>Can relative stat values be altered? I have a fire mage and the stats weights on mastery are very low and I was wondering if there was a way to customize that. I am just looking to make haste and mastery closer in value.</p>\r\n<p>&nbsp;</p>\r\n<p>Thx</p>\r\n<p>-nitrax-</p>\r\n</blockquote>\r\n<p>The only way to do that would be to change the mage model itself. &nbsp;The relative values are calculated based on your current stats.</p>\r\n<p>The whole point of Rawr is to be able to calculate possible gear combinations based on a model for your class. &nbsp;What I believe you mean to say is there is a problem with the Mage model undervaluing mastery. &nbsp;It's possible, but I have no clue about\r\n the Mage model. &nbsp;What basis do you have for thinking that mastery is under-valued?</p>\r\n",
    "PostedDate": "2010-12-22T16:23:16.873-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "539650",
    "ThreadId": "239332",
    "Html": "\r\n<p>Nitrax, and anyone else reading this thinking the same question, stat weights are\r\n<strong>NOT WHAT RAWR DOES</strong>.</p>\r\n<p><a href=\"http://rawr.codeplex.com/documentation\" target=\"_blank\">http://rawr.codeplex.com/documentation</a></p>\r\n<p><a href=\"http://rawr.codeplex.com/wikipage?title=FAQ&referringTitle=Documentation#01\" target=\"_blank\">http://rawr.codeplex.com/wikipage?title=FAQ&amp;referringTitle=Documentation#01</a></p>\r\n",
    "PostedDate": "2010-12-22T16:48:27.25-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "539680",
    "ThreadId": "239332",
    "Html": "\r\n<p>So in simple terms, trust it and I should see success ?</p>\r\n<p>&nbsp;</p>\r\n<p>I have always before so I dont have an issue with that. I has always worked very well. So it takes the gear avail and makes the best choices it sounds( based on the selection of current gear).</p>\r\n<p>&nbsp;</p>\r\n<p>I was just suprised to see such low mastery. and from the information I have read till now I was under the impression I should have a bit more mastery. Mastery is about balance with haste, if not a bit better. I will try and follow Rawr to a &quot;T&quot; and see\r\n if I see a difference.</p>\r\n<p>&nbsp;</p>\r\n<p>Again I have always trusted it before and have had great success, so thank you for what you guys do and the hard work you put out.</p>\r\n",
    "PostedDate": "2010-12-22T18:11:35.387-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "539699",
    "ThreadId": "239332",
    "Html": "\r\n<p>Specifically regarding fire mastery in Rawr.Mage, there is some discussion going about Rawr.Mage and SimulationCraft having significantly different values of mastery for fire. Last I heard, both sides are investigating that, and haven't found a conclusive\r\n reason for that yet, or which one is more accurate.</p>\r\n",
    "PostedDate": "2010-12-22T18:54:19.813-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "539831",
    "ThreadId": "239332",
    "Html": "\r\n<p>Nope Nitrax it is not about trusting it, its about testing it. The point you were missing is that there are NO relavtive stats values to tweak, such a thing simply doesn't exist in Rawr. Instead we work out how each ability/talent/enchant/stat contributes\r\n to your dps. There are lots and lots of calculations that work out how things interact and give a dps result.</p>\r\n<p><br>\r\nWhat we CAN tweak is therefore the formulas, so if a formula is giving the wrong result eg: if it says your damage from spell X should be xxxxx but you are constantly seeing yyyyy. Then perhaps there might be an issue with the formula that calculates the damage\r\n from spell X or some of the talents affecting it. If you find such a problem we can tweak the formula and it should fix that. That might in turn make a stat like mastery appear better. However this is as a result of making the formulas better.</p>\r\n<p>TLDR: we calculate dps based on formulas, there are NO stats values to tweak.</p>\r\n",
    "PostedDate": "2010-12-23T02:54:22.427-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "539833",
    "ThreadId": "239332",
    "Html": "\r\n<p>To clarify, the &quot;Relative Stat Values&quot; you see in Rawr are outputs only, never inputs. They're not actually used for anything in Rawr. Your gear, enchants, buffs, fight parameters, etc, are the inputs.</p>\r\n",
    "PostedDate": "2010-12-23T03:01:48.513-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]