[
  {
    "Id": "540981",
    "ThreadId": "239696",
    "Html": "\r\n<p>If I import from Armory on my Windows 7 laptop, everything is great.&nbsp; I see the whole gear lists for each slot.&nbsp; However, if I import from Armory on my Windows Vista 64 box, I don't see any other gear except the gear I'm wearing.&nbsp; I thought\r\n it was that Windows Vista 64 didn't work so well with the latest Rawr, but then I talked to a friend who uses Windows 7, and he said he was having the same problem.&nbsp; He couldn't get any other gear to show up.</p>\r\n<p>Is this a known issue?&nbsp; Is there a workaround to get other gear to show up?</p>\r\n<p>Great job, looking forward to more polished versions!</p>\r\n<p>-- edit --</p>\r\n<p>I've loaded my feral cat and mage, and see the same behavior.&nbsp; Offtopic:&nbsp; feral cat is saying that haste and crit are about the same at my gear level?&nbsp; Could this be right, or is model just kind of off right now?</p>\r\n",
    "PostedDate": "2010-12-27T15:25:15.42-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "540985",
    "ThreadId": "239696",
    "Html": "\r\n<p>You managed to get a blank item cache (probably due to a crash or quit while it was loading or something). Options &gt; Reset All Caches. That should fix it for you.</p>\r\n<p>Cat is working file right now; it's totally reasonable for Haste and Crit to be of similar values at some gear levels.</p>\r\n",
    "PostedDate": "2010-12-27T15:40:16.947-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "540990",
    "ThreadId": "239696",
    "Html": "\r\n<p>Thanks for the quick reply, I'll give that a try when I get home tonight.</p>\r\n<p>&nbsp;</p>\r\n<p>More offtopicness:&nbsp; Trinket list looks pretty strange for feral cats, assume many of the trinkets aren't being modelled correctly atm, especially all the the &#43;AGI and proc ones.&nbsp; And, it doesn't seem to like my JC &#43;67 AGI gems at all.</p>\r\n",
    "PostedDate": "2010-12-27T16:00:27.073-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "540995",
    "ThreadId": "239696",
    "Html": "\r\n<p>It's not a problem of not being 'modeled properly', but rather a problem of the current live item cache not having the right data for all of them (especially the heroic versions of the trinkets). I can see how that's not much of a difference to users though.</p>\r\n<p>&nbsp;</p>\r\n<p>EDIT: Oh, I guess it does have one important difference: You can simply edit the item and add the right proc to it, and it'll work fine. Additionally, your 67agi gems are a known issue: they're considered Unique(1) instead of Unique(3) by the current live\r\n version. Just either manually add the 3 67agi ones yourself, or edit them and make them non-unique, and then manually only use 3 of the ones it tells you to. That'll be fixed in the next version.</p>\r\n",
    "PostedDate": "2010-12-27T16:09:40.827-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "541303",
    "ThreadId": "239696",
    "Html": "\r\n<p>Thanks that worked, all the gear shows up now.&nbsp; I'll try the 67 AGI Gem workaround you suggest tonight.&nbsp; Not clear how I could add the right proc to trinkets, but maybe I'll be able to figure it out...</p>\r\n<p>Just curious, did you guys consider doing this in Java?&nbsp; Would have been nice to run Rawr on the Android platform.&nbsp; I know squat about Silverlight, but it seems to act a lot like Java applets.</p>\r\n",
    "PostedDate": "2010-12-28T10:51:26.117-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "541325",
    "ThreadId": "239696",
    "Html": "\r\n<p>Doing it in Java would be possible, though almost certainly slower performance, and more importantly, would be a complete rewrite from scratch (instead of an 80&#43;% port), in a language/platform that none of us know or use at all. ie, it's pretty well out\r\n of the question.</p>\r\n",
    "PostedDate": "2010-12-28T11:49:36.423-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]