[
  {
    "Id": "541104",
    "ThreadId": "239737",
    "Html": "\r\n<p>Dear developers,</p>\r\n<p>thanks for your most valuable time and your very much appreciated work with Rawr. I couldn't live without it.</p>\r\n<p>&nbsp;</p>\r\n<p>I wonder how I can handle items with random stats in best possible way. As you surely know, all drops from Throne of the Four Winds contains random stats, which don't show up on the armory (not yet at least). There seems to be some kind of bug for me that\r\n doesn't allow updating items correctly until restart. I e, if I edit an existing item to match my stats, the calculation will be misleading and incorrect (at least it was for me until I restarted the application). I also wonder if there is a better way at\r\n all for adding the customized gear that drops from Four Winds.</p>\r\n<p>(Sorry if this topic has been brought up before, but I can't seem to find it. And by the way, the model I used was Rawr.Bear, and the item slot was waist, and since the calculated mitigation and survival stats seems reasonable now after a restart, I assume\r\n this depends on a bug as described.)</p>\r\n<p>&nbsp;</p>\r\n<p>I also wonder if there is a way to allow me to chose every reforging possible. This is very frustrating when I use Rawr.Cat and want to use some tank pieces, since I can't chose a specific waist with haste reforged to dodge (i e).</p>\r\n",
    "PostedDate": "2010-12-28T02:12:32.477-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "541273",
    "ThreadId": "239737",
    "Html": "\r\n<p>Indeed, you can load it from Battle.net, it'll load a blank version of the random-suffix item. Then just edit the item to give it the stats yours has (if you have two of them... sorry, no way to support that right now). And yeah, there's a bug where sometimes\r\n you have to relaunch Rawr after editing items.</p>\r\n",
    "PostedDate": "2010-12-28T09:50:25.383-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "541411",
    "ThreadId": "239737",
    "Html": "\r\n<p>Thanks for your reply.</p>\r\n<p>Regarding the other matter, is there a solution to that? Even a work-around would be fine. My only solution right now is to load my tank-gear, then manually update all other pieces (which usually are most of the items).</p>\r\n",
    "PostedDate": "2010-12-28T16:13:47.917-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "541416",
    "ThreadId": "239737",
    "Html": "\r\n<p>I guess I don't understand what you're asking?</p>\r\n<p>The charts show the top X instances of each item (X set in the Edit Gemming Templates) screen. You can choose any item, any gems, any enchant, and any reforge, using the item pickers on the left half of the screen.</p>\r\n<p>I don't know if that answers your question; probably not. Please clarify what your asking.</p>\r\n",
    "PostedDate": "2010-12-28T16:31:30.257-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "541418",
    "ThreadId": "239737",
    "Html": "\r\n<p>Oh, sorry. Thought it was clear, and maybe it's possible, and I'm just stupid. May very well be the case :)</p>\r\n<p>I mainly use all my agility-gear for tanking, which means I have different sets for bear/cat, but they share some pieces. I e, I use the very same waist for both tanking and dps'ing, but still I gem and reforge for tanking (and I don't switch for the rare\r\n ocasions I dps). The problem is I can't chose the waist with that reforging, since I can only see the dps gaining reforges, which means I can never chose haste -&gt; dodge when I use the cat model. That's why I wondered if there were any way to turn on the\r\n option to see all reforging options, not only the ones relevant to dps, since I now can't compare wheter I should continue to use my epic tank waist (with bad reforging), or my rare waist with dps reforging. Since bears and cats share much of the gear, this\r\n should be a common &quot;problem&quot; for many feral nerds, I guess.</p>\r\n<p>Actually, as I explained it, I figured I can only switch model quick, change the reforging and change back to Rawr.Cat again. Case closed, if there aren't any other solutions?</p>\r\n",
    "PostedDate": "2010-12-28T16:39:28.67-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "541421",
    "ThreadId": "239737",
    "Html": "\r\n<p>Ah, yes. Swap models and then swap back.</p>\r\n",
    "PostedDate": "2010-12-28T16:49:21.677-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]