[
  {
    "Id": "541829",
    "ThreadId": "239928",
    "Html": "\r\n<p>Hello</p>\r\n<p>I want to ask, why the Linux users are excluded from the system ?</p>\r\n<p>I ask this because I'm&nbsp; linux user, and I play World of Warcraft near of five years ago. and&nbsp; ever I use linux</p>\r\n<p>In the version 2.4.,X, I use your desktop software with mono without problems but now i cant use it</p>\r\n<p>Now you change the method of develop to Micro$oft&nbsp; tool (Silverlight) and now i cant use it</p>\r\n<p>I want to know what system I can use to customize my Abatars because your system is the better in this moment</p>\r\n<p>&nbsp;</p>\r\n<p>Please help me.</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n",
    "PostedDate": "2010-12-29T11:32:00.837-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "541830",
    "ThreadId": "239928",
    "Html": "\r\n<p>Complain to Moonlight, or whatever they are calling that linux port now, for not being up to date?</p>\r\n",
    "PostedDate": "2010-12-29T11:33:27.933-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "541831",
    "ThreadId": "239928",
    "Html": "\r\n<p>The moonlight send errors because need microsoft libraries, that are not in linux</p>\r\n<p>:(</p>\r\n<p>&nbsp;</p>\r\n",
    "PostedDate": "2010-12-29T11:35:59.937-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "541838",
    "ThreadId": "239928",
    "Html": "Well, to be blunt, you're on Linux, you should understand this. That's the major downside to Linux that you have to live with, as a Linux user: ports are sometimes slow, and you'll almost never be the target audience. You can complain about &quot;Micro$oft&quot;,\r\n all day but it's exactly the same situation as you have been in for 5 years. Mono is a port of Microsoft .NET, Moonlight is a port of Microsoft Silverlight. Moonlight happens to be way behind.",
    "PostedDate": "2010-12-29T11:59:07.393-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "541865",
    "ThreadId": "239928",
    "Html": "\r\n<p>It's the same philosophy behind viruses and spyware...why take the time to develop malware for, say, Linux or Mac, just so you can try and hack the three people out there using it? &nbsp;It's a waste of time.</p>\r\n<p>On a side note, I find it hilarious when a Linux user asks for tech support...I thought those guys 'were' the support?</p>\r\n",
    "PostedDate": "2010-12-29T12:55:11.227-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "541868",
    "ThreadId": "239928",
    "Html": "\r\n<p>Thank for your words&nbsp;<a id=\"x_ctl00_ctl00_MasterContent_Content_PostRepeater_ctl06_UserNameLink\" href=\"http://www.codeplex.com/site/users/view/Astrylian\">Astrylian</a>, but with mono i can run your old software, but with moonlight &nbsp;i cant use rawr,</p>\r\n<p>Then I see that you are searching barriers only to selected group,</p>\r\n<p>&nbsp;</p>\r\n<p>Thank you for your help me in Wow 2.4.X, sorry that now I cant use your software.</p>\r\n<p>Please if someone can run rawr in Linux please say me HOWTO because i try all to run it, and my FireFox, my Chromium, My Konqueror, and others are broken when I try to open Rawr.</p>\r\n<p>Thanks&nbsp;</p>\r\n<p>&nbsp;</p>\r\n",
    "PostedDate": "2010-12-29T12:59:02.893-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "541896",
    "ThreadId": "239928",
    "Html": "Rawr 2.x was built on .NET, which you used through Mono. Rawr 4.x is built on Silverlight, which you use through Moonlight. Unfortunately, Moonlight is incomplete and buggy, last I checked. So, talk to the Moonlight team.\r\n",
    "PostedDate": "2010-12-29T13:44:41.247-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "541897",
    "ThreadId": "239928",
    "Html": "\r\n<p><a href=\"http://www.mono-project.com/Moonlight\">http://www.mono-project.com/Moonlight</a></p>\r\n",
    "PostedDate": "2010-12-29T13:45:47.74-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]