[
  {
    "Id": "542790",
    "ThreadId": "240170",
    "Html": "\r\n<p>From EJ ( http://elitistjerks.com/f78/t105429-cataclysm_mechanics_testing/p8/#post1830133 )</p>\r\n<p style=\"padding-left:30px\">My first test was just to check procc rate and it seems to be 1PPM. Did it with a 2.2 sword and flowers in offhand, ~3.6% was the expected procc rate but got 3.2%.<br>\r\nSpecial attacks (tested with SS) can procc it, so can FoK.<br>\r\nIt benefits from the 8% spellpower buff, seem to have a 150% crit and I'm fairly sure it is spell crit.<br>\r\nOn the sad news however, it does not seem to benefit from Bandit's guile (got a 4k procc during deep insight)<br>\r\n<br>\r\nMost interesting thing here that it seem to not have any ICD at all, or if it does a very short one. Observed proccs as close as 5 sec after each other in my first test when the log wasnt that spammy.</p>\r\n<p>I'm not sure I have it modeled perfectly in my Rawr, I have it as Physical hit, no ICD, 5000 nature dmg, 3% chance.&nbsp; I'm not sure this accounts for it being critable, nor the spellpower buff or miss chance (reportedly misses on spell hit table from\r\n other sources).&nbsp; By this modeling it's a decent trinket but not BiS.&nbsp; Any suggestions on changes to my settings for it?&nbsp; Or do I have it about right?</p>\r\n",
    "PostedDate": "2011-01-01T19:13:10.55-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "542800",
    "ThreadId": "240170",
    "Html": "\r\n<p>Well I currently have it set at 5% chance in the latest release (4.0.14b) so it being at 3.2% - 3.6% is not too terribly off. This was actually one of the few trinket procs I was having issues with in terms of modeling, so any additional information would\r\n be helpful. Some useful information would be to get the number attacks and the number of procs.</p>\r\n",
    "PostedDate": "2011-01-01T20:44:35.867-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "542835",
    "ThreadId": "240170",
    "Html": "\r\n<p>I turned mine in today and spent some time on the raider dummy.&nbsp; Looking pretty dismal for cat spec, honestly.&nbsp; Two different 3 minute full rotation trials, both only 5 procs.&nbsp; It can miss, it can crit (150% crit).&nbsp; No buffs, though I\r\n did use Berserk once and Lifeblood twice each run.</p>\r\n<p>Attacks that might have been able to proc in the last 3 min run:</p>\r\n<p>48 Shred, 203 Melee, 4 Ferocious Bite, 17 Fury Swipes, 5 Mangle, 14 Rake</p>\r\n<p>That's a 1.7% proc chance assuming all of those can proc.&nbsp; The counts were roughly the same for the other 3 min run.</p>\r\n<p>Inputting 1.7% in Rawr lines up almost exactly with modeling it as 1 PPM no ICD which is what the EJ rogue forums have been proposing is the correct model.&nbsp; Seems like more data in support of that.&nbsp; I'm moving my Rawr to 1 PPM and I'll probably\r\n just wear this for PvP :(.</p>\r\n<p>Well...that was a huge waste of herb farming haha...</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n",
    "PostedDate": "2011-01-02T02:59:03.017-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]