[
  {
    "Id": "542887",
    "ThreadId": "240196",
    "Html": "\r\n<p>Just continuing the discussion from the issue I placed.</p>\r\n<p>I guess I'm more concerned that an item like the Caridean Epaulettes were missing from the item cache completely. &nbsp;Had I not gotten the drop and tried to see where it fit into my set in Rawr I wouldn't have even known the item was missing. &nbsp;This\r\n item turns out to be pretty high on the list of potential items so to another druid looking for upgrades this wouldn't have been listed.</p>\r\n<p>When you update the global item cache from wowhead or the like do you just query every item from 1-100000 or how do you ensure that you are getting a good full set of items?</p>\r\n",
    "PostedDate": "2011-01-02T09:05:55.72-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "542921",
    "ThreadId": "240196",
    "Html": "\r\n<p>Like we already said in the issue tracker, the item cache was largely based on beta data which will be updated again for .15 now that a lot of that is populated on wowhead. Making more threads on it isn't going to change that.</p>\r\n",
    "PostedDate": "2011-01-02T11:18:09.217-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "542923",
    "ThreadId": "240196",
    "Html": "\r\n<p>No worries I didn't see the replies to the issue and noticed that Astrylian asked for clarification so I created a thread here.</p>\r\n<p>I'm glad that you guys are planning on updating the item cache in .15, and to my knowledge that wasn't stated anywhere so glad to have the new info.</p>\r\n<p>Thanks for your work</p>\r\n",
    "PostedDate": "2011-01-02T11:26:57.567-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "542935",
    "ThreadId": "240196",
    "Html": "\r\n<p>We'll be updating the itemcache in pretty much every new version, ever. It's not something you can 'get right', it's a constantly evolving thing.</p>\r\n",
    "PostedDate": "2011-01-02T12:33:26.403-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]