[
  {
    "Id": "542671",
    "ThreadId": "240148",
    "Html": "\r\n<p>How are you guys using the Optimizer right now? At 30 minutes, I'm only at 5%. Do you guys leave it on at night when you go to bed?</p>\r\n<p>I only have maybe 2 items per slot. Should I decrease the number of available gems?</p>\r\n<p>I'm at max thoroughness, is there another % that's about just as effective as max?</p>\r\n<p>Is there anything I can do that would make a significant difference in performance, or is this happening for everyone?</p>\r\n",
    "PostedDate": "2011-01-01T07:16:00.25-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "542692",
    "ThreadId": "240148",
    "Html": "\r\n<p>If I remember correctly you're using Arcane. In this case I have the following suggestions:</p>\r\n<p>I've made some improvements to quadratic solver in the last few days that should give an improvement in the order of 3-5x, so either wait for that to come live or build locally.</p>\r\n<p>Give WPF version a try if you can build yourself, it may be a bit rough around the edges, but it's worth for the extra speed gain.</p>\r\n<p>As far as option settings go, I would suggest changing Mirror Image to disabled and Flame Orb to averaged if you don't have it already. If you're willing to lose on accuracy you can also try disabling mana segmentation in advanced options, but I wouldn't\r\n advise this other than for rough comparisons.</p>\r\n<p>You might&nbsp;also notice that some particular gear/buff combinations&nbsp;take shorter/longer to solve.&nbsp;I've noticed specifically that as your mana situation gets better (in particular at the point where it's optimal to use just a&nbsp;combination\r\n of mana neutral mix&nbsp;and AB spam) it seems to get easier to solve so one thing to&nbsp;make sure is that you have all buffs&nbsp;selected.&nbsp;If you notice that a particular gear set is causing extra long times compared to otherwise it's also possible\r\n there is some numeric instability bug in the solver somewhere that's causing problems. In that case I'd need to see the specific character to see what is causing problems.</p>\r\n<p>EDIT: Actually I just checked, the big speed increase was already in v4.0.13, so if you haven't noticed any change it must be something else.</p>\r\n",
    "PostedDate": "2011-01-01T09:53:42.04-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "542785",
    "ThreadId": "240148",
    "Html": "\r\n<p>Yep, I'm Arcane and using v4.0.13. It worked overnight but I don't know how long it ended up taking.</p>\r\n<p>I tried unchecking the gem templates in Options and removed a bunch of gems, but added a cost modifier thing for Optimizer (with 6 items given Justice Points costs), and so far it's at 29% after 2 hours. I did make available maybe 6 extra enchants than necessary\r\n but that shouldn't affect it that much should it?</p>\r\n<p>Attached the xml here: <a title=\"http://rawr.codeplex.com/workitem/19512\" href=\"http://rawr.codeplex.com/workitem/19512\">\r\nhttp://rawr.codeplex.com/workitem/19512</a></p>\r\n<p>I'm only doing heroics right now (set &quot;Heroics&quot; under buffs) so I don't have that many buffs checked.</p>\r\n<p>Thanks for your help sir.</p>\r\n<p>&nbsp;</p>\r\n<p>Edit: Well, it completes in about 1hr now. Don't know if that's normal or not.</p>\r\n",
    "PostedDate": "2011-01-01T18:15:42.673-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "543295",
    "ThreadId": "240148",
    "Html": "\r\n<p>The only way anyone can give you an optinion if this is 'fast' or 'normal' would be to know SOMETHING about your PC.</p>\r\n<p># of CPU cores, and Speed?<br>\r\nRam size?</p>\r\n",
    "PostedDate": "2011-01-03T10:20:37.333-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]