[
  {
    "Id": "543095",
    "ThreadId": "240256",
    "Html": "\r\n<p>I've been taking a look at the prot paladin model with a few characters and it seems that the stat values are completely out of whack. For example threat values, almost all of the current theorycrafting is saying that before the hit cap and expertise soft\r\n cap, they are valued greater then strength, while in the model it is saying that strength is almost 3x better then expertise and almost 5x better then hit. There are various other problems like this with mitigation and survivial. It sais on the prot paladin\r\n model status that it is mostly ready for cata so I was just wondering why the numbers are so out of range from what everyone else is saying.</p>\r\n",
    "PostedDate": "2011-01-03T02:21:27.873-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "543149",
    "ThreadId": "240256",
    "Html": "\r\n<p>Please understand the basics of Rawr. <strong>There are NO STAT VALUES used in Rawr to calculate your abilities.\r\n</strong>Therefore there are no stat values to change.</p>\r\n<p>Instead Rawr calculates formulae to work out how good each ability is and how much the sum of all the items you are wearing the buffs you have, your talents etc contribute to your abilities. It then adds that up and presents a result. If the formula is wrong\r\n the results will be wrong. So what you need to help identify is WHAT is wrong. ie: what part of the calculations is out. Is it wrongly calculating the basics - hit%, crit%, dodge% etc? Is it wrongly calculating the threat/dps/mitigation from a certain ability?\r\n We need specifics NOT generalities about stat values which simply don't exist in Rawr.</p>\r\n",
    "PostedDate": "2011-01-03T05:49:17.097-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "543276",
    "ThreadId": "240256",
    "Html": "\r\n<p>All three paladin modules need updating. The Protection one has come a long way recently though.</p>\r\n<p>The Retribution module doesn't load for me, but it has typically been kept up to date the second best out of the three modules.</p>\r\n<p>The Holy Paladin one in specific hasn't worked right since Naxxramas. There was a quick addition for the Sacred Shield buff after Ulduar, but mostly, the module has been giving out incorrect information for a long, long time. One look at the options, referencing\r\n talents and that haven't existed or been used for a long time, and the lack of any options regarding the choice between Flash of Light and Holy Light frequency (which was greatly needed after 3.1's Illumination nerf) is just a few of the indicators.</p>\r\n<p>It's as bad as the old Warlock module used to be, but I haven't seen any other Holy Paladins up in arms about it like the Warlocks were with the Warlock module, which strikes me as odd to say the least.</p>\r\n",
    "PostedDate": "2011-01-03T09:45:55.89-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]