[
  {
    "Id": "544109",
    "ThreadId": "240513",
    "Html": "\r\n<p>Thank you to the users that have been following the Posting Guidelines properly and posting issues with the information we need. It's these issues that we can resolve quickly and efficiently and you helping us help you makes my life a\r\n<strong>lot</strong> easier, and the other devs.</p>\r\n",
    "PostedDate": "2011-01-04T20:59:31.387-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "544262",
    "ThreadId": "240513",
    "Html": "\r\n<p>Bah you tempted fate and Toriad posted this http://rawr.codeplex.com/Thread/View.aspx?ThreadId=240525</p>\r\n",
    "PostedDate": "2011-01-05T05:05:15.753-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "545222",
    "ThreadId": "240513",
    "Html": "\r\n<p>Isn't it great how I post a thank you and get 4 new threads in the wrong place in the same day (so far)</p>\r\n",
    "PostedDate": "2011-01-06T22:42:49.82-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "545670",
    "ThreadId": "240513",
    "Html": "\r\n<p>I see a lot of issues posted about errors popping up in modules that aren't cata ready.&nbsp;&nbsp;&nbsp;&nbsp; Perhaps a big note in the welcome screen showing a list of modules that are ready/partly ready/not ready might be more obvious for the more challenged\r\n users out there.&nbsp;&nbsp;&nbsp; You could even color code it for those who don't like to read much.&nbsp;&nbsp;</p>\r\n<p>Might save you guys some time replying to useless issues.</p>\r\n<p>&nbsp;</p>\r\n",
    "PostedDate": "2011-01-07T13:55:16.087-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "609002",
    "ThreadId": "240513",
    "Html": "<p>AAand we're back to a series of issues that we cannot help people with because they don't actually give us the resources we need to fix the problem, like what the hell character they are trying to load.</p>\r\n<p>I'm really really trying not to be an ass but how many times can I say \"Follow the Posting Guidelines and include your character\" before I have to say \"Stop wasting my damn time\"?</p>",
    "PostedDate": "2011-05-07T11:26:19.757-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]