[
  {
    "Id": "544884",
    "ThreadId": "240720",
    "Html": "\r\n<p>Everytime I get new gear I run the optimization tool; when I&nbsp;optimize&nbsp;it comes up with an optimize list that&nbsp;is less&nbsp;optimal (downgrades) than what i already had equipped sometimes&nbsp;by as much as&nbsp;a 1000 then i redo the optimization\r\n it swaps back to my former or better optimization depending on the new gear&nbsp;I received. basically each time I run optimize it will swap back and forth. Shouldn't rawr be ignoring any optimization that is worse than what i currently have?</p>\r\n",
    "PostedDate": "2011-01-06T08:35:54.843-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "544917",
    "ThreadId": "240720",
    "Html": "\r\n<p><strong>Documentation:</strong> <a href=\"http://rawr.codeplex.com/wikipage?title=GearOptimization\" target=\"_blank\">\r\nhttp://rawr.codeplex.com/wikipage?title=GearOptimization</a></p>\r\n<p><strong>Thread with an explanation:</strong> <a href=\"http://rawr.codeplex.com/Thread/View.aspx?ThreadId=68832\" target=\"_blank\">\r\nhttp://rawr.codeplex.com/Thread/View.aspx?ThreadId=68832</a></p>\r\n<p>The optimizer is not guaranteed to find the highest results every time due to the granularity of the checks. If we checked every single possible combination your optimize would go from minutes to\r\n<em><strong>literally eons</strong></em>.</p>\r\n<p>The optimizer shows you the results of it's current optimize regardless of whether the result was higher or lower. You then choose whether to keep your existing set or load in the new one.</p>\r\n<p>It sounds like you are loading in the new one each time even if it's lower. Alternatively, if you want to just save the set and see if you can run the optimizer again to find different results you can click the save the optimized set button. This puts it\r\n in the Item Sets list where you can compare it against your currently equipped gear and any other sets you generate.</p>\r\n",
    "PostedDate": "2011-01-06T09:16:44.743-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]