[
  {
    "Id": "547685",
    "ThreadId": "241376",
    "Html": "\r\n<p>New in version 0.60 of Rawr.Addon will be the ability to notice if an item is looted or linked in chat that is in your direct upgrades list.</p>\r\n<p>If the addon spots an upgrade it will display a message and play a sound. Now I've coded it with four levels of possible sounds as follows...</p>\r\n<p>Minor Upgrade, Upgrade, Big Upgrade, Massive Upgrade.</p>\r\n<p>The options panel will allow you to set the percentage of upgrade and which sound to play. So for example if its a minor upgrade (eg: between 0 and 5% upgrade) it might play sound 1 which might be a &quot;Meh maybe&quot; style sound, for a big upgrade eg: between\r\n 10 &amp; 20% upgrade it might play sound 3 which might be &quot;hmm definitely have that&quot; type sound, for a massive upgrade eg: over 20% it would play sound 4 which might be a OMG!!! NEEEEEED!! type sound. Now I want to include lots of possible sounds from in game.</p>\r\n<p>So what I really need is suggestions (and ideally sound file names) of sounds I should include. Suggestions please?</p>\r\n",
    "PostedDate": "2011-01-11T17:29:52.92-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "547959",
    "ThreadId": "241376",
    "Html": "\r\n<p>I can see this being useful or also being incredibly annoying.<br>\r\nIt should only happen when in a party/raid, and only when the chat is incomming via /y, /ra, /p or /w.<br>\r\nif you're going to play a sound each time somone links an epic in tradechat, you're going to be getting pissed off with it rather fast :p<br>\r\n<br>\r\nyou may want to make this configurable so people can adjust it to their looting system(s).<br>\r\n<br>\r\nThere's more than enough groups that do loot via normal rolls (with or without discussions befor eyou press 'need'), so it would need to intercept that also, and then it probably shouldn't&nbsp;notify on spam via /y /ra /p /w as well.</p>\r\n<p>I wouldn't use different sounds, a single simple attention grabber is enough.</p>\r\n",
    "PostedDate": "2011-01-12T04:52:31.97-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "548057",
    "ThreadId": "241376",
    "Html": "\r\n<p>Indeed it is planned that it is fully configurable. At present it tracks loot when you open the looting window yourself. For messages it does NOT track the normal channels eg:general/trade/says/yells only tracking party, party leader, raid, raid leader,\r\n raid announce, and whisper. All of these will be on by default and I'll add options to enable/disable one or more of them. Depending on feedback I may add support for general channels but most definitely they would be off by default.</p>\r\n<p>I won't however be disuaded from different sounds, as there is a radical difference between something that is a minor upgrade of 10-20 dps and something that's an upgrade of a few hundred or more dps. This also goes directly to the fun factor of the addon.\r\n Sure you can configure the same sound for every single type and thus have a single predicatable sound, or you can be the extrovert adding your own custom sounds to the addon via the support I've added for SharedMedia, and even record your OWN sounds for the\r\n addon to use. FUN!!!</p>\r\n<p>On a personal level in own use I'll probably stick to a few default sounds that I like and nothing too unusual. However I strongly believe that addons like this should be open for users who are at the more extrovert end of the scale to be more creative.\r\n Hey its no real extra coding so why not. It doesn't create support issues as the support is for SharedMedia if there is an issue with custom sounds thats a SharedMedia issue NOT a Rawr issue, and those that customise their interface to that extent know about\r\n SharedMedia anyway.</p>\r\n",
    "PostedDate": "2011-01-12T07:44:14.263-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "548372",
    "ThreadId": "241376",
    "Html": "\r\n<p>Just to chime in, and since I can't program C worth a damn, chime'ing is all I can do around here. :)</p>\r\n<p>for me, I would set it to a simple Ding sound as the Meh upgrade, 2 dings for a Larger upgrade, and 3 dings for a HUGE upgrade.&nbsp; Perhaps I am not that imagintive but for me, that would be gentle enough so I dont jump out of my chair, and yet sure to\r\n get my attention when something NICE drops.</p>\r\n",
    "PostedDate": "2011-01-12T17:29:15.317-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "548385",
    "ThreadId": "241376",
    "Html": "\r\n<p>Fyre, your post makes me think of &quot;that's right... bro-fist time! Ring that bell! FOUR TIMES!&quot;</p>\r\n",
    "PostedDate": "2011-01-12T18:04:18.11-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "548564",
    "ThreadId": "241376",
    "Html": "\r\n<p>Fye. For setting up the defaults I need to code a range of possible sounds, however you may have missed the point and so I'll clarify in case others have too...</p>\r\n<p><strong>All I need from people is suggestions for sound files ie: mp3 files to put in the addon directory. No programming required.</strong></p>\r\n<p>I can also use existing sound files in game, and if users can suggest something from those all I need is the name of the sound file. eg: &quot;Sound\\\\Spells\\\\DynamiteExplode.ogg&quot;</p>\r\n<p>Note sound files as they are just MP3s can be anything, from simple &quot;dings&quot; to actual lyric clips as Jothay hints at. Once I have the defaults in place users can customise their own sounds if they have the SharedMedia addon installed.</p>\r\n",
    "PostedDate": "2011-01-13T02:01:51.32-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "548612",
    "ThreadId": "241376",
    "Html": "\r\n<p>Would Love to have sound LEEEEEEEEROY JENKINS http://www.hark.com/clips/mhtzzzzsvm-leeroy-jenkins Haha!</p>\r\n",
    "PostedDate": "2011-01-13T03:58:19.657-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "548826",
    "ThreadId": "241376",
    "Html": "\r\n<p>I think we should record Astrylian's wife saying stuff. (She's the voice of the Tour of Rawr video.)</p>\r\n",
    "PostedDate": "2011-01-13T09:56:48.33-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "549073",
    "ThreadId": "241376",
    "Html": "\r\n<p>Guild mate suggested we have &quot;Mehh&quot;, &quot;Ooooohh&quot; and &quot;Yay&quot; or &quot;Woohoo&quot; as sounds. Astry over to you to get the recordings done :)</p>\r\n",
    "PostedDate": "2011-01-13T17:35:54.51-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "549077",
    "ThreadId": "241376",
    "Html": "\r\n<p>I'm tempted to suggest Mario jumping sounds. &quot;Wo&quot;, &quot;Wahah!&quot; &quot;WA HA HA HOOoooeeeeeee...&quot;</p>\r\n",
    "PostedDate": "2011-01-13T17:40:51.987-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "549085",
    "ThreadId": "241376",
    "Html": "\r\n<p>You might want to be careful about that Jothay.</p>\r\n<p>http://wow.joystiq.com/2010/11/27/the-lawbringer-fonts-and-why-you-cannot-sue-deathwing/</p>\r\n<p>it's a good read but even though it's talking about the use of fonts in addons the same thing applies here with sound as well.</p>\r\n",
    "PostedDate": "2011-01-13T17:56:54.68-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "549086",
    "ThreadId": "241376",
    "Html": "\r\n<p>/facepalm</p>\r\n<p>Damn you people and your incessant need to do everything proper!</p>\r\n<p>I bet you say hairace-ment instead of her-ass-ment (harassment) don't you.... DON'T YOU!</p>\r\n",
    "PostedDate": "2011-01-13T18:02:29.913-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "549088",
    "ThreadId": "241376",
    "Html": "\r\n<p>I say her-ass-ment.</p>\r\n<p>I just blame the &quot;Politically Correct&quot; attitude I've had to grow up with, living near DC. Stupid politicians.</p>\r\n",
    "PostedDate": "2011-01-13T18:05:05.12-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "549339",
    "ThreadId": "241376",
    "Html": "\r\n<p>This is partly why I suggested we could use IN GAME sounds. eg: QuestGuru uses a wonderful little in game sound called &quot;Sound\\\\Creature\\\\Peon\\\\PeonReady1.wav&quot; which is a peon saying &quot;Work Complete&quot; sound and thus highly appropriate for completing a quest.</p>\r\n<p>I understand that you can use MPQEditor http://www.ehow.com/how_4705307_extract-music-world-warcraft.html download is http://www.zezula.net/en/mpq/download.html to browse the wow mpq files in the data directory, which are basically big zip files. eg: Sounds\r\n are in &lt;wow folder&gt;\\data\\Sounds.mpq once open you can see all the sounds and click on them to play them assuming you have a WAV/MP3/OGG sound playing program.</p>\r\n<p>So perhaps our users out there could suggest some in game sounds for minor, medium and major upgrades. I'd like to have 8-12 sounds pre-loaded into the list before shipping v0.60. At present its ready to go it just needs a list of sounds.</p>\r\n",
    "PostedDate": "2011-01-14T06:27:34.997-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "549741",
    "ThreadId": "241376",
    "Html": "\r\n<p>Lol'd at Mario sounds. &nbsp;Shame Nintendo would bring down the hammer on that one.</p>\r\n<p>These sounds have some progression to them. &nbsp;Nothing&nbsp;extravagant.&nbsp;</p>\r\n<p>MPQ path follows:</p>\r\n<p>Sound/spells/directdamage - holyimpactddlow = minor upgrade</p>\r\n<p>Sound/spells/directdamage - holyimpactddmedium = good upgrade</p>\r\n<p>Sound/spells/directdamage - holyimpactddhigh = better upgrade</p>\r\n<p>Sound/spells/directdamage - holyimpactdduber = omgwtfbbq!?!!1!</p>\r\n<p>or perhaps:</p>\r\n<p>sound/character/footsteps/enterwatersplash - enterwatersmalla = Meh</p>\r\n<p>sound/character/footsteps/enterwatersplash - enterwatermediuma = decent</p>\r\n<p>sound/character/footsteps/enterwatersplash - enterwatergianta = it's over 9000!</p>\r\n<p>&nbsp;</p>\r\n<p>Ok. &nbsp;Thats about all I can handle for now.</p>\r\n<p>&nbsp;</p>\r\n<p>PS...</p>\r\n<p>sound/creature/felreaver - felreaverpreaggro = no effing clue here. &nbsp;Who doesn't know that sound?</p>\r\n<p>sound/creature/thief/thief_not_used = Anything in this folder. &nbsp;Interesting.</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n",
    "PostedDate": "2011-01-14T22:06:49.08-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "549816",
    "ThreadId": "241376",
    "Html": "\r\n<p>Thanks for those I've used some of them. Sounds need to be of a decent length to actually be audible now that &quot;PlaySoundFile&quot; no longer plays in the main channel.</p>\r\n<p>I've released v0.60 the ChangeLog is :</p>\r\n<p>Version 0.60&nbsp;&nbsp;&nbsp; <br>\r\n&nbsp;&nbsp;&nbsp; Add options to select sounds to play if an upgrade is seen<br>\r\n&nbsp;&nbsp;&nbsp; Fix issue if slot in direct upgrades isn't loaded from cache yet<br>\r\n&nbsp;&nbsp;&nbsp; Fixed shift clicking of Rawr slots or upgrade lists puts item links in chat<br>\r\n&nbsp;&nbsp;&nbsp; Fixed ctrl clicking of&nbsp; Rawr slots or upgrade lists shows items in dressing room<br>\r\n&nbsp;&nbsp;&nbsp; Added some default test sounds<br>\r\n&nbsp;&nbsp;&nbsp; Added check for upgrade when looting<br>\r\n&nbsp;&nbsp;&nbsp; Changed to have 3 ranks of sounds<br>\r\n&nbsp;&nbsp;&nbsp; Fixed issue with checking item ids with nil itemstrings<br>\r\n&nbsp;&nbsp;&nbsp; Looting mobs tested - bug fixes<br>\r\n&nbsp;&nbsp;&nbsp; Added warning frame and warning frame options<br>\r\n&nbsp;&nbsp;&nbsp; Tested Warning frame seems to all be working now<br>\r\n&nbsp;&nbsp;&nbsp; Added Warning frame move button<br>\r\n&nbsp;&nbsp;&nbsp; Fixed bug with missing locales<br>\r\n&nbsp;&nbsp;&nbsp; Added Default Sounds File</p>\r\n",
    "PostedDate": "2011-01-15T04:12:02.893-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]