[
  {
    "Id": "548885",
    "ThreadId": "241680",
    "Html": "\r\n<table width=\"100%\">\r\n<tbody>\r\n<tr>\r\n<td valign=\"top\">\r\n<p><a href=\"http://dl.dropbox.com/u/15727672/RawrVisible/ItemFilters_Ilvl.png\" target=\"_blank\"><img src=\"http://dl.dropbox.com/u/15727672/RawrVisible/ItemFilters_Ilvl.png\" alt=\"Filters by Item Level\"></a></p>\r\n</td>\r\n<td width=\"100%\" valign=\"top\">\r\n<p>A new change has just been checked in for 4.0.16 regarding how you filter by iLevel.</p>\r\n<p>The old Disable by Ilevel, where you checked off ranges of Ilevels that you didn't want to see, has been removed from the Filter Tree.</p>\r\n<p>The new method is seen in the image. Here, you leave all checks on if you want to see all ranges. Turn off checks to turn off that range.</p>\r\n<p>Alternatively, you can use the Custom Slider to show items with ilevels between the two grips' values.</p>\r\n<p>What you don't see in the image is that I've also added Reset and UnCheck All buttons below the message as a convenience method of quickly setting things back to default or hiding everything so you can turn on a specific range.</p>\r\n<p>These options are saved to the Character file so if you have one setup for your Mage and another one for your Bear, they won't interfere with each other.</p>\r\n<p>I'll be adding this information to the Item Filters documentation as well (probably with an updated image).</p>\r\n<p>Thanks to getting this setup done, I can now do the necessary work for the other accordions fairly quickly.</p>\r\n</td>\r\n</tr>\r\n</tbody>\r\n</table>\r\n",
    "PostedDate": "2011-01-13T11:28:25.437-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "548988",
    "ThreadId": "241680",
    "Html": "\r\n<p>Champion!&nbsp;&nbsp;&nbsp; Looks really nice - and the slider adds that little bit of extra power to the user - great stuff!</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n",
    "PostedDate": "2011-01-13T14:43:19.367-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]