[
  {
    "Id": "551946",
    "ThreadId": "242414",
    "Html": "\r\n<p>Quick edit: I didn't put this as an issue because it may well be working as intended, and maybe there is something missing from the current theory crafting I've read compared to the testing you have done. If it is an issue I apologize.</p>\r\n<p>I've been playing with the moonkin model lately and noticed that rawr goes against most common theorycrafting that haste is the best secondary stat by a long shot and evaluates crit as better than haste in just about every situation.</p>\r\n<p>Step 1: Loaded my character from Battle.net<br>\r\nStep 2: input all my gear into wrathcalcs<br>\r\nStep 3: Run the optimizer in Rawr (results say basically to drop 4% haste and gain 67sp and 2.38% crit)<br>\r\nStep 4: Make the same adjustments in Wrathcalcs</p>\r\n<p>When comparing the two wrathcals has this as a DPS loss while Rawr has it as a gain. Not only are these conflicting answers from the two leading sources of moonkin theorycrafting calculators, your modeling doesn't jive with all the theory crafting that has\r\n happened with moonkin that point to haste being the best secondary stat by a large margin. I loved using rawr and I believe it is a great tool, but with the numbers it is currently showing my confidence that it is accurate is shaken because it just isn't jiving\r\n with what others have already shown to be true.</p>\r\n<p>Just something I noticed and thought should be looked into.</p>\r\n",
    "PostedDate": "2011-01-19T07:12:58.547-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "552005",
    "ThreadId": "242414",
    "Html": "\r\n<p>Posting Guidelines, please.</p>\r\n",
    "PostedDate": "2011-01-19T09:22:35.34-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "552094",
    "ThreadId": "242414",
    "Html": "\r\n<p>Actually, Astrylian, I'm glad that this luser posted this discussion in this section.&nbsp; This is a fine place to announce once and for all:</p>\r\n<p><strong>IF MOONKIN SHOWS CRIT AS BETTER THAN HASTE, YOU ARE RUNNING OUT OF MANA.</strong></p>\r\n<p>Now will everybody STOP with the &quot;OMG Rawr sucks because it's overvaluing crit when we all know haste is better&quot; crap.&nbsp; I'm sick and tired of everyone trashing my hard work without taking 15 seconds to figure out how the model actually works.<strong><br>\r\n</strong></p>\r\n",
    "PostedDate": "2011-01-19T11:36:15.367-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "552108",
    "ThreadId": "242414",
    "Html": "\r\n<p>It's okay, Dopefish. &nbsp;We here in-house all know your work is... wait for it...\r\n<em>dope</em>. &nbsp;;)</p>\r\n",
    "PostedDate": "2011-01-19T11:50:05.213-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "552112",
    "ThreadId": "242414",
    "Html": "\r\n<p>I thought I was getting high off the Moonkin model...</p>\r\n",
    "PostedDate": "2011-01-19T11:53:52.16-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "552133",
    "ThreadId": "242414",
    "Html": "\r\n<p>dopefish, I appreciate your hard work.</p>\r\n<p>Moonkin model is usable, I'm happy with it (but I'm neither harcode nor raider) and it's a pleasure to enjoy Rawr once again. At least with my moonkin.</p>\r\n<p>Unfortunately Alynn is wrong, but I'm sure there's no need to write that: I personally experienced that haste was making me run OOM and Crit doesn't. Of course, with all the appropriate settings in Rawr - buffs and fight length modified for heroics, for\r\n example. And I need to change them all the time because there's not a &quot;no buffs&quot; in that section, but that's another story: just wanted to say that moonkin model reflects &quot;real life&quot; situation with high accuracy.</p>\r\n<p>GG</p>\r\n",
    "PostedDate": "2011-01-19T12:26:18.82-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "552140",
    "ThreadId": "242414",
    "Html": "\r\n<p>Azareus, are you not using Buff Sets? That should speed up having to do that for Heroics. There should be an UnBuffed selection in there for everyone to use and you can save your own sets of Buffs. If you don't see that, Options &gt; Reset All Caches.</p>\r\n<p><img src=\"http://dl.dropbox.com/u/15727672/RawrVisible/BuffSets.png\" alt=\"\"></p>\r\n",
    "PostedDate": "2011-01-19T12:34:11.933-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "552142",
    "ThreadId": "242414",
    "Html": "\r\n<p>Ok, I wasn't trying to say that it was wrong, I just wasn't understanding the information it was feeding me compared to what I had already read. If I insulted you it was not my intention, but on the flip side I don't appreciate being insulted either. That\r\n was uncalled for.</p>\r\n<p>Dopefish, I appreciate all the work you and others have put into it, and because I wasn't sure what I was seeing I came to the source to figure it out. Now I assume that it is upping crit to move you toward eclipse faster for the regen. Because rawr is showing\r\n me not running out of mana even in a 20 minute fight with my current setup with raid buffs and 6 minutes without raid buffs. This is what caused me to come here to begin with.</p>\r\n",
    "PostedDate": "2011-01-19T12:36:19.377-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "552150",
    "ThreadId": "242414",
    "Html": "\r\n<p>Jothay,</p>\r\n<p>woot? &quot;UnBuffed&quot; is not there for sure, just checked. I'm going to reset cache now! :-) Thanks.</p>\r\n<p>Oh, and I should read everything and use &quot;save&quot; more often... that for sure. :-P</p>\r\n<p>P.S.: yay, after reset, &quot;UnBuffed&quot; is there. Me happy.</p>\r\n<p>&nbsp;</p>\r\n",
    "PostedDate": "2011-01-19T12:44:53.357-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "552453",
    "ThreadId": "242414",
    "Html": "\r\n<blockquote style=\"border:solid .1em #ccc; font-style:italic; margin:.25em 1em 0 1em; padding:0 .25em 0 .25em\">\r\n<strong>dopefish wrote:</strong><br>\r\n<p>Actually, Astrylian, I'm glad that this luser posted this discussion in this section.&nbsp; This is a fine place to announce once and for all:</p>\r\n<p><strong>IF MOONKIN SHOWS CRIT AS BETTER THAN HASTE, YOU ARE RUNNING OUT OF MANA.</strong></p>\r\n<p>Now will everybody STOP with the &quot;OMG Rawr sucks because it's overvaluing crit when we all know haste is better&quot; crap.&nbsp; I'm sick and tired of everyone trashing my hard work without taking 15 seconds to figure out how the model actually works.<strong><br>\r\n</strong></p>\r\n</blockquote>\r\n<p>However the initial poster suggested that Wrathcalcs was showing a very different result, and I can only assume it is taking mana into account as well so SOMETHING is wrong. As you know dopefish my main is now a Moonkin so I am taking a keen interest in\r\n Moonkin theorycraft. I fully believe that you have put a lot of work into the model and are sure its accurate. However if two different methods of calculating dps are giving two different results then one of them must have a bug.</p>\r\n<p>It is my plan to spend time this weekend investigating both models and doing in game testing to see if I can determine where the differences lie. I did briefly note for instance that my crit in Rawr and my crit in game is out by 20 crit rating, however was\r\n called to join heroic so didn't finish my analysis enough to know if it was just me or something wrong with the model.</p>\r\n<p>If there are specific things I can assist with testing please let me know I'm a very experienced theorycrafter having previously worked on the Rawr.Enhance model and Enhsim the Enhancement Simulator. My focus now is on the Addon but naturally since Moonkin\r\n is my main I want to ensure if I can do anything to make it better I will. Treat me as a willing guinea pig that can try out stuff and test things whilst you do the coding.</p>\r\n<p>&nbsp;</p>\r\n<p>Oh and perhaps a Warning in RED on the display page ie: change the OOM time display to be RED if its less than the combat time and add a tooltip. Something like &quot;You will run out of mana during the fight. Gearing results will be heavily skewed towards getting\r\n more mana&quot;. Then you wont need to rage at &quot;lusers&quot; and get out your trusty 2x4 to &quot;re-educate&quot; them ;)</p>\r\n",
    "PostedDate": "2011-01-20T02:27:51.727-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]