[
  {
    "Id": "552678",
    "ThreadId": "242618",
    "Html": "\r\n<p>Here are your options:</p>\r\n<ol>\r\n<li><strong>Compact Paper Doll Mode:</strong> <em>In the Options dialog.</em> This hides the Shirt and Tabard buttons on the paper doll and moves the gloves to the left side. This effectively cuts a necessary row off the paper doll which allows it to compress.\r\n</li><li><strong>Browser Zoom:</strong> <em>Ctrl&#43;MouseWheel.</em> Silverlight is designed to resize based on your Browser's zoom settings. Putting it at 90% along with CPDM (above) should resolve the issue.\r\n</li><li><strong>Full Screen your Browser Window:</strong> <em>F11.</em> No, I don't just mean maximizing it to the top of the screen, I mean the special browser setting where it hides all the Browser UI and literally just shows the webpage as big as it can. In\r\n most browsers, it's the F11 hot-key. </li></ol>\r\n<p>Make sure you are doing the native resolution for your monitor.</p>\r\n<ul>\r\n<li>On about 80% of all standard-type (not wide) CRT/LCD monitors, the native resolution is 1280x1024. It's been like that for like a decade now and Rawr runs perfectly in that resolution.\r\n</li><li>The other 20% of standard-type CRT/LCD monitors are <em>higher</em> resolution monitors which are usually larger sized screens like 24&quot;&#43;. These usually run 1600x1200 which is even better for Rawr.\r\n</li><li>Widescreen monitors come in all sizes these days from Netbooks with their limited 1024x600 res to 30&quot; wides and their 2560x1600 res. If you are unsure of your native resolution and you are running Windows Vista or Windows 7. Go to Screen Resolution settings\r\n and there will almost always be a (Recommended) tag on one of the resolutions. That should be your native res. Most mid-range widescreens (18&quot;-24&quot;) run a 1680x1050 resolution. Higher ends run 1920x1080 (which is what a 1080p TV runs) or a 1920x1200 if its\r\n not designed to replicate TV function. Lower ends will run a 1440x900 resolution which can have problems in Rawr but with CPDM on that res, you should be fine.\r\n</li></ul>\r\n<p>Make sure you are using the correct DPI settings on your system. This is monitor independent.</p>\r\n<ul>\r\n<li><strong>Windows XP:</strong> This OS defaulted to the Standard 96 DPI setting. A lot of people turn this up to Large (125 DPI) in order to be able to read text on screen more easily, especially when they have problems with eyesight.\r\n</li><li><strong>Windows Vista and 7:</strong> These OS's, for some ungodly reason, defaulted to Large (125 DPI) on ship/install. Go fix this and put it back to Standard (96 DPI) unless you really need the Large setting. At least try out Standard to see what it\r\n looks like in comparison with your normal size. </li></ul>\r\n<p>If after all that, you still can't see what you need to see in Rawr:</p>\r\n<ul>\r\n</ul>\r\n<p><strong>Desktops:</strong> <em>Buy a monitor made in the last 5 years.</em> You can find decent 17-20&quot; widescreens for under a hundred bucks these days. Here's a search on\r\n<a title=\"NewEgg LCD Monitor Search\" href=\"http://www.newegg.com/Product/ProductList.aspx?Submit=ENE&N=100007617%204027&IsNodeId=1&name=%2475%20-%20%24100\" target=\"_blank\">\r\nNewegg.com</a> though there are plenty of other resources that can sell you a good monitor at a decent price</p>\r\n<p><strong>Netbooks:</strong> <em>You are pretty much screwed</em> if your resolution is so low that CPDM and Browser Zoom and Full Screen together can't help you. I'm sorry, but we won't be redesigning Rawr to operate on such low resolutions.</p>\r\n",
    "PostedDate": "2011-01-20T08:58:38.517-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "552712",
    "ThreadId": "242618",
    "Html": "\r\n<p>But but but... I want to run Rawr on my WVGA WinMo phone... why oh why won't you service me...</p>\r\n<p>wait...</p>\r\n<p>that didn't come out right...</p>\r\n<p>I think I'll go back to writing test scripts now.</p>\r\n<p>::DUCKS away before Jothay comes after me.::</p>\r\n",
    "PostedDate": "2011-01-20T09:42:56.367-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "552740",
    "ThreadId": "242618",
    "Html": "\r\n<p>Because you suck, and no one likes you.</p>\r\n",
    "PostedDate": "2011-01-20T10:31:01.47-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "552812",
    "ThreadId": "242618",
    "Html": "\r\n<p>You missed listing smartphones and tablets :)</p>\r\n",
    "PostedDate": "2011-01-20T12:26:47.723-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "553181",
    "ThreadId": "242618",
    "Html": "\r\n<blockquote style=\"border:solid .1em #ccc; font-style:italic; margin:.25em 1em 0 1em; padding:0 .25em 0 .25em\">\r\n<strong>Jothay wrote:</strong><br>\r\n<ul>\r\n<li>On about 80% of all standard-type (not wide) CRT/LCD monitors, the native resolution is 1280x1024. It's been like that for like a decade now and Rawr runs perfectly in that resolution.\r\n</li></ul>\r\n</blockquote>\r\n<p>The above isn't true at all.<br>\r\n10 years ago 2000:<br>\r\nLess than 5% of pc's in use were running resolutions higher than 1024*768. Around 25% ran at 1024x768, 55 at 800x600 and 12% ran at 640x480, with the other percentiles being &quot;odd&quot; resolutions.&nbsp; The numbers have been growing in favour of the higher resolutions\r\n since of course...</p>\r\n<p>2005 about when wow was released, still only 12% was at higher than 1024*768.</p>\r\n<p>In 2010 the average resolution has come up to 75% or so for higher than 1024*768 and about 20% for 1024*768.&nbsp; So even last year 1280*1024 was at least 5%less than 80%.<br>\r\nSo this year, It'll prob hit that 80% mark.</p>\r\n<p>Related to that:<br>\r\n256 color mode is now as good as dead, with the number falling below 0.5% last year. It's been dropping about a percent each year since 2000.&nbsp; well over 95% runs truecolor, 5% runs hicolor (16 or 15bit).&nbsp; The choice here is obvious, most videocards\r\n are optimised for 32bit, a lot don't even offer 16bit color modes, or the performance is so horrible nobody uses it.</p>\r\n<p>&nbsp;</p>\r\n<p>The above numbers is what we are getting through usage statistics of the software running the software of our company and it's affiliates.&nbsp; That's several million PC's worldwide (we even have users in antarctica), so while it may not be entirely representative\r\n of &quot;the wow players&quot;, it is fairly representative for PC's in general.</p>\r\n",
    "PostedDate": "2011-01-21T05:17:00.263-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "553486",
    "ThreadId": "242618",
    "Html": "\r\n<p>Yeah representative of all pcs of which I'm guessing a large percentage are office based ones where graphics resolutions are going to be dramatically different from gaming pcs even low end gaming pcs would have a lot better graphics than the majority of\r\n the higher end office pcs.</p>\r\n<p>I had a user complain that rawr addon toolitips are not looking right at 1024x768. Fair enough but he hadn't even changed his UI scale so had a horribly cramped screen.</p>\r\n<p>Not sure we can do a lot about users that don't use the tools available to them. It's notoriously tricky to deal with in game screen resolution changes as all you get are screen ratios. Not guaranteed resolutions. 1280x1024 is a decent miminum standard in\r\n my eyes. Then again I'm running a 24 wide screen at 1920 x 1200 and have always had UI scale in game set to give maximum screen area, just don't get why people stick with the scale of 1.0 and cramped screens.</p>\r\n",
    "PostedDate": "2011-01-21T16:04:14.633-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "554318",
    "ThreadId": "242618",
    "Html": "\r\n<p>No... those numbers are specifically EXCLUDING the typical office setups (and servers), which oddly enough favour higher resolutions than the &quot;home/entertainment&quot; branch which is what those specific numbers are taken from.&nbsp; And yes, those few antarctica\r\n machines are actually &quot;entertainment&quot; ones, and not the &quot;office&quot; ones which we also have over there. :)&nbsp; Someone's playing FPS's with the penguins.&nbsp; They have too high latency to play online games down there though :p</p>\r\n",
    "PostedDate": "2011-01-24T04:47:26.707-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "554351",
    "ThreadId": "242618",
    "Html": "\r\n<p>Interesting, although I suspect the only really useful results would be those that Blizzard collect. Those numbers are specifically the resolutions of people playing WoW. So precisely the target audience. I wonder if Blizz publish the info anywhere.</p>\r\n",
    "PostedDate": "2011-01-24T05:37:25.433-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "577983",
    "ThreadId": "242618",
    "Html": "<p>I run RAWR on my laptop so I can compare it to my setup without alt-tabbing back and forth.&nbsp; It's a little older and runs in 1280x800 resolution.&nbsp; It used to run fine in full screen mode, though I had to use the F11 command to get more vertical space.&nbsp; Recently, there has started being side banner areas that pushed the interface in and I lose 10-20 percent of the usable space.&nbsp; Even this would not be a problem, but the actual scores on the gear are now pushed off the interface and I cannot see the actual numbers.&nbsp; If the graphic bars were not there, I would be fine, but I'm having a bit of an issue at this point.&nbsp; (I love the graphic bars by the way)&nbsp; I end up exporting the data on several gear slots to see what the actual numbers would be.&nbsp; This gets to be rather trying if I'm comparing a number of pieces of gear.&nbsp;</p>\r\n<p>I don't know if the issue is the EJ website since they sometimes put advertisements in these side areas.&nbsp; Is there any way I can get this back to the actual full usable space in the browser?&nbsp; Do I need to install it offline?</p>\r\n<p>Any help would be greatly appreciated.&nbsp; I still love the program, even though I'm waiting for the fix for the current stamina issue for my Bear.</p>",
    "PostedDate": "2011-03-09T12:20:39.977-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "577998",
    "ThreadId": "242618",
    "Html": "<p>There's already a ticket open for this in the Issue Tracker. The issue is on EJ's side, it is not a Rawr issue. I found that by logging in to EJ, the side black bars went away.</p>\n<p>If you or anyone else is still having this issue, contact EJ support to ask them to fix it.</p>",
    "PostedDate": "2011-03-09T12:43:29.077-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "579529",
    "ThreadId": "242618",
    "Html": "<p>For those of you still having this problem, there is a link at the bottom of the page (EJ's page, not here) in the Rawr FAQ section that you can click to force it to 100% width. It was broken before a few minutes ago (clicking it did nothing).</p>",
    "PostedDate": "2011-03-12T11:30:36.173-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]