[
  {
    "Id": "553123",
    "ThreadId": "242734",
    "Html": "\r\n<p>Just wondering whether you guys have started pushing the 4.06 changes into RAWR yet, or whether you're still waiting on the actual release to come through first?</p>\r\n<p>Not pushing, I'm just hanging onto a couple pieces of gear that I *think* will be better thanks to upcoming changes and I'd love to test :)</p>\r\n",
    "PostedDate": "2011-01-21T03:30:38.577-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "553340",
    "ThreadId": "242734",
    "Html": "\r\n<p>I've put in a few myself. Most of these revolve enchanting, base stats, and what-not. I know the mage and WarriorDPS modules implemented a few PTR changes. If you want to check some of them out, go to the options menu and select PTR&nbsp; mode. This is a\r\n new feature where we now have a global PTR mode instead of a PTR mode by class (mages had a self-containing PTR mode back in RAWR 2). One warning about the PTR mode and enchants. Just selecting the PTR mode will not change the enchants to the PTR enchant,\r\n since these are loaded at launch. So this applies to enchants such as Superior Intellect to off-hand getting nerfed from 100 Int down to 40 Int.</p>\r\n<p>As for gear updates, I cannot really change those until the patch is released since these will affect live gear.</p>\r\n",
    "PostedDate": "2011-01-21T09:31:45.147-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "553360",
    "ThreadId": "242734",
    "Html": "\r\n<p>Moonkin has its own PTR mode right now, I didn't tie it in to the global option for some odd reason or another.&nbsp; Since I know you as one of my Moonkin users, I thought I'd point that out.&nbsp; It includes the spell changes that have been outlined in\r\n the patch notes, all the ones I could verify at any rate.&nbsp; I'm not 100% sure what went live in 4.0.16 beta; you can look at the change log in the Source Code tab to see what's in and what's not.</p>\r\n",
    "PostedDate": "2011-01-21T10:02:34.447-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "553361",
    "ThreadId": "242734",
    "Html": "\r\n<p>When I added the option, I specifically called out that the global PTR mode was NOT model specific. Models need to make their own PTR mode checkboxes for now.</p>\r\n",
    "PostedDate": "2011-01-21T10:07:38.363-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "553466",
    "ThreadId": "242734",
    "Html": "\r\n<p>Just a clarification on Mage model. Currently there are no ptr changes implemented yet, only the mana changes that are already live through hot fix.</p>\r\n",
    "PostedDate": "2011-01-21T15:04:10.233-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "553527",
    "ThreadId": "242734",
    "Html": "\r\n<p>Great stuff, thanks guys. Hadn't noticed the PTR checkbox, I'll check it out.</p>\r\n",
    "PostedDate": "2011-01-21T18:30:07.873-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]