[
  {
    "Id": "556559",
    "ThreadId": "243605",
    "Html": "\r\n<p>been waiting since cata release was just curious as to when you guys expect rawr.elemental will be up and running?</p>\r\n",
    "PostedDate": "2011-01-27T15:23:35.08-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "556656",
    "ThreadId": "243605",
    "Html": "\r\n<p>Let me just preface this by saying I truly appreciate all the time and effort that goes into Rawr, and I know it's free, and the developers do it because they want to, and that I'm not owed anything by them. But... I've been watching for elemental improvements\r\n for a while and there really hasn't been much in a long time. This is also the case for many other models, and there's no evidence to support that anything will change any time soon. It would be less frustrating to those of us feeling left out if existing\r\n &quot;active&quot; developers could take a stab at some of the other class models needing help.</p>\r\n",
    "PostedDate": "2011-01-27T21:03:24.277-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "556724",
    "ThreadId": "243605",
    "Html": "\r\n<p>Models that appear inactive... are inactive. We don't have active developers for them.</p>\r\n<p>This isn't a situation where the active developers can 'take a stab at' the other models. We don't play those classes, we don't theorycraft them, we don't know how to model them, etc.</p>\r\n",
    "PostedDate": "2011-01-28T00:38:22.807-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "556728",
    "ThreadId": "243605",
    "Html": "\r\n<p>which mean no one will be ever developing them?</p>\r\n",
    "PostedDate": "2011-01-28T00:47:16.853-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "556731",
    "ThreadId": "243605",
    "Html": "\r\n<blockquote style=\"border:solid .1em #ccc; font-style:italic; margin:.25em 1em 0 1em; padding:0 .25em 0 .25em\">\r\n<strong>Feeran wrote:</strong><br>\r\n<p>which mean no one will be ever developing them?</p>\r\n</blockquote>\r\n<p>Uhhh... No? How do you jump from what I said, to that retarded idea?</p>\r\n",
    "PostedDate": "2011-01-28T00:51:06.167-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "556747",
    "ThreadId": "243605",
    "Html": "\r\n<p>i asked when you expected to have them up and you reply with &quot;they are inactive&quot; thanks tips real helpful</p>\r\n<p>&nbsp;</p>\r\n",
    "PostedDate": "2011-01-28T01:26:03.87-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "556749",
    "ThreadId": "243605",
    "Html": "\r\n<p>The &quot;maintained&quot; column on the models status page should probably be updated then. Nothing there says inactive and every model lists a maintainer.</p>\r\n",
    "PostedDate": "2011-01-28T01:28:17.763-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "556760",
    "ThreadId": "243605",
    "Html": "\r\n<p>Jothay should update the &quot;Maintained&quot; column there, but...&nbsp;Come on.&nbsp;</p>\r\n<p>Some models don't have an active developer. It's pretty damn obvious when that's the case. That doesn't mean that they'll never be worked on ever again, it means we're looking for an active developer for that model.</p>\r\n<p>&nbsp;</p>\r\n",
    "PostedDate": "2011-01-28T01:59:59.713-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "556764",
    "ThreadId": "243605",
    "Html": "\r\n<p>There may be a maintainer, but that person does actually need to have the time to work on it as well.&nbsp; We're all humans with jobs, families etc.&nbsp; and sometimes you just can't make enough time to work on &quot;fun&quot; projects because other matters are\r\n more important.&nbsp; (I should know, I'm in that exact situation myself now).</p>\r\n<p>When the maintainer does find the time to work on the model it'll get updated.&nbsp; You could also sign up to be a developer for rawr and work on it yourself, you'll need to have some programming skills of course, but the developer list changes over time.&nbsp;Maybe\r\n you know an elemental shammy that is also a programmer and has some spare time on his hands ? :p</p>\r\n<p>I'm pretty sure that if nothing happens on it at all that one of the devs of the other models (looks at jothay) will probably end up making it at least &quot;semi functional&quot; once they get their own model and the major bugs sorted.</p>\r\n",
    "PostedDate": "2011-01-28T02:06:28.387-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "556794",
    "ThreadId": "243605",
    "Html": "\r\n<p>Astrylian is right though - if some &quot;other&quot; developer does look at the Elemental model and &quot;makes a stab at it&quot; you get a half done model. Now Feeran answer me this... Would you prefer a model that loads your character but gives you really inaccurate results\r\n and doesn't have the right formula because it hasn't been updated to know about change X, Y &amp; Z that patch 4.0.x introduced, or would you prefer to wait until a developer volunteers to help and produces a model that has accurate numbers so the gear it\r\n suggests is correct?</p>\r\n<p>Seriously if we don't have people willing to work on a model its inactive, until someone comes along it will stay inactive, because a half baked solution that gives inaccurate results is a lot worse than something that is acknowledged to be not working.</p>\r\n",
    "PostedDate": "2011-01-28T03:30:44.593-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "556795",
    "ThreadId": "243605",
    "Html": "\r\n<p>I can look at getting elemental up and running (as I am actually one, not an enhance shaman :P). &nbsp;But it will take the backseat when there are things that need to be done on enhance.</p>\r\n<p>&nbsp;</p>\r\n<p>But no promises, mind you...</p>\r\n",
    "PostedDate": "2011-01-28T03:31:01.77-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "560399",
    "ThreadId": "243605",
    "Html": "\r\n<p>I think a lot of the enhance model could be reused with&nbsp;elemental (Especially the fire elemental model!). I started to look at this the other day but my background is in C&#43;&#43;/Java, and there's enough differences in C# that I wasn't confident that I was\r\n following everything I read correctly. I think I got a fairly good grasp of how enhancement is calculating things, but it doesn't have to deal with cast times (I think the duration component of the abilities might work there though). One thing I wasn't certain\r\n on how to approach was Lava Surge and how it interacts with Lava Burst.</p>\r\n<p>&nbsp;</p>\r\n",
    "PostedDate": "2011-02-03T13:57:40.223-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "561577",
    "ThreadId": "243605",
    "Html": "\r\n<p>I used Rawr to get me started in WoTLK, it an awsome program that i would love to help suport. As with alot of people right now, i dont have any bloody money AND i know nothing about code. I do know about ele shammies. If someone were to put the time and\r\n effort into getting elemental up and running on Rawr again i would be more then will to help in any way that i can ( you do the code stuff and ill do the fact looking up, the coffee runs, the hiding of key board prints on ur face when u pass out at the computer\r\n I WILL NOT pretend to be you to curb the boyfriend/girlfriend agro tho, gotta have limitations :P) This is an epic program that really helps simplify things and it should be finished and shared with all the WoW comunity.&nbsp;</p>\r\n",
    "PostedDate": "2011-02-06T12:50:02.72-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]