[
  {
    "Id": "557497",
    "ThreadId": "243849",
    "Html": "\r\n<p>Just curious if this model is being updated with roncli being missing in action for over a month. There was a lot of progression done to the model and it has all seem to come to a dead stop. If you could just let me know if there is an ETA on the model being\r\n cata ready or someone else is working on the model in his absense that would be helpful.</p>\r\n<p>~Cantholdagro</p>\r\n",
    "PostedDate": "2011-01-29T22:07:01.413-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "558179",
    "ThreadId": "243849",
    "Html": "\r\n<p>Roncli is out for a bit but he will be back.</p>\r\n",
    "PostedDate": "2011-01-31T09:15:27.797-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "562201",
    "ThreadId": "243849",
    "Html": "Mamma MIA! I finally got a break in the action, so I gave ProtPaladin some love this weekend. Stats should be correct, and the only issue I'm aware of has to do with threat with Seal of Truth. If there are any other issues, please file them as issues.\r\n I've cleaned out my RSS inbox, so I should be pretty responsive to them again.",
    "PostedDate": "2011-02-07T13:22:37.493-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "562242",
    "ThreadId": "243849",
    "Html": "\r\n<p>Roncli, I think there is an issue with the Block/Perry/Dodge math, or its display on the Stats page.&nbsp; I will look into it deeper tonight, and if I am correct, I will post a new Issue.</p>\r\n",
    "PostedDate": "2011-02-07T14:31:29.373-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "562293",
    "ThreadId": "243849",
    "Html": "\r\n<p>I don't think my changes made the latest build, so either use the source or test it out in the next release. :)</p>\r\n",
    "PostedDate": "2011-02-07T16:10:20.693-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "566227",
    "ThreadId": "243849",
    "Html": "<p>I just tested the ProtPaladin module today.. And I've been surprised!</p>\n<p>Why Agility, Crit and haste is so high? I see a necklace with Agility, crit, haste is higher than a necklace with a lot of mastery and dodge.</p>\n<p>Maybe I missed a post on EJ but Mastery, Dodge, Parry still the avoidance stats for tanks, no?</p>\n<p>I understand a choice of Agility, Mastery, Dodge/Parry VS Strength, Mastery, Dodge/Parry with same value on stats; But it's not the case</p>",
    "PostedDate": "2011-02-14T18:04:42.483-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "566251",
    "ThreadId": "243849",
    "Html": "<p>There's a bug up for that, Seal of Truth seems to be quite a bit threat heavy. &nbsp;I haven't figured the cause yet.</p>",
    "PostedDate": "2011-02-14T18:57:55.09-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "566830",
    "ThreadId": "243849",
    "Html": "<p>You don't implement the self-heal capacities? Seal of Insight and Glyph of WoG and Insight?</p>",
    "PostedDate": "2011-02-15T17:02:15.697-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "566835",
    "ThreadId": "243849",
    "Html": "<p>In a tanking model, no, because they aren't part of your survivability or mitigation scores. That's why we don't model Hp5 either.</p>",
    "PostedDate": "2011-02-15T17:11:36.37-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "566837",
    "ThreadId": "243849",
    "Html": "<p>Ok, thanks for your answer :)</p>",
    "PostedDate": "2011-02-15T17:13:02.723-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "566986",
    "ThreadId": "243849",
    "Html": "<p>The problem for prot pala is that the self-healing builds&nbsp;<strong>are</strong> in wide use, even in progress raids.&nbsp; Self healing through SoI and WoG, and the shield from WoG may not be actual survival or mitigation since they're effects, but they do work to make a paladin tank easier to heal than another tank.</p>\r\n<p>With this many people actually speccing into 'wogger' builds, I'm not sure it would be right for rawr to entirely disregard this particular approach to protpala.&nbsp; Whether or not wogger specs will continue to be viable in next tiers is an entirely different matter of course that we can't possibly predict.</p>",
    "PostedDate": "2011-02-16T01:33:33.787-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "567080",
    "ThreadId": "243849",
    "Html": "<p>Well, if we think about it less like a heal, and more like say savage defense, it makes more sense. &nbsp;Treating it more like savage defense may be the best idea, and is at least plausible. &nbsp;</p>\r\n<p>And yes, I do understand that WoG is NOT an absorb, and savage defense IS. &nbsp;Perhaps that is where the shortfall lies, as both do the same function, make you live longer and also make you need less healing. &nbsp;</p>",
    "PostedDate": "2011-02-16T05:33:11.203-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "567083",
    "ThreadId": "243849",
    "Html": "<p>Wogger spec is like Savage defense, yes. All overhealing create an absorb shield.</p>\r\n<p>I agree OReubens and Antivyris. WoG healing is a large part of survivability for a protpaladin.</p>",
    "PostedDate": "2011-02-16T05:38:08.56-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "567250",
    "ThreadId": "243849",
    "Html": "<p>if its creating an absorb shield and you can determine with &nbsp;reasonable accuracy how big and how often its being made then use the damage absorb stat already in place in modelling.</p>\n<p>The point is, and I admit I havent looked into the details here, anything reactive to damage that restores health isnt survivability in a tank model. Like the Blood Ward enchant, it heals you affter you take the damage. So if you had taken a large enough single hit, it wouldnt fire because you died.</p>\n<p>I can go over this more when Im not typing from my phone.</p>",
    "PostedDate": "2011-02-16T08:57:01.283-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "567278",
    "ThreadId": "243849",
    "Html": "<p>Taking this discussion offline with the Devs involved for now. We'll report back when we come to a solution on this.</p>",
    "PostedDate": "2011-02-16T09:38:39.183-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "568842",
    "ThreadId": "243849",
    "Html": "<blockquote style=\"border: 0.1em solid #cccccc; font-style: italic; margin: 0.25em 1em 0pt; padding: 0pt 0.25em;\"><strong>Jothay wrote:</strong><br />\n<p>if its creating an absorb shield and you can determine with &nbsp;reasonable accuracy how big and how often its being made then use the damage absorb stat already in place in modelling.</p>\n<p>The point is, and I admit I havent looked into the details here, anything reactive to damage that restores health isnt survivability in a tank model. Like the Blood Ward enchant, it heals you affter you take the damage. So if you had taken a large enough  single hit, it wouldnt fire because you died.</p>\n<p>I can go over this more when Im not typing from my phone.</p>\n</blockquote>\n<p>It's the problem. The swogger spec is special. When you cast WoG, it heal you. All overheal is converted to a shield who absorb damage for the montant of the overheal.</p>\n<p>But it's true. It's not accurate and modelable.</p>\n<p>&nbsp;</p>\n<p>Sorry for my poor english :)</p>",
    "PostedDate": "2011-02-18T18:28:11.123-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]