[
  {
    "Id": "559804",
    "ThreadId": "244413",
    "Html": "\r\n<p>I was wondering if it would be possible to create certain rotations for the Arcane Talent Specialization and came across the custom spell mix editor. However, I have been unable to find anyone who has given a rundown of how to use this feature, and being\r\n new to Rawr I am clueless in how to use it. Also, is it possible for Rawr to produce slightly different numbers for each time it calculates the rotations so that I may use this data to do a statistical analysis to produce a fully analyzed set of data for me\r\n to use. If any one can help me I would appreciate it greatly.&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>:) Thank You!</p>\r\n",
    "PostedDate": "2011-02-02T18:05:58.137-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "559813",
    "ThreadId": "244413",
    "Html": "\r\n<p>Unfortunately the custom spell mix editor isn't really useful for modeling realistic rotations. It works if you know exact spell cast distributions, but doesn't allow you to model dynamic rotations. What you can do instead is look at the Cycle Analyzer under\r\n Options -&gt; Tools. That will allow you to construct any cycle based which spell to cast under which conditions as well as allow you to compute the optimal cycles for your case. The numbers it gives are statistical average or a stationary distribution so\r\n there is no need to generate slightly different numbers since it already takes all possibilities into account. The actual cycles used by the solver to compute dps that you see in the Spell Info listing are a subset of that taken from optimal cycles at various\r\n gear sets and optimized for performance. At this point I don't plan to allow using arbitrary cycles for comparison calculations, but if you feel a certain one is missing I could look into adding it.</p>\r\n",
    "PostedDate": "2011-02-02T18:39:16.21-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "560477",
    "ThreadId": "244413",
    "Html": "\r\n<p>Ok, I am doing a project for school that deals with Statistics and Statistical variation. This program is great for what I need to do, however my teacher is requiring me to gather alot of data. Obviously this would be extremely difficult. Is it possible\r\n to locate the data that Rawr creates?</p>\r\n",
    "PostedDate": "2011-02-03T18:15:06.487-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "560479",
    "ThreadId": "244413",
    "Html": "\r\n<p>Exactly what kind of data are you looking for? Rawr runs the calculations literally millions of times against as many gear sets when you run an optimize. The charts, etc. are just an output of the same thing but only against those items against your current\r\n set. We don't store this data anywhere that a user could get at beyond what you are seeing on screen.</p>\r\n",
    "PostedDate": "2011-02-03T18:17:59.627-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "560480",
    "ThreadId": "244413",
    "Html": "\r\n<p>Ok thank you. My teacher just wants the various numbers that are created through the calculations. Thank you for replying. :)</p>\r\n",
    "PostedDate": "2011-02-03T18:19:38.007-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "560481",
    "ThreadId": "244413",
    "Html": "\r\n<p>You would need to rewrite the program to export the data as it calculates it.</p>\r\n",
    "PostedDate": "2011-02-03T18:21:43.22-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "560482",
    "ThreadId": "244413",
    "Html": "\r\n<p>Is it possible for me to do this?</p>\r\n",
    "PostedDate": "2011-02-03T18:23:24.263-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "560484",
    "ThreadId": "244413",
    "Html": "\r\n<p>If you know how to write C# code, yes, but we have no need for this ourselves.</p>\r\n",
    "PostedDate": "2011-02-03T18:27:47.373-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "560485",
    "ThreadId": "244413",
    "Html": "\r\n<p>I think the data you're looking for actually doesn't exist. From your description it sounds like you want damage numbers for individual runs. Rawr.Mage never calculates any individual possible run of events, it just computes the mathematical average. If\r\n you want data of individual runs you'll probably want to look into simulationcraft.</p>\r\n",
    "PostedDate": "2011-02-03T18:29:19.843-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "560487",
    "ThreadId": "244413",
    "Html": "\r\n<p>Ok. Thanks guys! You all are very helpful. The program is fun to use and I will continue to use it. I must really thank you all for the help! :)</p>\r\n",
    "PostedDate": "2011-02-03T18:31:36.38-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]