[
  {
    "Id": "560324",
    "ThreadId": "244549",
    "Html": "\r\n<p>I am wondering what stat weights that Rawr is using for Optimization. Last time I read Elitist Jerks, Assination Rogues were going HIT to cap, Reforge&nbsp;Crit and Expertise&nbsp;to Mastery, gem everything&nbsp;Agility. Looking at the top Rogues that seems\r\n to be the case as well.</p>\r\n<p>When I optimize or check how an upgrade works with what I have, it seems that Expertise is usually on the top of the list, when in fact it should be the bottom.</p>\r\n<p>Secondly I read about Rawr only showing the equiped item. I went to the Gems and that seems to fix the problem. However, am I missing something in being able to choose the cogs, or is it not working?</p>\r\n<p>Probably need to repost in the Issue's that Glyphs are still not showing correctly, I did it once, but my issue was closed for some reason.</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n",
    "PostedDate": "2011-02-03T11:14:04.807-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "560326",
    "ThreadId": "244549",
    "Html": "\r\n<p>Do keep in mind, Rawr in general does not use Stat weights as part of it's calculations. It uses all of your gear and evaluates from there. On that note Fes is still trying to work on the rotation calculations for the rogue module and this in turn is used\r\n by the Optimizer to get the best gear calculations.</p>\r\n",
    "PostedDate": "2011-02-03T11:17:18.01-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "560341",
    "ThreadId": "244549",
    "Html": "\r\n<p>Rogue is still being worked on, but if you really think there's a problem, please follow the Posting Guidelines and post an issue with your character attached and state exactly what you think is wrong.</p>\r\n",
    "PostedDate": "2011-02-03T11:34:41.477-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "560404",
    "ThreadId": "244549",
    "Html": "\r\n<p>I'm in the process of rewriting Rogue, after that's done and released I'll post it and ask for tickets.</p>\r\n",
    "PostedDate": "2011-02-03T14:05:32.463-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]