[
  {
    "Id": "562568",
    "ThreadId": "245101",
    "Html": "\r\n<p>Hi!<br>\r\n<br>\r\nThe trinket data (on the mage model) looked to me very strange, so I tested around a bit. First thing I noticed was that the ICD for many trinkets was wrongly set to 45 seconds (bell, mirror,<br>\r\nfor example) when it should be 100 seconds (or for some blue trinkets 75 seconds or 50 seconds). (The Volcano Card is *correct* at 45 seconds, BTW).<br>\r\n<br>\r\nThis<br>\r\n<br>\r\nhttps://spreadsheets.google.com/ccc?key=t47dtne-1KNvOI-fMWiHz3Q&amp;hl=en&amp;pli=1#gid=0<br>\r\n<br>\r\nmight help for correct trinket data (spreadsheet was not done by me, I am just pasting it into this mail, but I can confirm the data for the Bell - which I own myselves - listed in this spreadsheet).<br>\r\n<br>\r\nWhen looking at this, I still noticed that the Soul Casket was evaluated much higher than I would<br>\r\ndeem correct (higher than the Bell, which should be definitely higher than the Soul Casket for\r\n<br>\r\nFiremages). So for testing I entered data for a trinket like this<br>\r\n<br>\r\n321 Crit Rating<br>\r\nOn Use every 2 Minutes 1926 spellpower for 20 seconds<br>\r\n<br>\r\nto compare with the Bell (Note: This is the bell since 4.0.6, with 20% Proccchance on spellhit, instead of 30% on spellcrit):<br>\r\n<br>\r\n321 Crit Rating<br>\r\n20% Procc. on SpellHit 1926 Spellpower for 20 seconds 100 seconds ICD<br>\r\n<br>\r\nThe FIRST trinket gets evaluated with 200 more spellpower/score. I am not into the<br>\r\ninvolved maths, but despite the ability to better plan the trinket effect I personally<br>\r\nwould have expected the other way round? <br>\r\n<br>\r\nIt seems to me as if ALL OnUse Trinkets (Heart of Ignacious, Jeweller Trinket,...) get a much<br>\r\nhigher value by Rawr than what I would have expected.<br>\r\n<br>\r\nAnybody has an idea about what is going on there?<br>\r\n<br>\r\nMelliandra</p>\r\n",
    "PostedDate": "2011-02-08T04:42:44.907-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "562814",
    "ThreadId": "245101",
    "Html": "\r\n<p>First of all if you think you have an issue, post it in the issue tracker</p>\r\n<p>Secondly, the trinket cooldown modeling was updated a month ago. Try reloading your item cache and see if that works. if not post in the issue tracker.</p>\r\n",
    "PostedDate": "2011-02-08T10:54:56.05-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]