[
  {
    "Id": "82339",
    "ThreadId": "24553",
    "Html": "\r\nHopefully that's clear enough for a title... What I mean is last night, I went through the lists deciding what I wanted for my tank suit (waiting for the Armory to update with my cat kit so I can do that now...), and would look at the stuff above what I had. \"Oo, shiny! Where does that come from? Nuts, Black Temple. No chance I can get that...\" <br /><br />What I'd like is an option to choose what the source of an item is. Quest reward, world drop, instance trash drop, instance boss drop, raid trash drop, raid boss drop, crafted BoP, crafted BoE. I solo and pug, mostly, so I don't have access to a lot of the high end raid stuff, but I still want to be the best I can... I can farm materials, but since I'm not a leatherworker, I can't make my own BoP gear. The option to choose 'crafted BoE' would be a huge help. <br /><br />Breaking it down to individual instances would be nice too; as someone else suggested for their 'I'm going into X instance, what's good for me in here?' list, but I expect that would be a hell of a lot of programming... <br /><br />I am not any kind of a programmer, but working nights I have a lot of free time between calls, so I would happily help with something like text entry for source adding if it would help. <br />",
    "PostedDate": "2008-03-23T19:27:19.807-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "82355",
    "ThreadId": "24553",
    "Html": "\r\nWe're working on it. :)<br />",
    "PostedDate": "2008-03-23T21:50:32.613-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "82376",
    "ThreadId": "24553",
    "Html": "<div class=\"quote\" style=\"border: dotted .1em #aaa; border-left: none; border-right: none; font-style: italic; margin: 1em 0em 2.5em 3em;padding: .2em;\"><br />Astrylian wrote:<br />We're working on it. :)<br /><br /></div><br />Sweet, thanks. Another related option might be professions... Engineering (goggles), leatherworking (sets like the Heavy Clefthoof set bonus), the Alchemist's stones (especially the new ones coming in 2,4) are all good buffs but totally dependent on the profession... I don't know how much Rawr takes into consideration stuff like the +20 heavy clefthoof strength bonus, but it would still help cut down on the list clutter. <br /><br />By the way, do you prefer suggestions here or under 'issue tracker'? I hadn't looked there before posting this, figuring it was for bugs rather than requests... <br />",
    "PostedDate": "2008-03-24T05:53:04.87-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "82406",
    "ThreadId": "24553",
    "Html": "\r\nBugs go there, suggests go here or there, doesn't matter. :)<br /><br />I think professions might come in later when we get a good Source field, that you could filter on. You could just hide all the BoP Jewelcrafting items if you're not a JC.<br />",
    "PostedDate": "2008-03-24T08:20:42.937-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]