[
  {
    "Id": "564749",
    "ThreadId": "245675",
    "Html": "\r\n<p>I'm new to Rawr. I tried to look this up in the FAQs, etc. but can't seem to find an answer. My character imports from BN correctly, but two items (one ring, and chest piece) do not have the proper stats attached. In the case of the chest piece, it just\r\n lists the armor, but no stat buffs. In the case of the ring it explicitly says &quot;Not found on armory&quot;. It'd be ideal if these could be looked up properly, but failing that, is there a way to edit them manually?</p>\r\n",
    "PostedDate": "2011-02-11T09:44:42.8-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "564780",
    "ThreadId": "245675",
    "Html": "<p><span style=\"font-size: x-large; font-weight: bold;\">Welcome to the Rawr Discussion Board</span><br /> <span style=\"font-size: large; font-weight: bold;\">&gt;&gt;Please read the <a title=\"Posting Guidelines\" href=\"../wikipage?title=PostingGuidelines&amp;referringTitle=Documentation\"> Posting Guidelines</a> before posting&lt;&lt;<br /> &gt;&gt;Do not post bugs, feature requests, or other issues here, post them in the <a title=\"Issue Tracker\" href=\"../WorkItem/AdvancedList.aspx\" target=\"_blank\"> Issue Tracker</a>&lt;&lt;</span></p>\r\n<p>After reading the <a title=\"Posting Guidelines\" href=\"../wikipage?title=PostingGuidelines\" target=\"_blank\"> Posting Guidelines</a>, there are several places to look for answers <em>before</em> posting. Search the existing threads here. Search the existing issues in the <a title=\"Issue Tracker\" href=\"../WorkItem/AdvancedList.aspx\" target=\"_blank\"> Issue Tracker</a>. Look through the documentation on the <a title=\"Documentation\" href=\"../documentation\" target=\"_blank\"> Documentation</a> tab, and in the Help menu in Rawr. Then, and only after reading the <a title=\"Posting Guidelines\" href=\"../wikipage?title=PostingGuidelines\" target=\"_blank\"> Posting Guidelines</a>, please feel free to post here. Note that threads in the Retired category are considered to be out of date and may provide information that is no longer valid.</p>",
    "PostedDate": "2011-02-11T10:16:46.273-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "564891",
    "ThreadId": "245675",
    "Html": "<p>You should be able to edit the item by selecting edit from context menu. Just search for the item in the charts on the right, if they don't have any stats currently they'll usually be at the bottom of the chart.</p>",
    "PostedDate": "2011-02-11T13:14:39.193-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "570006",
    "ThreadId": "245675",
    "Html": "<p>If Rawr did not find the item in the armory, you can do the following:</p>\r\n<p>1. Search for the item on thottbot or wowhead. Note the item ID in your address bar.</p>\r\n<p>For example: My mage, for lack of a better drop, still has Harrison's Climbing Hook. Searching for that on thottbot gives an address of&nbsp;<a href=\"http://thottbot.com/item=65787\">http://thottbot.com/item=65787</a>&nbsp;- Item ID is 65787.</p>\r\n<p>2. In Rawr, select the options menu, select Edit Items...</p>\r\n<p>3. In the window that comes up, click on the add button at the bottom of the window, and enter the item id there. That will pull the item info from the web, populating the item on your character.</p>\r\n<p>All my instructions assumed the wpf version of Rawr, I don't use the web application.</p>",
    "PostedDate": "2011-02-21T21:12:13.907-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]