[
  {
    "Id": "82407",
    "ThreadId": "24577",
    "Html": "\r\nLooking at my moonkin's model, I realized that not all of the factors for mana regeneration were being taken into consideration?  Or if they are it is a hidden function that I cannot help control with my own play specifics.  In any case, the estimates for OOM seem to be much earlier than I actually experience, and with a more conservative cast cycle.  I was wondering if mana potions or any of the drums (most specifically drums of restoration) or someone in group having a spell-surge enchant is taken into consideration?<br /><br />For example:<br />During an 8-10 min boss kill I pop an innervate on myself about 1 min after battle starts.  At that point I equip a staff that has high spirit to make the most out of my innervate.  After the innervate ends, I re-equip my regular weapon.  I then start using mana potions religiously every 2 mins until the fight is over (maybe starting 30 secs after I use my innervate).  If I'm still having mana problems, I use Drums of Restoration with my first mana pot.  If I'm not having mana problems I use drums of battle.  Often, I have a second innervate to use on myself before the end of battle.<br /><br />B/c of the intensive mana regen items / spells / etc I use, I am able to last longer in battle, use a heavier cast cycle (mana-wise), and choose more damage gear over regen gear.  If we can see mana pots implemeneted (maybe a first mana pot used roughly this far into the battle, and then calculate a mana pot popped every 2 mins after that?) and also a potential # of innervates used per battle (you're already allowing us to put in how long the battle is, so potentially this could be a function of battle time?) it'd make a huge impression on the #'s I'm seeing.<br /><br />Being the oomkin class means mana is a huge factor and what gear you wear and what gear is an upgrade hinges around that.  If I'm going oom in a fight all of my gear hinges on regen, and my cast cycle suffers along with it.  If I'm able to sustain my mana, I change around gear and cast cycle and am able to get probably 100dps more during a fight... if not higher.  So if you can find a way to calculate all of that extra crap into this program, it'd turn close to godlike :)<br /><br />I know the moonkin portion is newer and there'll be kinks to work out.  If there's any way any of this can be worked in I'd be most appreciative.  Thank you so much!<br />",
    "PostedDate": "2008-03-24T08:22:16.997-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "82670",
    "ThreadId": "24577",
    "Html": "\r\nFirst of all, it's assumed that if you're receiving an innervate, you're getting one on every cooldown for the duration of the fight.  That mechanic is already there.  I can add a similar mechanic for mana pots.  The fact is, there are a LOT of factors in the moonkin DPS spreadsheet, and while the numbers are fairly close for the parameters that are modeled, it's going to take time to model all of them.  It's a work in progress. =) That being said, my first priority today is to get the model updated for the new changes to 2.4.  Once that is done, I'll see about taking a look at this.<br />",
    "PostedDate": "2008-03-25T06:46:11.76-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "82698",
    "ThreadId": "24577",
    "Html": "\r\nThank you so much!  I'm sure none of this is simple and I appreciate the work done.  You guys have made a wonderful program.<br />",
    "PostedDate": "2008-03-25T08:15:33.133-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "82773",
    "ThreadId": "24577",
    "Html": "\r\nOne thing I realized that you should probably know: I do not model high-spirit \"Innervate weapons\" at the moment, and I'm uncertain of my capability to do so.  What I may end up doing is adding two boxes that are labeled \"Intellect/Spirit on innervate weapon\" with a note that says to leave them at 0 for no weapon-switching.  Would that be acceptable?  (Note: I include intellect because of the patch 2.4 change to mana regen, which includes intellect and should be uploaded along with mana pots and basic trinkets today).<br /><br />EDIT: I realize that this essentially blocks the possibility of searching for upgrades to an \"innervate weapon\".  What I would do in that case would be to add a second stat specifically for innervate mana regen.  It would not affect the rankings unless you chose to sort by that stat, so it would display all your DPS items under Overall and Damage, and Innervate would show values only for weapons/offhands and would show you which combination gave you the most mana.<br />",
    "PostedDate": "2008-03-25T12:57:15.68-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "87914",
    "ThreadId": "24577",
    "Html": "\r\nThe changes look fantastic!  Keep up the great work<br />",
    "PostedDate": "2008-04-20T17:59:49.393-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]