[
  {
    "Id": "568882",
    "ThreadId": "246713",
    "Html": "<p>Hi- first I downloaded Rawr_b4.0.19.zip and extracted and ran it. Then, when I had problems with the Optimizer, I came to the documentation area here and discovered that RAWR is supposedly web-based... making me wonder why I needed to download the zip file...  But I digress...</p>\n<p>So I went to the elitistjerks rawr page/app/script/code/whatever and tried again. Obviously, I am doing something wrong because no matter which way I approach it (the local app or the apparently identical web-based app) I get strange non-intuitive prompts and I  am not able to save or print out the optimizer suggestions as to re-gemming and/or re-enchanting my gear.</p>\n<p>Specific questions:</p>\n<p>1. What does Optimizer mean when I run it and it gives me a list of 6-8 gems, some of which are ALREADY EQUIPPED, which are \"not available?\" How is a gem \"not available?\" I can cut it myself or buy it in the auction house; therefore (almost) every gem in  the game is \"available.\"</p>\n<p>2. I ran the tutorial video and learned that I must \"check the green diamonds\" to make various things \"available.\" However, the information displayed is wider than my monitor and there is neither a horizontal scroll bar nor a scaling control, and control+mousewheel  does not scale the page either. Therefore, half the information on the right side of the page is simply off beyond the right edge of my screen somewhere, or buried under the left edge of that frame, and there are ZERO green diamonds visible to check or uncheck.  Further, there are no green diamonds anywhere near any of my gems, which are displayed on the fully-visible left side of the screen. Please, how can I \"make gems available\" (whatever that actually means in actual English).</p>\n<p>3. I ran the Optimizer anyway without being able to green-diamond-check anything, and it showed me new gems and enchants on much of my gear. YAY! Unfortunately, I could find no way to actually save or use the information. By \"use\" I mean the ability to <span style=\"text-decoration: underline;\">print out a list</span> that says basically:</p>\n<p>\"Item: Lich King's Frigid Helm of Ridiculosity: change Meta gem from Brilliant Starfire Oldsmobile to Wonderful Shadowspirit Thingamabob. Change Yellow-socket gem from x to y. Change enchant from Whatsisname's Lesser Arcanum of Absolute Gibberish to Somebody Else's Greater Arcanum  of Major Obscurity. Reforge 286 Spirit to Hit.\"</p>\n<p>The reason for needing to print out such a list (instead of being satisfied to have it in a web page or local app displayed on my monitor but not printed out) would be evident to anyone who goes through the pain and agony of tabbing out and back into full-screen  World of Warcraft, a process which can take up to 5 minutes each tabout while the computer does who-knows-what with the HDD light on continuously for literally 3-5 minutes every time I tab out of WoW. Yet I can find no way to print out the Optimizer result, and I have fully explored  every tab and menu option- most of which are not even available with the Optimizer window active, and closing the Optimizer window to gain access to the various menu options blows up all the Optimizer results which disappear into thin air and are not retrievable without re-running Optimizer, at which point the menu options are not available... lather, rinse, repeat...</p>\n<p>How can I print out the Optimizer results so that I can actually implement the recommendations without spending <span style=\"text-decoration: underline;\">literally hours on end</span> tabbing in and out of WoW? As info, my PC was built last year with an Intel Mobo and Core-2 Duo, 4Gb of RAM, 800Gb SATA HDD, Nvidia GeForce 9500GT and Windows XP SP3 (32-bit), so the horrible delays tabbing in and out of WoW are not due to any slouchiness in my hardware or OS AFAIK.</p>\n<p>4. Optimizer \"recommended\" regemming and re-enchanting such that my Hit percentage was reduced from 16.42% (close to Mage cap of 17%) down to 12.nn percent. According to everything I can read on EJ and elsewhere, reaching Hit Cap is the MOST important stat  for any raider of any class. So I am baffled as to why Optimizer would recommend a setup that REDUCES my spell hit from nearly capped with only about 0.5% miss possibility on level 88++ bosses down to huge miss possibilities on not only 88++ but also 87 and  86! Please, can someone tell me in plain English how to get Optimizer to simply give me some guidance on gems and enchants on my present gear without nerfing my Spell Hit to the point of killing my raid dps by making me miss 20% of my spells on bosses? (Yes, I stumbled across the \"filter\" where I put  in \"Hit &gt;= 17.00%\" but still could not get a credible result due to Optimizer saying 6-8 gems were \"unavailable\" whatever that means to the program (it's meaningless gibberish to me because the concept of a gem not being \"available\" simply makes no sense since I can easily cut or buy almost any gem in the game.)</p>\n<p>As info, I couldn't care less about seeing a list of 3,000 gear upgrades. Maybe I need 'RAWR Lite.\" :)</p>\n<p>I just want to <span style=\"text-decoration: underline;\">optimize the gear I have equipped now</span> to get the most out of it. That would include reforging it, regemming it and/or re-enchanting it. I need to find some way to \"tell\" Optimizer that ALL GEMS  and ALL ENCHANTS are \"available\" except profession-specific ones for profs I don't have (like the Blacksmith sockets), and since RAWR correctly imported my profs (mining and Jewelcrafting) that shouldn't be an issue.</p>\n<p>Thanks</p>",
    "PostedDate": "2011-02-18T22:44:42.52-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "568886",
    "ThreadId": "246713",
    "Html": "<p>1. It means you are using gems that are not in the gemming templates, because they are either very inferiois, like an AP gem for a warrior or they are green gems or something. To mark them available got to the Gem charts and enable them. OR dont and let the optimizer just regem you to gems you should actually be using.</p>\r\n<p>2. If you cant see the green diamonds you must be using a low res screen or something, because any screen res of 1280x1024 or higher can see them easily. You can try compact mode from the Tools. options &nbsp;dialog to see if that helps.</p>\r\n<p>3. No, theres no way to just print your optimzed character right now and theres already a feature request for that in the issue tracker. go vote on it or something.</p>\r\n<p>4. In rare cases, it may actually benefit to lose a little hit in favor of something else for higher total dps. to do any kind of OMG THERES AN ERROR HERE thing wemd need your character file, before and after. If you actually read the documentation, you would know what those optimizer warnings mean and how to fix them.</p>\r\n<p>There is no Rawr Lite, sorry. and its Rawr, not RAWR.</p>\r\n<p>You should neveer tell theboptimizer that all enchamts and or gems are avaulable, that would be dumb and highly innaccurate for the optimizer. It would take forever and most likely give crappy results. You only wanting it to be looking at Likely results.</p>\r\n<p>You downloaded Rawr because we have both a downloadable version AND a web version....</p>\r\n<p>All in all, everything you asked you could have figured out from reading the documentation or discussions on the subject or issues, because everything you havr asked has been asked before, and answered.</p>",
    "PostedDate": "2011-02-18T23:09:09.473-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "568887",
    "ThreadId": "246713",
    "Html": "<p>You are making some huge misunderstandings and mistakes, at a very basic level, and then wondering why the final results are odd. I'd start at the very beginning, and go from there, and solve your original problems (rather than ignore them, and be confused by the results).</p>\r\n<p>0. Rawr is available both online and as a download, whichever way you prefer.</p>\r\n<p>1. It means, quite literally, that those gems or other items, that you have equipped, are not marked&nbsp;<em>available</em>. Available has a significant meaning in Rawr, and it is used specifically, and described specifically in the docs, and in the UI.</p>\r\n<p>2. Here's where we get to your actual problem, which is probably causing the confusion with #1. You can't even see half of Rawr's UI it sounds like. There is something *seriously* wrong with... something, if you can't see half of Rawr's UI. Is your window very tiny? Are you using some hideously small resolution like on a really bad netbook or something? Are you using some extremely abnormal DPI in your display settings? Do you have zooming turned on very high in your browser or something? Rawr displays natively, and respects browser zoom in all major browsers. Solve this problem, and everything else will fall into place, I'd bet.</p>\r\n<p>3. A screen showing specific changes is displayed at the end of the Optimizer process. If it takes 3-5min to tab out of WoW, there is something hideously wrong with your system, which you should focus on solving before worrying about pretty much anything else. Since you mention the HDD light, you might have a corrupted hard drive.</p>\r\n<p>4. Hit capping is definitely not always optimal, and not being hit capped is not a DPS loss, for many classes, including all specs of mages. Optimal DPS typically comes from being somewhat close to hit cap, but not necessarily at it.</p>\r\n<p>&nbsp;</p>\r\n<p>Seriously, chill out, solve the root problems, which seem to be related to your ability to run Rawr usefully at all, not with any actual issue with the program.</p>",
    "PostedDate": "2011-02-18T23:15:14.88-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "569004",
    "ThreadId": "246713",
    "Html": "<p>\"Seriously, chill out\" What is this, Trade chat? You forgot 'Lrn2Play' and 'NOOB!'</p>\n<p>\"solve the root problems, which seem to be related to your ability to run Rawr usefully at all, not with any actual issue with the program.\" That would be why I started this discussion here and asked for help.</p>\n<p>I never said, nor did I mean to imply, that there was a problem with the program- I would have posted that in another forum (per instructions) had I believed that. I clearly indicated that *I* was having issues and requested help with specific tasks. Thanks  to Jothay for the information.</p>\n<p>\"Are you using some hideously small resolution\" My screen res is 1024 x 768. If I set it any higher most of my desktop shortcuts become so small as to be illegible. Yes, I wear thick glasses.</p>\n<p>\"If it takes 3-5min to tab out of WoW, there is something hideously wrong with your system, which you should focus on solving before worrying about pretty much anything else. Since you mention the HDD light, you might have a corrupted hard drive.\" I do not  have a corrupted HDD, or bad RAM sticks. I have run WoW on 4 different PC's for the past 4+ years, starting with a Compaq Presario P4 laptop (vanilla WoW) through my current Core 2 Duo @ 3GHz+ machine, briefly described in my OP. It has ALWAYS taken a REALLY  long time to tab out of full-screen WoW on ALL of those machines, but not 100% of the time. One time I'll tab out and get the HDD-furiously-busy hang for several minutes, but the next time I'll tab out and have virtually immediate access to my desktop and/or  other apps. It seems to hang about 60-75% of the time. For this reason, i.e. the problem is not 100% repeatable, the techs to whom I've taken two of the machines for diagnosis and remediation have said they can't find anything wrong much less begin to fix  anything. One of them, a long-time WoW player, said he and many others had the same problem and it was related to WoW not \"releasing\" system resources properly when it was minimized and to just live with it.</p>\n<p>\"It means you are using gems that are not in the gemming templates, because they are either very inferiois, like an AP gem for a warrior or they are green gems or something.\" All of my equipped gems are class and spec appropriate, so your conclusion is unwarranted. Look up Pyrophobia on US Blade's Edge.</p>\n<p>\"All in all, everything you asked you could have figured out from reading the documentation or discussions on the subject or issues, because everything you havr asked has been asked before, and answered.\" With all due respect, although I'm sure it seems  that way to you, it is not so to someone who has not been intimately involved with this project as you have. I had already read (but failed to understand) all of the documentation I could find, plus watched the video tour 3 times. Specifically, I still do  not understand the term \"available\" as used in this program. I know what the word means, but not what Rawr means when it uses the word. Also I searched the forums here on \"available\" and turned up numerous hits, all of which used the term to mean (whatever  Rawr thinks it means) without explaining what it means to Rawr. I also searched on \"Print Optimizer Results\" and got no hits, therefore I had no way to know it had been submitted on another forum somewhere else.</p>\n<p>So please, before you scold (at least you didn't use \"hideously\") pretend you know nothing about Rawr and come in here and try to find answers to the issues I raised. You won't be able to, nor will you be able to figure out what \"available\" means to Rawr.</p>\n<p>\"its Rawr, not RAWR\" Noted, and thanks for the correction.</p>\n<p>Again, thanks to all for the information, of which there was some in between all the scolding, chiding and sarcasm.</p>",
    "PostedDate": "2011-02-19T09:14:42.997-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "569023",
    "ThreadId": "246713",
    "Html": "<p>Have you seen this page of Documentation? &nbsp;<a href=\"http://rawr.codeplex.com/wikipage?title=GearOptimization\">http://rawr.codeplex.com/wikipage?title=GearOptimization</a>&nbsp;&nbsp;</p>\r\n<p>It is possible to print the Optimizer's output, if you're willing to do a little legwork of your own (really, it only takes a few short minutes). &nbsp;<a href=\"http://www.youtube.com/watch?v=54v0Sq-D1Q0\">http://www.youtube.com/watch?v=54v0Sq-D1Q0</a>&nbsp;&nbsp;While this video was created quite a while ago, it should still work flawlessly.</p>\r\n<p>1024x768 is rather small. &nbsp;You indicate that it's not the highest resolution available to you, but that you're doing it for legibility purposes - have you explored options such as setting your system text to Large or Extra-Large, or increasing the icon size? &nbsp;Both of these would allow you to retain legibility while not sacrificing your screen's resolution quite so sharply. &nbsp;Regardless, I'm currently downloading Silverlight on a new computer so I can test how Rawr works on something with the same resolution as yours. &nbsp;If you simply cannot see the right half of the screen on your computer, then Rawr will be mostly useless to you, because you won't be leveraging its capabilities.</p>",
    "PostedDate": "2011-02-19T10:36:35.787-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "569025",
    "ThreadId": "246713",
    "Html": "<p>Just downloaded and installed on a computer that runs 1024x768 native resolution, and while some text was rather cramped, the functionality was not impeded, and I was still able to mark items as available, apply Filters to lists, and all that schnazz that  happens on the right side of the application.m not saying that you're not having issues, but that I was not able to reproduce those issues when attempting to replicate the circumstances.</p>",
    "PostedDate": "2011-02-19T11:01:44.193-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "569031",
    "ThreadId": "246713",
    "Html": "<p>Using a non-native(max) screen resolution on a permanent basis is *always* the wrong choice, for any situation. If you have eyesight problems that make you <em>think</em>&nbsp;that using a lower screen resolution will help you, you should instead be using other alternative means to increase legibility at the optimal resolution. These things include the DPI settings, icon/font sizes, browser zooming, Magnifier, etc.&nbsp;</p>",
    "PostedDate": "2011-02-19T11:25:18.233-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "569036",
    "ThreadId": "246713",
    "Html": "<p>Unfortunately, the search engine on this site isn't near as powerful as Google's, you are better off putting in the main key word you were looking for, like \"Print\" and you would have gotten better results. Not to mention it sounds like you only searched the Discussions, and not the Issue Tracker too (which is where the open ticket is requesting printing the optimizer results). I've already been in contact with the makers of Codeplex to discuss making a single search engine on here that can search all the documentation, discussions and issues at once rather than having to go to them one at a time.</p>\r\n<p>The Tour of Rawr video is out of date, but the <strong>Where Do I Start?</strong> Documentation was written with Rawr 4.0.10, which isn't that far behind what we are doing now and it FULLY explains what available means. The link to the Where do I start page is on the top of Discussions, in the welcome window in Rawr and on several other pages of this site.</p>",
    "PostedDate": "2011-02-19T11:36:36.127-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "571505",
    "ThreadId": "246713",
    "Html": "<p>Thanks brwarner, Jothay&nbsp;&amp; Unknown1 for the additional info. Through trial &amp; error, I've pretty much figured out a lot of the Rawr functionality, but not enough of it to get a credible (or even repeatable!) outcome from Optimizer.</p>\n<p>I set my monitor res to 1280x1024, but I still get the right-hand frame contents overrunning the right edge of the display with no horizontal scrollbar and no response to attempted zooming using Ctrl-Mousewheel. This may not actually impair functionality, since I have no way of knowing what I can't see.&nbsp; :-P</p>\n<p>Also the <span style=\"text-decoration: underline;\">unfilled</span> \"green diamonds\" are completely invisible somewhere to the left of the text in the right-hand frame. This means that checking (filling) a green diamond to make any of the numerous chants and/or gems that the system fails to import from the Armory (plus any \"available\" gear that is not currently equipped, plus different enchants for that gear)&nbsp;\"available\" to Optimizer is a grope-and-click, grope-and-click&nbsp;operation, taking several tries to fill it without being able to see where it is. I have a screenshot showing both of these issues- just don't know what to do with it since I see no immediately-apparent way to upload/post it here. Since you folks seem to think the problems are all on my end I guess I'll just live with not knowing what's not visible beyond the right edge of the display, or where the unfilled green diamonds are.</p>\n<p>Second issue is that importing my character's gear, gems and chants from the Armory (or \"battle.net\" as the tooltip says) fails to get any of the enchants, and only about half of the gems. This failure is apparently 100% repeatable (consistent failure across about 10 attempts on 3 different days.) All of my equipped gear items show \"no enchant\" and many of them show an empty gem slot when in fact I have zero empty gem slots in my gear, and every piece of gear that&nbsp;CAN&nbsp;BE&nbsp;enchanted IS enchanted. This causes numerous problems with Optimizer, mostly stemming from a false \"beginning score\" which is artificially low due to all of the missed enchants and gems. This then gives&nbsp;spurious \"upgrades\" due to enchanting an item with the enchant I already have on that item (but the system doesn't know it) and further false \"upgrades\" by gemming&nbsp;various already-gemmed&nbsp;slots with the gem that is already actually&nbsp;in those slots (but again, the system doesn't know it.) &nbsp;I do recall reading somewhere in the mass of documentation I read that the character-import process is \"not ready for prime time\" yet so I'll just wait on new releases for reliable and accurate character import functionality.</p>\n<p>And before 6,000 of you jump on me to let me know about the little Enchant bar below each piece of gear, I already discovered those and manually populated all of them with&nbsp;my current enchants on each piece of gear. However, Optimizer ignored all of them and showed each piece of gear in the left-hand \"current\" window as \"no enchant\" then showed an \"upgrade\" for each piece of gear in the right-hand window, generally consisting of the enchant already on the gear.</p>\n<p>Optmizer also is of mixed opinion about reforging. The first time I ran it, it gave me reforging advice, which I immediately implemented at my friendly neighborhood reforger in Orgrimmar. Then, the next time I ran it with the same gear, gems and enchants, Optimizer suggested \"undoing\" about half of the reforgings I had done due to Optimizer's previous-day recommendations, plus some new reforgings. I suspect that Optimizer is secretly in cahoots with&nbsp;SOAR (Society of Orgrimmar Arcane Reforgers) and is programmed to recommend new reforgings every time it is run. Just very odd and I don't know what to make of this schizophrenic result. So I did nothing, since the overall Optimizer result (for me) is baffling and not credible anyway.</p>\n<p>I then decided to run a test. One of the most difficult gear choices (for me, at least) is comparing two one-handers with a two-hander. It's more complex than just adding up the stats on the two 1-handers and comparing the totals against the stats on the 2-hander, because the stats and chants available for 1-handers are different than those available for 2-handers and frequently are a \"similar but&nbsp;different stat.\"&nbsp;I have no idea how to compare \"63 Intellect\" against \"81 Spell Power,\" for example, because Intellect gives&nbsp;1-to-1 Spell Power but also gives Crit and Mana- which don't scale directly against Spell Power- hence the need for an app like Rawr.</p>\n<p>I currently have a dagger in my Main Hand and an off-hand item in my (D'OH!) Off Hand. Both are appropriately enchanted. I loaded my character file (which I had previously saved) and verified that it still showed all of my equipped items. I have no idea why, once I have gone to all the trouble of manually adding all the missed equipped enchants and&nbsp;gems, this info doesn't get saved, nor can I find any way to save it- so&nbsp;I laboriously went through (again) and green-diamonded all the \"equipped\" enchants and gems it had missed importing. Then I green-diamonded my new staff (not equipped) plus the different 2H enchant for it. I then ran Optimizer, which did NOT recommend switching to the staff. Then I ran it again under the same exact criteria, and this time it DID recommend switching to the staff. I just calmly closed the program at that point and wandered off, muttering to myself,&nbsp;in search of an alcoholic beverage.</p>\n<p>The other problem, I suspect, is more of my own failure to understand how to force/cram/manage the hundreds of \"making stuff available\" options. I make sure that I have manually entered the current enchant on every piece of equipped gear, then looked at and verified every category in the \"Equipped\" section (which supposedly makes everything I have equipped \"available\" by default), then I go to every Gems and Enchants category to \"make available\" (grope-and-click) all the enchants that didn't get imported plus all the gems I'm using that didn't get imported plus any higher gems of the same color. Nonetheless, when I then go to run Optimizer it warns that many of my <span style=\"text-decoration: underline;\">equipped</span> enchants and gems are \"not available\" despite the fact that I just spent the preceding&nbsp;hour manually adding each and every one of them. So I'm at a loss to understand what else I'm supposed to do to force-feed Optimizer so it \"knows\" what I actually have equipped so it will stop showing me false upgrades in the form of stuff already gemmed/enchanted.</p>\n<p>One day next week maybe I'll just pack a lunch and spend the day studying each and every document I can find anywhere on how to manage this app.&nbsp;I already read the one brwarner linked, and the \"Where do I Start\" section that Jothay mentioned.</p>\n<p>Again, thanks for the additional info.</p>",
    "PostedDate": "2011-02-24T06:30:02.883-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "571570",
    "ThreadId": "246713",
    "Html": "<p>If you would go create an ISSUE TICKET in the ISSUE TRACKER per the POSTING GUIDELINES. You could attach all the files you want, like screen shots, your saved character xml files from a fresh armory download to a fully \"optimized\" character.</p>\r\n<p>You say you keep having to manually set all of this stuff, are you even saving your character file at all? <strong>File Menu &gt; Save to Character File...</strong></p>\r\n<p>Essentially, what we are saying is, you are apparently doing things <strong>so wrong</strong>, that we don't even know how to help you.</p>\r\n<p>So for starters, lets walk through this part:</p>\r\n<p><strong>Step 1:</strong> Create a ticket in the Issue Tracker, name it: \"I'm Mal, and I have no clue what's wrong\". Include in your ticket description all of the information we ask for in the Posting Guidelines, especially the character's armory info.</p>\r\n<p><strong>Step 2:</strong> Attach to that ticket, a Screen Shot of your desktop with Rawr open and maximized on your screen in 1280x1024. <a href=\"http://lmgtfy.com/?q=How+to+take+a+screen+shot+and+save+it\" target=\"_blank\">You can Google how to screen shot if you really don't know how.</a></p>\r\n<p><strong>Step 3:</strong> Add a comment to the ticket so you can attach another item, which would be your character save file, from the menu I mentioned above, immediately after doing a fresh armory pull NOT a refresh character, a new character as loaded from the armory.</p>\r\n<p><strong>Step 4:</strong> Do whatever the hell it is you are doing to get the optimizer results you claim you have been getting. BUT before actually running the optimize, save the character file as the other file name + \"_beforeOpti.xml\" so: \"otherfilename_beforeOpti.xml\" and then add another comment to the ticket so you can attach this file.</p>\r\n<p><strong>Step 5:</strong> Actually start the optimize now, BUT when you get those optimizer warnings Screen Shot that and save the screen shot. Do that again for each warning you see if there are multiple. Another comment, another attachment.</p>\r\n<p><strong>Step 6:</strong> Save the character after the optimize as the other file name + \"_afterOpti.xml\" so: \"otherfilename_beforeOpti.xml\". Another comment, another attachment.</p>\r\n<p>When you have all 6 steps done, reply to this thread saying you have it there and I'll go walk myself through whatever you are doing based on your previous comments.</p>",
    "PostedDate": "2011-02-24T08:17:43.49-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "571607",
    "ThreadId": "246713",
    "Html": "<p>Jothay, I have tried to be constructive, and even a bit humorous and self-deprecating, and not let my frustrations show in a denigrating or personally-abusive manner. I must say that your response, like Unknown1's first response, is surprisingly harsh and gratuitously abusive.</p>\n<p>\"If you would go create an ISSUE TICKET in the ISSUE TRACKER per the POSTING GUIDELINES. You could attach all the files you want, like screen shots, your saved character xml files from a fresh armory download to a fully \"optimized\" character.\"</p>\n<p>As I clearly stated, I am not yet convinced that there is any issue with the program, or I would have long since posted an issue in the appropriate section. I have repeatedly stated that all of the issues I am experiencing may well be due to my own failure to understand how to manage the program.</p>\n<p>\"You say you keep having to manually set all of this stuff, are you even saving your character file at all? <strong>File Menu &gt; Save to Character File...\"</strong></p>\n<p>Reread my last post. I clearly said I&nbsp;had saved my character file, and further, that I had opened my previously-saved file the next day and discovered that all the manually-input stuff that the program missed in the import was not saved with my character file. How do you deem it possible for me to open my previously-saved character file if I had not saved my character file?</p>\n<p>\"<a href=\"http://lmgtfy.com/?q=How+to+take+a+screen+shot+and+save+it\" target=\"_blank\">You can Google how to screen shot if you really don't know how.</a>\" Truly abusive, and \"hideously\" condescending. I clearly stated that I had captured a screenshot.</p>\n<p>It occurs to me that since I have already given you my Mage's name and server, that YOU could go to the armory, look her up, verify that every enchantable item is in fact enchanted and every gem slot is in fact filled; then try a character import on her into Rawr and see if YOU get all chants missing and half the gem sockets empty. Just for starters, and having NOTHING to do with file saves, Optimization or screenshots.</p>\n<p>It also occurs to me that the real message you are trying to send, since you didn't mention having done that, is \"why don't you just go the f*** away,\" and so I will.</p>",
    "PostedDate": "2011-02-24T09:25:23.077-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "571651",
    "ThreadId": "246713",
    "Html": "<p>I'm saying I will help you if you will follow the steps I have outlines. Yes, I sound pissy because in the giant walls of text we keep posting to each other we still don't have the info we devs need to actually try and fix whatever the hell is wrong with  your local Rawr. I'm saying use the Issue Tracker because you can attach the files we need to move forward. I added the link because a lot of people don't know how to screen shot stuff and someone else reading this might learn something.</p>\n<p>Even if I armory your toon myself, I still can't see how Rawr looks on YOUR screen. AND I can't see how the hell you are doing whatever it is you are doing after you load your toon in.</p>",
    "PostedDate": "2011-02-24T10:36:49.373-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "571660",
    "ThreadId": "246713",
    "Html": "<p>OK, Answer one queston and I'll set about collecting the evidence and posting it.</p>\n<p>\"[...] attach [...] your character save file,[...] immediately after doing a fresh armory pull NOT a refresh character, <em>a new character </em>as loaded from the armory\" (italics mine).</p>\n<p>I have only one level 85 character supported by Rawr- my Mage. My other 85 (Hunter) is not supported according to Rawr documentation. I have already imported, re-imported, re-re-re-imported that one character into Rawr many, many times. Since that is the only character that I <span style=\"text-decoration: underline;\">can</span> logically import into Rawr, how do I do \"a fresh armory pull [...] a <strong>new character </strong>as loaded from the armory\"?</p>\n<p>Should I uninstall/reinstall Rawr to clear \"whatever,\" or just go find my character file (I know the name and location) and blow it up? Or would simply doing a new Import Character (not opening the saved file) be sufficient?</p>\n<p>Thanks</p>",
    "PostedDate": "2011-02-24T10:49:23.84-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "571678",
    "ThreadId": "246713",
    "Html": "<p>Ignore any files you have already saved. Just launch Rawr and click \"Load from Battle.Net...\" and continue from there doing what you normally would but with the steps I outlined too.</p>",
    "PostedDate": "2011-02-24T11:19:36.357-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "571958",
    "ThreadId": "246713",
    "Html": "<p>With reference to it taking so long for you to alt-tab out of WoW,&nbsp;&nbsp; I used to have the same sort of issues until I changed WoW to run in windowed mode with \"maximised\" ticked.&nbsp;&nbsp;&nbsp; It looks exactly the same as playing full screen (no task bar or maximise buttons etc.) but allows you to alt tab without any issues.&nbsp;&nbsp;&nbsp;&nbsp; I'm always switching out to Wohead, EJ's, Rawr etc.</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2011-02-24T22:22:59.087-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "572473",
    "ThreadId": "246713",
    "Html": "<p>\"I used to have the same sort of issues until I changed WoW to run in windowed mode with \"maximised\" ticked.\"</p>\r\n<p>Interesting, and thank you- I'll try that. I have been told that running in Windowed mode adversely affects fps, but I'll give it a shot since the 2-4-minute tabouts are really, really getting old.</p>",
    "PostedDate": "2011-02-26T00:48:09.313-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "572780",
    "ThreadId": "246713",
    "Html": "<p>Honestly, we don't take offense to new Issues in the Issue Tracker.&nbsp; In fact, we welcome them, <em>even if you're not sure that it's really a problem with the program</em>.&nbsp; Reasons:&nbsp; People can attach files (screenshots, character files, whatever) to Issues, as opposed to Discussions.&nbsp; We can close Issues when we're done with them, as opposed to Discussions.&nbsp; They're just infinitely better for handling any Issue a person is having than the Discussions forum, hence our Documentation heavily indicating that people should post well-documented Issues for ANY issue they may have (assuming they've searched for an existing similar issue prior to the posting stage).</p>\r\n<p>Back to more immediately pertinent info, please follow Jothay's instructions, so we can actually get a good look at the character file that's being generated, and can best diagnose the issue you're having in that regard.&nbsp; As to the window frame and whatnot... I'm at a loss, especially after you bumped the resolution up to a more reasonable level.&nbsp; Being able to actually see what you're seeing would definitely help at this point.</p>",
    "PostedDate": "2011-02-27T05:50:08.08-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]