[
  {
    "Id": "569282",
    "ThreadId": "246826",
    "Html": "\r\n<p>Hello all,</p>\r\n<p>I've been a long time user of Rawr and wanted to see if I could help out with development. &nbsp;I'm an experienced SW developer, but new to C#. &nbsp;I've followed the instructions I could find for setting up my development environment with Visual Studio\r\n 2010 Express. &nbsp;But I've run into a few issues and I'm hoping someone here could lend a hand.</p>\r\n<p>1. When I try to open the Rawr4.sln or the Rawr4.WPF.sln file I get an error that states that VS express does not support solution folders. &nbsp;So I started a new project of my own and added the existing subprojects from Rawr to it. &nbsp;Can someone tell\r\n me what the correct dependencies are for the subprojects? &nbsp;Is there a VS express&nbsp;compatible project available?</p>\r\n<p>2. Related to 1 above, I can not get anything to compile &nbsp;I get many errors about Rawr.base.dll not being found. &nbsp;Is this something I'm doing wrong?</p>\r\n<p>&nbsp;</p>\r\n<p>Thanks, and please be gentle, I'm new to the VS environment.</p>\r\n<p>--Durn&nbsp;</p>\r\n",
    "PostedDate": "2011-02-20T11:13:32.44-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "569288",
    "ThreadId": "246826",
    "Html": "<p>1. What worked for me was to just ignore those errors, it's fine. If you're not using full VS, there are several 'errors' and warnings when you first open the sln, but they should all be ignorable. It will be unable to build a few of the projects (test projects, I think), but they're  all unnecessary, and should work anyway. Do make sure you've installed the Silverlight dev tools though.</p>\n<p>2. Don't make your own project, just use the main one, ignoring the errors, as in #1.</p>",
    "PostedDate": "2011-02-20T11:29:48.477-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "569341",
    "ThreadId": "246826",
    "Html": "<p>One thing, as I use the express versions as well.</p>\r\n<p>I use C# Express to open Rawr4.WPF.sln and use Web Developer Express to open Rawr4.sln.</p>\r\n<p>The first error (the solution folder error) is safe to ignore. &nbsp;Should only be getting this one when opening Rawr4.sln (not Rawr4.WPF.sln). &nbsp;Just click ok.</p>\r\n<p>Also, since your using express, make sure you click No when it ask's you to remove source control bindings.</p>",
    "PostedDate": "2011-02-20T14:53:40.753-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]