[
  {
    "Id": "572734",
    "ThreadId": "247735",
    "Html": "\r\n<p>Hi</p>\r\n<p>I just commited 58363 which attempts to bring Rawr.Tree partially updated to patch 4.0:</p>\r\n<p>-Spells are now using 4.0 numbers for Base&#43;Scaling and Mana usage.</p>\r\n<p>-Haste&#43;crit applies to HoT ticks (not sure if crit is working properly everywhere though).</p>\r\n<p>-Mana regen looks broken so still not sure what overall numbers mean in absolute terms.</p>\r\n<p>&nbsp;</p>\r\n<p>Will see if I can get things a bit more reliable.</p>\r\n<p>Regards</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n",
    "PostedDate": "2011-02-27T02:24:03.157-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "605883",
    "ThreadId": "247735",
    "Html": "<p>Would be great if the tree-module would be updated to at last \"mostly\" status. Jerks and TreeCalcs (http://elitistjerks.com/f73/t110354-resto_cataclysm_release_updated_4_1_a/) helps a lot, but it is not the same. Is there anything the community could to help updating rawr-tree ?</p>",
    "PostedDate": "2011-05-02T07:41:04.747-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "605931",
    "ThreadId": "247735",
    "Html": "<p>Last updates a few patches ago greatly improved the accuracy of stats that involve or are based on Int.&nbsp; There are still a lot of gear combinations that throw the values off from what's displayed on the character screen.&nbsp; I spent a few days trying to track the issue down, with not much luck.</p>\r\n<p>I would start with no gear on (Rawr matching WoW), and put stuff on one piece at a time until they diverged.&nbsp; With my normal gearset a few weeks ago, Rawr.Tree matched WoW for all my stats when I had everything but a helm equipped.&nbsp; But I could start over with helm on first, and equip almost all my gear except cloak, neck, and some other stuff and it'd be correct again.&nbsp; My suspicion was something to do with the way the model handled metas, but I could never nail that down.</p>\r\n<p>Ignoring the &lt;1% difference between Rawr.Tree &amp; wow char screen, correctly modeling mana regen, spell costs &amp; healing throughput seem like the next logical things to tackle.&nbsp; Also, relative stat valuation.</p>\r\n<p>As far as things community could do, you could find a gearset you have available on your druid whose stats in game match those in Rawr (ie: int, mana, spell crit match), and start seeing if the values for your healing spells, rejuv/regrowth/LB/HT/WG/Nourish match between in game &amp; Rawr.&nbsp; If they don't, submit detailed issue reports with Rawr .xml character files, screen shots, &amp; actual values attached to help track down the discrepancies.</p>",
    "PostedDate": "2011-05-02T09:00:59.533-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "606539",
    "ThreadId": "247735",
    "Html": "<p>I'm not that active in playing WoW and thus updates to Rawr.Tree are not always high priority. I also did my first Cata raid a week ago, so have a slightly better feel for raid healing in Cata, which will be fed back into the model soon.</p>\r\n<p>Nevertheless, last week as 4.1 hit, the lifebloom nerf and change to effloresence was quickly implemented (I hope nothing broke in the process), just before I left on holiday without internet access for almost a week (Haven't even seen 4.1 yet).</p>\r\n<p>&nbsp;</p>\r\n<p>I was tempted to label Rawr.Tree as \"mostly\" a while ago already, since atleast in terms of talents, I got the impression it is already modelling a much higher percentage than what some of the other fully updated models are modelling.</p>\r\n<p>Main issues atm are:</p>\r\n<p>-Burst is basically pre-4.0 rotations. Need to be replaced. (But not yet sure what are useful burst rotations to model).</p>\r\n<p>-Details reported of simulation are using out-dated pre-4.0 rotations. (Plan is to replace with proper rotation's information).</p>\r\n<p>-Procs based on casts/heals are using out-dated rotations (Plan is to switch over to sustained rotation).</p>\r\n<p>- Procs are probably not all working consistently (trinkets/weapon enchants), including the haste proc caused by one of the balance talents. Plan is to calculate with and without and weighted combine based on uptime, instead of using averaged values like in past (especially due to haste causing extra HoT ticks).</p>\r\n<p>-Sustained is basically using a dedicated tank-healing rotation atm,  thus heavy on valuing mastery. (I guess we need an option to select  between tank/raid in some varying degree. For example, even if your tank  healing in 10-man, if there is large raid aoe, Wild Growths would also  be useful. Or it could be a waste of mana, if you have a number of raid  healers in 25-man. Suggestions on how to do/various rotations would be  very welcome).</p>\r\n<p>-Based on all the changes to tranquility in 4.1, it seems tranquility needs to be modelled as well.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2011-05-03T09:27:59.41-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "606738",
    "ThreadId": "247735",
    "Html": "<p><strong>@ihop0</strong></p>\n<p>Here is a Screenshot of my Druid complete unbuffed with resto gear and talents:</p>\n<p>http://img508.imageshack.us/i/wowscrnshot050311210243.jpg/</p>\n<p>Here is my tree.xml also unbuffed:</p>\n<p>http://www.file-upload.net/download-3405798/tree.xml.html</p>\n<p>maybe the difference in mana comes from the different basemana of the druid-races ? or maybe you don't take the Leather Specialization (http://www.wowhead.com/spell=86530) into account ? or a some wrong data for Furor or Heart of the Wild ?</p>\n<p>I hope this helps.</p>\n<p>&nbsp;</p>\n<p><strong>@wildebees</strong></p>\n<p>The Rawr.Tree is far away from \"mostly\" sorry. Don't take me wrong, you guys are doing a great job on this programm/application. I loved using it for years but now I'm just missing it for my tree since 4.0, that's why I posted above.</p>\n<p>It's not really about rotas, that's one of the last things which should be add in my eyes. Healing isn't casting rotas in any way, of course I miss those models and oom-timers but every healer can now take every role. A tree can heal tanks, the raid or cetain  groups like melees, a camp or a pillar. The difference between 10 and 25 man raids are enormous. A perfect way would be models and data for every boss, like in Rawr.Bear but that's probably to much to do. Also you have to create a different way calculating  mana-regen vs throughput. Before Cata it was something like \"get enough spirit that you can't get oom and then get spellpower\". Now it is much more like finding a balance depending raidsize, role, boss, talents and more. Healing is just very different now,  there are no tanks which could be killed with 2 hits, but now you really have to do something with every gcd, not like pressing wg on cooldown add some rejus and go afk.</p>\n<p>What I try to say, it would be nice if people could use the basics of rawr as a start. Things like finding gear, finding ways to come to a haste-breakpoint with a minimum of int-lose, find ways to avoid going oom and so on.</p>\n<p>&nbsp;</p>\n<p>Things that come to my mind to improve which maby could be done more easily:</p>\n<ul>\n<li>fixing for all those \"the stats are different in rawr than in game\"</li>\n<li>support for t11 set bonuses</li>\n<li>import glyphes and support for everyone of them</li>\n<li>4.1 talent-trees</li>\n<li>haste-breakpoints</li>\n<li>support for relevant trinkets</li>\n<li>support for different roles in a raid and basic rotas for them</li>\n<li>innervate (with switch with another caster-druid and glyphed)</li>\n<li>checking stat priorities (reforging to crit is stupid)</li>\n<li>checking gem-selection (there are a lot of uselees greens between the good ones)</li>\n<li>enchants (Power Torrent is missing and Heartsong is worse than 25 crit-rating ?)</li>\n<li>exclude cloth-items</li>\n<li>timing cooldowns (Tree and Tranq can now be used multiple times in a bossfight and should...Tranq is incredible strong right now)</li>\n<li>Effloresence has changed very much in 4.1</li>\n<li>suggesting talents</li>\n</ul>\n<p>and much more...</p>\n<p>&nbsp;</p>\n<p>Here are some Spreadsheets and tables which might be usefull:</p>\n<p>http://elitistjerks.com/f73/t110354-resto_cataclysm_release_updated_4_1_a/#TreeCalcs</p>\n<p>https://spreadsheets.google.com/ccc?key=0AuwcTdFIcJZydFdTTVQ1SDJRN28tMklhc2RtWVRpSFE&amp;hl=en#gid=0</p>\n<p>https://spreadsheets.google.com/ccc?key=0AuwcTdFIcJZydHZlY09wQTQ3UUxKZVJWa04yQ1ZsTHc&amp;hl=en#gid=1</p>\n<p>&nbsp;</p>\n<p>I'm really not here just to complain that people don't spend their freetime optimizing a tool for me. I just want to help, maybe you can tell me how. Unfortunately I haven't got any idea of C++, Silverlight and php. But I already found the Donation-Button^^</p>\n<p>greetings</p>\n<p>Nihlo</p>",
    "PostedDate": "2011-05-03T15:38:20.893-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "607341",
    "ThreadId": "247735",
    "Html": "<p>Nihlo, thanks for this.</p>\r\n<p>Firstly in terms of specific issues like the screenshots, please use the issue tracker, it allows keeping track of the issue and allows uploading of xml files etc. I created 1 on your behalf here:</p>\r\n<p>http://rawr.codeplex.com/workitem/20637</p>\r\n<p>Anything further on that aspect will be dealt with on that side.</p>\r\n<p>&nbsp;</p>\r\n<p>In terms of the rest of the issues, I'm so glad someone is participating in discussions on this. It helps seeing what the users feelings and thoughts are.</p>\r\n<p>&nbsp;</p>\r\n<p>When I talk about rotations, I'm talking about something along the line of (currently the sustained model):</p>\r\n<p>-put 3 stack of lifebloom on the tank.</p>\r\n<p>-omen procs allow x % of the LB refreshes to be free, since I use it on the tank</p>\r\n<p>-maintain a rejuv on the tank as well</p>\r\n<p>-swiftmend on cd, to get both the direct tank healing and Effloresence</p>\r\n<p>-(to be implemented in future for raid healing situations) for the other refreshes, should I save mana and use LB or spend the cast time and use nourish or HT?</p>\r\n<p>- spend all available cast time on nourish, swapped out with some healing touches where mana permits.</p>\r\n<p>&nbsp;</p>\r\n<p>Some of my comments on the list you give:</p>\r\n<ul>\r\n<li>fixing for all those \"the stats are different in rawr than in game\" <span style=\"color: #008000;\">- A few hundred mana more or less and a int/spi/crit/mastery offset by a few points should not make or break the overall calculated value of gear over a full fight (in the cases where 2 pieces of gear swap around on the list, the real difference between them is probably smaller than the performance that a player can obtain versus the theoretical analisis. A few percent difference is significant though.</span></li>\r\n<li>support for t11 set bonuses <span style=\"color: #008000;\">- Agreed, this is actually not too difficult to model, if we can assume that 3LB is kept up/refreshed if it does fall off.</span></li>\r\n<li>import glyphes and support for everyone of them - <span style=\"color: #008000;\">importing of glyphs should be generic to all models. If the glyph is supported by the model, but not being imported, an issue should probably be logged against the import method. Rejuv, LB, SM, WG and Innervate Glyphs are implemented. I'm scratching my head why rejuv doesn't show up. Suggestions on modelling Regrowth glyph is welcome.</span></li>\r\n<li>4.1 talent-trees <span style=\"color: #008000;\">- except for the tranq cd talents almost all of the rest of the talents are modelled. If it isn't showing in the 4.1 format yet, that is a generic rawr feature from my understanding and don't need anything model specific.</span></li>\r\n<li>haste-breakpoints <span style=\"color: #008000;\">- they are modelled, but currently only rejuv and LB breakpoints are reported. Potentially better reporting method. Suggestions?.</span></li>\r\n<li>support for relevant trinkets<span style=\"color: #008000;\">- as I mentioned procs are not reliable at the moment. procs based on casts or heals depend on the rotation being modelled.</span></li>\r\n<li>support for different roles in a raid and basic rotas for them-<span style=\"color: #008000;\"> agreed, suggestions?</span></li>\r\n<li>innervate (with switch with another caster-druid and glyphed)<span style=\"color: #008000;\">- agreed, was thinking about sliders showing how many innervates are used on self / others / received from others</span></li>\r\n<li>checking stat priorities (reforging to crit is stupid)<span style=\"color: #008000;\">- I hope this isn't happening and haven't seen it happen yet.</span></li>\r\n<li>checking gem-selection (there are a lot of uselees greens between the good ones)<span style=\"color: #008000;\">- I never fully understood how to setup default gems, but will try to get to it as a lower priority.</span></li>\r\n<li>enchants (Power Torrent is missing and Heartsong is worse than 25 crit-rating ?)<span style=\"color: #008000;\">- Again proc based being unreliable atm.</span></li>\r\n<li>exclude cloth-items<span style=\"color: #008000;\">- Shouldn't be necessary if leather bonus is working, they should only show up if multiple tiers better</span></li>\r\n<li>timing cooldowns (Tree and Tranq  can now be used multiple times in a bossfight and should...Tranq is  incredible strong right now) <span style=\"color: #008000;\">- Have wanted to model tranq a year or more ago already, but never seemed significant enough. Now it definately is a priority. Bonus obtained from tree uptime is modelled. I believe it should already cater for multiple uses. Changing LB and Regrowth behaviour during Tree form is not modelled.</span></li>\r\n<li>Effloresence has changed very much in 4.1<span style=\"color: #008000;\">- I believe tree was updated to reflect the new mechanism (If there is anything missing in this, please post an issue</span>.)</li>\r\n<li>suggesting talents<span style=\"color: #008000;\">- hmmm, I'm not convinced that enough of the talent effect can be properly modelled to use Rawr to really choose complete talent specs. The best you can do is get a relative idea between talents that don't have too much situational value. The final choice then needs to be made with care.</span></li>\r\n</ul>",
    "PostedDate": "2011-05-04T11:31:03.303-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "608952",
    "ThreadId": "247735",
    "Html": "<p>60608:</p>\r\n<p>Adds T11 set bonusses and gets Rejuv Glyph to show up.</p>",
    "PostedDate": "2011-05-07T07:09:49.697-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]