[
  {
    "Id": "83346",
    "ThreadId": "24866",
    "Html": "\r\nAll,<br />I'm thinking about starting Rawr.Tree(yeah, I've heard it's cursed, lol), and I'd like to know your opinion about what kind of simulation should I focus on. I'll start with item values/ranks(+heal/mp5/spirit/intelect/stamina/etc), but that's just the basic part.<br />I wanna know what kind of scenarios are worth simulating. On Rawr.Bear, we've got Mitigation and Survival as our main roles. I was thinking about <br />maybe throughput(focus on per spell efficiency, with +heal/spirit/etc) and endurance(focus on mana efficiency and long fights, with mp5/spirit/intellect/etc) or something like that as a starting point.<br />But, a Tree druid might be in a few different situations. For example a tank healing role, where you're mostly rolling lifeblooms, adding a few hots and using NS/HT/Regrowth/Swiftmend to deal with spike damage. Or a raid healing role, where you're using regrowths/single lifeblooms/rejuvenation on multiple targets, etc.<br />Has anyone given any serious thought on a resto druid model for Rawr?<br /><br />Malkav<br /><br /><br /><br /><br />sugestions/opinions plz.<br />",
    "PostedDate": "2008-03-27T13:10:50.55-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "84432",
    "ThreadId": "24866",
    "Html": "\r\nI started a version of tree a couple months ago, but I couldnt finish it because I don't know advanced programming and no one wanted to help. I did all the model calculations before giving on it. Is not that hard to model.<br /><br />Basically you could choose MT Healing or Pure Raid Healing. You could define pauses, intensity of raid healing, % of usage of spells for raid healing, estimated usage of Swiftmend/Nature's, and so on. Based on a fight duration, you could calculte the total healing done until going OOM (or not), and you could value items with that. For short fights healing is more important than mana, and in long fights mana is more important. Is kinda tricky anyway because on a fight you out-mana, mp5 value will be zero, giving some funny results if people doesnt configure the fight correctly. I had even an option  to estimate tree of life aura benefits to raid and adding it to your own heal if you wish.<br /><br />I think another one is doing Rawr.Tree now (you?), I wish him luck.<br />",
    "PostedDate": "2008-04-02T02:43:20.07-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "84749",
    "ThreadId": "24866",
    "Html": "\r\nI can definately do the programming, but I was looking for a model(since other people have worked on that before) before starting one from scratch. Do you still have the modeling you did? Can you share it?<br />Yes, I'm prolly \"the other guy\" working on Rawr.Tree.<br />",
    "PostedDate": "2008-04-03T06:23:36.057-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]