[
  {
    "Id": "578544",
    "ThreadId": "249213",
    "Html": "<p>With the next release of Rawr, we will now be supporting Random Enchants Items. If you mostly work with gear from Throne of the Four Winds, then all gear is in the system. The way the system works is this: If you take a look at the item cache and take a  look at say: <a href=\"http://www.wowhead.com/item=63507\">Soul Breath Leggings</a>. You will probably notice that the only stats showing is the armor. Well Kavan has implemented a new button in the edit item window that allows users to add available suffix  ids to items.</p>\n<p>Suffix ids allow Wow and Rawr to see what stats are available that the item can use. In our case, if you look at the wowhead page for Soul Breath Leggings, you will notice it has the following stats it can use:</p>\n<ul>\n<li>\n<div><span>...of the Feverflare</span><br /> +511 Stamina, +301 Intellect, +208 Haste Rating, +208 Mastery Rating</div>\n</li>\n<li>\n<div><span>...of the Fireflash</span> <br /> +511 Stamina, +301 Intellect, +208 Critical Strike Rating, +208 Haste Rating</div>\n</li>\n<li>\n<div><span>...of the Flameblaze</span><br /> +511 Stamina, +301 Intellect, +208 Mastery Rating, +208 Hit Rating</div>\n</li>\n<li>\n<div><span>...of the Undertow</span><br /> +511 Stamina, +301 Intellect, +208 Haste Rating, +208 Spirit</div>\n</li>\n<li>\n<div><span>...of the Wavecrest</span><br /> +511 Stamina, +301 Intellect, +208 Mastery Rating, +208 Spirit</div>\n</li>\n<li>\n<div><span>...of the Wildfire</span><br /> +511 Stamina, +301 Intellect, +208 Hit Rating, +208 Critical Strike Rating</div>\n</li>\n</ul>\n<p>How do you figure out what suffix ids go to which suffix you may ask? Well that is a problem we currently have. We have literally had to either buy green items and look at the id suffix through the armory, or look at other characters with suffix items and  look at theirs. Currently Wowhead nor the armory tell us what available suffix ids are associated with an item (they just list the name of the suffix). However if you are loading an item with a random suffix from your own armory character sheet, then it is  done for you since we add the currently equipped suffix as we go.</p>\n<p>For the advanced users we have deduced the following: Suffix in the range of 114 and 138 refer to Ring suffix, 170 - 202 generally refer to leg suffix, and 206 - 236 generally refer to Waist suffix. If you use any other item slot just use the ring ids at this time.</p>\n<p>Now that that is understood, how does this affect the program. Well once the suffix ids are in place (which in the case of Throne of the Four Winds, they will already be set with the default item cache [remember to reload your item cache come next release]),  you don't have to touch the item cache. Just look at the available weapons, Waists, Leggings and Rings, and you will notice that several new items with similar names will be added all with Suffix to them. We have implemented Rawr in such a way that by adding  the suffix ids, we automatically calculate the basic stats associated with that suffix. This should allow for more customization in the gear set you are looking for instead of manually adding these items and suffix.</p>\n<ul>\n</ul>",
    "PostedDate": "2011-03-10T10:00:36.903-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]