[
  {
    "Id": "579493",
    "ThreadId": "249435",
    "Html": "\r\n<p>Is there an easy way to disable all upgrades temporarily?&nbsp; Got a couple of characters ready to hit 85 and don't care about gemming, enchanting and reforging gear that I probably won't be using very long.&nbsp;&nbsp; For gemming, I tried making a custom\r\n gemming template and leaving it blank, but then I'd either get no direct upgrades, or I'd get a gear upgrade that still have gem upgrades.</p>\r\n<p>Thanks for all the hard work for such a great program.</p>\r\n",
    "PostedDate": "2011-03-12T09:12:07.233-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "579495",
    "ThreadId": "249435",
    "Html": "<p>Mark the gear you don't want to be able to change with a blue diamond instead of a green one per the Optimizer documentation.</p>",
    "PostedDate": "2011-03-12T09:14:49.587-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "579499",
    "ThreadId": "249435",
    "Html": "<p>I don't want any gear to be gemmed, and I'm doing this in the Direct Upgrades.</p>",
    "PostedDate": "2011-03-12T09:31:56.51-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "579502",
    "ThreadId": "249435",
    "Html": "<p>The charts cannot generate items without at least 1 gemming template that has gems in it enabled. For the items you are actually wearing, you can put them at no gems then mark that one as a blue diamond and remove the green diamond from any other copies you see. Direct Upgrades is always going to tell you that you can upgrade the item by throwing a gem into it.</p>\r\n<p>You should at least throw green level (uncommon) gems into items, even if you don't plan to use them very long once you hit 85. This way you just enable the Uncommon level gemming templates in your model and throw those cheap 2g gems into your items.</p>",
    "PostedDate": "2011-03-12T09:48:18.91-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "579604",
    "ThreadId": "249435",
    "Html": "<p>thanks, that worked great.</p>",
    "PostedDate": "2011-03-12T19:19:58.863-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]