[
  {
    "Id": "579955",
    "ThreadId": "249570",
    "Html": "\r\n<p>Hello everyone,</p>\r\n<p>I've been using Rawr since late Wrath, but only starting the optimizer since Cata came out. I'm playing a fire mage and i really like that there are tools such as Rawr to help us mages out.</p>\r\n<p>However, when i'm running the optimizer, it comes up with some really stranges results from time to time.</p>\r\n<p>For example, i run a thorough optimizer (as i always do) and three to four items that i have equiped simply dont show up in the result window. I've manually deselected and reselected the green diamond next to each piece of gear that i have, so that Rawr\r\n actually can see that those items are 'available' for optimizing. I thought it was some kind of bug, so i just restarted the program and reran it. The second time i got some pieces that werent on the original scan on the result window, however other items\r\n suddenly disappeared. It's quite annoying that i just dont seem to be getting a complete result screen with ALL of my gear in it.</p>\r\n<p>I'm using the latest Rawr online version.</p>\r\n<p>Please help me out here, i'm sure i'm doing something wrong, but i just cant figure out what it is.</p>\r\n<p>&nbsp;</p>\r\n<p>Greets<br>\r\nOorlog</p>\r\n",
    "PostedDate": "2011-03-14T04:11:06.837-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "580070",
    "ThreadId": "249570",
    "Html": "<p>The results screen is designed to only show the items that change. If the gear appears to be \"missing\" it's because you aren't supposed to change that gear.</p>",
    "PostedDate": "2011-03-14T08:37:38.883-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "580125",
    "ThreadId": "249570",
    "Html": "<p>But how do you explain the fact that sometimes a dagger appears in the result window, and the second optimize i run without doing anything else or changing anything, the dagger has disappeared from the list?</p>",
    "PostedDate": "2011-03-14T10:44:00.467-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "580126",
    "ThreadId": "249570",
    "Html": "<p>In the second optimize, the dagger didn't change, something else did. Optimizer results don't always come out exactly the same, even on the same settings. That's the nature of the algorithms we use to make the optimizer work.</p>",
    "PostedDate": "2011-03-14T10:46:00.297-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "608331",
    "ThreadId": "249570",
    "Html": "<p>Hello - hope this is the correct spot to place this question about Optimizer and my Mage.</p>\r\n<p>I have just installed the latest version of RAWR - 4.1.04, and went to optimize my gear. I keep getting the message that my Cloak and Leggings are not enchanted - though they are. Cloak has Lightweave Embroidery (Rank 2), and Leggings have Master's Spellthread (Rank 2). I select to continue through this advice and then get the message that neither of the two enchants are available.</p>\r\n<p>I did have this problem a while back with previous versions but it seemed to resolve itself, though I do not know how?? I clearly need to have these enchants recognized to be able to use the optimizer option to give advice on reforging.</p>\r\n<p>Can you advise me how to resolve this problem please.</p>",
    "PostedDate": "2011-05-06T01:14:57.62-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "608532",
    "ThreadId": "249570",
    "Html": "<p><a href=\"http://rawr.codeplex.com/wikipage?title=GearOptimization\">http://rawr.codeplex.com/wikipage?title=GearOptimization</a></p>",
    "PostedDate": "2011-05-06T07:58:02.047-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]