[
  {
    "Id": "591174",
    "ThreadId": "252384",
    "Html": "\r\n<p>Or is the changelog between two releases posted anywhere?</p>\r\n",
    "PostedDate": "2011-04-04T02:15:15.793-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "591189",
    "ThreadId": "252384",
    "Html": "<p>If you click on a changeset number under the source code tab on this site, it will list the files that have been changed. &nbsp;Clicking on these files will show what has been changed. &nbsp;This only shows what was changed in that specific check-in.</p>\r\n<p>You can get a general overview of what has changed between versions in the Version/Release notes:&nbsp;<a href=\"http://rawr.codeplex.com/wikipage?title=VersionNotes\">http://rawr.codeplex.com/wikipage?title=VersionNotes</a>.</p>",
    "PostedDate": "2011-04-04T02:47:09.243-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "591356",
    "ThreadId": "252384",
    "Html": "<p>Is it possible to do e.g. 4.1.01 vs 4.1.02 in code? (on the web, without having both trees and actually manually diffing them)</p>",
    "PostedDate": "2011-04-04T08:24:17.693-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "591377",
    "ThreadId": "252384",
    "Html": "<p>I don't believe so.&nbsp; One of those features we can't even really do with TFS.&nbsp; WTB Perforce for Codeplex.</p>",
    "PostedDate": "2011-04-04T08:46:04.25-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "591404",
    "ThreadId": "252384",
    "Html": "<p>Using ToirtoiseSVN's Repostory browser&nbsp;you can compare the HEAD (current) revision against a specific revision number, such as the revision of the 4.1.1 release. This isn't going to tell you much though unless you know what you are looking for and how to read C#.</p>\r\n<p>Version Notes are always included in the Welcome Window inside the program and at the link TimeToDance provided, though the linked page&nbsp;may not be updated for a day or two after the release.</p>",
    "PostedDate": "2011-04-04T09:39:06.943-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]