[
  {
    "Id": "605262",
    "ThreadId": "255808",
    "Html": "<p>Hello, I am interested in updating the Healadin module, and spent some hours yesterday trying to set up my development environment.&nbsp; I have never done development on windows, so it is all new to me.&nbsp; I managed to get Visual Studio 2010 Express with SP1 but have problems opening&nbsp; rawr4.sln &nbsp;&nbsp; \"I get an error message \"solution folders are not supported by this version of the application.&nbsp; Solution folder 'Solution Items' will be displayed as unavailable.\"&nbsp;&nbsp;&nbsp;&nbsp;</p>\n<p>I then get the error message \"The source control provider associated with this solution could not be found.&nbsp; The projects will be treated as not under source control.&nbsp; Do you want to permanently remove the source control bindings from this project?\"&nbsp; and  I select no.</p>\n<p>After all these messages, I can edit some code, but I don't want to spend too much time on it since it looks like I have setup issues.&nbsp;&nbsp; Also, I think my Visual Studio 2010 Express is a trail deal, and expires in a month :(</p>\n<p>So, my question is, can I use free software to help with the healadin module?&nbsp; Your page on development says:</p>\n<h3>For Development</h3>\n<ul>\n<li>Visual Studio 2010, Visual C# Express 2010, or Visual Web Developer 2010 </li>\n<li>Silverlight 4 Runtime, Toolkit, and Tools </li>\n</ul>\n<p>and also says:</p>\n<ol> </ol> <ol>\n<li>Install <strong>.NET Framework 3.5SP1</strong> </li>\n<li>Install <strong>Visual Studio 2010</strong>, or <strong>Visual Web Developer 2010</strong> <em>(Visual C# Express will not work)</em> </li>\n<li>Install <strong>Visual Studio 2010 SP1</strong>, or <strong>Visual Web Developer 2010 SP1</strong> </li>\n</ol> <ol> </ol>\n<p>so there is conflicting information on if I can use Visual C# Express, and I seem to be having issues with Visual Studio 2010 Express.</p>\n<p>Sorry I'm such a noob at this!&nbsp; I'm an experienced programmer, just not to this environment, and would like to help if I can without spending hundreds of $$$ on full versions of these products.</p>\n<ul>\n</ul>",
    "PostedDate": "2011-04-30T07:45:59.097-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "605300",
    "ThreadId": "255808",
    "Html": "<p>All the different editions of VS are confusing, indeed. Express just means the freeware version; not a timed trial or anything, it won't expire. Visual C# Express just included C#, not any of the web-based stuff which we use. Visual Web Developer (Express) includes C# and the web stuff we use. Visual Studio Express includes everything (I think), so also works fine.</p>\n<p>The first error you're getting is because we have some projects (assemblies) which are not supported by the free version of VS, but that's safe to ignore because they're just unit testing projects,  not required at all. The second error is because you haven't set up source control bindings (because you're not a dev on the project yet). That's also safe to ignore.</p>\n<p>I'd suggest playing around with the code for a bit, fixing some bugs, maybe post a patch or two to fix some bugs, and talking to Jothay about becoming a dev if you're still interested.</p>",
    "PostedDate": "2011-04-30T09:34:23.77-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "605356",
    "ThreadId": "255808",
    "Html": "<p>As far as I know, I did exactly what Astrylian said, and its working great for me. The only problems I'm having is my own stupidity. And trust me, thats a showstopper! :P</p>",
    "PostedDate": "2011-04-30T14:33:54.587-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]