[
  {
    "Id": "607539",
    "ThreadId": "256427",
    "Html": "\r\n<p>Hello everyone, I'm trying to make a BIS for my character and I have a little problem.</p>\r\n<p>Lets say I recently reached level 85 and I want to make a BIS items for normal dungeons.</p>\r\n<p>What I'm doing is:</p>\r\n<ul>\r\n<li>Get my Wow character naked </li><li>Log Out </li><li>Open the Rawr Addon </li><li>Load my Character form battle net </li><li>Filter the items by Dungeon only </li><li>In gear I select: All (This is Slow to Calculate) </li></ul>\r\n<p>After this the pain begins, I need to manually select all items one by one and is very time consuming, I was unable to find out an options to this automatically, so my questions will be:</p>\r\n<ol>\r\n<li>Is there a way to do this? </li><li>if yes, how? </li><li>if not, can this be implemented? </li></ol>\r\n<p>Let me know if you need more details.</p>\r\n<p>By the way awesome job guys.</p>\r\n<p>Thanks.</p>\r\n",
    "PostedDate": "2011-05-04T20:33:18.163-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "607547",
    "ThreadId": "256427",
    "Html": "<p>This has been asked for in the past and denied. If you want to make a BiS character, you have to do it manually.</p>\r\n<p>What I normally do when testing is: (Note: I'm adding a little fluff info to this guide to try and give some awareness to some new things you can do in Rawr as of Rawr 4.1.x)</p>\r\n<ul>\r\n<li>Go to Tools &gt; Edit Gemming Templates and turn the number of gemmings down to 1 (default is 3)</li>\r\n<li>Start with a blank toon (don't load something from the armory, there's no point in that when it's faster to just make it from scratch)</li>\r\n<li>Apply the Professions. For Warriors, I normally do Blacksmithing/Mining or Engineering/Mining.</li>\r\n<li>Check the Blacksmith sockets for Waist and if a Blacksmith, the Glove/Bracer slots too</li>\r\n<li>Apply the right Talent Spec</li>\r\n<li>Give it a full load of buffs, Flasks, Pots, Food, everything you'd expect to have in a well-balanced 25 man raid</li>\r\n<li>Apply the Boss Handler Settings for T11 25H's The Average Boss</li>\r\n<li>Determine what the T11 set for this toon is (like <a title=\"Earthen War Plate\" href=\"http://www.wowhead.com/itemset=-299\" target=\"_blank\">Earthen War Plate</a> for DPSWarr)</li>\r\n<li>Use the&nbsp;Find box at the top of the Charts and&nbsp;enter \"Earthen War Plate\" then press Shift+Enter (or click the Adv Search button, both do the same thing) and that will find all items in that set (359 and 372 versions, regardless of current filters)</li>\r\n<li>Equip the 372 versions of the items and mark them available with Green Diamonds. \r\n<ul>\r\n<li>See Optimizer Documentation for clarification on what that means/does.</li>\r\n</ul>\r\n</li>\r\n<li>Change the active Chart to Relative Stat Values. \r\n<ul>\r\n<li>This is just so running new calcs on the chart is short and simple as there's less than a dozen points to calc rather than a whole gear slot full.</li>\r\n</ul>\r\n</li>\r\n<li>Start to Round-Robin, selecting the top item in each slot as you click the paper doll dropdown. Skip over slots that were filled by T11 gear. \r\n<ul>\r\n<li>In some models, like Hunter and DPSWarr, you need to start with the Weapon slots or other gear slots won't have values.</li>\r\n</ul>\r\n</li>\r\n<li>When all gear slots are filled, do the round-robin again and ensure Enchants are selected</li>\r\n<li>Now, do a different kind of round-robin in that you go to each Gear chart and green diamond the top 3 items in each slot \r\n<ul>\r\n<li>Skip gear that is lower versions of itself, meaning don't mark a 359 item when you have the 372 marked, move on to the next highest item instead).</li>\r\n<li>Tier gear which should already be marked counts against this three, even if it's for some reason lower on the list.</li>\r\n</ul>\r\n</li>\r\n<li>Round Robin again with the charts through Enchant slots to mark the top enchant. \r\n<ul>\r\n<li>In some slots, like gloves and feet, there could be several viable enchants, like Expertise and Hit or Movement Speed, those should also be marked as appropriate as well</li>\r\n</ul>\r\n</li>\r\n<li>If an Engineer, round-robin through the&nbsp;tinkering charts and mark the appropriate ones as well</li>\r\n<li>You should now have everything marked, which is a LOT of gear and well more than any normal character loaded into Rawr should have.</li>\r\n<li>Save the character file (so you don't have to go through all this again)</li>\r\n<li>Go to the Optimizer and set the thoroughness to about 4/10 of the way over from the left, setting this really high with all this gear will make it take a very very very long time (some models worse than others).</li>\r\n<li>Don't check the change Talents/Glyphs whatever boxes except maybe Flasks and Food (if it's possible that other Flasks/Food could be better with a different combination of gear)</li>\r\n<li>Run the Optimize. Don't use Ctrl+Click for 10x the thoroughess, you'll be sitting there all night waiting for it to finish</li>\r\n<li>In a few minutes, the optimize should be done, load the optimized set and save the character.</li>\r\n<li>You can run additional optimizes or if you have the time, run it once more at a much higher thoroughness and walk away while it computes.</li>\r\n</ul>\r\n<p>You should now have a reasonable BiS character.</p>",
    "PostedDate": "2011-05-04T21:00:13.86-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "613436",
    "ThreadId": "256427",
    "Html": "<p>My version of this is a bit faster and simpler, I believe.&nbsp; Also I wouldn't just assume like that T11 being great.&nbsp; It's not for all classes.</p>\n<p>I open my current rawr char that I have been using day to day.&nbsp; It already has my buffs and talents and all that plus the gear I currently own in it.</p>\n<p>I go slot by slot starting with head (ignore that \"all\" one it takes too long).&nbsp; I green dot anything that I think I am able to get based on my current progression (or everything of a certain ilvl if I am going by an ilvl based BiS).&nbsp; Slot by Slot all the  way through ranged takes maybe 15-20 mins.</p>\n<p>I make sure my enchants are all selected correctly and green dotted.&nbsp; I verify my gemming templates look right.&nbsp; I verify my boss handler is right.</p>\n<p>I run optimize and I do it on max (but not 10x).&nbsp; It takes a while since there's an awful lot of gear selected but not that long.&nbsp; Maybe 2-3 mins at most.</p>\n<p>I make sure to save this file so that next time I want to run a BiS after a patch comes out or if my guild downed a new boss/new patch I can just add in the new gear instead of starting over.</p>",
    "PostedDate": "2011-05-16T09:48:06.8-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "613438",
    "ThreadId": "256427",
    "Html": "<p>The intent isn't to \"assume\" T11 is great, it's to enforce that it's available because the end user doesn't know if it is or isn't based on selecting one piece at a time. Let the optimizer sort it out by having all 5 peices available and determine if 4P is worth it and if it is, which 4 peices to use.</p>",
    "PostedDate": "2011-05-16T09:58:54.973-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "613471",
    "ThreadId": "256427",
    "Html": "<p>Misunderstood your point there since I read you skipping the T11 slots in part of your process.&nbsp; I see now the \"different sort of round robin\" you mention after that.</p>",
    "PostedDate": "2011-05-16T11:02:43.2-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]