[
  {
    "Id": "613097",
    "ThreadId": "257726",
    "Html": "<p>WPF users in the next and future versions will now be alerted to the presence of Debug builds. These builds provide access to issue fixes and other beta work being done by developers.</p>\n<p>We will be using these builds to get the following feedback points:</p>\n<ul>\n<li>Responses to Issue Fixes on whether the fix actually worked </li>\n<li>New Feature breakpoints, to provide more stability to&nbsp;the next&nbsp;Release build </li>\n</ul>\n<p>When replying to issues or features in the Debug build, please submit them to the Issue Tracker and denote the response is related to the Debug Build.</p>\n<p>You can find the debug builds here: <br /><a href=\"http://rawr.codeplex.com/releases/view/66372\">http://rawr.codeplex.com/releases/view/66372</a></p>\n<p>I'll be making debug releases every few fixes or days. Note this isn't an automated process and updates will come sporadically.</p>\n<p>If you don't want to be alerted to Beta versions in WPF, you can turn them off in the Options dialog.</p>\n<p>The current build includes up to checkin <span style=\"color: #ff0000;\"><strong>60775</strong></span>.</p>",
    "PostedDate": "2011-05-15T18:41:05.403-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "613602",
    "ThreadId": "257726",
    "Html": "<p>Is there any easy way to know what has been changed in these debug releases? The issue tracker lets me sort by planned release but I don't see any way to sort for this sort of thing.</p>\r\n<p>I note the main version notes weren't updated (which is probably as it should be).&nbsp; I simply have no idea if there are any changes in this Debug build related to things I use.&nbsp; So I don't know if I can be of any assistance in testing and/or need to update due to some issue being resolved that might affect me.</p>",
    "PostedDate": "2011-05-16T15:25:12.18-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "613605",
    "ThreadId": "257726",
    "Html": "<p>There's this thing called the Source Code Tab. Everything up to the number you see in Red there from the last actual release.</p>\n<p>*slight sarcasm*</p>",
    "PostedDate": "2011-05-16T15:27:14.343-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "613606",
    "ThreadId": "257726",
    "Html": "<p>And if I make a build, I'll most likely post on the referencing issues to go try the debug build.</p>",
    "PostedDate": "2011-05-16T15:28:13.613-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]