[
  {
    "Id": "614358",
    "ThreadId": "258025",
    "Html": "<p>My first problem is that the information regarding how to go about editing or understanding the tersm used and available for editing items does not seem to be readily accessible. The one hint I have come across suggest this information is located in the  readme file. My problems is I have no idea where the readme file for the online version is. I have download the WPS zip but that does not seem to have a readme file either.</p>\n<p>Editing any on the ilvl 359 Alchemist stones I can see they have under stats 2 lines with multiplies with a&nbsp; of .4.&nbsp; These are greyed out but I can see enough that one is % Bonus Mana Potion Effect and the other is Health Restored. While % Bonus Mana Potion  Effect sounds correct Health Restored seems to be too broad a term. Is Health Restored only a Health Restored from Mana Potions? Are these for a specific HP/Mana potion or any selected? Is the .4 HP/Mana added to the Base HP/Mana fro these pots of should the multipler not be 1.4?</p>\n<p>The other problem I have is there does not seem to be an option any where to specify which Cataclysm Health or Mana potion should be used. I'm looking to model with, Mysterious Potion, Mythical Mana Potion and&nbsp; Mythical Healing Potion. At one stage I did  see an option for some potions but but the only Cataclysm potion listed was Earthen potion all the rest were WotLK potions and I can;t find where that was now. It certainly is not appearing on the Main Buffs Tab though Catacysm Flasks and Elixirs options are  there.</p>\n<p>The only potion option I do find where I expect it from Rawr 3 days is the under the Options tab, sub tab Spells and Buffs where I can select Volcanic Potion and Mana Potion but no mention of what the mana potion is. I recall seeing use 2 potion trick as  an option somewhere at one stage but that too seems to have disappeared.</p>\n<p>Can someone please tell if Alchemist Stone multiplier is factored in if use Mana option is selected and if so what the the value used for the mana potion? Is it the avg for for Mythical mana potion? Is there any way for Alchemists to use Mysterious Potion  instead? I don't have enough data yet to conclude what that the avg Mana/HP from Mysterious Potion is but reports suggest that for Goblins it could be much higher than Mysterious Mana/Healing Potions and even for non Goblin Alchemists using the Mysterious  potion may be prefer due to the 2 for me even if the avg HP/Mana is not quiet the individual Mythical Potions return.</p>",
    "PostedDate": "2011-05-17T22:34:59.563-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "614382",
    "ThreadId": "258025",
    "Html": "<p>What those stats do is entirely model dependent, and you haven't told us what model you're talking about. Regardless, I'm curious what you're concerned about health potion effects for? I don't know of any viable use for healing potions currently.</p>",
    "PostedDate": "2011-05-17T23:40:05.29-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "614953",
    "ThreadId": "258025",
    "Html": "<ol>\r\n<li>Per the Posting Guidelines, you need to be as clear as possible when asking questions. There are significant typos throughout your post that make it difficult to read. A simple once-over before posting would have helped make it more human-readable.</li>\r\n<li>Where do you see mention of a ReadMe file? Whatever the reference is, it's out of date. All documentation is either in the Documentation tab on this website or provided as Discussions to search through.</li>\r\n<li>Editing items is not rocket science.<ol>\r\n<li>Open Item Editor/Browser</li>\r\n<li>Click Item to Edit</li>\r\n<li>Click Edit Item</li>\r\n<li>Change stats, icon, whatever you want to change</li>\r\n<li>Click OK</li>\r\n</ol></li>\r\n<li>Astry is right, those stats effect every model differently. Most do not model Health Potion or similar effects at all. Whatever they are, the models are handling them the way they are supposed to be as those are specific stats that have to be applied a certain way. If you think it's (by that I mean a specific model)&nbsp;actually doing it wrong, you need to follow the Posting Guidelines and create an Issue in the Issue Tracker with your character file and state how you came to that conclusion and the steps to reproduce. Some models use the Buffs Pane to select the Potion you are using, others use the Options Pane (because they have more specific restraints). If you can't see it outside of that, the model doesn't use it, nor should you because health pots suck. Remember, they *do* count as your one potion shared cooldown in a fight so you should be using something that actually gives you stats like Earthen Potion (for tanks).</li>\r\n<li>The dumbest way to figure out if the alchemist stone multiplier is being applied is to put the item on, look at your score, edit the item to remove those stats and click ok, look at your score again, see if it changed then go change the item back to what it was.</li>\r\n</ol>",
    "PostedDate": "2011-05-18T16:54:27.56-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "614988",
    "ThreadId": "258025",
    "Html": "<blockquote style=\"border: solid .1em #ccc; font-style: italic; margin: .25em 1em 0 1em; padding: 0 .25em 0 .25em;\"><strong>Astrylian wrote:</strong><br />\n<p>What those stats do is entirely model dependent, and you haven't told us what model you're talking about. Regardless, I'm curious what you're concerned about health potion effects for? I don't know of any viable use for healing potions currently.</p>\n</blockquote>\n<p>I wasn't concerned with a particular model although I'm interested for my own which is Arcane Mage with Alchemy. Specifically I'm trying to determine if there is a way to change the potion used from what I'm assuming is the mythical mana potion to mysterious  potion. I'm afraid I wasn't even able to determine what potion is used and what value of mana is used for it.</p>\n<p>I value the trinket and potion combination higher on fights where there is periodic large damage that may need to be addressed in a prompt matter such as chimeron or nefarian where it can be used both as a mana CD and for higher survivability.&nbsp; With regards  to benefits of HP potions obviously it affects survivability and again I was wondering if when mysterious potion is used, if both affects were being valued correctly, so as to determine the correct relative value of the alchemists stones compared to other trinkets.  In some special cases the effects might be larger than in others. An extreme example, Goblin Warlock with Alchemy where&nbsp; mysterious potion would affect mana regen in 2 ways. Firstly in the direct usual way and secondly indirectly since HP is converted into mana  via Life Tap. In the Case of Goblins the returns from mysterious mana potion are greater than for other races due to their racial giving them +15 Skill to this profession. Another case when the trinket might have a higher value when used with mysterious potion  is in the case of Protection Paladins, though usually Mana is not much of a concern.</p>",
    "PostedDate": "2011-05-18T20:48:48.407-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "615991",
    "ThreadId": "258025",
    "Html": "<p>There are a few errors in your theories, I would like to assist you with them.</p>\n<p>First, the amount of alchemy skill a character has plays no role in how much mana is returned via the mysterious potion.</p>\n<p>Second, If we were to use the mysterious potion in Rawr, it would most likely be done as an average, which is 7500 mana, far below the 10500 mana of the Mythical Mana potion. &nbsp;As the bonus is percentile, there is no way that on average the mysterious potion  would restore more than the mythical.</p>\n<p>Third, if you consider lifetap, it restores 120% of life taken into mana, or 140% talented. &nbsp;If we take this directly, that means a Mythical healing potion would be worth 25200 Mana (29400 talented) base, and 41160 Mana with stone(35280 untalented). &nbsp;However,  it is not ever really direct. &nbsp;Consider the gear of a T11 warlock, HP of 120k. &nbsp;At most, life tap will take 18k health, meaning a standard potion would be completely used. &nbsp;This means you will need 2 GCD's used in a row. &nbsp;That is enough time for a healer to  begin healing noticing the health deficit. &nbsp;As a healer, I would not advise this practice. &nbsp;You could pre-plan it and call it out, but that could increase your deaths as a healer would think you are double-tapping, and not the target of a boss effect. &nbsp;</p>\n<p>Fourth, considering Nefarion or Chimaeron, there are far better ways to increase your lifespan than a health potion. &nbsp;Using a dps increasing potion could yield enough dps on the burn phase to decrease chimaeron's uptime, therefore making &nbsp;the need of said  healing potion not necessary. &nbsp;I understand you wish to put less stress on the healers, however, if they are not asking for it, again, you may use the potion and waste the incoming heal on you. &nbsp;In that case, you could waste upwards of 8-15k of their mana,  a resource more precious.&nbsp;</p>\n<p>And finally, something to always consider that most DPS do not and I never understand why. &nbsp;Dps is healing saved. &nbsp;If you use a trinket that costs you 100 dps on a 7 minute boss fight, that's 42k damage lost. &nbsp;Killing a boss 10 seconds faster can save upwards  for 250k healing most fights. &nbsp;Also, stamina is not survivability in most cases, you are simply a bigger sponge. &nbsp;If an extra 2k HP would save you, then survivability is not the issue.</p>",
    "PostedDate": "2011-05-20T10:45:45.637-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "620327",
    "ThreadId": "258025",
    "Html": "<p>Hi, sry for late response.</p>\n<p>The skill you have when you use a mysterious potion does or at least did affect the amount of mana and HP returned. This was tested by a number of people myself included. I don't have a goblin to verify those results but I did to testing at 470, 500 and  525 lvls and found the averages to increase during patch 4.03a. There was an official acknowledgement of this at the time and some results can still be found on the wowhead page for the potion along with the blue response quotation http://www.wowhead.com/item=57099/mysterious-potion#comments.</p>\n<p>With regards to the Warlock the idea was that a mysterious not mythical potion would be used and so the Warlock&nbsp; would be gaining from both the Mana and HP effects of the potion. How the use of the potion would affect healing etc. doesn't have to play out  as you say. On most encounters it is unlikely that all members will be at 100% HP all the time so there are periods when a mysterious potion can be used without HP first having to be consumed via Life Tap and certainly without a Warlock having to double Tap.&nbsp;</p>\n<p>The discussion regarding such potions effects on raiding healing is something I'll leave aside till I can address it more fully.&nbsp; The issues you raise can easily be handled through proper planning, without the need for people calling out they are going to  use a HP potion and without a healer getting the wrong idea. After all such potions can only be used once per fight.</p>\n<p>There is no need to point out DPS is healing saved etc. I'm not ignorant of that fact. I am specifically looking to find the correct relative value of these trinkets so I can determine what gear is best given a specific sets of circumstances. All such considerations  are obviously relevant. The question is are these trinkets when used with potions they affect, in particular, Mysterious Potion, Mythical Mana Potion and Mythical Healing Potion better than other trinkets with other potions in any circumstances.</p>\n<p>Increased HP is increased survivability. To claim otherwise is ridiculous. Firstly we are not talking 2k but even if we were it it enables you to survive where you would otherwise die then it is something that needs to be factored in. That the same result could be achieved with other methods does not detract from that. Increased HP is a bigger sponge other things improved the effectiveness of the sponge, either way your talking about the sponge being able to soak up greater amounts.</p>\n<p>Finally if you are using 7500 as the average mana returned from mysterious potion I would ask what sample size and what skill you used to obtain that average. My testing at 525 alchemy puts it at above 9k min while I know people testing at 540 skill on goblins are obtaining figures that puts the min significantly above the 9250 obtained from the mythical mana potion.</p>",
    "PostedDate": "2011-05-30T08:09:07.55-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "620457",
    "ThreadId": "258025",
    "Html": "<p>Some&nbsp;research&nbsp;into the matter reveals that at 525 skill, this brings the minimum mana restored to 5k. &nbsp;If we consider it scaling off skill, then logically you could theorize that a goblin alchemist would have a ~5140 average. &nbsp;Even as an&nbsp;alchemist, this puts the average restored at 10070, making it on par with the mythical mana potion, so I apologize for that oversight &nbsp;So far the only proof is buried in wowhead comments and forum posts as the old forums are shut down. &nbsp;Now that I understand that you're not crazy, this is probably where our conversation ends. &nbsp;There is clearly evidence out there to support the potion is being represented in Rawr incorrectly. &nbsp;I'd put in an issue to resolve this if I were you. &nbsp;</p>\r\n<p>Also, I leave you with an observation. &nbsp;Raid healing is what I do. &nbsp;A lot. &nbsp;And please trust me when I say that if 10k HP would have saved someone, there is something seriously wrong, at least on normal fights. &nbsp;And if you are doing heroic fights, all of the 372 trinkets far outshine the 359 stone. &nbsp;Until we have a 359+ stone, it will go the same route of the alchemist stones of wrath, being useless quite quickly. &nbsp;HP is now a useless stat unless there are tools behind it. &nbsp;Someone can drop from 100% to 0% in seconds, even faster sometimes. &nbsp;Making yourself a bigger sponge never helps the healers. &nbsp;It's why most of us absolutely loathe heroics most times, the tank is someone who has simply stacked stam on top of stam with complete disregard to any sort of avoidance. &nbsp;I find this most commonly with DK tanks I get, with 180K HP, but drop like a rock on the first pull in heroic stone core. &nbsp;This works in raids because they are being focus healed, but in a heroic or raid healing situation, they aren't, and they drop. &nbsp;It seems that blizzards current goals for boss damage on raid is for it to be healed up efficiently and slowly. &nbsp;</p>\r\n<p>If 10k saved you, one of two things happened. &nbsp;The healer didn't heal you for some reason, or you are standing in bad. &nbsp;And again, from a raid healer's view, if the former option happened, it will happen again soon after, because none of the reasons are good why it happens.</p>",
    "PostedDate": "2011-05-30T14:26:13.163-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]