[
  {
    "Id": "614627",
    "ThreadId": "258084",
    "Html": "<p>Hey, as I continue to work on the Healadin module, I thought I would post what is implemented so far in to code (but not necessarily in the latest build), and what is on my agenda.&nbsp; I started keeping notes for myself in the code, and will paste that here.&nbsp;  I will edit this post as I make updates.</p>\n<p>I thought this thread was a good idea so people can find out what exactly is implemented so far, and can make suggestions.&nbsp;&nbsp; I will try to note any assumptions the model makes, so that people are aware and can make suggestions if there is a better way.</p>\n<p>Where a talent has more than 1 effect, I list them on seperate lines so I can mark each line DONE independently.</p>\n<p>Basic logic of the model:</p>\n<ul>\n<li>figures the total cast time and mana used for all the stuff we \"have to cast\" based on assumptions and the options tab.&nbsp; (HS, Judgement, WoG, LoD, BoL, etc)&nbsp; </li>\n<li>use up the remaining time / mana with melee / HL / DL / FoL casts. <br /> \n<ul>\n<li>If there is not enough mana to fill in the remaining time with HL casts, fill it with a mix of melee attacks (to get more mana) and HL casts, and use up all mana </li>\n<li>If we can fill in the remaining time with HL casts and some DL casts, figure out the perfect mix of that to use up all mana </li>\n<li>If we can fill in the remaining time with DL casts and some FoL casts, figure out the perfect mix of that to use up all mana </li>\n<li>If we have enough mana to spam FoL the rest of the time, just do that </li>\n</ul>\n</li>\n</ul>\n<p>updated 6/3:</p>\n<p>&nbsp;*Left to do: (in no particular order)<br />&nbsp;*&nbsp; Last Word(0-2) - 30% extra WoG crit per point, when target below 35% health<br />&nbsp;*&nbsp; Divine Favor(0-1) - increase haste/crit 20% for 20 secs.&nbsp; 3 min CD<br />&nbsp;*&nbsp; Daybreak(0-2) - FoL, DL, HL have 10% chance per point to make next HS not trigger its 6 sec CD.<br />&nbsp;*&nbsp; Tower of Radiance(0-3) - healing beacon target with FoL or DL has 33% chance per point of giving a Holy Power<br />&nbsp;*&nbsp; Glyph of Divine Favor<br />&nbsp;*&nbsp; Avenging Wrath<br />&nbsp;*&nbsp; Guardian of Ancient Kings<br />&nbsp;*&nbsp; T12 set bonuses<br />&nbsp;*&nbsp; Divine Plea: causes 50% heals.<br />&nbsp;<br />&nbsp;* <br />&nbsp;*Done, with assumptions (which can't be changed in the options tab):<br />&nbsp;*&nbsp; Speed of Light - assumes 3 points for Holy Radiance CD reduction.<br />&nbsp;*&nbsp; Assumes you are holy spec, so you get:<br />&nbsp;*&nbsp;&nbsp; - Illuminated Healing (shield on heals, Mastery ability)<br />&nbsp;*&nbsp;&nbsp; - Meditation (50% spirit regen in combat)<br />&nbsp;*&nbsp;&nbsp; - Walk in the light (+10% to all heals)<br />&nbsp;*&nbsp; Seal of Insight is always up<br />&nbsp;*&nbsp; Infusion of Light -0.75 cast time reduction is applied after haste.&nbsp; Also a HL or DL can be cast before this procs again.<br />&nbsp;*&nbsp; <br />&nbsp;* <br />&nbsp;*Not done, but no current plans to do:<br />&nbsp;*&nbsp; Crusade (0-3) - 2nd part - after killing something, next HL heals for 100% extra per point, for 15 sec.<br />&nbsp;*&nbsp; Blessed Life(0-2) - 50% chance to gain holy power when taking direct damage.&nbsp; 8 sec CD.<br />&nbsp;*&nbsp; figure hit into melee / Judgement mana regen - leaning towards not bothering to do this... *&nbsp; <br />&nbsp;*&nbsp; Enlightened Judgements(0-2) - 1st part - gives +50% spirit to hit per point <br />&nbsp;* <br />&nbsp;* <br />&nbsp;*Known shortcomings of the model:<br />&nbsp;*&nbsp; Crits often cause overheals.&nbsp; Model does not take this into account.</p>",
    "PostedDate": "2011-05-18T07:32:38.763-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "622969",
    "ThreadId": "258084",
    "Html": "<p>I just coded up something to try to address overheals on a crit - I added something to the options menu to discount a % of the heals from crits.&nbsp; (with 100% not counting any heals from a crit, making it just like a non-crit heal).</p>\n<p>Anyway, when testing this, I noticed something that I saw with a similar option I coded for Illuminated Healing.&nbsp; IH is the shield thing from mastery, and it often is overwritten or expires.&nbsp; When I adjust either of these, the values that Rawr calculates  for Mastery or Crit jump up and down a bit.&nbsp; They do not increase / decrease linearly as I would expect.&nbsp; Often the value goes in the opposite direction that it \"should\" when I adjust one of these in 5% increments.&nbsp; In larger increments they do tend to behave  more in the direction I would expect, but the amount still seems inconsistent.</p>\n<p>Anyway, has anyone else noticed similar peculiarities in other models, or have any advice for me?&nbsp; I don't want people to discount Healadin results altogether because of this apparent \"error\" in crit or mastery values.</p>\n<p><strong>edit:&nbsp; to clarify my concern:</strong>&nbsp; If I decrease \"Crit Overheals\" in 5% increments from 100 to 0, then overall HPS goes up every time, in a consistent and expected amount.&nbsp; The value of Crit SHOULD go up every time also, but sometimes it goes down, it is very eratic.</p>\n<p>Similarly, if I increase IH effeciency in 5% increments from 0-100%, overall HPS increase as expected, but the value of mastery jumps all over the place.&nbsp;</p>\n<p>The odd behavior of the calculated values for crit and mastery concern me, and therefore would concern any Healadin users.&nbsp; Any thoughts on why this is happening?</p>",
    "PostedDate": "2011-06-04T09:20:58.25-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "623011",
    "ThreadId": "258084",
    "Html": "<p>This kind of problems are most easily seen on the Stats Graph, so if you don't have that implemented yet I'd suggest you do, it's just a few lines of code.</p>\r\n<p>Other than that, this kind of problem is not that uncommon, but doesn't have any single cause. Sometimes it is a result of real disconinuities, sometimes it can be a result of basing results on overly discretized simulation data, sometimes it can be a result of&nbsp;using some fixed rng seed effect. In general looking at the Stats Graph can sometimes help get an idea of what is going on, but usually one has to dig quite deep to get at the root. Best is start disabling small component models to try to isolate where it is coming from, other than that it might be useful to look at some graphs showing spell distribution as it changes with stats.</p>",
    "PostedDate": "2011-06-04T13:25:48.573-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "624735",
    "ThreadId": "258084",
    "Html": "<blockquote style=\"padding-bottom: 0px; font-style: italic; margin: 0.25em 1em 0px; padding-left: 0.25em; padding-right: 0.25em; padding-top: 0px; border: #ccc 0.1em solid;\"><strong>molotok wrote:</strong><br />\r\n<p><strong>edit:&nbsp; to clarify my concern:</strong>&nbsp; If I decrease \"Crit Overheals\" in 5% increments from 100 to 0, then overall HPS goes up every time, in a consistent and expected amount.&nbsp; The value of Crit SHOULD go up every time also, but sometimes it goes down, it is very eratic.</p>\r\n</blockquote>\r\n<p>First, be sure you implemented the \"Crit Overheals\" as a modification to the crit healing bonus (50% in 4.1 for a generic heal), not as a modification to the likelyhood of a crit (the crit%).&nbsp; Changing the crit% would cause interactions with items or talents that proc on crits.</p>\r\n<p>Second, does your model change rotations based on the relative strength of spells?&nbsp; I don't know about Healadins, but for Trees:</p>\r\n<p>Regrowth (+60% crit chance from talents) crits more often than Healing Touch.&nbsp; Regrowth gets less benefit from additional crit rating (Regrowth = 1.0 HPCT/Crit rating, HT=1.2).&nbsp; As the benefit of crits increase, Regrowth improves more quickly than HT, and an appropriate model might use Regrowth more often in its rotation.&nbsp; As the rotation uses more Regrowth, the marginal value of crit rating goes down.</p>\r\n<p>As a side note: Knobs like this in a model are easily misused.&nbsp; It is true that crits contribute to overhealing.&nbsp; It is also true that SP, Mastery, and even Haste or Mana can contribute to overhealing.&nbsp; Singling out crit for this type of attention seems to be a bit unfair.&nbsp; A better reason for most healers to dislike crit is its RNG nature.&nbsp; If I need a lot of \"reliable\" healing in the next several seconds, I need to accept that over a short period of time, the number of crits I see may be much less than average.</p>",
    "PostedDate": "2011-06-08T07:00:05.607-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "625083",
    "ThreadId": "258084",
    "Html": "<blockquote style=\"border: solid .1em #ccc; font-style: italic; margin: .25em 1em 0 1em; padding: 0 .25em 0 .25em;\"><strong>molotok wrote:</strong><br />\r\n<p>&nbsp;*Known shortcomings of the model:</p>\r\n<p>&nbsp;*&nbsp; Crits often cause overheals.&nbsp; Model does not take this into account.</p>\r\n</blockquote>\r\n<p>Overhealing is one of those factors that is very difficult model accurately. Even taking your assertion that crit is more likely to result in overheal, one could make an argument that even though it does overheal, the healing from crit when it does not overheal outweighs the increased overhealing as crit is very effective (in terms of HPS, it's still very RNG) burst healing. I've just had a look at a random sample of my HHalfus parses and my DL overheal (10%) is actually less than my HL (30%) which is the exact opposite of what your model expects. For heavy-damage fights I suspect not uncommon: DL spam during heavy damage, HL to top people off: DL crits just mean that they get topped off faster and can switch to HL earlier.</p>\r\n<p>The previous healadin model completely ignored overhealing and I recommend taking the same approach. Overhealing is notoriously difficult to model and I suspect the only way to get meaningful overheal numbers is from extensive log parses and even then there is likely considerable variance due to group composition (who are your other healers?), and raid size (10/25).</p>",
    "PostedDate": "2011-06-08T19:19:33.253-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "625436",
    "ThreadId": "258084",
    "Html": "<p>Thanks for the feedback everyone.&nbsp; I plan to implement the Stats Graph as Kavan pointed out, which is good to have anyway and might shed some light on my question.</p>\n<p>Erdluf, the way I coded the \"crit overheals knob\" was reduce the 50% crit bonus, not the percent chance of a crit.&nbsp; Also, thanks for pointing out that more options might not be better.&nbsp; The Healadin model does not swap spell priorities based on crit, for now it seems that the 3 \"filler\" spells (HL, DL, FoL) do not change places in terms of HPS / HPM rankings with eachother.&nbsp; I'll have to check that assumption though, especially with a new tier level coming.</p>\n<p>Iminmmnni, good point on the potential for crit heals to actually contribute less to overheals, the opposite of what I was guessing.&nbsp;&nbsp;</p>\n<p>This discussion has me leaning towards scrapping the crit overheals option, and also removing the Illuminated Healing slider bar that provides similar functionality for Mastery.&nbsp; I read that the shields from Mastery are currently stacking in the PTR, up  to about 1/3 of the paladin's max health.&nbsp; That should remove overwriting of the shield in most cases anyway.</p>",
    "PostedDate": "2011-06-09T08:08:01.31-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]