[
  {
    "Id": "86519",
    "ThreadId": "25840",
    "Html": "<br />When I use the \"load possible upgrades from armory\" feature, is it looking at the gear I currently have on in the armory?  Or the current gear in Rawr?<br />",
    "PostedDate": "2008-04-12T21:31:39.743-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "86525",
    "ThreadId": "25840",
    "Html": "\r\nIt's actually kind of both. It's in the context of the current gear on the armory, trying to find upgrades from each item on the Rawr character. That functionality is up to the Armory though, nothing I can change about it.<br />",
    "PostedDate": "2008-04-12T23:32:59.17-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "86570",
    "ThreadId": "25840",
    "Html": "\r\nOk, so does that mean that it only loads upgrades for slots where the item in Rawr matches the item currently equipped in the Armory?<br /><br />i.e. suppose that I have a bear set of gear, and a cat set of gear, and let's assume they are completely different gear in each slot.<br /><br /><br />If I've logged out in cat, and I open up my cat set in Rawr, and load upgrades, it will load everything as expected. <br />If I've logged out in cat, and I open up my bear set in Rawr, and load upgrades, it will do nothing. (because nothing in rawr matches the armory items)<br />If I've logged out in cat, and I open up my bear set in Rawr, and manually equip 2 items in Rawr that match what's on the armory and load upgrades, it will load upgrades for just those 2.<br /><br />Is that right?<br /><br />",
    "PostedDate": "2008-04-13T13:13:30.593-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "86572",
    "ThreadId": "25840",
    "Html": "\r\nNo, doesn't have to match or anything. The Armory returns a ton of upgrades based on your current gear on the Armory, and Rawr filters that down to only items that are potentially upgrades from what you currently have selected in Rawr.<br />",
    "PostedDate": "2008-04-13T13:22:57.737-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]