[
  {
    "Id": "87073",
    "ThreadId": "26010",
    "Html": "\r\nWhen doing an optimizing, I usually select the blue gems that I can purchase on AH.<br /><br />However, I do have a few epic gems already socketed. Is it possible to allow the optimizer to accept gems that are currently socketed in the equipped gear? Even if those gems are not selected in the gems list as \"available\".<br />",
    "PostedDate": "2008-04-16T00:58:55.643-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "87146",
    "ThreadId": "26010",
    "Html": "\r\n\"Known Gemmings Only\"<br />",
    "PostedDate": "2008-04-16T08:18:57.743-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "87276",
    "ThreadId": "26010",
    "Html": "\r\nCorrect me if I'm wrong:<br />Known gemmings only optimizes between all instances of selected gear with all the gemmings that exist in the list in \"Item Editor\"? In there I have lots of items with gems I can't acquire.<br /><br />And I want it to come up with new gemmings too. Just that on top of what I allow it to come up with, I want it to accept the better gemmings that I may already have.<br /><br />I have a few epic gems that are drops from instances. I can let them remain in the gear, but I can't move them and I can't get new (it's too much work simply to grind for more)<br />",
    "PostedDate": "2008-04-16T22:40:51.71-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "87284",
    "ThreadId": "26010",
    "Html": "\r\nAh, that's an even weirder setup... Nope, not possible, sorry.<br />",
    "PostedDate": "2008-04-16T23:40:56.033-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "87366",
    "ThreadId": "26010",
    "Html": "<div class=\"quote\" style=\"border: dotted .1em #aaa; border-left: none; border-right: none; font-style: italic; margin: 1em 0em 2.5em 3em;padding: .2em;\"><br />Astrylian wrote:<br />Ah, that's an even weirder setup... Nope, not possible, sorry.<br /><br /></div>Shouldn't that be a fairly common thing? You could use what you have, or you could buy certain gems at the AH. But some gems that you currently have can't be aquired easily but you don't want to replace them if it's a downgrade to do so!<br />",
    "PostedDate": "2008-04-17T07:32:48.11-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "87382",
    "ThreadId": "26010",
    "Html": "\r\nNo, not really, because typically if you have one of something, you could have more of it (epic gems)<br />",
    "PostedDate": "2008-04-17T08:15:49.03-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "87643",
    "ThreadId": "26010",
    "Html": "\r\nIts a common thing for people that are in heroics/kara level gear.  Common access to blue quality gems from the AH, and rare access to epic quality gems by random drop through running heroics.  I would imagine tho that this would be quite hard to optimize for.<br /><br />One other thought on gem optimization, at the very very end of the optimization process, add an algorithm to best match gems to socket colors.  I've had it come up several times with blue gems in yellow sockets and yellows in blues in the same equip set, and socket bonuses could be achieved by just swapping which gems are in which slots.<br />",
    "PostedDate": "2008-04-18T13:08:53.737-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "87656",
    "ThreadId": "26010",
    "Html": "\r\nActually implementing this would not be hard. I kind of do this for the upgrade valuations if you select \"known gemmings only\" that applies to the available gear only, but for the items that are evaluated i evaluate all gemmings using the available gems.<br /><br />What Rooted suggested is just a 3rd option that is basically union of the current two.<br />",
    "PostedDate": "2008-04-18T13:57:17.853-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "87726",
    "ThreadId": "26010",
    "Html": "\r\nAlmost a union. I'm not suggesting a full union, but a union of:<br />1) All gemmings according to selected gems.<br />2) THe gear I'm currently wearing.<br /><br />Not.<br />3) The gear with gemmings that exist in the database. <br /><br />Number 3) would be nice if it was easy to remove things from there, but deleting item by item isn't that much fun! ;-)<br />",
    "PostedDate": "2008-04-19T00:05:55.58-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]