[
  {
    "Id": "626733",
    "ThreadId": "261140",
    "Html": "\r\n<p>I have a few low lvl toons that can use the Program Rawr to show me what glyphs would be best for my toon while lvling to do the est dps and r hold the most threat... I know how to use the program for this but it would be nice to know all the gear for all\r\n lvls and your lvling to know if you should get an item, and have an upgrade list all the way through to lvl 85 right off the start... that would make this program the most innovative lvling and gearing program lone.</p>\r\n",
    "PostedDate": "2011-06-12T22:40:54.313-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "626736",
    "ThreadId": "261140",
    "Html": "<p>Couple of reasons</p>\r\n<p>a) Rawr is mostly designed for lvl 85 numbers</p>\r\n<p>b) The item cache would be astranomical in size. The current cache has a compressed size of 3.5 megs (7 megs uncompressed). Back in Wrath everything included had a compressed size of 8 megs. Between Wrath and Cata combined that would be 11.5 megs. Factor in The rest and your looking at 25 megs about. The bigger the file, the longer it takes to load, which slows the overal performance. Plus it would be extremely annoying seeing AQ40 gear show up on the same screen as Firelands.</p>\r\n<p>c) You gear up too quickly. Since lower level gearing got streamlined by Blizzard you will be replacing gear within hours of acquiring your previous item.</p>\r\n<p>d) Only the mage model has backwards compatibility in which you can see gearing choices while you level.</p>",
    "PostedDate": "2011-06-12T22:52:17.847-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "627908",
    "ThreadId": "261140",
    "Html": "<p>Download the addon Pawn and it has preset stat values for each spec you can use (based on Wowheads presets).&nbsp;&nbsp;&nbsp; Every time you complete a quest, if the item is better than your current item, it appears with an up arrow over it to show you it is an upgrade or a coin item over the highest vendor value item if no rewards are upgrades.</p>\r\n<p>Will suit your purposes perfectly and would be just as accurate than trying to apply Rawrs level 85 mechanics to a low level toon.</p>",
    "PostedDate": "2011-06-14T21:22:48.01-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "628619",
    "ThreadId": "261140",
    "Html": "<p>Well guys thanks for the reply. I have made a new assessment based on the info provided and have posted a new thread? and Im installing that addon for my low lvl's TY... But on my mew thread I posted I have another question that might perk some interest I think.</p>",
    "PostedDate": "2011-06-16T04:30:57.603-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]