[
  {
    "Id": "87369",
    "ThreadId": "26119",
    "Html": "\r\nRawr.Bear gives three ratings. Mitigation, Survivability, and Overall (where Overall = Y * Mitigation + Z * Survivability). Sure, the Mitigation and Survivability may have been scaled ahead of displaying them according to the values of Y and Z, but that doesn't change this reasoning.<br /><br />The ratio between Y and Z gives if Rawr give a build that favours mitigation or survivability.<br /><br />I'd like an option to modify that ratio.<br /><br />Sometimes I want to optimize for a Mitigation build or a survivability build. Today I can only optimise for either overall or optimize where Y or Z are zero (that is not care about it at all). <br /><br />It would be nice with a slider on the Options tab where I could modify that ratio.<br />",
    "PostedDate": "2008-04-17T07:40:10.933-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "87387",
    "ThreadId": "26119",
    "Html": "\r\nAgain, there's literally no coefficient for survival, and Mitigation is just raised to the same scale as Survivability. They're static in that regard in that they are accurate as they are. They're not distinct things that you want to maximize both of, or maximize in proportion. Overall is there for convenience. <br /><br />In your case, the correct solution to your problem is this: Use the Optimizer, set to optimize either Overall or Mitigation, with an additional requirement of Chance to be Crit &lt;= 0, and an additional requirement of Survival &gt;= X, where X depends on the boss in question, and your healers. For example, for just starting Bruttalus, X should be somewhere around 90k, perhaps a bit higher or lower depending on raid.<br />",
    "PostedDate": "2008-04-17T08:22:33.04-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "87571",
    "ThreadId": "26119",
    "Html": "\r\nI have talked about this before, and I think I would like to add a general way to modify the weight of each sub item.  I have added a weight to the bear threat (since the amount of mitigation/survival you want to loose for threat generation is very subjective).  It seems appropriate for any model that has more than one sub point to be able to weight them individually.  <br />",
    "PostedDate": "2008-04-18T07:48:14.08-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]