[
  {
    "Id": "87651",
    "ThreadId": "26210",
    "Html": "\r\nSuch as the <a href=\"http://www.codeplex.com/Rawr/Wiki/View.aspx?title=http%3a%2f%2fwww.wowhead.com%2f%3fitem%3d34473\">http://www.wowhead.com/?item=34473</a> (Commendation of Kael'thas)<br /><br />Its not an activated, yet at the same time its not a random chance.  It happens when you drop below a % health, with a hidden cooldown.  Is there any way to add a functionality to compute the amount of mitigation items like this add?  As it stands, this item in particular is only counted as a survivability item, even though it would add significantly to mitigation, albeit only situationally.<br /><br />Oh, as an aside, is it possible to tell Rawr that an item is unique?  When i try to optimize for mitigation, it likes to tell me to equip two marks of tyranny.  I'd imagine if a boolean indicating uniquness could be added to each item the optimizer would be able to only put one in a given gearset.<br />",
    "PostedDate": "2008-04-18T13:47:12.47-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "87658",
    "ThreadId": "26210",
    "Html": "\r\nRegarding unique items you probably just have outdated data. Just do a refresh of items from armory.<br />",
    "PostedDate": "2008-04-18T14:00:27.803-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "87660",
    "ThreadId": "26210",
    "Html": "\r\nI'll be adding a temporary buff for the CoKt in b14.<br /><br />Mark of Tyranny is in a unique situation. You can only get/have one, but it's not unique. I'll see about adding a special case handler to mark it as unique.<br />",
    "PostedDate": "2008-04-18T14:12:50.443-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "87674",
    "ThreadId": "26210",
    "Html": "\r\nOn the unique front I noticed that the optimizer tries to equip me with two signets of ancient magic from ZA.<br />",
    "PostedDate": "2008-04-18T14:40:25.06-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "87678",
    "ThreadId": "26210",
    "Html": "\r\nIs it different gemmings of it? Perhaps it's counting different gemmings as different items... I'll look into that.<br />",
    "PostedDate": "2008-04-18T14:48:00.857-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "87688",
    "ThreadId": "26210",
    "Html": "\r\nYes it is different gemmings of it<br />",
    "PostedDate": "2008-04-18T16:29:02.43-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]