[
  {
    "Id": "87673",
    "ThreadId": "26220",
    "Html": "\r\nI know the current mana regen of 13.1 is skewing the results for moonkins but what numbers can I put in to fake it to get a idea of what gear/gemmings to change to. Atm I'm guessing adding in a shadow priest regen of 90 seems about right but some confirmation of this would be helpful as I currently have 460 badges and would like to make as informed badge purchases as possible. I do respec healing occasionally for the guild if we are short and those upgrades will be another 400+ badges after the fact so I would like to not respend badges to correct a bad purchase.<br />",
    "PostedDate": "2008-04-18T14:38:10.467-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "88009",
    "ThreadId": "26220",
    "Html": "\r\nThe mana regen in 13.1 isn't really skewed; the time to OOM is definitely correct.  It's actually the DPS calculations that are skewed at the moment.  I understand the desire to use all those nice shiny badges, but if you can hold off for a little bit until the next version comes out, I think it'll be worth your while.  In the meantime, I hear Efejel has updated his spreadsheet over at Elitist Jerks if you want to use it until Rawr b14 is released.<br />",
    "PostedDate": "2008-04-21T05:30:05.38-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "88077",
    "ThreadId": "26220",
    "Html": "\r\nI have found if I have a S.Priest with about 230 MP5 (I got this number from another spreadsheet based on a priest doing about 1000DPS) I not only never run out of mana, I never need to drink a potion or use innervate.  I tested this further this weekend in our weekly SSC clear.  I only used Innervate once and that was on Tidewalker.  I got grave 3 times and all 3 I shifted to cat to save fall damage, healed myself and back into moonkin, after the 3rd one I was pretty low so I innervated (with weapon swap) back to full mana and finished him off.<br /><br />If you set the priest mana return to 230, and remove the other check boxes, I feel you will be pretty satisified with the results.  I show that the new crit cloth badge gloves from SSO vendor will be a huge upgrade and also the crit cloth pants.  And also the Cloth robe from heroic Kael.  Those are what I am aiming for.<br /><br />As a side note, I have mine set up to always assume I am in an Elem shammy group w/S.Priest so my +hit requirement is very low.<br /><br /><br />Another thing, Windhawk set bonus isnt modelled anywhere as far as I know.  It is only a minimal 8mp5 but if you are modelling for a 10 man or even 5 man, you cant reliably expect to have a priest or even pally buffs to offset your mana usage.  Could this be added somewhere in the future?  I intend to have it replace in a few weeks anyway, but it could still be useful for your average kara/ZA boomkin.<br />",
    "PostedDate": "2008-04-21T10:18:53.03-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "88079",
    "ThreadId": "26220",
    "Html": "\r\nAnother thing for Dopefish, the DPS calcs you speak of that are skewed, would that be skewed to be way higher than reality?  My current gear shows I should be able to do around 1400DPS with a MF/SFx4 rotation.  In reality I am more likely to do 700-750DPS.  I realized right away that my gear should in no way produce 1400DPS, but I had not run a raid as Moonkin until this past week, so I had nothing to compare to.  Those are the numbers I produced, so I assume its somehow roughly double in your calcs?  It is still all relative, and an upgrade is still an upgrade, regardless the numbers.<br /><br />Also all other models now show numbers in raw DPS rather than some obscure 5 to 6 figure number, will this also be implemented in 14?<br />",
    "PostedDate": "2008-04-21T10:31:23.47-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "88496",
    "ThreadId": "26220",
    "Html": "\r\nWindhawk set bonus has been added for b14.  My raiding Kara boomkin has the set, so I kind of had to model it at some point.  As for the skewing, I'm not sure where the numbers actually lie with respect to reality.  All I know is that in beta 14, the answers given by the moonkin spell calculation engine should be considered the final authority.  The moonkin model displays its numbers in terms of total damage done during the fight.  If the other models show numbers in raw DPS, I can certainly do that.<br />",
    "PostedDate": "2008-04-23T07:04:07.65-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "88526",
    "ThreadId": "26220",
    "Html": "<br /><div class=\"quote\" style=\"border: dotted .1em #aaa; border-left: none; border-right: none; font-style: italic; margin: 1em 0em 2.5em 3em;padding: .2em;\"><br />dopefish wrote:<br />Windhawk set bonus has been added for b14.  My raiding Kara boomkin has the set, so I kind of had to model it at some point.  As for the skewing, I'm not sure where the numbers actually lie with respect to reality.  All I know is that in beta 14, the answers given by the moonkin spell calculation engine should be considered the final authority.  The moonkin model displays its numbers in terms of total damage done during the fight.  If the other models show numbers in raw DPS, I can certainly do that.<br /><br /></div><br />Aye, for consistency, please display overall in DPS. (Though it should be just a simple matter of your total damage divided by fight duration)<br />",
    "PostedDate": "2008-04-23T08:36:16.427-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "88547",
    "ThreadId": "26220",
    "Html": "\r\nThanks for the info guys.  I am however confused, currently just importing my toon rawr 13.1 puts a really really heavy weight on mana regen stats (int, spirit, mp5) and it also says I will go OOM in like 2 minutes which doesn't really happen.  In fact ATM i very rarely run out of mana.  If just the dps stat is messed up why is healing gear and int gems being put up as top picks for increasing my dmg?  Could I just being doing something horribly retarded in my use of the program?<br /><br />US Kilashandra Madoran<br />",
    "PostedDate": "2008-04-23T10:06:04.43-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]