[
  {
    "Id": "637605",
    "ThreadId": "263968",
    "Html": "\r\n<p>Rawr 4.2.0.0, TankDK, the Rotation Report seems to die about 2/3 the way through and tells me to spam Rune Strike 30 times followed by White Swing for about 50 times, to finish out the 124 second rotation. &nbsp;While it's unlikely I'd ever follow that recommendation,\r\n I do wonder if this is evidence of an underlying issue that might affect its evaluation of gear. &nbsp;If the generation attacks look like that for half the rotation, and they're reported from the calculations, it makes sense that the gear values could be\r\n similarly affected.</p>\r\n<p>I'm posting this in discussion instead of issue tracker because this may not be a bug at all, so I'm just seeking feedback. &nbsp;If someone indicates this is a bug, I will gladly created a bug report.</p>\r\n<p>Cheers</p>\r\n",
    "PostedDate": "2011-07-05T09:45:57.757-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "637614",
    "ThreadId": "263968",
    "Html": "<p>The rotation reports are specifically NOT in order of execution.&nbsp; Also, the rotation has only a small effect on the overall gear evaluation for TankDK, given that Survival and Avoidance (mitigation) has nothing to do with the rotation, and Burst comes not only from DS+Blood Shield, but also on-use trinkets and abilities. &nbsp; If you have a concern about the gear evaluation, please be specific.</p>",
    "PostedDate": "2011-07-05T09:56:05.737-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "637621",
    "ThreadId": "263968",
    "Html": "<p>Thank you, this answers my question. &nbsp;I have no concerns with gear evaluation other than that if the rotation report was actually supposed to be ordered, that something underlying was up. &nbsp;Since that's not the case, there is no issue.</p>\r\n<p>As long as I'm here, I do often wonder why the negative side of the graph is often empty (large negative values) even though no gear is listed with any negative values. &nbsp;It doesn't affect usability in any way, just looks strange. &nbsp;Maybe that's a question for the core devs.</p>",
    "PostedDate": "2011-07-05T10:04:18.107-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "637622",
    "ThreadId": "263968",
    "Html": "<p>I'm with you on that.&nbsp; I haven't had the time to look into it just yet since there's always items higher on my list, but I am keeping my eye on that weird negative thing.</p>",
    "PostedDate": "2011-07-05T10:06:38.953-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]