[
  {
    "Id": "639454",
    "ThreadId": "264422",
    "Html": "\r\n<p>I used to use Rawr a lot in the Wrath expansion and am now trying again, but the problem is that I cannot seem to understand the stats that Rawr is displaying. I loaded my character from the battle.net and everything looks fine, until I look at my stats;\r\n unbuffed I have 1717 dodge rating but Rawr says I have 2202's worth. Parry is similar, except way too low. Block is again the same but like dodge, too high. I could not find any proper explanation for how Rawr calculates the stats, so could use some help understanding\r\n these figures.</p>\r\n",
    "PostedDate": "2011-07-08T07:02:04.673-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "639618",
    "ThreadId": "264422",
    "Html": "<p>do you have any trinkets that adds Dodge? If so you are probably seeing and averaging out of dodge. Say a trinket procs 1000 dodge rating for 30 seconds with a two minute cooldown. This would average out to 250 Dodge rating that would be automatically be added to your character sheet. Two other things, this needs to be posed in the Issue Tracker with a) what model your working (are you using Prot Pally or Prot Warrior) b) a copy of your Rawr character file (we do have a file upload feature for our issue trackers).</p>",
    "PostedDate": "2011-07-08T11:40:52.807-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "639654",
    "ThreadId": "264422",
    "Html": "<p>Make sure to double check correct talents were loaded. There is currently a problem with loading talents from battle.net that we're in the process of fixing.</p>",
    "PostedDate": "2011-07-08T13:00:59.5-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "639820",
    "ThreadId": "264422",
    "Html": "<p>Thanks for the tips. I actually managed to solve the dodge issue, as per Hinalover's suggestion. The two items that were interfering were my Mandible of Beth'tilac and Vial of Stolen Memories. The vial obviously has a dodge proc and 1605 rating for 20 sec, on 2min CD. The mandible is enchanted with Windwalk, which I assume is also adding to the averaging of stats. However, parry and block are still off and I cannot find the cause. I did check the talents, per Kavan's suggestion, and sure enough they were not loaded and had to assign them manually. It did not solve the issue but still, very good to know.</p>\r\n<p>I will post this on the Issue Tracker, as soon as I'm finished with this post.</p>\r\n<p>Just one question, about the averaging of stats; is it a feature that can be manually turned off?</p>",
    "PostedDate": "2011-07-09T03:36:46.107-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]