[
  {
    "Id": "88878",
    "ThreadId": "26572",
    "Html": "\r\nWhen you use the optimizer and it completes, it tells you that it just made a gear set with x score (and your current one has y score). I had two questions. The first was what this score exactly meant. I am using Rawr.Mage, and I know when comparing gear, it gives you the score in dps, so I assumed that's what it meant. However, when I looked on the list of spell rotations, my score was not located there. So, I was wondering what was actually used to figure this out. Second, and also related was the question of whether or not there was a convenient place to locate this number. I like to play around with gear myself, and I'd like to check to see how the overall number changed in comparison to my last gear set, but I'm not sure if a summary is even available outside the optimizer.<br />",
    "PostedDate": "2008-04-24T16:45:58.657-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "88898",
    "ThreadId": "26572",
    "Html": "\r\nThe result of the optimizer is in terms of whatever you optimize. As a Mage, that's just DPS. And there's a 'DPS' line on the main stats tab, which is what you're looking for.<br />",
    "PostedDate": "2008-04-24T19:56:23.997-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "88911",
    "ThreadId": "26572",
    "Html": "\r\nBoy, am I stupid. I have no idea how I missed that. How is this dps number calculated anyway? Like I said before, it doesn't match up with any of the dps numbers on the rotations section. Does it add in dps from the cooldowns and such based on the fight length?<br />",
    "PostedDate": "2008-04-24T21:10:41.23-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "88926",
    "ThreadId": "26572",
    "Html": "\r\nMouse over the Spell Cycles star, just below DPS.<br />",
    "PostedDate": "2008-04-24T23:43:41.693-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "89062",
    "ThreadId": "26572",
    "Html": "\r\nOkay, that's what I figured. Thanks for the clarifications.<br />",
    "PostedDate": "2008-04-25T10:57:46.167-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]