[
  {
    "Id": "645287",
    "ThreadId": "265966",
    "Html": "\r\n<p>We have transitioned to the new Blizzard API for pulling character data. Please post any issues related to errors that might have been introduced by this change.</p>\r\n",
    "PostedDate": "2011-07-20T19:24:45.837-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "653926",
    "ThreadId": "265966",
    "Html": "<p>CN realm can not load from battle.net, the ok button on load character window is unclickable, it seems rawr need to check realm name.</p>",
    "PostedDate": "2011-08-06T23:15:06.683-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "654128",
    "ThreadId": "265966",
    "Html": "<p>I'll double check the realm names later today</p>\n<p>http://www.battlenet.com.cn/wow/zh/status - as reference so that I don't forget</p>\n<p>It could very well be that we didn't convert the characters to unicode when we try to use the API.</p>\n<p>If anyone wants to take a look before I get there, the list of CN servers is located here</p>\n<p>http://rawr.codeplex.com/SourceControl/changeset/view/62380#955924</p>",
    "PostedDate": "2011-08-07T11:24:05.823-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "654347",
    "ThreadId": "265966",
    "Html": "<p>Okay, I've update the server list to include all missing server names. The Chinese servers we were missing close to 200 server names, while the Tiawanese servers, we were only missing about 20.</p>\n<p>If you find any servers that are not listed after the next release, please let us know. I was basing ALL of the changes on the Chinese and Tiawanese realm status pages.</p>\n<p>When I mean we were missing about 200 servers for the Chinese, I'm talking about we had about 150 and the Chinese have about 350 servers. That is more than what the US has O_o. GG for having 1.3 Billion population (yes I know not all play WoW but I was just kindof shocked at the number of servers).</p>",
    "PostedDate": "2011-08-08T01:14:30.293-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "654668",
    "ThreadId": "265966",
    "Html": "<p>Due to Export laws (and I have seen this happen to other Busnisses before) the server hardware In China may not be the same high end equipment that is used elsewhere.&nbsp; Which would lead to needing more servers&nbsp;for X number of users.&nbsp; I it just a theory, I have no information on what Blizzard was able to export into China.</p>",
    "PostedDate": "2011-08-08T09:48:41.67-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "654673",
    "ThreadId": "265966",
    "Html": "<p>If I remember correctly, Blizz doesn't actually own the Chinese operation.&nbsp; I believe they license it to a Chinese company, so that decision could be a \"local\" decision and outside of Blizz's hands.</p>",
    "PostedDate": "2011-08-08T09:56:42.457-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "655346",
    "ThreadId": "265966",
    "Html": "<p>Shazear, you are most likely correct.&nbsp;&nbsp; China generally does exactly that.&nbsp;&nbsp;This still gives weight to the idea that each individual server is of a lower 'power' then the ones the Blizz generally uses. and thus the number of 'users' per realm is lower.&nbsp;&nbsp; I think I might do some digging and see if I can get 'number of subscriber' information out of the China realms, but I doubt I will be able to find anything solid.&nbsp; It is just for my own curiosity.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2011-08-09T10:16:03.437-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]