[
  {
    "Id": "645470",
    "ThreadId": "266024",
    "Html": "\r\n<p>I had make an issue report that Pyroblast(normal) is missing from the stats page since it may be needed for gimmick fights like Alysrazor but then I noticed a person on EJ talking about seeing it in Rawr. So, is it possible to see Fireball and Pyroblast\r\n and compare based on different haste multipliers and how?</p>\r\n<p>Also, is the Pyroblast DOT portion included?</p>\r\n",
    "PostedDate": "2011-07-21T04:23:59.747-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "645734",
    "ThreadId": "266024",
    "Html": "<p>You probably can't do it in an easy way. The dps number of the Pyroblast! that is listed includes the full dot, so if you were to spam it the number would be different. I can add the spammed version of&nbsp;normal Pyroblast.</p>\r\n<p>To properly model Alysrazor we'd need to create a boss profile that included timing information for the stacking buffs that you get and included a spammed Pyroblast cycle and then the solver would be able to tell when to use which. If there is a lot of interest in this I can probably add something. By the way is normal Pyroblast able to proc Pyroblast!? I'm currently assuming it does, but just want to make sure.</p>",
    "PostedDate": "2011-07-21T12:14:00.12-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "645755",
    "ThreadId": "266024",
    "Html": "<p>I'm working on getting the boss handlers finished for T12.&nbsp; I agree there may need to be some design tweaks to properly handle buffs/debuffs on the player and the boss.</p>",
    "PostedDate": "2011-07-21T12:41:50.55-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "645799",
    "ThreadId": "266024",
    "Html": "<blockquote style=\"border: solid .1em #ccc; font-style: italic; margin: .25em 1em 0 1em; padding: 0 .25em 0 .25em;\"><strong>Kavan wrote:</strong></blockquote>\r\n<blockquote style=\"border: solid .1em #ccc; font-style: italic; margin: .25em 1em 0 1em; padding: 0 .25em 0 .25em;\">By the way is normal Pyroblast able to proc Pyroblast!? I'm currently assuming it does, but just want to make sure.</blockquote>\r\n<p>I can confirm to you that it does. Whenever I do go up as Fire and get to the point of Pyroblast spamming it procs.</p>",
    "PostedDate": "2011-07-21T14:08:24.38-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]