[
  {
    "Id": "89073",
    "ThreadId": "26620",
    "Html": "\r\nWould it be possible to get average hit and crit damage values added to the spell tooltips for Rawr: Mage.<br /><br />I realize DPS is listed, and it's really the more important factor, but seeing those values would still be helpful.<br />",
    "PostedDate": "2008-04-25T12:02:54.653-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "89080",
    "ThreadId": "26620",
    "Html": "\r\nThis is a good point. I actually used this in the spreadsheet version of the model to verify how accurate the model was by comparing in game spell ranges with what model predicted. I'll see about adding this in for next release.<br />",
    "PostedDate": "2008-04-25T12:15:38.403-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "89085",
    "ThreadId": "26620",
    "Html": "\r\nMuch appreciated.<br /><br />In addition to simply being able to theorycraft for \"big numbers\", I do find these calculations useful in determining things like whether it's better to make a pull (solo) with Pyroblast of Fireball, as DPS values for Pyroblast tend to get skewed by the long casting time (but that doesn't matter for a pull).<br /><br /><b>Which reminds me:</b> Can you please add Pyroblast as a spell listing.<br /><br />I know it's a spell that'll never be used in a raid, but it is somewhat useful for pulls, and it's nice for Rawr: mage to be complete regarding combat spells.<br />",
    "PostedDate": "2008-04-25T12:24:01.347-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "89087",
    "ThreadId": "26620",
    "Html": "\r\nI'll probably add the ranges without passive procs affecting it. Let me know if you have a good reason why you would want it some other way.<br />",
    "PostedDate": "2008-04-25T12:27:17.8-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "89089",
    "ThreadId": "26620",
    "Html": "\r\nYea I'll see about adding Pyroblast.<br />",
    "PostedDate": "2008-04-25T12:28:57.877-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "89090",
    "ThreadId": "26620",
    "Html": "\r\nThat sounds fine. I don't think calculating passive procs really needs to be done for those values.<br /><br />Thanks again.<br />",
    "PostedDate": "2008-04-25T12:30:51.53-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]