[
  {
    "Id": "89860",
    "ThreadId": "26881",
    "Html": "\r\nHi,<br /><br />I love Rawr, my main is a 70 frost mage and I have a 68 druid who will soon become my new main, so you can imagine how Rawr is my new best friend. However, I find myself having to double-check all values for my Mage since it only considers spell power. It's like it assumes I'm spell hit capped (I am not, I'm close at 196) and thinks spell crit does not matter.<br /><br />Maybe I'm using the software wrong, so I'd like to know how other mages deal with the fact that I'd like to use the optimizer and compare gear upgrades while letting Rawr know that my spell hit should be as close as possible to 202 and I should have a healthy dose of spell crit % too (20-25% min).<br /><br />Lastly, why are there so many enchants missing? The chest piece shows Exceptional Mana, which does not even exist in the live game, and my fortitude enchant to boots (yes, even mages need a minimum of health for endgame) does not show up. Do I need to add it manually? How do you guys deal with this? Why not put them all in and let us choose?<br /><br />Thanks for your help, and keep up the great work.<br /><br />Arkayne / Shalansay of Echo Isles<br />",
    "PostedDate": "2008-04-30T07:32:10.44-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "89875",
    "ThreadId": "26881",
    "Html": "\r\n\"...my spell hit should be as close as possible to 202...\"<br /><br />Wow dude, you are waaay over the spell hit cap for Frost. 202 is if you are untalented. Spell hit caps for mages are 76 for Arcane, 126 for Frost, 164 for Fire. And crit has a value which changes based on your other stats.<br /><br />I took care of removing 150mp to chest. Kavan, if there's a lower version, like 100mp, which is worth adding, please do so. Also look into counting stam enchants as relevant to mages. What other \"so many\" enchants are missing?<br />",
    "PostedDate": "2008-04-30T08:34:25.087-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "89948",
    "ThreadId": "26881",
    "Html": "\r\nSee, I told you there was a reason why I added sta to HasRelevantStats, I just forgot what it was. :) For gear I don't want it, but for buffs and enchants if it is only stamina then I want it. I'll see what I can do.<br />",
    "PostedDate": "2008-04-30T15:43:27.983-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "89956",
    "ThreadId": "26881",
    "Html": "<br /><div class=\"quote\" style=\"border: dotted .1em #aaa; border-left: none; border-right: none; font-style: italic; margin: 1em 0em 2.5em 3em;padding: .2em;\"><br />Astrylian wrote:<br />\"...my spell hit should be as close as possible to 202...\"<br /><br />Wow dude, you are waaay over the spell hit cap for Frost. 202 is if you are untalented. Spell hit caps for mages are 76 for Arcane, 126 for Frost, 164 for Fire. And crit has a value which changes based on your other stats.<br /><br />I took care of removing 150mp to chest. Kavan, if there's a lower version, like 100mp, which is worth adding, please do so. Also look into counting stam enchants as relevant to mages. What other \"so many\" enchants are missing?<br /><br /></div><br />You mean the 3/3 I have in Elemental Precision? Man, I forgot that \"Resist\" actually means \"missed\" in WoW... you are right. And I thought I knew my class well. I guess I can finally stop using my Scryer's Bloodgem and regem a few piecesto boost my damage and crit %. Good to know!!!!<br /><br />There is indeed a +100 Mana enchant, but no +150 yet. The +150 is in the game code and shows up in many sites because it was in the beta, but is nowhere in live. I will go over the enchant list and give you suggestions on what else I feel should be added to potential mage enchants.<br />",
    "PostedDate": "2008-04-30T16:58:43.25-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "90285",
    "ThreadId": "26881",
    "Html": "\r\nHow about subtlety to cloak? You are calculating tps, after all.<br />",
    "PostedDate": "2008-05-02T13:20:56.453-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "90287",
    "ThreadId": "26881",
    "Html": "\r\nIt's in for b14.<br />",
    "PostedDate": "2008-05-02T13:36:05.817-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "90703",
    "ThreadId": "26881",
    "Html": "<br /><br /><div class=\"quote\" style=\"border: dotted .1em #aaa; border-left: none; border-right: none; font-style: italic; margin: 1em 0em 2.5em 3em;padding: .2em;\"><br /><br />You mean the 3/3 I have in Elemental Precision? Man, I forgot that \"Resist\" actually means \"missed\" in WoW... you are right. And I thought I knew my class well. I guess I can finally stop using my Scryer's Bloodgem and regem a few piecesto boost my damage and crit %. Good to know!!!!<br /><br />There is indeed a +100 Mana enchant, but no +150 yet. The +150 is in the game code and shows up in many sites because it was in the beta, but is nowhere in live. I will go over the enchant list and give you suggestions on what else I feel should be added to potential mage enchants.<br /><br /></div><br />first off 100 or 150 mana to chest is LOL. get the +6 stats to chest. this way you get 6 to stam int and spirit all at once. get boar's speed on your boots. DON'T get rid of the bloodgem trinket. trade out some of your hit gems for crit/dmg gems. if your a full fire mage once you hit the 34-37% crit start stackin straight +9 or if you can get your hands on them the +12 dmg gems and put them in your sockets. as far as stam enchants...LOL again. your a ranged class. if you get hit its one of 3 things....1) your tank(s) suck at holding aggro. 2) your doin what your class is ment to do...hurt everything fast and you pulled before it died. 3) you need to learn to watch your threat meter better. now if you want ideas on what to do with your mage as far as gear goes. head to elitistjerks.com and look through the threads there. or if you wanna see what an Arc/Fire mage looks like in the badge armor. look up Kanin from the guild Tindi Losi. thats me. as a mage of that spec i'm at 28% crit with what all i have at the moment. once i get a few more things i need i think i can break over the 1200 bonus dmg unbuffed and near or barly over the 1300 when raid buffed.<br /><br />But since your more of a frost mage. try to get as close to 30% crit the load dmg gems.<br />",
    "PostedDate": "2008-05-06T01:59:41.91-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "91362",
    "ThreadId": "26881",
    "Html": "<br /><div class=\"quote\" style=\"border: dotted .1em #aaa; border-left: none; border-right: none; font-style: italic; margin: 1em 0em 2.5em 3em;padding: .2em;\"><br />Kanin wrote:<br /><br />LOL again. your a ranged class. if you get hit its one of 3 things....1) your tank(s) suck at holding aggro. 2) your doin what your class is ment to do...hurt everything fast and you pulled before it died. 3) you need to learn to watch your threat meter better.<br /><br /><br /></div><br />Ok, first of all, if you look at any site that provides minimum stats for Kara, Heroics, ZA, etc you'll notice that even mages have a minimum health requirement. It's not super high but it still has to be met...<br /><br />There are many encounters that bypass the threat table, I know enough about my class to play it, thank you very much. I know you were just dying to plug your toon and all the awesome badge gear you have since it's probably the only thing you have going good in your amazingly fulfilling life, so I'll let it slide. But think back to Shade of Aran... his aggro table is meaningless, he spams arcane missiles, frostbolt and fireball at random arouond him, and yes, as a mage you can get hit too. How about those flares the Curator sends off? Do they have a threat table? Threat tables are not absolute all the time, my tanks are very good, but damage happens. Bosses AoE in encounters, even the best mage with the best tanks needs healing sometimes, we are not completely immune to being hit.<br /><br />And if you do not believe me, ask your top healer, and ask them if they ever heal a mage. They'll agree, and not because the mage or tanks suck, because raid encounters are not rock-paper-scissors. If the mage gets pounded on repeatedly, then yes, there is a problem. And while Vitality is ok for boots, feet are a weak slot in terms of enchant choices for mages, and I'm an enchanter, and I do not have the Vitality recipe, so in the meantime, I use Fortitude.<br /><br />Lastly, Rawr can help me plan my PvP gear too... and player hordes and opposing arena teams could not care less about me being a mage and not supposed to be hit, in fact, being a mage means I have a big billseye on my chest in arena. I think stamina enchants should be availabel to all classes supported by Rawr.<br />",
    "PostedDate": "2008-05-08T17:44:46.083-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]