[
  {
    "Id": "657333",
    "ThreadId": "268890",
    "Html": "<p>I thought I would like to point everyone to this thread about the Dragonwrath's proc:</p>\n<p>http://us.battle.net/wow/en/forum/topic/2973251647</p>\n<p>From what it sounds like:</p>\n<p>a) Direct damage spells with proc at the exact same time.</p>\n<p>14:40:28&gt; Siiz's Ice Lance hits Training Dummy for 1 Frost.(10466 Overkill) (Critical)<br /> 14:40:28&gt; Siiz's Ice Lance hits Training Dummy for 1 Frost.(10418 Overkill) (Critical)</p>\n<p>b) Direct damage spells can cause the copy to crit and visa-versa</p>\n<p>14:20:55&gt; Siiz's Ice Lance hits Training Dummy for 1 Frost.(5331 Overkill)<br /> 14:20:55&gt; Siiz's Ice Lance hits Training Dummy for 1 Frost.(11015 Overkill) (Critical)</p>\n<p>14:25:23&gt; Siiz's Frostbolt hits Training Dummy for 1 Frost.(27912 Overkill) (Critical)<br /> 14:25:24&gt; Siiz's Frostbolt hits Training Dummy for 1 Frost.(13511 Overkill)</p>\n<p>c) Dots are treated on each tick but given a new spell. The new spell cannot crit independently from the dot</p>\n<p>15:23:01&gt; Training Dummy suffers 1 Fire damage from Siiz's Living Bomb.(5453 Overkill)<br /> 15:23:02&gt; Siiz's Wrath of Tarecgosa hits Training Dummy for 1 Arcane.(5453 Overkill)<br /> 15:23:04&gt; Training Dummy suffers 1 Fire damage from Siiz's Living Bomb.(5454 Overkill)<br /> 15:23:05&gt; Siiz's Wrath of Tarecgosa hits Training Dummy for 1 Arcane.(5454 Overkill)<br /> 15:23:07&gt; Training Dummy suffers 1 Fire damage from Siiz's Living Bomb.(5453 Overkill)<br /> 15:23:07&gt; Siiz's Wrath of Tarecgosa hits Training Dummy for 1 Arcane.(5453 Overkill)</p>\n<p>15:22:31&gt; Training Dummy suffers 1 Fire damage from Siiz's Living Bomb.(12431 Overkill) (Critical)<br /> 15:22:31&gt; Siiz gains Siiz's Electrical Charge (4).<br /> 15:22:32&gt; Siiz's Wrath of Tarecgosa hits Training Dummy for 1 Arcane.(12431 Overkill)</p>\n<p>d) If a direct damage copied spell causes a dot (such as a critical strike Fireball proccing Ignite) the dot will get affected by the staff</p>\n<p>Lastly for mages, If a mage has two FoF procs up, the first ice lance will eliminate the first charge and the proc will eliminate the second charge.</p>\n<p>Edit: a shit ton of info is coming out left and right Deep Freeze proc not able to take advantage of shatter if there is only one Fingers of Frost proc, Procs can miss.</p>\n<p>For Moonkin, Happyjojj over on the EU servers has started doing some Boomkin testing. You can check his thoughts so far here:</p>\n<p>http://eu.battle.net/wow/en/forum/topic/2504844873</p>\n<p>If anyone has any questions I've been trying to keep an eye out for all info coming out about the proc and all the idiosyncrasies with the proc.</p>\n<p>Right now, they are saying mages are being given a 10% chance to proc, Boomkins are currently being set at 11% chance to proc.</p>",
    "PostedDate": "2011-08-12T11:50:24.407-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "658311",
    "ThreadId": "268890",
    "Html": "<p>The worrisome thing for Moonkin is that procs of Wrath, Starfire, and Starsurge do generate Eclipse energy.&nbsp; (Thankfully, proc'd Moonfires with Lunar Shower do not, which removes one possibly considerable complexity.)&nbsp; Currently I'm not modeling this effect, but it would have the net effect of a very large haste proc (essentially eliminating 1 cast time's worth of casting from the cycle each time it procs).</p>",
    "PostedDate": "2011-08-15T06:10:59.243-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "658590",
    "ThreadId": "268890",
    "Html": "<p>I'll put this here for when we get an Elemental dev (or I suddenly get enough time to do it myself):</p>\r\n<ul>\r\n<li>An Elemental Overload (Mastery) proc can proc the staff's effect</li>\r\n<li>The staff's effect can't proc Elemental Overload</li>\r\n</ul>\r\n<p>This is just (highly educated)conjecture at this stage as I don't believe there is a Shaman with the staff.</p>",
    "PostedDate": "2011-08-15T16:28:35.593-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]