[
  {
    "Id": "90020",
    "ThreadId": "26926",
    "Html": "\r\nHey,<br /><br />I've been using Rawr now for my druid and mage and I thing it's absolutely great.<br /><br />I've been looking for anything remotely similar for my enhance shaman but have not been able to find one. Does anybody have plans for the module? Unfortunately I can't do anything with C# (Java, Perl, Bash, etc would work but just not C# :/ ) - otherwise I'd definitely help in creating one!<br /><br />Cheers,<br /><br />  Ciran / Barthilas, Calada / Nagrand<br />",
    "PostedDate": "2008-05-01T06:21:02.343-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "90028",
    "ThreadId": "26926",
    "Html": "\r\nAs far as I know, there is no closed-form (i.e. can be distilled to a series of computable equations) solution to the problem of enhance shaman DPS.  Without such a solution, the only tool available is simulations, of which Yo's simulator (available from Elitist Jerks) is an excellent pre-existing example.  Rawr is not really built to be a simulator, so unless a closed-form solution can be found, there may never be a Rawr.Enhancement.<br />",
    "PostedDate": "2008-05-01T06:48:46.04-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "90037",
    "ThreadId": "26926",
    "Html": "\r\nActually, the main problem with Enhancement dps is getting good estimates of Windfury proc rates, Flurry uptimes and Unleashed Rage uptimes. These depend only on MH and OH speeds, and your crit rate, assuming that you always have enough mana to keep stormstrike up. While these are not solved, it should be possible to create tables to approximate these values from simulations that are close enough to do reasonable estimations, and use them to create a good and fast approximation.<br />",
    "PostedDate": "2008-05-01T07:40:26.733-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "90046",
    "ThreadId": "26926",
    "Html": "\r\nAye, there was actually some testing done on this that showed that those values scaled in an easily predictable way. However, nobody actually took that and started a Rawr.EnhSham. If anyone would like to, let me know.<br />",
    "PostedDate": "2008-05-01T08:02:16.343-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "90572",
    "ThreadId": "26926",
    "Html": "\r\nWhat would the level of competency be necessary for someone to take up the EnhSham model?  As in, would someone need schooling at the least, or would someone be able to start from knowing 0 and learning specifically for this.<br /><br />Personally, I have no problem learning this.  While I understand simulations were necessary to fine the inner-workings, it shouldn't be that hard to take something like Yo's simulator, or the Shamulator and correlate a % to a certain Hit, Expertise, or haste percent.  The only issue would be if the numbers didn't stack up, like increasing hit and expertise increased X, but was more then just hit or expertise alone.  <br /><br />There I go, rambling...I do too much theorycraft sometimes.  Eagerly awaiting response to the competency question.<br />",
    "PostedDate": "2008-05-05T09:30:49.79-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "90585",
    "ThreadId": "26926",
    "Html": "\r\nSchooling is never necessary for any development project (schooling is commonly a hinderance, not a benefit in the coding world). You'll need C# programming knowledge, which you can learn online.<br />",
    "PostedDate": "2008-05-05T10:23:25.74-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]