[
  {
    "Id": "90026",
    "ThreadId": "26928",
    "Html": "\r\nI'm currently preparing to begin work on Rawr.Tankadin.  I expect the work to go very quickly - avoidance and survival are well-established calculations, and I've been working on the threat calculations in my notebook when I haven't been doing real work or working on Rawr.Moonkin.  My question to the tankadin community (if any are reading this) is, what features would you like to see in Rawr.Tankadin besides the basic avoidance/survival/threat gear comparisons?<br />",
    "PostedDate": "2008-05-01T06:46:24.167-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "90091",
    "ThreadId": "26928",
    "Html": "\r\nJust downloaded Rawr the other day so still figuring out all its capabilities so I defer the right to come back and change some of these suggestions.  Tankadin specific things I can think of would be if the tankadin has Ardent Defender at what point will it kick in based on new gear setup.  Just from experience, gearing at 70 has three stages.  First get to uncritable at 490 defense.  Next get to uncrushable at 102.4% combined mitigation.  Final phase is maxing health and threat through a combo of spell damage, spell hit, melee hit and expertise.  Threat per second calculation options based on group makeup like the 10-12% bonus to holy damage with a retribution pally in the group or flat 50 TPS with a grace of air totem.  If you know you have those two options in your group makeup maybe you focus more on mitigation stats over threat stats.  Something that calculates when reckoning starts to become obsolete as a threat mechanic would be nice too.  At some point mitigation starts to cut into the proc rate of reckoning that spending those 5 points elsewhere becomes a relevant decision.  And option to define the type of tanking being done.  Besides resist sets, I carry a threat set (max spell damage while still maintaining uncrushable or uncritable) and AOE tanking set (focus on damage return and block gear). Going to link to this message in the maintankadin.failsafedesign.com forums to see if I can get you some more feedback.  You can also find a lot of useful theorycraft info there if you are looking for specific calculations.<br />",
    "PostedDate": "2008-05-01T12:45:55.017-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "90094",
    "ThreadId": "26928",
    "Html": "\r\nThe calculations I'm not so worried about.  All those features should be included, although I haven't yet decided how I'm going to display the difference between having Reckoning and not having it.  I am going to expose resistances and uncrittability to the optimizer to help with creating resist sets.  The other exposed interfaces will be the usual avoidance, survival, threat modules; mixing and matching those should let you create MT/OT (threat)/AOE tank sets.  I won't have the user set what \"type\" of tanking will be done, it'll be up to them to decide what they want to emphasize in their gear, but you will be able to set the expected incoming attack speed to deal with Holy Shield/Blessing of Sanctuary/Retribution Aura/shield spikes.<br />",
    "PostedDate": "2008-05-01T13:01:53.997-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "90399",
    "ThreadId": "26928",
    "Html": "<div class=\"quote\" style=\"border: dotted .1em #aaa; border-left: none; border-right: none; font-style: italic; margin: 1em 0em 2.5em 3em;padding: .2em;\"><br />dopefish wrote:<br />The calculations I'm not so worried about.  All those features should be included, although I haven't yet decided how I'm going to display the difference between having Reckoning and not having it.  I am going to expose resistances and uncrittability to the optimizer to help with creating resist sets.  The other exposed interfaces will be the usual avoidance, survival, threat modules; mixing and matching those should let you create MT/OT (threat)/AOE tank sets.  I won't have the user set what \"type\" of tanking will be done, it'll be up to them to decide what they want to emphasize in their gear, but you will be able to set the expected incoming attack speed to deal with Holy Shield/Blessing of Sanctuary/Retribution Aura/shield spikes.<br /><br /></div>I recently actually started making one my self. Currently just done making all the basic calculations. Planning on finishing the initial version next week.<br /><br />A couple things I didn't see you mention:<br /><ul><li>Will you also be able to specify the average incoming damage (pre armor) per hit so you can properly value block?</li><li>Have some interface to select what talents you have, so you can compare how it changes your threat and survivability. Since prot paladins can't pick up nearly all the talents that they want to.</li><li>Seperate AoE threat from single target threat. Because on a fight like Felmyst it really doesn't matter my threat on the target I am judging or auto swinging at. Since I won't be able to distribute it between all the mobs.</li></ul>",
    "PostedDate": "2008-05-03T20:17:42.29-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "90405",
    "ThreadId": "26928",
    "Html": "\r\nNo, no, you go ahead and take care of it.  I didn't know there was anyone else on the project.  It'll help me keep my attention more focused on Rawr.Moonkin. :) Good luck and I hope to be using your product soon.<br />",
    "PostedDate": "2008-05-03T23:47:24.063-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "91559",
    "ThreadId": "26928",
    "Html": "\r\nI can help with this, however help is needed.<br />",
    "PostedDate": "2008-05-09T12:44:07.287-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "91726",
    "ThreadId": "26928",
    "Html": "<br>\r\n<div style=\"border-style:dotted none;border-color:rgb(170, 170, 170) -moz-use-text-color;border-width:0.1em medium;margin:1em 0em 2.5em 3em;padding:0.2em;font-style:italic\"><br>\r\nCae wrote:<br>\r\nI can help with this, however help is needed.<br>\r\n</div>\r\nCurrently I need to finish the Threat component and support for special gear procs/bonuses. Threat is mostly done, just need to put in support for melee hit/damage mechanics and double check my formulas are working properly. So I mainly need to finish the procs, if you want to help with that you can toss me an AIM at endoscient.<br>\r\n",
    "PostedDate": "2008-05-10T18:49:18.867-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]