[
  {
    "Id": "90474",
    "ThreadId": "27110",
    "Html": "\r\nWhile I do understand that beta versions are indeed meant mainly for testing, is there a way to try the currently being worked on part?  I've done this for years for auctioneer, and while I understand it would be very buggy, I would indeed love to learn to use the certain aspects of the newer models (i.e. Tankadin, Prot Warrior, and such) before they are indeed fully created, so I can be familiar with how to change the settings to get my desired results for the people in my raid I help with it.<br /><br />Mainly, I strip down the items to be only those attainable from normal instances, non-exhalted faction items, and all quest items 60-70 to get the best upgrade \"path\", and would love to be able to do this with more class/specs.  Rawr gives much more tangible information then any spreadsheet I have, and has indeed become an invaluable tool in helping me teach players to be fresh-raiders.<br /><br />In essence, if there could be an alpha version as a link under the beta version, it would be very nice to some of us.  Now, I have no idea how the process works, and if it has to all be collected and compiled, I can see how that would be hard to do alpha's for, but if its people updating parts, maybe if a alpha compilation could be thrown up every couple of days (or x amount of changes), I can guarentee a lot of people would enjoy it, with the obvious caveat of not putting in bug reports for the alpha, just the beta.<br />",
    "PostedDate": "2008-05-04T21:39:20.093-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "90475",
    "ThreadId": "27110",
    "Html": "\r\nThe current source code, as we update it, is available, just like auctioneer, on the Source Code tab here. Only difference is that you need to compile it... You can download Visual C# 2008 from Microsoft for free, just search on microsoft.com for it, should be easy to find. Kinda a big download, but you can use it to compile Rawr. You probably don't even need the whole thing, just the compiler program, but I don't know offhand how to separate that out.<br />",
    "PostedDate": "2008-05-04T21:58:11.18-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "90554",
    "ThreadId": "27110",
    "Html": "\r\nWhat would be the exact name of the program I need?  I tried the C# 2008 Express Edition, but the compiled program wouldn't start (the rawr splash screen was a red X).  Is there a specific download that I didn't get?   Unfortunately, c#, c++, and the like goes right over my head.  <br /><br />Trust me, if I actually did understand how to make these models, I'd be jumping at the chance to to enhancement.<br />",
    "PostedDate": "2008-05-05T08:25:26.57-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "90559",
    "ThreadId": "27110",
    "Html": "\r\nYeah, C# 2008 Express Edition is right... Use it to open the Rawr.sln file, then goto Debug &gt; Start Debugging.<br />",
    "PostedDate": "2008-05-05T08:30:29.63-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]