[
  {
    "Id": "90683",
    "ThreadId": "27179",
    "Html": "\r\nI'd like to use some items in my DPS <u>and</u> in my tanking gear. The problem is that I cannot use the cat enchants in bear modus or the bear ones in cat modus (e.g. for the head the glyph of ferocity). As I'm defense capped I want to optimize my attack power-hit in bear form by using some of my cat stuff.<br /><br />A dual gear setting in Rawr would then be very useful (some way to, let's say, make a cat gear, lock some items, click on a button then have a \"blank\" gear with only the cat locked items for me to make a bear gear (and to have the models change automatically)<br /><br />Or to have a cat gear, lock some items, load a bear gear (the locked items would not be replaced)<br />",
    "PostedDate": "2008-05-05T22:22:48.24-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "90685",
    "ThreadId": "27179",
    "Html": "\r\nYou can already swap between models with one character, how does that not solve this?<br />",
    "PostedDate": "2008-05-05T22:30:56.843-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "91851",
    "ThreadId": "27179",
    "Html": "Between models, yes, but you cannot switch gears within one character, just load another one with no connection with the first.<br>\r\n<br>\r\nIn fact, the data is saved as &quot;gear&quot;, not as &quot;mycharacter with gear&quot;<br>\r\n<br>\r\nI don't know if I make myself clear... a bit hard to explain...<br>\r\n<br>\r\nSay I have a druid, called Animus<br>\r\n<br>\r\nI load the Animus data. Included are my Bear gear (with bear model selected), and my cat gear (with cat model selected). I can switch between the gears just by clicking on a button, the models would change too. I also could lock items in a gear, that would then appear in the other gear too, without any possibility to change them (enchant included). That would also allow me to create different set of gears (even with resist frost or whatever) within one character data, using the optimizer for example (as all the available gear would then have been selected in the list). I could also save the character without any worn gear, just with the available gear list for the optimizer<br>\r\n<br>\r\nJust my 2 cents ;-)<br>\r\n",
    "PostedDate": "2008-05-11T23:52:39.337-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "91927",
    "ThreadId": "27179",
    "Html": "We're not going to have multiple gearsets per character any time soon, if that's what you're asking. You can always just duplicate the character, or use Save As... 'Locking' of slots probably isn't going to be done that way exactly, but we'll try to fill that need in a later version.",
    "PostedDate": "2008-05-12T08:16:03.557-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]