[
  {
    "Id": "673030",
    "ThreadId": "272913",
    "Html": "\r\n<p>I seem to be getting an error using the application. &nbsp;I am not sure if I am doing something wrong or if it's a known issue that I just missed on the issue tracker.</p>\r\n<p>&nbsp;</p>\r\n<p>I have performed the Suggested Fix and continue to receive this error. If I am posting this message without having performed the Suggested Fix I am aware that I am consuming the Developer(s) time in managing my Issue unnecessarily.<br>\r\n== Version: 4.2.4.0 ==<br>\r\n== Error Message ==Object reference not set to an instance of an object.<br>\r\n== StackTrace ==&nbsp; &nbsp;at Rawr.Hunter.StatsHunter.Accumulate(StatsHunter data, Single weight)&nbsp; &nbsp;at Rawr.Hunter.CalculationsHunter.GetSpecialEffectsStats(Character Char, Dictionary`2 triggerIntervals, Dictionary`2 triggerChances, StatsHunter\r\n statsTotal, StatsHunter statsToProcess)<br>\r\n== These are the Steps that I have tried ==[Please fill in steps here]</p>\r\n<p>I tried to reload my information using the addon, also tried loading through battle.net, always coming up with the same issue. &nbsp;Correct me if I'm wrong, I think this means that an item I am wearing isn't able to be found in the database, but that is\r\n just my uneducated guess as I haven't really used this. &nbsp;I have loaded my death knight alt into this program and it worked without a glitch.</p>\r\n",
    "PostedDate": "2011-09-16T20:01:28.71-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "673144",
    "ThreadId": "272913",
    "Html": "<p>Hunter is non functional, this specific defect has been fixed, but not released as the model would still be non-functional.</p>\r\n<p>See:</p>\r\n<p>http://rawr.codeplex.com/wikipage?title=Models</p>",
    "PostedDate": "2011-09-17T10:58:50.257-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "674392",
    "ThreadId": "272913",
    "Html": "<p>Ah didn't see that. &nbsp;Thanks for letting me know. &nbsp;Hopefully there will be a fix for it as I really would love to use it.</p>",
    "PostedDate": "2011-09-20T13:44:00.33-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]