[
  {
    "Id": "92519",
    "ThreadId": "27738",
    "Html": "If this feature is in 14b, I apologize as I only have 13 and the release notes for 14 didn't mention this...<br>\r\n<br>\r\nI would love to be able to filter out items by source, PvP (gear puchased with honor), Quest rewards, Rep Vendor, Crafted BoE, Crafted BoP, Badge, Arena Points, Drop, heoric Drop, Kara, Gruul, etc.&nbsp; Or for the last group maybe just &quot;T4 content&quot; , &quot;T5 content&quot;, etc.&nbsp; The information appears to be present in the item tag, so I'm sure it can be done.&nbsp; It would certainly make it easier for those of us that will never see T5 or T6 content, do not have Profession X (can't use BoP crafted items) and avoid PvP like the plague to know what is the best item for slot Z without having to wade through the list of T5/6 and PvP items only to find out the top item is a BoP crafted item.<br>\r\n<br>\r\nJust a thought.<br>\r\n<br>\r\n",
    "PostedDate": "2008-05-14T12:23:56.557-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "92526",
    "ThreadId": "27738",
    "Html": "Just not possible right now. I'd love to include this, but the data to support this isn't available yet. Wowhead doesn't expose their data, and Armory's data is very sketchy, incomplete, or vague.",
    "PostedDate": "2008-05-14T12:49:05.003-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "92782",
    "ThreadId": "27738",
    "Html": "Perhaps other sources? I haven't looked in much detail, but doesn't wow.allakhazam.com export the item definitions in XML?<br>\r\n",
    "PostedDate": "2008-05-15T13:38:52.533-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "92785",
    "ThreadId": "27738",
    "Html": "Looks like I just might have to install VS2008 and take a look at this at home.....<br>\r\n",
    "PostedDate": "2008-05-15T13:52:58.153-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "92800",
    "ThreadId": "27738",
    "Html": "A long long time ago, Rawr used Allakhazam's data. That was torturous. Not going back there.",
    "PostedDate": "2008-05-15T15:25:00.76-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "112111",
    "ThreadId": "27738",
    "Html": "This is probably my most wanted feature in RAWR.&nbsp; And the thing that when I introduce new people to RAWR they ask how to do almost every time.&nbsp; It makes RAWR a lot harder to use for folks who are not doing 25-man raids.<br>\r\n<br>\r\nWould it be possible to do something with lookups in wowhead, and a file that mapped the source to a category? <br>\r\n<br>\r\nIt'd have issues with gear with no source listed, but it might be a solid start.<br>\r\n",
    "PostedDate": "2008-08-19T10:39:53.157-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "112121",
    "ThreadId": "27738",
    "Html": "If wowhead exposed their data, we'd use it. They don't, so we can't. We're stuck with the armory.<br>\r\n",
    "PostedDate": "2008-08-19T11:28:21.403-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "112180",
    "ThreadId": "27738",
    "Html": "I guess I see that most items have a source in RAWR.&nbsp; I was more suggesting adding something that looked at those sources and mapped them to categories.<br>\r\n<br>\r\nIf the source was any of Supremus, Gorefiend, etc it got flagged as Black Temple.&nbsp; If the source &quot;Purchaseable for Arena Points&quot; it got flagged as Arena.&nbsp; Most of the gear seems to have these tags at the moment.&nbsp; It'd just be creating a way to turn those tags in to categories, and then enabling ways to filter what was being displayed based on categories.&nbsp; The filter should probably also make it so that any item tagged as owned by the character displays even if it'd not otherwise be available -- I'll want to turn off upgrades only available from SSC when I'm only doing T6 content.&nbsp; But I still want the T5 pieces I have to show up in the list.<br>\r\n",
    "PostedDate": "2008-08-19T14:59:56-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "112186",
    "ThreadId": "27738",
    "Html": "I think the most elegant way to handle this would be to add a way to item editor where people can edit the source tag and create simple regex mapping rules into categories that they could also edit themselves and provide a way to filter by those categories.\r\n",
    "PostedDate": "2008-08-19T15:25:14.037-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "112306",
    "ThreadId": "27738",
    "Html": "I like Kavan's suggestion. You could go with a dropdown with pvp/arena/crafted/T4/T5/T6/Sunwell/Badges/rep vendors/other as options and let people populate the information themselves on the items. If the XML for the item data is easy to grab then it'd also be possible to share it with guildies/friends to save time updating. Not as nice as pulling data straight from Armory or Wowhead but at least it'd allow filtering.<br>\r\n<br>\r\nThe question if you do becomes how do you filter? I know I'd prefer a checklist where I could pick and choose rather than a &quot;Less than this instance&quot; approach. eg: allowing T5 and T6 but ignoring T4 and other gear.<br>\r\n",
    "PostedDate": "2008-08-20T05:50:42.823-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "112362",
    "ThreadId": "27738",
    "Html": "I really don't like any solution that requires the user to do data entry... I'm hoping that with the expansion, the armory will be improved to have accurate source data for all items, or else wowhead (or wowdb) will be willing to expose their data.<br>\r\n",
    "PostedDate": "2008-08-20T08:48:01.01-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "112406",
    "ThreadId": "27738",
    "Html": "At the moment, most gear in RAWR has a source listed.&nbsp; Why can't we use that data?<br>\r\n<br>\r\nIf you mouse over &quot;Mask of the Fury Hunter&quot;&nbsp; you see &quot;Drops from Kil'jaeden in Sunwell Plateau&quot;.<br>\r\n",
    "PostedDate": "2008-08-20T10:28:07.913-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "112408",
    "ThreadId": "27738",
    "Html": "&quot;most&quot; &lt;-- There's the problem. There are so many exceptions out there, that your filter would either include or exclude a very significant portion of items, causing people to be either annoyed by the filtering 'not working', or them missing upgrades that they could get if they knew about them, but don't because they're incorrectly filtered out.<br>\r\n",
    "PostedDate": "2008-08-20T10:44:35.373-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "113265",
    "ThreadId": "27738",
    "Html": "Is the unreliability of Armory in that some entries are wrong or that some items don't have entries? If it's just lack of data on some items just never filter those.\r\n",
    "PostedDate": "2008-08-24T10:31:36.01-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "113283",
    "ThreadId": "27738",
    "Html": "Lack of data usually. And just not filtering those still leads to tons of 'wtf, this thing iz borken, whys it showing me [xxxx] when i told it no raid drops this thing suxx0rs' questions to us.<br>\r\n",
    "PostedDate": "2008-08-24T15:21:26.44-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "113287",
    "ThreadId": "27738",
    "Html": "I'd say don't design this tool for those kinds of people. They'll complain no matter what and the best way to handle them is to ignore them. There is no question that there is a lot of functionality in providing filtering support, specially in terms of improving performance of comparisons and building upgrades. For me the benefits clearly outweigh the potential outbreak of crying.\r\n",
    "PostedDate": "2008-08-24T15:33:37.84-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "113301",
    "ThreadId": "27738",
    "Html": "I agree with you. This late in the game, though, I don't think it's worth trying to implement in the current version of Rawr. I'd say it's something we should implement in Rawr 2.0 (which I'm going to branch off in only like a week, anyway).<br>\r\n",
    "PostedDate": "2008-08-24T17:04:00.917-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "113462",
    "ThreadId": "27738",
    "Html": "How does www.lootrank.com do it?&nbsp; They seem have great source filtering as well as the much needed gem quality option?&nbsp; They seem to be using wowhead.&nbsp; If they have done some sort of custom filtering of wowhead data, maybe you could gain access to their data for filtering?<br>\r\n<br>\r\n",
    "PostedDate": "2008-08-25T08:05:29.167-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "113479",
    "ThreadId": "27738",
    "Html": "Did some investigating, looks like they have their own manually created/updated database.<br>\r\n",
    "PostedDate": "2008-08-25T08:43:43.56-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "114028",
    "ThreadId": "27738",
    "Html": "We should create our own meta-data database that has this information in it.&nbsp; At first the developers/users can just update it by hand.&nbsp; Once Rawr gets more popular and supports more build types then someone will happily take it over.<br>\r\n<br>\r\nJust look at the guys who maintain item databases for the private server coders.&nbsp; Those who code, code.&nbsp; Those who can't use tools coders provide. :)<br>\r\n<br>\r\n",
    "PostedDate": "2008-08-26T23:57:18.893-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "114148",
    "ThreadId": "27738",
    "Html": "Sorry, but no, Rawr is designed to be reliant on other databases, and that's not going to change. I have no interest in building/maintaining our own item database, just because one piece of extraneous data is unreliable from our primary data source.<br>\r\n",
    "PostedDate": "2008-08-27T08:30:23.477-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "115029",
    "ThreadId": "27738",
    "Html": "Is there any way of saving selections of items for the optimizer without the character?<br>\r\n<br>\r\nI have several characters i want to optimize with rawr and at the moment I need to select the available items again. (do I?)<br>\r\n",
    "PostedDate": "2008-08-31T13:31:34.933-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "115047",
    "ThreadId": "27738",
    "Html": "The available items should be character specific. ie, don't just mark all the items you have available for all types of gear, then optimize with that same set in Bear, Cat, Moonkin, and Tree, or something like that. You don't want to do that, because the more items are marked available, the slower and more inaccurate the Optimizer will be.<br>\r\n",
    "PostedDate": "2008-08-31T16:36:58.763-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "115049",
    "ThreadId": "27738",
    "Html": "To do that atrax you can use the batch tools. Load all the characters you want into the batch tool and then using Set Available Items from Tools menu will set available items from character opened in main Rawr window to all characters in batch tool.\r\n",
    "PostedDate": "2008-08-31T17:00:57.097-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "116905",
    "ThreadId": "27738",
    "Html": "If it isn't reasonable for a database to be, perhaps something a little more specific?&nbsp; Such as forcing the ItemSource.xml to instead be internal, and just kept up by one person much like any of the modules are?&nbsp; It would be the equivilent of keeping the enchants or buffs up to date.&nbsp; Also, rather then a &quot;sort&quot; or filter, perhaps a middle ground, such as a &quot;Import SSC&quot;, or &quot;Import TK&quot;.&nbsp; <br>\r\n<br>\r\nThis would give the ability to start with a blank ItemCache, load your character from the armory, then import the instances you have access to.&nbsp; I think that in itself could go a long way, and wouldn't require end-user data entry.&nbsp; This would also make sure the items are clean via the armory, and since it's adding items it wouldn't be over-writing pre-existing gemmings or enchantings (to my knowledge, I haven't had that happen when I update items)\r\n",
    "PostedDate": "2008-09-08T08:50:35.833-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "117018",
    "ThreadId": "27738",
    "Html": "What you just described is a form of database, and we're still not in the business of compiling and maintaining our own item database.<br>\r\n",
    "PostedDate": "2008-09-08T14:41:37.457-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "117350",
    "ThreadId": "27738",
    "Html": "<span style=\"background-color:#d8d0c8\">Just to add my .02.&nbsp; If the community wished to establish a db for this info; take the initiative and set it up pseudo wiki style with priveledged editors, and open it up to Astrylian for use in RAWR.</span>\r\n",
    "PostedDate": "2008-09-09T14:01:53.013-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "117417",
    "ThreadId": "27738",
    "Html": "Rather than adding a database to allow source filtering how about a simple toggle in the item editor that includes/excludes the items in the main items lists and dropdowns? By default everything is included until the user turns it off. At least then we can filter items out without having to delete them.<br>\r\n",
    "PostedDate": "2008-09-09T18:02:48.117-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "117419",
    "ThreadId": "27738",
    "Html": "There will&nbsp;be filtering support in Rawr 2.0, but we won't maintain any databases of item source information.\r\n",
    "PostedDate": "2008-09-09T18:17:58.59-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]