[
  {
    "Id": "691738",
    "ThreadId": "277793",
    "Html": "\r\n<p>Hi,</p>\r\n<p>I'm a healing priest but play shadow as an offspec. Whilst gearing for shadow is easy in that I can share the same gear as my main spec, the difficulty is in locking certain items.</p>\r\n<p>If I'm wearing an item that is normally used for healing, I can lock that item on the item list on the right of the app; because I am wearing the item I'm locking the exact same reforging and gemming.</p>\r\n<p>I love the feature of being able to select more than one piece of gear to optimize with (e.g. I may have a 378 ilvl piece of healing gear which I don't want to reforge or change and I wish to compare it to another piece of gear that I'm free to alter in\r\n any way I like).</p>\r\n<p>However, the issue I'm having is that sometimes I wish to include an item I have in my bags (one that I normally use for healing) but I wish to lock it in it's current state - sometimes the exact reforging and gemming I'm using on that item isn't included\r\n in the item list on the right.</p>\r\n<p>E.g. I have the healing tier shoulders in my bag which are higher ilvl than the shadow shoulders I'm currently using. When using the shoulders for healing I keep them un-reforged with a particular gemming choice. I wish to lock the item and make it available\r\n for optimizing but the particular reforging I'm already using (i.e. none at all) is not available as a choice to be locked.</p>\r\n<p>Any thoughts on how to get around this?</p>\r\n<p>Thanks</p>\r\n",
    "PostedDate": "2011-10-31T10:41:52.377-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "691801",
    "ThreadId": "277793",
    "Html": "<p>I would suggest you use the Rawr paperdoll to \"equip\" the item that you have in your bag temporarily. Since equipped items always show in the chart that will let you lock it then.</p>",
    "PostedDate": "2011-10-31T13:07:21.223-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "691914",
    "ThreadId": "277793",
    "Html": "<p>Logout in your in your shadowspec but wearing your holy gear.&nbsp;&nbsp; Then load up your shadow profile in Rawr and refresh the character from battle net.&nbsp;&nbsp; Then you can lock all the gear you are wearing to the correct gems/enchants/reforges.</p>\r\n<p>&nbsp;</p>\r\n<p>Your other option is to download the WPF and use the batch tools, but I generally find it quicker to do it as I mentioned above.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2011-10-31T18:20:24.853-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]