[
  {
    "Id": "92787",
    "ThreadId": "27817",
    "Html": "<br>\r\nI see only 3 available bear idols (raven goddess, white stag, terror).&nbsp;&nbsp; It seems that other idols (idol of the wild, idol of ursoc etc) must generate threat and be worth analyzing?&nbsp; <br>\r\n<br>\r\nIs this the expected behavior?&nbsp; I do see the item(s) in the item editor, though Idol of the Wild has zero BonusMangleBearDamage and zero % Mangle (Bear) Threat.&nbsp; Perhaps this is the problem?<br>\r\n<br>\r\nDo I have an override to add items to the list of chooseable idols for a bear? <br>\r\n<br>\r\nSorry if this is covered in documentation somewhere which I haven't yet found. (I'm trying RAWR for the first time, starting with version 14b.)<br>\r\n",
    "PostedDate": "2008-05-15T14:06:20.337-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "92802",
    "ThreadId": "27817",
    "Html": "Ah, good point. Those idols aren't worth using at all, but yeah, they should be there for comparison sake. If you goto the item editor, delete them, and re-add them, it'll work. (Copy the ID#, delete, add, paste the ID#)",
    "PostedDate": "2008-05-15T15:29:53.903-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "93065",
    "ThreadId": "27817",
    "Html": "<br>\r\nI couldn't get Idol of Brutality to work with the re-add trick you mention above.&nbsp; I also didn't see a BonusSwipe/BonusMaul field to edit myself.<br>\r\n<br>\r\nI was able to get Idol of the Wild and Idol of Ursoc in by editing the Misc/BonusLacerate and Misc/BonusMangle* item fields.&nbsp; <br>\r\n<br>\r\nAside: are these Idols really not worth considering?&nbsp; When I put them in, they outscored the other Idols except Idol of the White Stag (Black Temple).&nbsp; As a 5-man Heroic Bear, I'm interested in how these non-raiding Idols do.&nbsp; For reference, here are the scores that were generated in case there is a problem with the threat calculation:<br>\r\n<br>\r\nWhiteStag&nbsp;&nbsp;&nbsp; 196.70<br>\r\nUrsoc&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 146.56<br>\r\nWild&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 128.98<br>\r\nTerror&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 66.92<br>\r\nRaven Gddss 42.62<br>\r\n<br>\r\n",
    "PostedDate": "2008-05-16T14:22:31.96-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "93071",
    "ThreadId": "27817",
    "Html": "Sure, if you only care about Threat. Terror provides a proc that gives a *ton* of mitigation, and a bit of survival, completely dominating all the other idols if you care about mitigation at all. That proc is up about 70% of the time. See the temporary buff for it to see.",
    "PostedDate": "2008-05-16T14:39:28.29-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "93083",
    "ThreadId": "27817",
    "Html": "Ah, I think I see.&nbsp; <br>\r\n<br>\r\nI can't get the Mitigation buff to show up on the Idol of Terror itself, so I don't notice it when I am comparing Idols.&nbsp; I do see it if I look at Chart: Buffs &gt; Current Buffs though.<br>\r\n<br>\r\nMaybe that would be a useful thing for a future release; either:<br>\r\n<br>\r\n1) an indicator that an item is tied to a temporary buff (and that buff is on/off) similar to the green optimizer diamond.<br>\r\n&nbsp;&nbsp;&nbsp; 1a) possibly a clock which would let you set the % uptime for the buff.<br>\r\n2) or a 4th graphical column besides Mitigation/Survival/Threat which shows temporary buffs due to that item.<br>\r\n<br>\r\nAlso, thanks for all the help.&nbsp; <br>\r\n<br>\r\n",
    "PostedDate": "2008-05-16T16:05:22.93-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]