[
  {
    "Id": "694354",
    "ThreadId": "278469",
    "Html": "<p>This is just a PSA for the next release of Rawr. Due to 4.3 being around the corner, I will be updating the cache with 4.3 gear. This will include gear suddenly saying that it would require Justice Points instead of Valor Points, or who is selling the items.&nbsp;  The next release will include all of the 4.3 PvE gear. PvP gear will be done in the following week (going through 500+ pvp items takes a while, especially considering Wowhead doesn't update their cost of each item until a week or two after the patch is released.</p>\n<p>Also there are several procs from trinkets and/or weapons that are either not going to be modeled immediately (a tanking trinket that creates an absorb based on the size of the boss hit on the tank) or the proc is a guess (Deathwing's 2-hander Sword that  procs a tentacle that fights with you [I'm basing the proc damage from the other weapon procs of the similar item level]). For the later if anyone wants to help and tell us what the proc damage is, it would be much appreciated.</p>\n<p>If anyone has any issues with the upcoming gear, just post here.</p>\n<p>&nbsp;</p>\n<p>Edit:</p>\n<p>As a bit of a follow-up, all PvE gear is in place, however all of the Non-Dragon Soul items do not have a source info. This was just a quick push so that people can test the gear, and I'll get to the source info.&nbsp; Also as of right now, please don't complain about why x item found on wowhead is not in the cache. Blizzard does this all the time in that they will make items they will not use and are usually datamined. One example, our own Kavan got acknowledged by Blizz next patch with an item named after him.</p>\n<p><a class=\"q4\" style=\"font-family: Verdana,sans-serif;\" href=\"http://ptr.wowhead.com/item=77176\">Kavan's Forsaken Treads</a></p>\n<p>On the PTR these are bought with Valor points, so the other two options:</p>\n<p><a class=\"q4\" style=\"font-family: Verdana,sans-serif;\" href=\"http://ptr.wowhead.com/item=78597\">Kavan's Forsaken Treads</a></p>\n<p><a class=\"q4\" style=\"font-family: Verdana,sans-serif;\" href=\"http://ptr.wowhead.com/item=78518\">Kavan's Forsaken Treads</a></p>\n<p>are reserved for Looking for Raid and Heroic respectfully but will not be used.</p>",
    "PostedDate": "2011-11-05T17:33:14.36-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "695132",
    "ThreadId": "278469",
    "Html": "<p><span class=\"q2\">Wowhead lists </span><strong class=\"q4\">Ti'tahk, the Steps of Time </strong><span class=\"q2\">with this description \"Equip: <a class=\"q2\" href=\"http://ptr.wowhead.com/spell=109846\">Your spells have a chance to grant you 1740+435 haste rating for 10 sec and 435 haste rating to up to 3 allies within 20 yards.\".</a></span></p>\r\n<p><span class=\"q2\">However, Rawr only includes the 1740 haste proc, and does not currently add the 435 haste that the user apparently gets as part of the extra raidwide effect.</span></p>\r\n<p><span class=\"q2\">Assuming Wowhead is right about the tooltip, it should be fixed, and it should be easy to do so.<br /></span></p>\r\n<p><span class=\"q2\"><br /></span></p>\r\n<p><span class=\"q2\"><br /></span></p>",
    "PostedDate": "2011-11-07T22:44:27.52-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "695135",
    "ThreadId": "278469",
    "Html": "<p>I'm actually unsure about the +435 Haste part. Before it was just the 1740 haste rating and 435 haste rating to 3 allies. If it's something that needs to be added, the parsing for it is in, it just means adding the 435 part to the special effect.</p>\n<p>As for the 3 allies part, I am not going to attempt to model that. The devs can add something in their own models if \"id ==78486\", \"id == 77190\", \"id == 78477\" if they want to add those buffs. But from a cache perspective, I'm not going to.</p>",
    "PostedDate": "2011-11-07T22:50:28.85-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "703161",
    "ThreadId": "278469",
    "Html": "<p>As someone who is currently gearing up alts, it would be preferable in the future not to change the valor items to justice items so long before the patch.&nbsp;&nbsp;&nbsp; Only a small incomvenience at the moment, but one that is affecting me quite a lot.&nbsp;&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2011-11-24T14:38:03.387-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "703194",
    "ThreadId": "278469",
    "Html": "<blockquote style=\"border: solid .1em #ccc; font-style: italic; margin: .25em 1em 0 1em; padding: 0 .25em 0 .25em;\"><strong>RareBeast wrote:</strong><br />\n<p>As someone who is currently gearing up alts, it would be preferable in the future not to change the valor items to justice items so long before the patch.&nbsp;&nbsp;&nbsp; Only a small incomvenience at the moment, but one that is affecting me quite a lot.&nbsp;&nbsp;</p>\n<p>&nbsp;</p>\n</blockquote>\n<p>Additionally, in the past, every time the item cache was downloaded I had to manually go in and set the item costs on almost every justice and valor items. &nbsp;Except for the BOEs, some trinkets, and most (strength-plate) gear, most everything else came down with 0 cost  every time the item cache was reset. &nbsp;Has this been fixed?</p>",
    "PostedDate": "2011-11-24T17:00:41.903-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]