[
  {
    "Id": "92907",
    "ThreadId": "27854",
    "Html": "Hello, I noticed that the DPS calculation for Ashtongue Talisman of Insight seems to be way off. Apparently the current calculations assume there is an internal cooldown on it, while there is not. It will proc on consecutive crits, it will overwrite itself and it does stack with other haste stuff. The 145 haste proc amounts to a 9% increase in dps for those 5 seconds and the procrate increases with higher crit rates. Therefore, the more you crit, the more this buff gets applied. From a personal point of view I'd rate it above HSH and below Skull, and from a quick math exercise assuming 30% crit, raid buffed,&nbsp; it gives approximately 75 DPS.<br>\r\nHowever i don't theorycraft much,&nbsp; so my math probably isn't accurat, but the way this trinket behaves is easily confirmable for anyone who chooses to do so.<br>\r\n",
    "PostedDate": "2008-05-16T05:19:40.273-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "93091",
    "ThreadId": "27854",
    "Html": "The calculations don't have internal cooldown for AToI. As far as I know the calculations are accurate. If you think it is wrong you'll have to be a bit more specific in what part of the modeling you think is wrong.\r\n",
    "PostedDate": "2008-05-16T16:59:39.153-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "93297",
    "ThreadId": "27854",
    "Html": "With 30% crit rate on your spells AToI is very poor on single target spells. This means it will proc on average around once every 7 spells. If you are casting fireball it'll likely only affect 1 or 2 fireballs before the debuff drops (depending on your passive haste). I don't know how you got 75 dps in your calculation, but I very much doubt it.<br>\r\n<br>\r\nThe only way to make full use of AToI is during AoE where you can crit often enough to keep the debuff on all the time. That's really what this trinket was originally designed for: flamestrike spam. Now with change to GCD affected by haste and the lifting of the damage cap for arcane explosion, it really shines with AE spam.\r\n",
    "PostedDate": "2008-05-18T19:28:02.67-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "93345",
    "ThreadId": "27854",
    "Html": "You can always promediate it using the uptime formula: 1-(Chance to not proc)^(Number of spells casted in 5 secs)<br>\r\n<br>\r\nWith 30% crit (15% chance to proc), an 0 base haste (1.67 spells in 5 seconds): 23.77% uptime. So is like 34.46 haste rating promediated.<br>\r\n<br>\r\nWith 30% crit (15% chance to proc), 9% base haste (1.82 spells in 5 seconds): 25.6% uptime. Equivalent to 37.12 haste rating promediated.<br>\r\n<br>\r\nI don't think 35-40 haste rating gives anyone 70 DPS.<br>\r\n",
    "PostedDate": "2008-05-19T04:11:24.127-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]