[
  {
    "Id": "93136",
    "ThreadId": "27906",
    "Html": "first of all, i'm a long time user of this program, best thing provided to play wow imo<br>\r\n<br>\r\njust the problem i'm having atm is that i'm going deeper and deeper in end game content and i'm seeing that rawr is<br>\r\nsuggesting to put 15 stam gems in everywhere, which is a bit strange. could end up having 23K hp and 20% dodge or something.<br>\r\n<br>\r\nmaybe it's possible to enter a certain point of hp where stamina is less important then dodge, or the other way around<br>\r\nthat you need to reach a certain amount of dodge before stamina gets rated the way it is now<br>\r\n<br>\r\nkeep up the good work guys, you rock!<br>\r\n",
    "PostedDate": "2008-05-17T03:48:34.223-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "93173",
    "ThreadId": "27906",
    "Html": "Rawr doesn't make suggestions, it shows what will produce the highest effect. Whether 10agi or 15sta gems are better for you depends strongly on how much dodge you already have, what debuffs are on the mob, and especially sunwell radiance and crushless mob.",
    "PostedDate": "2008-05-17T11:23:19.39-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "93198",
    "ThreadId": "27906",
    "Html": "yes, like you said, it shows what will produce the highest effect<br>\r\nbut if you have 20% dodge for instance, won't agi produce a higher effect then stamina then if you're at the 23k (to stay in the same numbers)<br>\r\nisn't it something that would be possible to get hard coded, as rawr can see how much dodge and stam you have, you can set the debuffs on a mob and the radiance<br>\r\n<br>\r\nso what i was thinking was getting a hard coded 'cap' or that rawr tries to even dodge and stam a bit<br>\r\njust a thought tho, it's working perfect already, but i still need to do some thinking of my own now :P<br>\r\n<div style=\"border-style:dotted none;border-color:rgb(170, 170, 170) -moz-use-text-color;border-width:0.1em medium;margin:1em 0em 2.5em 3em;padding:0.2em;font-style:italic\"><br>\r\nAstrylian wrote:<br>\r\nRawr doesn't make suggestions, it shows what will produce the highest effect. Whether 10agi or 15sta gems are better for you depends strongly on how much dodge you already have, what debuffs are on the mob, and especially sunwell radiance and crushless mob.<br>\r\n<br>\r\n</div>\r\n<br>\r\n",
    "PostedDate": "2008-05-17T16:04:50.297-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "93201",
    "ThreadId": "27906",
    "Html": "No, the value of avoidance scales exponentially. When you have only a little dodge, adding more doesn't get much value. When you have alot of dodge, adding more is alot of value. If you've got 23k hp, and 20% dodge (doubt you could get that low without really trying), stacking more HP really will provide the best direct overall benefit, assuming you can use that extra survival. (Remember, survival beyond what you use is wasted)",
    "PostedDate": "2008-05-17T16:20:09.44-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "93202",
    "ThreadId": "27906",
    "Html": "ah yeah, didn't think that far :P<br>\r\nthanks for pointing it out<br>\r\n<br>\r\nman i feel like a nabcaek now ^^<br>\r\n",
    "PostedDate": "2008-05-17T16:38:49.833-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]