[
  {
    "Id": "697972",
    "ThreadId": "279409",
    "Html": "\r\n<p>We just posted 4.2.7.&nbsp; This includes some rotation code for Marksmen spec that is worth taking a look at.&nbsp; Survival also has some code, but yeah, don't look to hard there since it's not finished.&nbsp;</p>\r\n<p>Let me know if you have any MM feedback.&nbsp; (something other than where's the pets or what about BM,&nbsp; that's all coming in time.)</p>\r\n",
    "PostedDate": "2011-11-14T10:21:02.65-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "995973",
    "ThreadId": "279409",
    "Html": "I was wondering what the status was on the hunter modules, with respect to the different specs. I know that on the program itself, it says that Hunter is partially developed, but if you could give some more information on what is working and what isn't?\r<br />\n<br />\nThe reason I ask this is because I recently got a few new items, and after adding them to my hunter's list of items, the optimised solution tells me to gem Deft Vermilion Onyx (Agi/Haste) and reforge several items to haste. Before I added these items, rawr was suggesting agi/crit gems and reforging items to crit, which makes more sense if you go by the theorycrafting on EJ and other sites. I want to check if I've just managed to get to a certain point of gear where haste is suddenly better than crit, or if it is an issue with the model for hunters not being fully developed?<br />\n",
    "PostedDate": "2013-02-04T00:36:27.963-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1000257",
    "ThreadId": "279409",
    "Html": "Currently, the Survival model is the only one which is anywhere close to accurate, and even in it, pets are not modeled appropriately at all which cascades issues through everything else.  BM depends heavily on pets obviously, and I've never done much with Marksmanship so I just haven't been able to invest much time in learning and implementing that rotation.  I'm not currently playing my hunter much and have a lot going on in RL, so I've been less inclined to invest the time in the code.  Hoping that at some point that changes, but will likely not be in the next few weeks.<br />\n",
    "PostedDate": "2013-02-12T13:16:27.087-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]