[
  {
    "Id": "705930",
    "ThreadId": "281487",
    "Html": "\r\n<p>Hi</p>\r\n<p>I've read the discussion of straight dodge vs stats to boost savage defense, and just wanted to clarify my understanding of the issues, since the only place I have seen anyone recommend exp/mastery builds elsewhere is on a thread at theincbear.com, and that\r\n was somewhat inconclusive.</p>\r\n<p>1) Don't stack Stamina - make sure that you can survive either 2.5-3.5 depending on the commentator/your estimation as to the competency of your healers.</p>\r\n<p>2) If you outgear content - e.g. when running heroics (pre 4.3?) or raids up to early firelands bosses, then the mastery build outplays the dodge build because the absorbs on the smaller hits done by these bosses are more effective than dodging them.</p>\r\n<p>3) I am however struggling to get rawr to suggest anything OTHER than the expertise mastery route however. I did set the difficulty to impossible boss and choose survivability as the optimse option to get a stam set suggested, but getting agi/dodge gems\r\n to come up rather than agi/mastery gems has proved challenging in any of the combinations I have found. Equally, it consistently recommends the latter gems, plus reforging into expertise then mastery.</p>\r\n<p>4) I am a newly dinged 85 - I have ground out enough JPs to fund the t12 chest and legs, and honor to get the season 11 shoulders and gloves next week. Other than that I have fluid death and an array of crafted vicious gear, plus a couple of random dungoen\r\n drops and a witch hunter's harvester - in effect, the sum of these is not a perfect mix - (dodge is around 37% unbuffed) but I was surprised at the difficulty I had getting rawr to recommend dodge as an option.</p>\r\n<p>5) In conclusion: dodge if I try progression, otherwise a threat/dps oriented set that will allow me to get by as a&nbsp;passable&nbsp;dps where necessary, and hold threat on pewpew-ers when I have to?</p>\r\n<p>RAWR settings used:</p>\r\n<p>t11n</p>\r\n<p>average boss</p>\r\n<p>optimise: overall and mitigation options chosen</p>\r\n<p>&nbsp;</p>\r\n<p>thanks for any feedback/pointers for further research</p>\r\n",
    "PostedDate": "2011-12-01T08:32:05.333-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "706261",
    "ThreadId": "281487",
    "Html": "<p>I can't comment on much of what you've brought up, but I do know the big factor in Rawr suggesting mastery or dodge is in the boss handler. &nbsp;Set it to t12 or t13 and, if your experience is like mine, it will switch to dodge.</p>",
    "PostedDate": "2011-12-01T23:14:40.667-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]