[
  {
    "Id": "93991",
    "ThreadId": "28169",
    "Html": "I'm one of those pallies that refuses to wear non-plate items in any relevant slots. Is it possible to add an option where only plate items (or of whatever armor type the user selects) are shown in the Comparisons list?<br>\r\n<br>\r\nThanks<br>\r\n<br>\r\nNhyl<br>\r\n",
    "PostedDate": "2008-05-21T11:27:26.32-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "93995",
    "ThreadId": "28169",
    "Html": "/agree\r\n",
    "PostedDate": "2008-05-21T11:38:04.707-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "94192",
    "ThreadId": "28169",
    "Html": "/disagree<br>\r\n<br>\r\nArmor class is only relevant if your class can't equip the item.&nbsp; If you don't want to consider cloth, leather, or mail gear, then delete them from your item list. \r\n",
    "PostedDate": "2008-05-22T08:37:03.73-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "94213",
    "ThreadId": "28169",
    "Html": "Not completely. I would like to add some sort of 'highest armor class only' filter, but it's a low priority.",
    "PostedDate": "2008-05-22T10:02:15.45-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "94403",
    "ThreadId": "28169",
    "Html": "A few reasons why deleting the items isn't the best option.&nbsp; First, if you only want to limit your view because you'd prefer to equip the highest armor class when possible, but would still like to have the option to see how other armor class gear compares.&nbsp; Second, if you want to use the same instance of Rawr to view characters of other classes.&nbsp; Third, Rawr does not state in the item tooltip what armor class an item is, so in order to check the armor class before you delete an item you either have to open each item in the editor or via the wowhead link.&nbsp; Plus manually going through a list of every equippable item and deleting ones you don't want to display seems pretty counterproductive when they are already internally flagged as a particular type that they can be filtered by.<br>\r\n",
    "PostedDate": "2008-05-23T09:06:12.003-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "94410",
    "ThreadId": "28169",
    "Html": "Yeah, don't worry, we won't be suggesting just deleting stuff like that, I want to add filtering like that, just won't be in the immediate future.",
    "PostedDate": "2008-05-23T09:20:59.403-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]