[
  {
    "Id": "708662",
    "ThreadId": "282103",
    "Html": "<p>It appears that there is a peculiarly small advantage for using 4 x Tier 13 normal over 3 x Tier 12 heroic + 1 normal Tier 12. Arcane appears to get a significant advantage from 2 x Tier 13 normal. Is the modelling complete?</p>\n<p>I have to underline I do not question the quality of the modelling. It is only a question based on the peculiar results I got. I wonder if the developers are aware of an incomplete status.</p>",
    "PostedDate": "2011-12-07T01:43:37.43-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "709146",
    "ThreadId": "282103",
    "Html": "<p>All parts are modeled. The only thing that could be causing problems is that combustion treats T13 as averaged instead of knowing it comes at the top stack of it. I'll probably update cycle level haste procs mode for next release to take that into account.</p>",
    "PostedDate": "2011-12-07T22:08:40.037-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "711865",
    "ThreadId": "282103",
    "Html": "<p>I managed to get a 4th piece of heroic T12 and now it appears Rawr suggests to not upgrade T12 at all unless at least one heroic piece is into T13. I wouldn't normally mention this but it appears SimCraft may not agree. There, even 2 pieces alone on normal  might be considered good.</p>\n<p>edit: i.e. I'm a bit worried about it and I'm not insinuating Rawr is wrong and SimCraft correct. What confuses me is that they may disagree and I can not figure out which one of the two gets it better.</p>",
    "PostedDate": "2011-12-13T18:28:39.98-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "711990",
    "ThreadId": "282103",
    "Html": "<p>Can you post the xml where you're seeing it? If you're using advanced haste procs mode there was a bug with it I just fixed.</p>",
    "PostedDate": "2011-12-14T01:12:26.76-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "712023",
    "ThreadId": "282103",
    "Html": "<p>OK on the latest version the advantage is significant even with 2 of the items on 384. It still gives 2x to be worse than 4x heroic T12 but I suspect that's reasonable.</p>\n<p>By the way, the 'cycle level haste proc' feature gave a significant increase (on the DPS) on the previous version, now it gives nothing. Also, the previous version appears to keep the x4 T12 and it gives a very marginal advantage on the X4 T13</p>\n<p>This is the file if still of interest: https://rapidshare.com/files/3211227457/__fire.xml&nbsp;(it does not include T13 x4 items other than 2 of 397.)</p>",
    "PostedDate": "2011-12-14T02:35:41.287-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "712083",
    "ThreadId": "282103",
    "Html": "<p>On a related note,&nbsp;Baltha from Paragon appeared to stack crit. Rawr gives it a 2.22% loss for the gear equipped. SimCraft gives it a very marginal loss.</p>",
    "PostedDate": "2011-12-14T05:13:18.617-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "712102",
    "ThreadId": "282103",
    "Html": "<p>Related to this.&nbsp; I just got 4xT13LFR and was previously wearing 4xT12N in those slots.&nbsp; When given the choice rawr tells me to stick with T12 but my gut feeling says this is wrong.&nbsp; Do I need to enable an advanced setting somewhere to model the T13 set bonuses?</p>\r\n<p>Additionally when I deselect my T12N gear to force rawr to build a set around 4xT13LFR it reforges everything around a 2005 haste breakpoint.&nbsp; Is there some way to reduce this breakpoint to 1505 to account for the T13 set bonus or is this related to my point above?</p>",
    "PostedDate": "2011-12-14T05:57:53.187-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "712459",
    "ThreadId": "282103",
    "Html": "<p>Found another bug, try out 4.3.2b and let me know how it goes.</p>",
    "PostedDate": "2011-12-14T19:08:51.163-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "712575",
    "ThreadId": "282103",
    "Html": "<p>Itemization is suggested to be same with the previous version here, from a quick look.</p>",
    "PostedDate": "2011-12-15T01:23:10.253-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "712760",
    "ThreadId": "282103",
    "Html": "<p>I'm having a similar problem with cycle level haste procs, even with 4.3.2b.&nbsp; It's giving me 0% uptime on the haste buff.&nbsp;</p>\r\n<p>http://i.imgur.com/jhsNw.png</p>",
    "PostedDate": "2011-12-15T08:22:16.727-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "712981",
    "ThreadId": "282103",
    "Html": "<p>That is not an actual problem, that graph doesn't support stacking effects, but it should be calculating correctly. I'll just have to remove it from that chart.</p>",
    "PostedDate": "2011-12-15T16:03:23.027-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "713016",
    "ThreadId": "282103",
    "Html": "<p>I'm thinking since most of mages are Fire right now it will be less confusing for most users if I just make cycle level haste procs enabled by default and if anyone doesn't want to get the performance hit in Arcane they can just disable it. Let me know if anyone feels otherwise about this.</p>",
    "PostedDate": "2011-12-15T17:46:37.617-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "713079",
    "ThreadId": "282103",
    "Html": "<p>I realised that as I am a troll, Berserking is probably corrupting the figures so I switched to undead so that it doesn't get included.</p>\r\n<p>Rawr now seems to have become obsessed with a 13.38% (1714 rating) haste position that I cannot explain.</p>",
    "PostedDate": "2011-12-15T23:40:24.293-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "713086",
    "ThreadId": "282103",
    "Html": "<p>Was this with the 4.3.2b version? If so, post the character xml and I'll take a look at why it goes for that value.</p>",
    "PostedDate": "2011-12-16T00:03:31.75-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "713642",
    "ThreadId": "282103",
    "Html": "<p>It was with 4.3.2b.&nbsp; Here is the xml</p>\n<p><a href=\"https://rapidshare.com/files/46338637/Fire_mage.xml\">https://rapidshare.com/files/46338637/Fire_mage.xml</a></p>",
    "PostedDate": "2011-12-17T09:22:53.823-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "713699",
    "ThreadId": "282103",
    "Html": "<p>It seems to be going for 1712 haste threshold, which gives you an extra combustion tick during heroism. There's also a new post on EJ that goes over most of the combinations that can happen:&nbsp;<a href=\"http://elitistjerks.com/f75/t110326-cataclysm_fire_mage_compendium/p29/#post2064715\">http://elitistjerks.com/f75/t110326-cataclysm_fire_mage_compendium/p29/#post2064715</a></p>",
    "PostedDate": "2011-12-17T16:20:53.02-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "713758",
    "ThreadId": "282103",
    "Html": "<p>Thanks for the info Kavan.</p>",
    "PostedDate": "2011-12-18T01:43:36.437-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "713794",
    "ThreadId": "282103",
    "Html": "<p>RAWR seems to be taking ANY (including just 1 part) as having 500 haste.</p>\n<p>It's trying to reforge to 1712 plateau with 1 part up to and including the stat graph showing a jump at the 1712 mark *with only 384 chest equipped* of the T13.</p>\n<p>Jump at 1712 disappears if I replace the chest with anything else.</p>\n<p>&nbsp;</p>\n<p>edit: Above was on WPF version. I cannot seem to reproduce the weirdness. Also getting 1993 as jump now. Possible false positives, sorry</p>",
    "PostedDate": "2011-12-18T05:25:15.383-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "713984",
    "ThreadId": "282103",
    "Html": "<p>I feel like I should point more clearly at my practical situation:</p>\n<p>Take this xml:&nbsp;https://rapidshare.com/files/870046038/_fire_crit.xml</p>\n<p>which is largely a collection of intuitively chosen high ilevel items reforged to crit with no much regard for anything more specific.</p>\n<p>Now, optimize it in Rawr. It will immediately assume a ~2% loss if the optimization is not followed (it also drops the T13x2 for T12x4 in the process).</p>\n<p>Save the new file and keep the old one.</p>\n<p>Run them in SimCraft:</p>\n<p>The new file loses ~1,100 DPS in Simcraft.</p>",
    "PostedDate": "2011-12-18T16:14:50.373-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "714033",
    "ThreadId": "282103",
    "Html": "<p>Thanks for the link, was able to find another bug with it. Doing a simc comparison now.</p>",
    "PostedDate": "2011-12-18T21:28:29.507-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "714051",
    "ThreadId": "282103",
    "Html": "<p>Well I still see the same result as you, with simc suggesting the other char is better, although now Rawr keeps 2T13. It seems like the main problem is that simc with haste profile runs oom and switches to mage armor, but I'm not sure if there isn't any  other thing going on.</p>",
    "PostedDate": "2011-12-18T23:09:57.297-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "714064",
    "ThreadId": "282103",
    "Html": "<p>Is switching to Mage Armor better than using Evocation?</p>",
    "PostedDate": "2011-12-18T23:48:54.553-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "714066",
    "ThreadId": "282103",
    "Html": "<p>Evocation is better as far as I can tell. In some cases I've seen a bit of scorch mixing sufficient without having to evo or armor swap, but I don't remember under what conditions that was better.</p>",
    "PostedDate": "2011-12-18T23:51:56.177-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "714107",
    "ThreadId": "282103",
    "Html": "<p>Actually I've ran into the same issue, namely Simc. preferring the crit profiles since Simc. is so aggressive&nbsp;about switching to Mage Armor I ran the comparrisons with&nbsp;infinite_mana=1 and the results were the same.</p>\r\n<p>I even plotted a reforge graph of crit&lt;-&gt;haste, the results were small local maxima at some haste breakpoints but a significant direction of more crit = mode dps. (with&nbsp;infinite_mana=1) Also note that the tests were run with DI.</p>",
    "PostedDate": "2011-12-19T01:43:59.68-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "714549",
    "ThreadId": "282103",
    "Html": "<p>By the way, the sequence of SimCraft does not have Evocation in it. I had replaced that line (of MArmor) with an Evocation for the same conditions or similar and the DPS was marginally lower, almost same.</p>",
    "PostedDate": "2011-12-19T16:55:10.203-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "714584",
    "ThreadId": "282103",
    "Html": "<p>Well looking more in details it seems one main thing that differs is the numbers for ignite. The biggest difference in modeling here is that simc accounts for the munching/rolling influence of haste that results from crossing the 2 sec cast time + delay. Because of this simc predicts much bigger drop in ignite damage than rawr. To take this into account we'd have to implement a more detailed ignite model in rawr (right now it's just a flat percentage munching), but if we go this route I'd like to base this on in game data of how much munching is present at different values of haste.</p>",
    "PostedDate": "2011-12-19T20:00:42.053-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "714709",
    "ThreadId": "282103",
    "Html": "<p>So more haste = more munching?</p>",
    "PostedDate": "2011-12-20T02:16:42.203-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "715081",
    "ThreadId": "282103",
    "Html": "<p>I'm not exactly an expert as far as ignite mechanics goes. My understanding is that if your cast is above 2 sec you'll have more rolling and you lose that when you go below. So it's not really more munching, but less bonus damage. Also it would seem the drop is highest when crossing the threshold, not sure if it gets worse with more haste (or by how much). Regardless it would be nice to have some real data to know if this theoretical result even holds in real play.</p>",
    "PostedDate": "2011-12-20T13:31:01.177-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "718641",
    "ThreadId": "282103",
    "Html": "<p>edit: nevermind, needs more info.</p>",
    "PostedDate": "2011-12-30T04:40:57.72-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]