[
  {
    "Id": "713537",
    "ThreadId": "283290",
    "Html": "\r\n<p>Just curious what the status of the RestoSham model is, as I've seen several posts over the last 6 months that indicated it was being rewritten. &nbsp;I'm asking because of the several &quot;oddities&quot; that have been hanging around for a while, such as:</p>\r\n<p>Rotation options are HW and LHW, no GHW option available.</p>\r\n<p>Many items' secondary effects seem to be completely ignored. &nbsp;Sets of trinkets all ranked the same due to their identical Intellect, ignoring their secondary effects, some of which are dps specific. &nbsp;(One set is&nbsp;Cunning of the Cruel (dps),\r\n Insignia of the Corrupted Mind (dps), Seal of the Seven Signs, Variable Pulse Lightning Capacitor (dps), &amp; Windward Heart; all 458 Intellect, all ranked the same.)</p>\r\n<p>Meta gems are all wonky, with Revitalizing Shadowspirit (54 Spirit/3% Crit Heal) ranked the same as Revitalizing Skyflare (22 Spirit/3% Crit Heal), seemingly ranked solely on the Crit Heal effect without regard to the differing Spirit values. &nbsp;Burning,\r\n Bracing, Ember, and Forlorn Shadowspirit are also all ranked the same, based on their 54 Intellect, without regard to their secondary effects.</p>\r\n<p>Any one of these issues individually seems minor and easily worked around, but taken together, they make me start to question my faith in the model as a whole.</p>\r\n",
    "PostedDate": "2011-12-17T01:00:58.18-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "713640",
    "ThreadId": "283290",
    "Html": "<p>http://rawr.codeplex.com/wikipage?title=Models</p>\r\n<p>The last check in for RestoSham was back at the end of October.&nbsp; It has a \"mostly\" status which suggests that it should work in most situations, but clearly as you say there are issues.&nbsp; I'd say, write them up, and hopefully Antivyris will get crackin' on them.</p>",
    "PostedDate": "2011-12-17T09:21:31.01-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "713676",
    "ThreadId": "283290",
    "Html": "<p>OK, thanks. &nbsp;I've been kind of ticket-happy lately, so I figured I'd ask informally before I made it all ticket-official.</p>",
    "PostedDate": "2011-12-17T11:54:55.453-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "716196",
    "ThreadId": "283290",
    "Html": "<p>Yeah, in october the other restosham dev went MIA, so I was left with a hideous amalgamation of half-implimented code that was to be the new model over the old LHW/GHW model.&nbsp; I'm in the painstaking process of re-writing it to better use the boss handler, since, really, we don't use 'rotations' anymore, we use reactive healing per situation.&nbsp; The meta gems I think are also going off 150% crit, so I'm in the process of moving it to marginally useful till I get it updated.&nbsp; Honestly, I'd stick with the current gearing choice of int/spir and then your preferred secondary, as there isn't a lot of math out there as to which secondary stat is best in the long run.&nbsp;</p>\r\n<p>That said, any ideas you have, this would be the best time to put in tickets for em, or to upload patches.</p>",
    "PostedDate": "2011-12-22T09:47:55.8-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]