[
  {
    "Id": "713181",
    "ThreadId": "283201",
    "Html": "<p>Is there ever going to be a stat plugin type interface so you can custom input your our stats for Rawr to go by? well a good example is the stat weight editor on ask Mr. Robots Website? altho I hate saying that!!!</p>",
    "PostedDate": "2011-12-16T04:51:05.46-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "713183",
    "ThreadId": "283201",
    "Html": "<p>Not likely.</p>",
    "PostedDate": "2011-12-16T05:00:54.597-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "713302",
    "ThreadId": "283201",
    "Html": "<p>To expand on what Kavan said.&nbsp; That's the exact OPPOSITE of what Rawr does.&nbsp; So doing so would go against the very point of how Rawr works, and provides it's recommendations.&nbsp; Each piece of gear, or each change in shot priority changes the value of adding 1 more point of any given stat.&nbsp; Those weight values that you are asking for are merely a snapshot of stat weights given a specific shot rotation/priority and a very specific set of gear.&nbsp; Deviate too far from either of those unspoken assumptions and you will see very different stat weights.</p>",
    "PostedDate": "2011-12-16T09:40:07.483-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "713540",
    "ThreadId": "283201",
    "Html": "<p>Yes I understand that. This is just a question cause I'm curious and would actually like to see something along this line. Would merely give the option to edit the stat weights for only if the person wanted to further customize their toon using your amazing program? You see I love the user interface and that you guys got this stuff  on lock down but I'm sure there are people out that would like to see such a feature added. I mean with how custom everything is now I figured that this might be a viable ad-din for those extreme advanced  users. And given that yes there is a fine line to how much you can change your stat weights before you deviate from the main rotation priority to out put maximum Performance, but there is a small window or leeway. To identify and take advantage of this leeway  would present an opportunity for customization I suspect. Of course the area of leeway would be restricted to a very small amount. Thus changing what gear, enchant, gem that would go to suit the asked custom stat change while keeping to spec and rotation priorities needed to out put maximum Performance. Now I'm wondering  if this be is more viable.</p>",
    "PostedDate": "2011-12-17T01:11:23.913-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "713550",
    "ThreadId": "283201",
    "Html": "<p>This is a feature Rawr should include. This is for several reasons.</p>\n<p>1. Some classes are undeveloped. One enters their info and they are informed by big red letters this class is undeveloped for 4.3.&nbsp;</p>\n<p>2. There is a use of the feature that does not go against the 'philosophy' of Rawr. If it is done _partially_ it can satisfy situational&nbsp;necessities. e.g. \"I want all my stats to be handled by Rawr. However, I want to restrict it to a high crit because I believe  that, situationally, it helps me in getting reliable Ignites\".&nbsp;</p>\n<p>Note: This is actually a big thing right now in this patch since theorycrafters - on Mage - appear to admit stacking of crit or stacking of haste do not have great differences. But that is very important because one might see crit as a situational reliability  factor. Others may see haste as a reliability factor because it makes everything 'run faster'. It might depend on the person and their style.</p>\n<p>This is already partially possible but it is limited. e.g. one can restrict haste but not crit.</p>\n<p>3. If one does go to avoiding Rawr's theorycrafting completely - perhaps for cases a class has no support at all, it helps to avoid having to use Mr Robot which is a tool clearly less evolved than this, with much less ease of use in choosing items and stats  and with much less connectivity for sharing information between tools.</p>\n<p>4. I have never seen a tool - of this nature - gaining anything from restricting features by attempting to not share data with other tools or by attempting to restrict features because it thinks a different feature is better. This might have hold _some_  truth in tools aimed for the mass market, but the audience here is clearly the 'nerds'.</p>",
    "PostedDate": "2011-12-17T02:31:56.24-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "713555",
    "ThreadId": "283201",
    "Html": "<p>Concerning point 2 which is probably the most important right now, I would like to add that there might be a solution that both satisfies the Rawr way of doing things and it helps a user support situational needs:</p>\n<p>A feature that adds a 'weight' towards a stat. For example \"If this stat, by giving it a higher priority, does not reduce DPS by more than 0.7%, then please use it instead of this other stat\".</p>",
    "PostedDate": "2011-12-17T02:52:30.55-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "713571",
    "ThreadId": "283201",
    "Html": "<p>At one point I've actually considered adding a meta model where you could add stat weights, mainly because I think all tools that currently do this do it in a completely wrong way. The main obstacle I ran into is in how to handle custom stats like item set bonuses and special effects. At least in my opinion it seemed like there would have to be way too many exceptions and special handling for a generic approach to have much merit.</p>\r\n<p>Modifying the existing models to modify weights is not really an option as the models don't actually use any such weights as input so there is nothing to modify. The stat weights you see in Rawr are purely on the output side.</p>\r\n<p>Regarding crit/haste in mage model I don't have much of a problem adding an optimizer condition on crit, at least on paper the desire to get more reliable ouput seems like a reasonable condition outside the scope of the modeling. I would be less inclined in adding arbitrary weights to bias the stats, but I might be convinced otherwise if you have a good argument for it.</p>",
    "PostedDate": "2011-12-17T04:23:04.487-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "714286",
    "ThreadId": "283201",
    "Html": "<p>well, OK say I'm a Frost DK in Unholy Pres or a Fury 2H Dual wield Warrior, I want to add a little more Expertise for a less chance or being avoided by a raid boss with my White Hit swings, In order to get rawr to help me make this possible I would have  to be able to tell rawr the output stat weight that I am looking for or input the absolute value and have this figured into my gemming, reforging per say so that rawr itself can configure my gear to the added wanted or needed stat weight so that I'm not taking  away from Primary stats caps or soft caps need for optimal DPS. This is only off the top of my head at the moment but I do know that allowing the user to tweak stat weights will help improve DPS/Avoidance/HPS in not just situational encounters, if done right it will improve the overall playability of a toon based on their stat weights/Spec/Glyphs/Rotation/Gear.</p>\n<p>&nbsp;</p>\n<p>On a separate note this just hit me but in you ad don you can put a rotation record so that a person can load this into Rawr and see their rotation based off of their gear and stat weights and so the rawr could in theory generate the most optimal rotation to the users. This would help out so many players to stop being fail. I know this a rotation that is considered optimal but the consensus of all the website out there and used quit widely but say rawr could generate a rotation optimal one complete toons setup then that would be amazing.</p>",
    "PostedDate": "2011-12-19T08:10:22.41-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]