[
  {
    "Id": "716954",
    "ThreadId": "284100",
    "Html": "\r\n<p>As of Rawr 4.3.3, I can't get Rawr to show me any gear for my mage's off hand slot, except for items that were previously marked as available.&nbsp; I've reset my item filter, confirmed that various off hand items are in the item database, and tried various\r\n weapons for the main hand. (empty / 1h / staff).&nbsp; It happens with my normal character and with a &quot;New&quot; blank character.</p>\r\n<p>All the other gear slots seem fine.&nbsp; I don't remember this being a problem with previous versions.</p>\r\n<p>Is it possible that somehow my particular system got corrupted?&nbsp; If so is there a file somewhere I need to delete?</p>\r\n<p>Let me know if you'd prefer I file a bug but wanted to find out if this was just me first.</p>\r\n",
    "PostedDate": "2011-12-24T13:49:40.56-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "716990",
    "ThreadId": "284100",
    "Html": "<p>Have you checked the item type filter? Other than that I'm not sure what it could be.</p>",
    "PostedDate": "2011-12-24T19:34:18.84-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "716993",
    "ThreadId": "284100",
    "Html": "<p>Bingo!&nbsp; Never even noticed those filters before, they are usually below the fold.&nbsp; Thanks for the pointer!</p>",
    "PostedDate": "2011-12-24T20:08:12.323-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "819996",
    "ThreadId": "284100",
    "Html": "<p>I think this will answer my would be question as well, but I can't seem to find the item type filter? Can you direct me?</p>\r\n<p>Specifically, I'm wanting Rawr to consider a one hander + Off hand as potential upgrades to available staves.</p>\r\n<p>Thanks,</p>",
    "PostedDate": "2012-04-04T11:39:58.62-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "820037",
    "ThreadId": "284100",
    "Html": "<p>The filters are on the very right hand side above the charts, but that is probably not an issue for you.</p>\n<p>To compare one handers/off hands in charts make sure there is an off hand equipped for comparison of staff vs one hand and for off hand comparisons you'll need a one handed weapon equipped. If you have things marked available from both categories then  optimizer will automatically choose whatever is best (similar for upgrade list, except it will only look at one item and won't notice if it takes two new items to get to an upgrade).</p>",
    "PostedDate": "2012-04-04T13:15:02.523-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]