[
  {
    "Id": "94863",
    "ThreadId": "28448",
    "Html": "There are some discrepancies with the stats when loaded from the armory.<br>\r\nThe Attack Power and Critical Strike ratings are off, showing that I have 300 more Attack Power and 1% less Critical Strike.<br>\r\nIs this an error or something I'm doing wrong?<br>\r\nEdit:These are links to my armory and of rawr's load from the armory.<br>\r\n<a href=\"http://img362.imageshack.us/img362/5348/retma3.png\">Armory</a><span style=\"text-decoration:underline\"><br>\r\n</span><a href=\"http://img362.imageshack.us/img362/7420/rawrwu6.png\">Rawr</a><br>\r\nI've also checked that there are no buffs selected.<br>\r\n<span style=\"text-decoration:underline\">\r\n</span>\r\n",
    "PostedDate": "2008-05-27T01:24:28.71-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "95632",
    "ThreadId": "28448",
    "Html": "Regarding the AP, Rawr calculates in the effective AP from procs and uses on your items (i.e. the mouse over the Libram and see that it gives you 88.89AP).<br>\r\n<br>\r\nAbout the crit though, were you buffed at all when you took the armory SS?<br>\r\n",
    "PostedDate": "2008-05-29T14:19:10.85-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "95720",
    "ThreadId": "28448",
    "Html": "Nope, no buffs were on except for Crusader Aura.<br>\r\nBut thanks for the info on the AP on items.<br>\r\nAha, I found the problem, Cloak of Darkness' melee crit rating wasn't showing up and it won't show up when I refresh it too.<br>\r\nI'll go and put it in manually.<br>\r\n",
    "PostedDate": "2008-05-30T00:11:52.1-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "95729",
    "ThreadId": "28448",
    "Html": "Ah yes, that's an interesting item... Rawr just doesn't understand the <span style=\"font-style:italic\">Melee</span> Crit Rating stat... No other item that I know of has crit rating that only applies to melee.",
    "PostedDate": "2008-05-30T01:21:37.153-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "96801",
    "ThreadId": "28448",
    "Html": "I believe its a display issue with the armory. The crit value is shown as &quot;bonus CritMeleeRating 24&quot; for the Cloak of Darkness. I had to do the same thing when I got Rawr. I've sent Blizzard emails regarding the problem months ago when I got the cloak, and after getting a form email back, nothing was done. <br>\r\n",
    "PostedDate": "2008-06-04T10:44:41.97-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]