[
  {
    "Id": "721399",
    "ThreadId": "285208",
    "Html": "\r\n<p>I'm a protuguese player, using the new Aggra (Portugu&ecirc;s) EU Realm, that Blizzard lists on the English language realm Tab.<br>\r\nThis Realm doesn&acute;t appear on the realm list when I&nbsp; try to &quot;Load Character from Battle.net Armory&quot; dialog window.<br>\r\nI tried &quot;Aggra-portugues&quot; (accepted by Mr.robot.com, but doesn.t work either.<br>\r\nCould you please fix it. The porutuguese community from Portugaleuropean community wil apreciate your efforts and attenetion.</p>\r\n<p>Thanks guys and keep the good work. Pedro</p>\r\n",
    "PostedDate": "2012-01-06T03:43:20.287-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "721402",
    "ThreadId": "285208",
    "Html": "<p>some text revision and new information - sorry for mistakes.</p>\r\n<p>I'm a protuguese player, using the new <strong>Aggra (Portugues)</strong> EU Realm . Blizzard lists it on the English language realm Tab.<br /> This realm doesn&acute;t appear on the rawr realm list, when I&nbsp; try to \"Load Character from Battle.net Armory\" dialog window.<br /> I tried \"Aggra-portugues\" (accepted by Mr.robot.com, but doesn't work either.<br /><br />It I select EU.Aggra.Pedmagoio, it gives me the message {\"status\":\"nok\", \"reason\": \"Realm not found.\"}.<br /> Could you please fix it. The porutuguese community from Portugaleuropean community wil apreciate your efforts and attention.</p>\r\n<p>Thanks guys and keep the good work. Pedro</p>",
    "PostedDate": "2012-01-06T03:56:47.75-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "721984",
    "ThreadId": "285208",
    "Html": "<p>Stupid thing is that we had \"Aggra\" in just Blizzard decided to name it differently; as you said; \"<span>Aggra (Portugu&ecirc;s).\"</span></p>\n<p>What I'm going to do is I'm going to edit the name to \"Aggra-Portugues\" since that is how Blizzard labels it for their API. Using your character locally, I was able to make sure that the change does work just fine.</p>\n<p>If for some reason people find it confusing, we can change it so that it shows up as \"Aggra (Portugu&ecirc;s),\" instead of \"Aggra-Portugues.\"</p>",
    "PostedDate": "2012-01-07T17:23:44.437-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]