[
  {
    "Id": "96076",
    "ThreadId": "28817",
    "Html": "Ok so I am not the most computer savey person on the planet but im pretty certain I can follow directions.<br>\r\n<br>\r\nCan anyone help me with how to get this program to work, I have tried downloading the 2.0 Framework a few times and then proceeded to completely uninstall the framework and the reinstall using the direct link from the rawr readme file. I even proceeded to do all my windows system updates and attempted to repair the framework a seperate time also to no avail. At one point after unitnstalling and reinstalling i even went and removed the old versions of the frame work per the directions given on a microsoft support site and still I get the following when I try and start rawr.....<br>\r\n<br>\r\nRawr has encountered a problem and needs to close.  We are sorry for the inconvenience. and then follows to ask me if i want to send the error report to microsoft <br>\r\n<br>\r\nRawr experts please help.<br>\r\n<br>\r\nThanks in advance for all the possible help.\r\n",
    "PostedDate": "2008-06-01T10:57:09.127-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "96084",
    "ThreadId": "28817",
    "Html": "Gunna have to post the full error text for us to be able to help.",
    "PostedDate": "2008-06-01T12:25:57.447-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "96089",
    "ThreadId": "28817",
    "Html": "I hope this is what you are reffering to it's titles error signature<br>\r\n<br>\r\nEventType : clr20r3     P1 : rawr.exe     P2 : 1.14.1.0     P3 : 482c1021     <br>\r\nP4 : rawr     P5 : 1.14.1.0     P6 : 482c1021     P7 : 1b5     P8 : 3e     <br>\r\nP9 : system.io.filenotfoundexception     <br>\r\n<br>\r\n",
    "PostedDate": "2008-06-01T13:24:11.11-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "96092",
    "ThreadId": "28817",
    "Html": "Not exactly, but that gives a hint... You need to unzip the entire Rawr.zip somewhere where you have full access, such as My Documents.",
    "PostedDate": "2008-06-01T14:09:41.873-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]