[
  {
    "Id": "97146",
    "ThreadId": "29162",
    "Html": "I downloaded Rawr a couple weeks ago and have been using the protection warrior and mage models.  My tank is my main character and my guild has been working on Illidan.  Anyway, I was looking through the discussions but could find no mention of two specific ideas:<br>\r\nFirst, Executioner is not listed as a possible enchant to the warrior's weapon.  Many end-game warriors choose this enchant for the added threat it provides, and it would be nice to have it as an option in Rawr for overall optimization.<br>\r\nAlso, the newest Meta gem from 2.4 (eternal earthstorm diamond) is not in the current Rawr.  The 12 def/10% block value meta is a very nice mitigation gem and it would be nice to select that for optimizing a mitigation set.<br>\r\nLastly, especially for sunwell, many warriors are prioritizing parry rating over dodge.  One trinket from ZA (Ancient Aqir Artifact) has to be added manually, which is what I did, but I'm sure other warriors would like to see it integrated into Rawr.  It's been fun using Rawr so far.  Keep up the good work.  Any plans for a fury warrior dps model?  :P<br>\r\n",
    "PostedDate": "2008-06-05T17:01:04.99-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "97175",
    "ThreadId": "29162",
    "Html": "The Executioner enchant I can't help with, but the Eternal Earthstorm Diamond is easily added manually - just add itemID 35501.&nbsp; The same goes for the AAA, it's itemID is 33830.<br>\r\n<br>\r\nI'm sure that the Rawr database will continue to be updated with the new and somewhat-rare items as new releases are put out.&nbsp; In the meantime you just need to add items manually :-)<br>\r\n<br>\r\nI will upload my itemCache,xml as an &quot;updated&quot; one as an issue, there's quite a bit of new gear out there since the latest Rawr update, and I'm sure some of you guys will want to use it.<br>\r\n",
    "PostedDate": "2008-06-05T20:47:29.393-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]