[
  {
    "Id": "97263",
    "ThreadId": "29181",
    "Html": "Hi there, <br>\r\n<br>\r\nI'm not sure if this goes under 'Issue Tracker' or here, apologies if this is in the wrong section.<br>\r\n<br>\r\nI use Windows XP Media Centre Edition, and it came with a nice set of high-DPI fonts that make everything look shiney and pretty. Rawr really doesn't like this, and all the text is shunted off or hidden under buttons; some buttons are un-clickable as they are pushed away, and most things I can only read the first few words of. I'm pretty sure that setting my fonts to the normal lame DPI will fix it... There are a couple of other programs that do the same thing, but I don't want to change my setup every time I want to use just a couple of programs! So I go without.<br>\r\n<br>\r\nIf there is any way you could change the layout-formatting so that it displays correctly on my system, that would be awesome! However, I understand that I am probably in a very small minority here.<br>\r\n<br>\r\n-Will<br>\r\n",
    "PostedDate": "2008-06-06T06:19:34.44-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "97288",
    "ThreadId": "29181",
    "Html": "Windows Forms' support for high dpi resolutions is broken. Sorry, you'll have to live with it, or turn it off (my recommendation) when you use Rawr.",
    "PostedDate": "2008-06-06T08:14:18.79-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "97361",
    "ThreadId": "29181",
    "Html": "Ah poop, oh well, cheers for the heads up Astrylian.<br>\r\n<br>\r\nIf it's a problem with something to do with Windows, it'll probably never get fixed, being this obscure. <br>\r\n<br>\r\nHeh, unfortunately, my main user account isn't an administrator, I only\r\nlog on as admin to install/remove applications, so just changing it\r\nwould be a PITA. I suppose I'll have to fiddle with the font-size of standard resolution fonts to try and make it look the same XD<br>\r\n<br>\r\n<br>\r\nCheers though!<br>\r\n<br>\r\n:-)<br>\r\n",
    "PostedDate": "2008-06-06T15:02:16.633-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]