[
  {
    "Id": "98200",
    "ThreadId": "29473",
    "Html": "Hello,<br>\r\n<br>\r\nI have a question about mage spell hit, and talents.<br>\r\n<br>\r\nTypically I know that arc mages cap at 75, frost at 125, and fire at 164 (or something close to those numbers).&nbsp; I'm currently specced as an arc mage, with 5/5 in Arcane Focus.<br>\r\n<br>\r\nWhen I run the optimizer, it ends up with a equipment set that includes about 105 spell hit.&nbsp; If I stay as Arc, this is way over the spell hit which is wasted.&nbsp; If I switch to frost or fire, then it's way under.<br>\r\n<br>\r\nWhy is this?&nbsp; I thought maybe it was recommending that I stay as arc, but need the extra spell hit for when I use frostbolt (or scorch or whatever).&nbsp; Is that it?&nbsp; The optimizer lists my current talent spec as the &quot;top&quot; spec (40/0/21).<br>\r\n<br>\r\nI guess what I don't understand is how the items are optimized in relation to talent specs - are talent specs &quot;optimized&quot; too?<br>\r\n<br>\r\nThanks, it's a great tool!<br>\r\n",
    "PostedDate": "2008-06-11T09:36:48.69-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "98214",
    "ThreadId": "29473",
    "Html": "What is happening is that most of the best items have hit on it, so if you go for max total damage you can't do it without wasting some stuff on extra hit. What I do is move some points from Arcane Focus to other talents.<br>\r\n<br>\r\nWhen you're doing optimization the talent spec is not being changed, it is used as a fixed input, same as fight information.\r\n",
    "PostedDate": "2008-06-11T10:14:33.07-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "98297",
    "ThreadId": "29473",
    "Html": "Another consideration is that for Arcane, you're almost always going to be casting some non-arcane spells as well. For example, a typical Arcane rotation is AB-Frostbolt-AB-Frostbolt-AB-Frostbolt-Frostbolt-Scorch. This means that a notable amount of your DPS is dependant on how well that Frostbolt does, even if it's only 1/3 of your damage it still matters, since you don't have the mana to spam AB constantly. I've often seen optimization cap me at 126 hit for Arcane builds.<br>\r\n",
    "PostedDate": "2008-06-11T16:57:02.1-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "98303",
    "ThreadId": "29473",
    "Html": "Thanks for the quick response.<br>\r\n",
    "PostedDate": "2008-06-11T17:53:38.803-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]