[
  {
    "Id": "99535",
    "ThreadId": "29874",
    "Html": "First of all I want to say great job so far on the Hunter portion of Rawr.&nbsp; Just a few things.<br>\r\n<br>\r\nRight now the module is set that when a 3:2 rotation is selected it changes on the fly to a 1:1 rotation when aspect of the hawk procs.&nbsp; This is actually very cool.<br>\r\n<br>\r\nThe issue with doing this is that it is not always accurate.&nbsp; Depending on shot speed when hawk procs it might not lower attack speed enough for a 1:1 rotation to result.<br>\r\n<br>\r\n<br>\r\nI am not sure if this is possible but under normal ping conditions (200ms or less) most Hunters using the 3:2 macro will change to&nbsp;a 1:1 rotation when shot speed drops below&nbsp;1.9 and the 3:2 macro will produce a 2:1 rotation when above 2.1 shot speed.&nbsp; The sweet spot to actually gain a 3:2 rotation is between&nbsp;1.9 and 2.1 attack speed.&nbsp; 2.0 is actually the shot speed to be aimming for.<br>\r\n<br>\r\nMy suggestion would be that when the option is selected that the player is going to be using the 3:2 shot macro that the hunter module detects shot speed to determine which shot rotation to model.&nbsp; Right now when it detects an imp&nbsp;hawk proc it changes to a 1:1 rotation, how hard would it be instead of detected hawk procs for changing the rotation to use shot speed instead?&nbsp; <br>\r\n<br>\r\nA large number of survial spec hunters use the 3:2 macro to produce a 2:1 rotation that changes to a 3:2 rotation when under the effects of haste like imp hawk procs.&nbsp; Also when using a very slow bow as beast spec with no haste, for example a 3.0 bow the 3:2 macro will produce a 2:1 shot ratio and not the 3:2 ratio that is being modeled right now.<br>\r\n<br>\r\nFor example&nbsp;when attack speed is less than&nbsp;1.9 then a 1:1 steady to auto shot ratio is selected.<br>\r\nOr if attack speed is greater than 2.1 then the macro normally produces a 2:1 steady to auto shot ratio.<br>\r\nIf attack speed is between&nbsp;1.9 and 2.1 then the 3:2 macro actually produces a 3:2 steady to auto shot ratio.<br>\r\n<br>\r\n<br>\r\nA 2:1 rotation looks like:<br>\r\nauto<br>\r\nsteady<br>\r\nsteady<br>\r\nauto<br>\r\nsteady<br>\r\nsteady<br>\r\nrepeat<br>\r\n<br>\r\nAlso remember that only auto shots can proc imp hawk.&nbsp; So when using a 2:1 rotation because of shot speed, hawk will not proc as often.<br>\r\n<br>\r\nFor more information on how the 3:2 macro works in relation to shot speed please check out this thread:&nbsp;<a href=\"http://www.bigredkitty.net/forums/index.php?PHPSESSID=9f3ef2d4b7f5e899a1800b15ae235bf9&topic=1003.195\">http://www.bigredkitty.net/forums/index.php?PHPSESSID=9f3ef2d4b7f5e899a1800b15ae235bf9&amp;topic=1003.195</a><br>\r\n",
    "PostedDate": "2008-06-18T08:52:58.537-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "99542",
    "ThreadId": "29874",
    "Html": "I just took the time to look at the source code and it seems like this is already being taken into account.&nbsp; It is actually modeling a 2:1 rotation at 2.15 attack speed.&nbsp; Very nice.\r\n",
    "PostedDate": "2008-06-18T09:27:53.223-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "99682",
    "ThreadId": "29874",
    "Html": "Just to clarify for others that might be curious how the model works, there are currently 3 shot models: Auto Shot Only (obvious), 1:1, and 3:2.<br>\r\n<br>\r\n1:1 is built on the assumption that you are hand weaving shots so that server side latency doesn't play into the dps as would happen with the cast sequence macro (unless that has changed). <br>\r\n<br>\r\n3:2 is built on variations of the following<br>\r\n<br>\r\n/cast !AutoShot<br>\r\n/cast SteadyShot<br>\r\n<br>\r\nIf you analyze what that is doing, its basically saying:<br>\r\n<br>\r\nIf you can cast an auto shot, do it,&nbsp; then, either way, cast a steady shot, so that is how the 3:2 algorithm was designed, with that same basic logic (checking for GCD conditions and what not as well).&nbsp; I wanted to make sure I didn't artificially force a 3:2 condition since thats not what the 3:2 macros that are flying around lately are really doing.<br>\r\n<br>\r\nAll of the shot rotation modes take into account the shots per second based on haste, weapon speed, etc.&nbsp; Quick Shots is modeled as a percent uptime based on auto shot speed as well as how many points are in the talent and then applies the quick shots haste to the shot speed and gets its own run through the same simulation, for the very reasons you mention, you can't just apply a static haste buff, you have to treat that as a separate condition with its own variation on whats being fired when.&nbsp; (DST will be modeled the same way eventually).&nbsp; When I said (I'm assuming I said it somewhere) that the 3:2 model would start acting more like a 1:1 on Quick Shots proc, I more meant that the above macro would act like one when run through the simulation.&nbsp; The model doesn't actually change the shot rotation algorithm used. <br>\r\n<br>\r\nTo your suggestion that the model suggest a shot rotation based on gear, this is something that is on the board for phase 2 of the model.&nbsp; For phase one, I'm just trying to get all the moving parts in place with the calculations and output making sense to everyone.&nbsp; <br>\r\n<br>\r\nDefinitely thank you for the feedback, keep it coming!!<br>\r\n",
    "PostedDate": "2008-06-18T21:19:28.677-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]