[
  {
    "Id": "100298",
    "ThreadId": "30102",
    "Html": "Hello everyone. <br>\r\n<br>\r\nI just developped a Rawr.DpsWarr model for, well, dps warriors, you guessed it. You can find it in the patches section (&quot;source code&quot; tab).<br>\r\n<br>\r\nSo, just like any of the other models, it uses analytical computations. For the short story, I wanted to do something more elaborated (simulation)&nbsp;but had to resign myself to a simpler model. It was sometimes a pain to find detailled informations despite the existence of our beloved wowwiki but I finally managed to do quite a decent job, better in my opinion and to my knowledge than what exists over the web to rate&nbsp;dps warriors' gears.<br>\r\n&nbsp;<br>\r\n<br>\r\nThis model supports the following things :<br>\r\n- Arms and fury &quot;cycles&quot;<br>\r\n- Flurry, windfury, windfury / flurry / slam interaction (I used a convergence loop for the curious ones of you)<br>\r\n- Rage generation and average rage starvation. It means that if, on the average,&nbsp;you don't generate enough rage for a full dps cycle, the model will choose what to do among your available instant attacks rather than using a typical and unreal dps cycle. However, it doesn't support rage stravation due to statistical aleas (when you just miss three attacks in a row and cannot fire anything).<br>\r\n- Mongoose<br>\r\n<br>\r\nAnd it produces the followning datas :<br>\r\n- Detailled informations regarding your dps (how much, what contributes to it - useful to know what seemed to be the optimal cycle for the model)<br>\r\n- Rage generation (how much, what contributes to it)<br>\r\n- Special attacks rating (dmg / rage)<br>\r\n- Procs uptime (how much windfury procs for a dual wielder with the 3s cd, time spent under flurry or&nbsp;mongoose, average time needed to refresh rampage)<br>\r\n- Attack table<br>\r\n- One custom chart : stats weighting<br>\r\n<br>\r\n<br>\r\nAny feedback would be appreciated. Did you find any bug ? Are there unclear things ? What do you like and dislike ?&nbsp;Are my english skills utter crap ?<br>\r\nWhatever, I hope you will enjoy it and find it to be useful.<br>\r\n<br>\r\nSource code is obviously provided (C#) and let's just put it on the same license than Rawr itself (MS-PL ?).<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\nPS : For the long story, I began to write a simulation. That is, a reproduciton of the game mechanics with a simulator (the game server, managing cd and dealing damages) and a controller (a player, firing attacks depending on the rage and cd&nbsp;currently availables). This choice was quite obvious : a far better reproduction of some complex mechanics, no pain with creating complicated formulas, easy to maintain as wow will continue to evolve, a fewer bugs.<br>\r\n<br>\r\nHowever... it failed. I was surprised to see that even on a 10 minutes simulation, the result was pretty chaotic : for example, increasing some stat by a small amount sometimes resulted in a dps loss, which is obviously bad for a gear rating software. Of course, such glitches disappeared with a longer simulation (100 minutes one) but it was too slow to rate dozens of gear pieces or buffs. This is why I left it in order to write the analytical model we currently use. The simulational one is not available to the user but has been left in the code for the curious ones (look at the CalculationsDpsWarr.Mode constant to use it). Please note it is incomplete however, some datas not being produced and some other being incorrectly parsed. Besides, it does not support windfury for example, although adding it would be a piece of cake.\r\n",
    "PostedDate": "2008-06-23T01:17:02.49-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "100382",
    "ThreadId": "30102",
    "Html": "You did all this without mentioning that you were starting on it? There's already a DPSWarr model far into development...<br>\r\n<br>\r\nPlease IM me, cnervig@hotmail.com on MSN, Astro tSD on AIM.<br>\r\n",
    "PostedDate": "2008-06-23T08:10:16.15-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "107711",
    "ThreadId": "30102",
    "Html": "Any update on this? I along with some other people are really looking forward to a proper fury warrior model; hate using spreadsheets.<br>\r\n",
    "PostedDate": "2008-07-29T07:01:28.963-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "107759",
    "ThreadId": "30102",
    "Html": "Would love if Harmattan would come back to work on this. Currently we have no active DPSWarr development from any of the previously-interested developers, as far as I know. b15 is released with Arms support, but we'd really love if someone could put together all this work that's already been done, for Fury as well.<br>\r\n",
    "PostedDate": "2008-07-29T10:14:43.617-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]