[
  {
    "Id": "100626",
    "ThreadId": "30206",
    "Html": "<br>\r\n1) Have you considered putting any of the following rotations in Rawr?<br>\r\n<br>\r\nAB-AM-AM (This would allow the debuff to expire, but it's mainly useful if we have enough haste to make AM-AM stay within the debuff range.)<br>\r\nAB-AB-AB-AM-Frostbolt (Like AB3AMSc, but for Frost. On that note, on a previous post, it was noted that AB-AB-AB-[filler] is a poor cycle because it keeps the &quot;downside, and not the upside, of the previous cast's debuff.&quot; Why the change of heart?)<br>\r\n<br>\r\n2) I'm curious as to why the suggested spell rotations include activated buffs like Heroism and Icy Veins, but not procs (other than Clearcasting) like Quag's Eye or the Lightning Capacitor. I can see how one might want to use AP when Quag's Eye or Eye of Mag procs. Would the optimization simply be too complicated?<br>\r\n<br>\r\n<br>\r\nThanks!<br>\r\n",
    "PostedDate": "2008-06-24T12:54:58.92-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "100639",
    "ThreadId": "30206",
    "Html": "1) I'll see about adding AB-AM-AM. It's a mix of AM and non-fully-debuffed AB so the tradeoff should be similar to normal cycles, except with heavier focus on AM so I doubt it's useful under normal circumstances. It might have a place for heavy interrupt fights although AB-AM is probably better in that case.<br>\r\n<br>\r\nThe reason why I left&nbsp;AB3AMSc there is so that one can compare it to the&nbsp;ABAM3Sc. I don't know a single set of parameters that would make it the better cycle. ABx3 cycles are bad, that one is there just for illustration.<br>\r\n<br>\r\n2) The reasoning was that you cannot plan for when proc items will be activated so I felt it was more appropriate to model it as average. You might wait with the cooldown until you get the proc, but you leave yourself vulnerable to having to delay it too much, resulting in getting one less cooldown during the fight. It is not clear to me that stacking outweighs this drawback and creating a probabilistic model that would capture this is not exactly straight forward.\r\n",
    "PostedDate": "2008-06-24T14:49:19.287-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]