[
  {
    "Id": "760260",
    "ThreadId": "310249",
    "Html": "\r\n<p>Well if I understand correctly.&nbsp; the protpally module has been taken over by somebody else, and is currently rewritten.</p>\r\n<p>So I figured this was the perfect opportunity to get rid of some thoughts I have on this, as &gt; 99% of the time I use rawr I use it for my Protection Paladin.</p>\r\n<p>&nbsp;</p>\r\n<p>first, shut of proccs please.&nbsp; as a tank you always want your worst case scenario.&nbsp; so proccs are irrelevant if you want to go for blockcap.</p>\r\n<p>&nbsp;</p>\r\n<p>also there is no &quot;right way&quot;&nbsp; as a tank, your philosophy is very boss-specific.&nbsp; especially in HM Raids.</p>\r\n<p>so something like options, on what you prioritize would be really nice, like&nbsp; &quot;keep Blockcap&quot;&nbsp; than &quot;go to max stamina&quot;&nbsp;&nbsp;&nbsp; OR&nbsp; &quot;keep Blockcap&quot;&nbsp; than go to max avoid.</p>\r\n<p>in essence you could prioritize yourself.&nbsp;&nbsp;&nbsp; like CTC&gt;stamina&gt;avoidance&nbsp;&nbsp;&nbsp;&nbsp; or even&nbsp; CTC&gt;Expertise softcap (26)&gt; at least 220k raid buffed of stamina &gt; 38%&nbsp; avoidance&nbsp;&nbsp; or&nbsp; Stamina\r\n &gt; all,&nbsp; and so on.</p>\r\n<p>The possibilities are endless. But this would be a major improvement for Tanks.</p>\r\n<p>also&nbsp; the resistance model seems a bit odd.&nbsp; it seems as if the xx% resistance are in fact the % not resisted,&nbsp; to get the resisted value I have to take the difference of 100%-xx% shown.</p>\r\n<p>&nbsp;</p>\r\n<p>oh and just as I'm here, anyone else having problems that HM DS items are not in the item cache, and even a reload form wowhead does not make em show up in the list, although if I'm wearing an Hm item in my armory and load my toon it is shown on the character\r\n sheet but still not in the rawr library.&nbsp;&nbsp;&nbsp; this is a bit odd.&nbsp; (the missing socket bonuses have been addressed in an issue tracker I saw.)</p>\r\n",
    "PostedDate": "2012-02-13T02:34:52.14-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "760583",
    "ThreadId": "310249",
    "Html": "<p>1) Procs have already been shut off in the latest source. &nbsp;That doesn't mean they don't have value, though. &nbsp;If you get a dodge proc, that will improve your mitigation, albeit temporarily. &nbsp;So they're not worthless, you just don't want to optimize around them.</p>\r\n<p>2) You can already choose your options in the Prot Paladin model. &nbsp;If you go to the Options tab, you can play with the \"Number of hits to survive\" option to get the balance of Survivability (stamina, armor) and Mitigation (dodge, parry) you want.</p>\r\n<p>3) In the optimizer, you can add whatever constraints you like. &nbsp;You can set the block cap (\"Avoidance + %Block\" &gt;= 100.0). &nbsp;You can set a minimum amount of health/stamina to hit and tell it to optimize for pure mitigation, if you like. &nbsp;The options are all there, you just have to play with it and find out.</p>\r\n<p>4) The resistance model has already been fixed in the latest source.</p>\r\n<p>5) The heroic mode DS items are in the item cache, you need to check your item filters and ensure that under T13, the box for Heroic is checked.</p>",
    "PostedDate": "2012-02-13T06:10:57.443-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "760706",
    "ThreadId": "310249",
    "Html": "<p>so there is a newer source then 4.3.7?&nbsp; mh I'll try to find it. thanks for the other tips. I&pound;ll try that out and play with it a bit.</p>",
    "PostedDate": "2012-02-13T07:18:45.85-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "760949",
    "ThreadId": "310249",
    "Html": "<p>Source is the code that will go into the next release. &nbsp;When 4.3.8 comes out, those fixes will be included.</p>",
    "PostedDate": "2012-02-13T09:43:06.86-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]