[
  {
    "Id": "103805",
    "ThreadId": "31239",
    "Html": "I'm currently using Rawr b14.1 for my moonkin, and while it has greatly helped out with my gear selection and increased my damage dramatically, I still find myself able to easily pull aggro off just about any tank (pugs &amp; guildies). Anyways, at first I thought that maybe the enchant just wasn't in Rawr, so I do the whole rigmarole&nbsp; to add an enchant only to find out that it is in there, but only available to mages and ret pallies. <br>\r\n<br>\r\nSo, is there anyway for me to change something to make the subtlety enchant available for moonkins? <br>\r\nAlso, is it planned to make it available to all classes in the next release?<br>\r\nAnd totally off topic, is there anyway to add a different/more options to the Optimizer (ie, +hit, +crit, etc)?<br>\r\n<br>\r\n",
    "PostedDate": "2008-07-10T01:52:32.667-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "103909",
    "ThreadId": "31239",
    "Html": "I've just added ThreatReductionMultiplier (the stat on Subtlety) as relevant for Cat and Moonkin, though they still won't value it in any way, since they don't calculate threat in any way.<br>\r\n<br>\r\nRegarding the Optimizer, hit and crit are already considered in the Damage Rating. Is there anything else you would like added, or a reason you see to optimize those specifically?<br>\r\n",
    "PostedDate": "2008-07-10T08:54:21.433-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "104228",
    "ThreadId": "31239",
    "Html": "I was mostly wondering about +hit. I wouldn't consider myself to be any kind of expert on being a moonkin, so I read through forum after forum after forum (that's how I actually found Rawr), and everyone's always saying that you need so much +hit and blah blah blah blah. Now, I can see how it can all be calculated together, giving a result of balanced stats, instead of a result of one buffed stat and the others gimped and then going from there. Which actually brings me back to the Subtlety enchant, I'm sure there's a lot more math than this, but shouldn't -2% threat basically equal +2% damage? Anywho, I was wondering about the extra options for the optimizer, mostly because most of the other classes have them and I'm jealous, but also to have the ability to look into different gearing options. I tried working around the not having the option to set +hit to XX or grater by increasing the target's level to like 76, but that didn't do anything :( <br>\r\n<br>\r\nBack to the enchant, would adding a new enchant of +2%-ish damage be an &quot;appropriate&quot; work around to get the subtlety enchant to be considered for gearing?<br>\r\n",
    "PostedDate": "2008-07-11T12:08:45.11-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "104255",
    "ThreadId": "31239",
    "Html": "Regarding Hit, the results from the Optimizer for Overall will give you a set with the highest DPS available, which will 99% of the time include capped hit, or within a hit rating or two of cap, if possible. Everything you see says that Hit is the most important stat until capped, is correct, and Rawr accounts for that.<br>\r\n<br>\r\nSubtlety isn't a DPS bonus in terms of the DPS you see in Rawr, because Rawr assumes you're not threat capped (currently, we hopefully will implement threat limiting calculations like the Mage model has, at some point)).<br>\r\n<br>\r\nIn actual gameplay though, Subtlety is either worthless, or a ~2% DPS boost, depending on whether you're threat capped or not. However, it's not like there are any other enchants for casters, so it's a non-issue.<br>\r\n",
    "PostedDate": "2008-07-11T14:46:29.893-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]