[
  {
    "Id": "103865",
    "ThreadId": "31256",
    "Html": "I notice if you change the level of the mobs your defensive values change properly, however missed attacks vs the mobs does not reduce properly. Would it be possible to fix this for the next release so hit isn't overvalued against mobs under level 73? The Hit and Expertise requirements drops significantly from 73 to 72 mobs, so this would be much appreciated. Have been toying with my available gear to deal with tanking adds in the M'uru encounter which has mobs of level 71. If it would help, I can go out and find Hit/Exp requirements per mob level. Thanks!\r\n",
    "PostedDate": "2008-07-10T06:38:04.243-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "103884",
    "ThreadId": "31256",
    "Html": "Dodge and miss are already fixed, but I haven't found any information on parry for lower levels.<br>\r\n",
    "PostedDate": "2008-07-10T07:51:54.773-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "103910",
    "ThreadId": "31256",
    "Html": "I don't have any hard numbers, but I'm pretty sure that Parry drops substantially for 72s and below... Like it's ~15% for 73s, ~9% for 72s, ~6% for 71s, ~5% for 70s... If you can do some research on that, that'd be cool, but I think it's something like that.<br>\r\n",
    "PostedDate": "2008-07-10T08:56:51.537-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "108068",
    "ThreadId": "31256",
    "Html": "Penguin over @ EJ did this testing, as far as I know this is the most recent testing, previous wws reports had most people speculating 15% for 73 level mobs but this gets a bit closer to the truth.<br>\r\n<br>\r\n<a href=\"http://elitistjerks.com/821641-post1853.html\">http://elitistjerks.com/821641-post1853.html</a><br>\r\n",
    "PostedDate": "2008-07-30T13:48:45.307-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "108092",
    "ThreadId": "31256",
    "Html": "Thanks for the link to that post, was wondering if anybody would ever do testing like that. When I searched there was virtually no data hehe. Now if someone can figure out 72 and 71 rates. &gt;_&gt;\r\n",
    "PostedDate": "2008-07-30T15:39:12.19-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]