[
  {
    "Id": "106814",
    "ThreadId": "32190",
    "Html": "First off, I just downloaded this app and so far it looks amazing!<br>\r\n<br>\r\nI noticed that the socket bonuses for gear show up on the equipped side (left side) but the same peice doesn't explicitly say it's getting the bonus on the right side.&nbsp; The Enslaved Doomguard Soulgrips for example.&nbsp; I have a Reckless Pyrestone on my gloves and it shows the 2 Spell Damage on the left but in the list on the right it doesn't reflect the 2 Spell Damage with the same stone.<br>\r\n<br>\r\nI do notice that when a socket bonus is met.. the &quot;Socket Bonus: None&quot; message will have a black font but when it's not bet the &quot;Socket Bonus: None&quot; will be in grey so maybe it is accounting for the bonus but not stating it... *shrug*.<br>\r\n<br>\r\nCan anyone advise on if it's working properly and just not listing the Bonus properly?<br>\r\n<br>\r\nThanks!\r\n",
    "PostedDate": "2008-07-24T09:08:55.31-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "106821",
    "ThreadId": "32190",
    "Html": "If you are not getting the socket bonus it should be grayed out in the tooltip.&nbsp; I guess I don't understand your problem.&nbsp; You should be able to add 2 in your head to see if the damage is getting applied properly<br>\r\n",
    "PostedDate": "2008-07-24T09:18:41.387-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "106837",
    "ThreadId": "32190",
    "Html": "It's the Comparisons list on the Right that doesn't specify the socket bonus... not the one on me.<br>\r\n<br>\r\nI have learned to edit the item and the dps value isn't changing when I take one that says None (in black) and changing it to it's appropriate value&nbsp; and it's dps value doesn't change.<br>\r\n<br>\r\nExample:<br>\r\non the right: Gloves of the Tempest (Socket Bonus: None - In Black Font), Reckless Pyrestone Socketed (matches socket type)... DPS = 49.60<br>\r\nmanually edited to show the +2 Spell Damage per the Socket Bonus... DPS = 49.60<br>\r\n<br>\r\nso basically, the socket bonus is applying and it hints that as the font is in black but it doesn't list it's socket bonus type on the right.&nbsp; The importance here is that I have to open wowhead on each item to see exactly what that bonus is if I was interested.\r\n",
    "PostedDate": "2008-07-24T10:25:29.597-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "106840",
    "ThreadId": "32190",
    "Html": "Additionally, maybe this should be a second post but whatever.... the items on the right do not list all the socket options that should be.<br>\r\n<br>\r\nExample:<br>\r\nFrozen Shadoweave Boots<br>\r\nthe 6th best Boots avaialable has 2 +9 Spell Damage Gems.<br>\r\nThere isn't a mention of 2 +12 Spell Damage on them<br>\r\nI can manually edit and duplicate the boots and just change the sockets, np... just thought this should be mentioned as when I added the 2 +12 gems, the new boots are now the 4th best in game but then get bumped down to #5 to the Slippers of the Seacaller when I put 2 +12s in that one.<br>\r\n<br>\r\nBut back to my topic, I noticed that an item that I have on will show it's socket bonus for any of the same type that meets the criteria on the right.<br>\r\n<br>\r\nExample<br>\r\nAll of the Frozen Shadoweave Boots will show the +3 Spell Hit Socket Bonus (because those are my current equipped boots)<br>\r\nAny other Boots like the Slippers of the Seacaller will say None (in Black print) <br>\r\n<br>\r\nBoth problems are fixableable manually, just it takes a little work and requires that I don't over look items below my current one on the list of upgrades.\r\n",
    "PostedDate": "2008-07-24T10:37:33.493-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "106882",
    "ThreadId": "32190",
    "Html": "Err, I'm a little lost on what your problems are. The tooltip for an item is identical everywhere, whether you look at it on the item selection popups on the left, or the comparison charts on the right. Whether or not that gemming meets that socket bonus is indicated by grey text (not getting the socket bonus) or black text (are getting the socket bonus). All items with sockets will show their socket bonus. A socket bonus of 'None' indicates that there is no (relevant) socket bonus. Very few items, if any,&nbsp; should have a socket bonus of 'None'. Your example of Slippers of the Seacaller has a 4dmg/4heal socket bonus. Did you edit it to remove the socket bonus or something?<br>\r\n<br>\r\nYou can change gems in each item as you want, but you should not be changing the socket bonus, unless you're actually trying to make new items. If you deleted the socket bonus on any items, you can right click on them and choose Refresh Item Data to pull the item data back down from the armory, including its correct socket bonus.<br>\r\n<br>\r\nLet me know if any of this is still unclear.<br>\r\n",
    "PostedDate": "2008-07-24T13:21:55.893-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "107139",
    "ThreadId": "32190",
    "Html": "I've seen this problem. It's been resolved in later builds. The socket bonus isn't being picked up when the items get updated. So the socket bonus listed is none. I think there was a checkin related to different naming of +spell damage effects that fixed this. I'll look and see if I can find it.<br>\r\n<br>\r\nEdit: Found it, change set 18553\r\n",
    "PostedDate": "2008-07-25T10:51:47.123-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]