[
  {
    "Id": "107587",
    "ThreadId": "32439",
    "Html": "I notice that the latest beta of rawr.mage notes the inclusion of a cooldown on the IED meta gem.&nbsp; This, at least numerically, nerfs the dps from the meta gem on my arcane/frost build from about 23 (above all other metas including CSD) to around 6.&nbsp; But I can't find anything on the web to indicate what, if any, cooldown the IED has on its procs.&nbsp; I thought it was just a flat 5% chance on the 300 mana proc.&nbsp; So for one cast each 5 seconds it would provide an average of (300) *&nbsp; (.05)&nbsp; = 15 mp5 (which of course means more time doing AB spams).<br>\r\n<br>\r\nIs there verification of a hidden cooldown on the Insightful proc, and if so what is the cooldown?<br>\r\n<br>\r\n",
    "PostedDate": "2008-07-28T15:43:06.157-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "107664",
    "ThreadId": "32439",
    "Html": "<a href=\"http://elitistjerks.com/f31/t19181-shaman_how_heal_like_pro/p53/#post759589\">http://elitistjerks.com/f31/t19181-shaman_how_heal_like_pro/p53/#post759589</a>\r\n",
    "PostedDate": "2008-07-29T02:32:32.637-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "107727",
    "ThreadId": "32439",
    "Html": "So assuming the 15 sec internal cooldown the IED, will only proc once every 45-60 sec instead of every 30-45 sec and provides around 25-30 MP5.&nbsp; Not a drastic change but apparently more accurate.<br>\r\n<br>\r\nIts not showing enough dps for me now to compare to the CSD so its time to change out the meta.&nbsp; Rawr 14 was showing much more dps from the gem, but it must have been more than just the cooldown.&nbsp; I think my suggested rotation changed from AB3AMFrB to ABAM3FrB so more 5 sec AM casts = fewer meta procs.&nbsp; When I use a custom mix and force AB3AM the meta gems are nearly equal.&nbsp; Time to learn a new rotation.<br>\r\n<br>\r\nThanks for the program, its awesome.<br>\r\n<br>\r\nScott<br>\r\n<br>\r\n",
    "PostedDate": "2008-07-29T08:18:56.94-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]