[
  {
    "Id": "107716",
    "ThreadId": "32470",
    "Html": "Was using Rawr's Warlock model to work on my Leo tanking set and it wasn't till <em>after</em> I imported all the missing pieces and such that I noticed resists are not calculated.&nbsp; Surely I'm not the only one that has noticed this? (did a search).&nbsp; Am I missing something?<br>\r\n",
    "PostedDate": "2008-07-29T07:24:44.743-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "107724",
    "ThreadId": "32470",
    "Html": "Just a reply to add something ...<br>\r\n<br>\r\nIncluding resistances, resilience, spell pen and so on would be a great addition to make this model a little more complete for warlocks.&nbsp; A warlock tank is not uncommon for most raiding guilds and these stats would also be helpful for PvP.<br>\r\n<br>\r\nAlso, I don;t see any selection for the self buffs (e.g. Demon Armor).<br>\r\n",
    "PostedDate": "2008-07-29T07:50:23.013-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "107760",
    "ThreadId": "32470",
    "Html": "Hey, yeah, we broke resistances in 15.0, we'll get that fixed for 15.1, sorry about that.<br>\r\n",
    "PostedDate": "2008-07-29T10:16:13.01-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "107772",
    "ThreadId": "32470",
    "Html": "Awesome, just checking. :-)<br>\r\n<br>\r\nThanks for the reply!<br>\r\n",
    "PostedDate": "2008-07-29T10:50:52.933-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "108555",
    "ThreadId": "32470",
    "Html": "Currently, the lock module doesn't do survivability calculations. As such, among other things, it assumes that you're using Fel Armor all the time so there's no armor choice button. <br>\r\n",
    "PostedDate": "2008-08-01T10:03:17.94-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "109979",
    "ThreadId": "32470",
    "Html": "The assumption of useing Fel Armor for the moment is ok, but does that take into effect the talent for additional spell damage?&nbsp; As a note, once the expansion comes out, there may be a reason to use Demon Armor again, so you may want to add those as options rather then assumed.<br>\r\n<br>\r\nAlso, although it wouldn't normally be used, the Fire stone for a fire lock would add more damage then almost any wand, but I don't see any way to equip it<br>\r\n<br>\r\nWith the Spell Hit, it would be nice to see the Number there, not just the Percent..\r\n",
    "PostedDate": "2008-08-08T09:36:39.45-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "110376",
    "ThreadId": "32470",
    "Html": "Yes, Demonic Aegis is taken into account. I don't really think we have an item defined for Firestones, I'll look into it. Will add hit/crit/haste rating as well as percents. <br>\r\n",
    "PostedDate": "2008-08-11T11:17:31.453-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]