[
  {
    "Id": "109183",
    "ThreadId": "32950",
    "Html": "I have download the Client 15.1 for determine the best RestoSchaman Items ingame.<br>\r\nThe Gems are sorted by Time out of Mana (that shows at least by Stat relativ Weigths)<br>\r\nCan i change the weighting of the Gems manually for personal results?<br>\r\n",
    "PostedDate": "2008-08-05T12:49:50.56-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "109229",
    "ThreadId": "32950",
    "Html": "Rawr is designed to give you accurate results based on the parameters of the fight, and your current gear/enchants/buffs. Make sure you fill all of those out, in order to give accurate results. If you've fully filled out the character, and still don't see results you expect, please attach the character file here, in a new Issue, and we can take a look.<br>\r\n",
    "PostedDate": "2008-08-05T16:14:01.46-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "109298",
    "ThreadId": "32950",
    "Html": "Rawr is creates around the best result for a long combat duration.<br>\r\nBut I would like to know, what the best Equip with the highest welfare value is.<br>\r\nWith a Shadow Priest, Manapotions and Totems I have enough Mana available, that I can participate a long time in fight.<br>\r\nThus my weighting of the jewels shifts.<br>\r\n<br>\r\nFor example:<br>\r\nyellow socket - 10 Spellhaste<br>\r\nred socket - 22 Heal<br>\r\nblue socket - 11 Heal/2 mp5<br>\r\n<br>\r\nBut the Spellhaste Geme does have in Rawr zero Itempoints and thus in Ranking&nbsp;not an effect.<br>\r\n<br>\r\nThe most Spreadsheets essentially differs in the Gems compared with Rawr.<br>\r\nFrom there the question about the possibility of the change of the weighting of the jewels.<br>\r\n<br>\r\n<br>\r\n<br>\r\nExcuses my bad English, I hopes it understands me nevertheless.<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\nSaXe\r\n",
    "PostedDate": "2008-08-06T01:40:26.857-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "109392",
    "ThreadId": "32950",
    "Html": "We're still working on perfecting RestoSham, so keep checking for updates for improvements like this.<br>\r\n<br>\r\nIn b15.1, spell haste has 0 value if you'll go OOM during the fight. Try changing the fight parameters (fight duration, mana from shadow priest, downranking) until you see spell haste have a value.<br>\r\n",
    "PostedDate": "2008-08-06T09:26:10.35-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "109579",
    "ThreadId": "32950",
    "Html": "thx, i will check this.\r\n",
    "PostedDate": "2008-08-07T00:29:53.36-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "113979",
    "ThreadId": "32950",
    "Html": "I don't know how the points for restogear are calculated, but isn't MP5 not at least a little bit overrated?<br>\r\nLoads of gear with intellect and MP5 are topping heal gear.<br>\r\nWould like to see cloth and leather shown. Very interested how you calculate all the values including armor and stamina maybe.<br>\r\nIs there a discussion or site where calculation is explained? <br>\r\n",
    "PostedDate": "2008-08-26T17:19:01.35-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "113980",
    "ThreadId": "32950",
    "Html": "Mp5 and Int are best if you're running OOM. Most likely, you need to make sure you've got the right fight duration, downranking, potion use, spriest mana income, and buffs set. Once you're not OOM, you'll see results much closer to what you 'expect'. <br>\r\n<br>\r\nItem values are the difference between the character rating with that item equipped and the character rating with that slot empty. How character ratings are calculated is, for resto sham, just how much healing is done. The place to discuss how it calculates healing done is right here.<br>\r\n",
    "PostedDate": "2008-08-26T17:42:52.183-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "122441",
    "ThreadId": "32950",
    "Html": "Basically, the way it was originally coded, the RestoSham model looked at the maximum amount of healing you could potentially put out given the specified conditions (gear, buffs, fight info, spell rotation, totems, etc.) for a single fight.\r\n",
    "PostedDate": "2008-10-02T10:54:08.47-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]