[
  {
    "Id": "109920",
    "ThreadId": "33170",
    "Html": "At the moment Rawr has 'Stats', 'Enchants', 'Buffs' and &quot;Options'. Options seems to be where all the class specific things are put, ranging from 2 modifiers in HolyPriest to 6 subtabs worth of settings in Mage. I wonder if this could all be reorganised to make things clearer for the user, but also to bring some uniformity across the models. Models could of course disable controls that aren't used (or&nbsp;grey them out). It would also be interesting to be able to save the fight parameters part of the settings as a separate template, rather than attaching it to the character. So that you can make a 'Brutallus' template and a 'Mother Shahraz' template and apply it to several characters with various models. <br>\r\n<br>\r\nFurthermore, in terms of user interface, it's becoming rather cluttered. Of course you don't want the settings panel to become larger, but actually all you want in that centre panel is the 'Stats' or results/analysis, and perhaps also the enchants because they belong to the gear. However, there's no reason why the other fight parameters couldn't be set in a non-modal window which could be shown and hidden as needed by the user. In terms of usability users would prefer to be able to click on the 'kings' buff and see directly what the impact of the change is without having to click on the 'stats' tab. You really want that always showing.<br>\r\n<br>\r\nIn this proposed pop-up settings window, you would then have more real estate to categorise the settings better. There are raid buffs, group buffs, self-buffs, consumables, temporary buffs (trinkets, drums, heroism, mana tide), debuffs (on boss and adds). Looking at the mage model there are a huge amount of fight parameters / effects which could be cross-model. Only lastly would you need the model specific settings, and they should always be truly only needed by that model: talents, spell-cycle, etc. I'd just like to repeat that it's weird that mage armor is on the class buffs, while fight length seems model-specific.<br>\r\n<br>\r\nWell, that was just a quick brainstorm. Throwing out some ideas for consideration in a future version.\r\n",
    "PostedDate": "2008-08-08T05:21:57.46-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "109959",
    "ThreadId": "33170",
    "Html": "Awesome. We're considering rearranging the UI, similar to how you propose, for Rawr 2.0, and this sort of feedback is especially helpful. Would love any others views on the subject too. The two general problems that we want to solve are: A) You want to be able to make changes to the enchant/buffs/options/etc and immediately see the change they have on your stats, not have to swap back to the Stats tab and try to find what changed, and B) We're running out of space for stuff in there; it's really cramped and cluttered on some models, especially Mage, since there are just so many settings on Mage.<br>\r\n<br>\r\n<br>\r\n",
    "PostedDate": "2008-08-08T08:20:32.1-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "109963",
    "ThreadId": "33170",
    "Html": "Consider adding a status-bar at the bottom of the main window.&nbsp; It would always show a current &quot;character score&quot; bar, consisting of the sum of the scores from the Current Gear/Enchants/Buffs graph (so for Bear the Mitigation Points, Survival Points, and Overall Points&nbsp;numbers would always be visible).<br>\r\n<br>\r\nAs an aside, seeing the three overall current score numbers for Moonkin (DPS, RawDPS, Overall) is a bit awkward.&nbsp; I have to go to Stats/Spell Info to find Selected Rotation and Max DPS rotation (there I find IS/SFx4&nbsp;and IS/MF/SFx3.&nbsp; I then have to scroll down to the named rotations to see the actual DPS and RDPS numbers.&nbsp; It would be nice to have &quot;DPS Points, RDPS Points, and Overall Points&quot; directly on the &quot;Stats&quot; tab somewhere.\r\n",
    "PostedDate": "2008-08-08T08:38:34.963-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "110632",
    "ThreadId": "33170",
    "Html": "I really liked the status bar idea and ended up writing myself one. I couldn't find a way to share it in this thread, so it's attached to <a href=\"http://www.codeplex.com/Rawr/WorkItem/View.aspx?WorkItemId=10993\">a new post in the Issue Tracker</a>. Here's hoping it does something useful for someone. ;)<br>\r\n",
    "PostedDate": "2008-08-12T10:28:54.907-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]