[
  {
    "Id": "110321",
    "ThreadId": "33296",
    "Html": "I have a problem with Timbals.&nbsp; I did a search and it returned nothing, so I assume no one has mentioned this.&nbsp; If you look at the rating for Timbals, it is extremely low compared to other trinkets when I read everywhere else that it is the be all end all for an affliclock.&nbsp; It appears that it is ONLY considering the static +44dmg and not the proc effect.&nbsp; It would seem difficult to model that effect since it is dependant on how many dots are ticking and how often they are refreshed, but all that info is already available on the options tab so it is possible.&nbsp; If you compare it with the timbals rated in Moonkin, it is rated as the absolute best.&nbsp; Now in the Moonkin model, there are some bizarre ratings given to everything and nothing is simply stated as +dmg added to a spell, but either way it clearly is calculated as the best and moonkin only have 2 dots.&nbsp; I have it on my Moonkin, but I have stayed away from running H-MgT for it on my warlock because I am destro, still it seems to be an excellent affliclock option.<br>\r\n<br>\r\nNext issue is with the SSO neck (acumen) for the warlock.&nbsp; Again, Moonkin has a setting for Aldor/Scryer and it seems to be calculating the proc effect into its rating.&nbsp; Warlock model doesnt know if you are Aldor or Scryer and it doesnt seem to be considering the proc at all.<br>\r\n<br>\r\nLast problem is I feel that crit is undervalued and Haste is over valued for a lock.&nbsp; I am sure haste is overvalued since it is suggesting haste gear as the best upgrades for an affliction lock which doesnt make sense (other than to decrease GCD which seems a small effect on it).&nbsp; I have not been able to find anyway to prove these theories, but I feel you need a minimum amount of damage and crit before you should add haste in any significant amount for a destro lock.&nbsp; It would seem to me a minimum of 32-33% crit should always be maintained (raid buffed, totems etc...) yet as you increase in gear level, haste takes over entirely.&nbsp; I modelled it once where crit was as low as 25% fully raid buffed and it still said haste was better.&nbsp; Something in the haste calcs must be off.<br>\r\n<br>\r\nAny thoughts on any of these?&nbsp; I havent posted any of it as an issue since I really dont know if they are wrong, but they certainly seem to be.\r\n",
    "PostedDate": "2008-08-11T07:04:57.237-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "110375",
    "ThreadId": "33296",
    "Html": "Timbal's and the SSO neck aren't modeled yet, they will be in the next release. Can you give me an example of some of the items that you think it's recommending incorrectly and some items you think it SHOULD be recommending?<br>\r\n",
    "PostedDate": "2008-08-11T11:01:19.073-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "110553",
    "ThreadId": "33296",
    "Html": "It isnt so much that I think specific items are rated incorrectly (aside from the timbals and the SSO neck), it is more that I feel stats are weighted incorrectly.&nbsp; Crit specifically.&nbsp; I believe that crit should in some way have a soft cap % that should be maintained before haste becomes valuable.&nbsp; Choose too many haste items without maintaining crit, and the haste items you have will&nbsp;become less effective.<br>\r\n<br>\r\nCurrently, affliction spec seems to weigh haste as the best stat to stack, where I would think always stacking dmg is preferred but I am not sure.&nbsp; While admittedly, affliction requires much less crit, bolts still will generally be 50% of total affliction damage so I can see haste having some merit while crit would be weighted less (unless you spec for Ruin).&nbsp;&nbsp;<br>\r\n<br>\r\nHowever, as&nbsp;Destro, I can see haste being effective&nbsp;since you are only spamming bolts but still without a good crit rating destro is less useful since the point is to apply ISB, which wont happen without crit.&nbsp; I wont even begin to claim I can calculate what those target stats are, but I doubt that over an average 5-10 minute fight you could see enough extra shadow bolts from haste that you can compensate for the lesser crit rating.&nbsp; 7.5 min average fight with 10% haste (157 rating) would amount to an addition 18 bolts cast assume perfect conditions with no latency delay, no movement required,&nbsp;and an infinite mana supply.&nbsp; Since those are unreal conditions the true number is probably closer to 12-15 depending on movement mana regen and interruptions in casting.&nbsp; Now the question is (and the part I dont want to calculate due to so many variables) how many more crits and bolts effective by the ISB +20% would it take to compensate for the extra 12-15 bolts.&nbsp; 157 haste rating isnt a rediculous amount, its not THAT hard to achieve, but I bet you find that it would take alot less itemization for crit rating to achieve the same amount of extra damage.\r\n",
    "PostedDate": "2008-08-12T04:52:11.95-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "111845",
    "ThreadId": "33296",
    "Html": "Since this has slowly dropped off without any responses, I was wondering if anyone else felt that crit was undervalued at all for a Destro spec in Rawr, or if everyone just follows the lemmings on EJ without question?&nbsp; I realize that point for point, crit is the worst itemization per item value, but a minimum amount of crit must be required for a class spec based largely on crits and how often they occur no matter what the item value cost is.&nbsp; It just doesn't seem right for a destro warlock in T6 or equivalent with a (character sheet) crit&nbsp;value of less than 25% and yet RAWR still says stack more haste, ignore crit.\r\n",
    "PostedDate": "2008-08-18T11:45:49.87-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "111852",
    "ThreadId": "33296",
    "Html": "Insulting us and saying Rawr recommends things wrong with no basis isn't exactly the best way to get things changed how you want.<br>\r\n<br>\r\nRawr doesn't say to stack anything, it just says what your DPS should be with any given gear/buffs/situation. Different items and different stats affect that in different ways, but there's no 'weight' do different stats. If you feel that any of the calculations are off, let us know that, and what math you're basing that on, and we'll gladly take a look.<br>\r\n",
    "PostedDate": "2008-08-18T12:06:33.813-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "112015",
    "ThreadId": "33296",
    "Html": "I wasnt insulting anyone, though I hate to see when people read something on a site *like* EJ and go &quot;Hrm, I always thought something completely different, but EJ says it works like this so it must be true!&quot;&nbsp;and thats the end of all discussion on the matter.&nbsp; Im trying to discuss this further saying that if you are using some standard calculations that someone dreamed up for warlocks, it may not be correct (or maybe there is simply an error in the model).&nbsp; Whatever the math is behind the scenes, you have to have a &quot;value&quot; placed on crit, haste, and damage (and hit when not capped).&nbsp; I dont know those values because I dont know whats going on behind the scenes.&nbsp; What I do know is that, as an example,&nbsp;it has been calculated for moonkin that once you reach 1400dmg raid buffed, haste is 1.2 times as effective as adding more damage.&nbsp; When in RAWR, on moonkin model, you can see that when you stack dmg to 1400, haste becomes exactly 1.2 times as effective.&nbsp; Therefore, I have to assume that the warlock model has a similar &quot;weight&quot; system to stats or else how can it calculate which item is better in combination with my other gear.<br>\r\n<br>\r\nI can select a set of gear (with talents set to the standard shadow 0/21/40) 4pcT6, all other gear is selected to get me hit capped as quickly as possible, not necassarily the best gear per RAWR, just gear with high hit rating.&nbsp; All my other gear tries to avoid either crit or haste and adds only hit and damage.&nbsp; When I have the gear selected except MH/OH, I end up with 15.98% hit, approx 3-4% haste, and 20.2% crit.&nbsp; 20.2% crit WITH 8% talents included.&nbsp; That means my gear itself is only adding about 10.5% crit.&nbsp; There is no way I would ever want to see a warlock with that low crit rating specced as destro, not even starting Kara, but this is 4pcT6!&nbsp;<br>\r\n<br>\r\nNow when you look at what gear it recommends, it still says that haste is better to use for gems and for MH/OH pieces, than anything that adds crit rating.&nbsp; I have the specific gear selections saved at home, but I can list them tonight if you would like them.&nbsp; This just cant be right.&nbsp; Whatever calculations you are using to add a value to crit, hit, haste, and dmg is wrong.&nbsp; Again, I dont know the math, Im good with math if I had the equations and the numbers, but I dont currently know them or how to find it.&nbsp; What I do know is I wouldnt want a warlock with 15% (character sheet) crit in my guild with any spec, let alone Destro.<br>\r\n<br>\r\nAgain, I didnt mean to insult anyone, but it just seems to me to be the typical &quot;someone smarter than me says always value XXX, so it must be true&quot;.&nbsp; And when someone questions it, he is brushed aside and ignored.&nbsp; I will refer you to this&nbsp;<a href=\"http://www.codeplex.com/Rawr/WorkItem/View.aspx?WorkItemId=10101\">http://www.codeplex.com/Rawr/WorkItem/View.aspx?WorkItemId=10101</a>&nbsp;for an example of this mentality.&nbsp; When miststorm started suggesting that all the moonkin calcs we off, he was basically brushed aside.&nbsp; Since he had programming background, he was able to look for the calcs and rewrite what was wrong and therefore eventually got the attention he needed and now the moonkin model kicks ass.&nbsp; Only difference here is I am not a programmer.&nbsp; Im just asking for an open mind.\r\n",
    "PostedDate": "2008-08-19T04:47:02.64-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "112077",
    "ThreadId": "33296",
    "Html": "Again, no, <strong>there are no stat weights</strong> (some models have customizable weights to the different ratings, but never to stats). The rating of an item is defined as\r\nthe difference between the rating of the whole character with\r\nthat item equipped, and the rating of the whole character with\r\nthat slot empty. So the rating calculations are always as accurate as the DPS calculations.<br>\r\n<br>\r\nSo again, if you feel the DPS calculations are off, tell us how, tell us what math you see is wrong, tell us what you think it should be.<br>\r\n<br>\r\nI'm no warlock, but offhand, I'd guess that that Haste increases ISB uptime just as much as Crit does, if not more, and provides more DPS.<br>\r\n",
    "PostedDate": "2008-08-19T08:20:25.133-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "114948",
    "ThreadId": "33296",
    "Html": "For one, the thing doesn't take in raid DPS from your ISB when calculating dps so if, for example, you plugged the same numbers into the spreadsheet while Raid TNS was checked, you'd get a higher value for crit. Given that, crit is the by far the least valuable of the four &quot;important&quot; stats (e.g., spell damage, hit, haste, crit), especially if you look at it in terms of item budget. While you don't want to ignore it, you certainly don't want to be gemming for it at any point, it's just a waste of item budget. <br>\r\n",
    "PostedDate": "2008-08-30T17:24:22.197-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "116077",
    "ThreadId": "33296",
    "Html": "Blizzard has recently added in a cap to the amount of dmg a shadow bolt can do since people still complain that we are OP(especially the Orc Warlocks).&nbsp; I believe this is now 8.5k (not counting fights like currator where you have evocate).&nbsp; I am not sure if this is true though since&nbsp;my highest hit so far has only been 8.2k so if you know I'm wrong, please let me know.&nbsp; If you really want to do as much damage as possible, you should ignore haste until you see your shadow bolts constantly hitting for around 8.5 and ISB constantly procced.&nbsp; I usually count on raid buffs to get me over the 25% crit chance since unbuffed I'm slightly under 22%.<br>\r\n<br>\r\nThe true fact when it comes to haste is if you are going to stack haste, you need to stack a lot of it for it to become useful.&nbsp; I'd say at least 5%(around 90 points - can't remember the calculation right now).&nbsp; Other than that, haste is really a personal preference.&nbsp; I started stacking it because I hated the mages always getting their shot out before me or another lock's bolt beating mine by a fraction of a second for the killing blow.&nbsp; I am pretty sure I could get more dps if I switched out all of my +5 haste/+6 damage gems and put in the +12 damage gems or the crit/dmg gems but I'm happy with my raid performance and enjoy the .15 seconds i've shaved off my shadow bolt cast.<br>\r\n<br>\r\nPeople should realize that RAWR and other tools out there are simply that, a tool and should not be used as a crutch to fake your way through your spec/class.&nbsp; That being said, I still the this is the best tool out there and helps people who understand their character better than any other tool.\r\n",
    "PostedDate": "2008-09-04T09:59:39.353-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "116102",
    "ThreadId": "33296",
    "Html": "I'm not sure what the point of your post was, DracToD. We care about hard facts and theorycraft here, not your personal feelings on the values of stats. The clear evidence and math shows that many of your personal preferences are in fact DPS losses. It's not a matter of Rawr being a 'crutch to fake your way through your spec/class'. Rawr is as accurate as possible. It's not perfect, there's no question of that, but the ideal goal is to be completely accurate. If you have any theorycraft, math, evidence, etc, that shows your 'facts' are actually facts, we'd love to hear it, and use it to improve Rawr.<br>\r\n",
    "PostedDate": "2008-09-04T11:12:03.893-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "116342",
    "ThreadId": "33296",
    "Html": "First off, ignore most of this post.&nbsp; I was mistaken on the damage cap to a shadow bolt (I listened to a friend who likes to make stuff up without looking into it further).<br>\r\n<br>\r\nSecondly, I am not complaining about your work.&nbsp; I think your work makes good players even better and helps them out a lot (as well as the fact that the overall design of the program is excellent).&nbsp; It was simply a reminder that if you suck at your class, Rawr or any other gear guide isn't going to&nbsp;make you any better.<br>\r\n<br>\r\nFinally, I don't know the numbers, nor care to figure them out, but I do know that if you are a destro shadow&nbsp;lock, ISB improves your damage and if this isn't constantly procced, then&nbsp; you need more crit because no amount of haste is gonna compensate for the additional 20% damage you are losing (especially when you calculate that into a crit).&nbsp; Since ISB gives you 4 chances to proc again before it goes away you want at least 25% chance to crit (i like simple math).&nbsp; I don't know if your program gives different values to different stats based on what you currently have but it would definitely be a cool feature, though I'd hate to figure out all those algorithms for all the different classes/specs.&nbsp; This is the biggest reason why haste is the least valuable of the 4 major stats (hit, damage, crit, haste).&nbsp; This is also why you can't assign a simple point value to one of these stats without understanding what that stat does, why it is important, and what the limit to that stat is.&nbsp; &nbsp;\r\n",
    "PostedDate": "2008-09-05T07:38:43.503-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "116353",
    "ThreadId": "33296",
    "Html": "That's the whole point of Rawr, and what it already does. It doesn't rate stats, it rates the whole character only. Item values are defined as the difference between your whole character's rating (DPS, in this case) with the item equipped, and the item's slot empty. So effectively, the value of stats changes based on your existing stats, without actually putting values on stats specifically. (So that it remains completely accurate).<br>\r\n",
    "PostedDate": "2008-09-05T08:33:26.297-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]