[
  {
    "Id": "110467",
    "ThreadId": "33331",
    "Html": "Now that Rawr has the ability to read from -- and write to -- WoW SavedVariables files, the question is should additional features like the CharacterProfiler importer be added?<br>\r\n<br>\r\nAnother feature which could be useful (particularly for a druid who travels around with multiple gear sets) is to allow Rawr to view avaiable&nbsp;gearsets using an addon like Outfitter, and even to create new ones.<br>\r\n<br>\r\nParsing outfits should be very straight forward, and you could get a drop-down with your kitty, bear &amp; heal or moonkin gear sets.&nbsp; Saving existing outfits having swapped in or out an item should be pretty straight forward too, the only minor challenge is creating new outfits (and I mean minor challenge), and, as the case is for outfitter, checking or unchecking which pieces of gear are locked to that outfit.<br>\r\n<br>\r\nIs this something interesting to more people than me?<br>\r\n<br>\r\nOriginally my frustration with Rawr was that it only had ready access to the gear I happen to be wearing in the armory.&nbsp; The CharacterProfiler takes care of that.&nbsp; Now what I'd like to do is, having chosen best possible gear sets, to be able to save them.<br>\r\n<br>\r\nI'd be happy to try to implement the same functionality for other gear set addons (outfitter's not the only one) if this is something that appeals to folks.<br>\r\n<br>\r\nChar<br>\r\n",
    "PostedDate": "2008-08-11T18:41:27.73-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "110468",
    "ThreadId": "33331",
    "Html": "Having to relaunch WoW would take longer than just equipping the items it tells you... Writing outfitter gear sets doesn't seem very useful to me, because of that. That's not to say that I'm against Rawr having that feature, just that I personally doesn't find it useful. Additionally, it would have to assume that you already have all the items, with those gems/enchants, which would quite commonly be wrong (when making new gearsets, and changing gems/enchants).<br>\r\n",
    "PostedDate": "2008-08-11T18:48:23.637-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "110494",
    "ThreadId": "33331",
    "Html": "I'm confused...<br>\r\n<br>\r\nWhy would you need to relaunch WoW?&nbsp; Did you mean to reload the UI if you're editing item sets while playing?<br>\r\n<br>\r\nFor me this is a feature I'd use when I'm <em>not</em> logged into WoW...&nbsp; And it's more of an issue of input not output -- querying the various gear sets you have configured &amp; making small adjustments to it.&nbsp; As it stands I usually need at least 3 Rawr saves for the various gear sets I use, this would avoid the need to do that because I'd be able to query them from my save.<br>\r\n<br>\r\nBut anyway, I'll see if anyone else is interested.&nbsp; If not, well, I don't necessarily need to pollute Rawr's source with it.&nbsp; fwiw, the SavedVariables export feature seems to work reasonably well with my limited testing so there may be other opportunities there.<br>\r\n<br>\r\nChar<br>\r\n",
    "PostedDate": "2008-08-11T21:42:31.873-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "110522",
    "ThreadId": "33331",
    "Html": "I think it's a useful feature.<br>\r\n<br>\r\nRight now I'm using a custom exporter that reads from the batch file to save all gear sets for use in game. Some features that I would find useful is to provide some way to export the character in canonical form. For example the optimizer doesn't care about slot 1 or 2 for trinkets and I want the specific activatable trinket to always be in the same slot so I have the exporter do those swaps automatically. (I'm not using Outfitter though, using my own fork of Wardrobe)\r\n",
    "PostedDate": "2008-08-12T01:18:03.22-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "110593",
    "ThreadId": "33331",
    "Html": "I suppose a full relaunch isn't necessary, just a log out, but a ReloadUI won't work. Again, there's no problem with 'polluting Rawr's source'. I personally wouldn't use it, but you and Kavan would, and there are probably more people who would too.<br>\r\n",
    "PostedDate": "2008-08-12T08:05:27.033-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "110643",
    "ThreadId": "33331",
    "Html": "This is definitely interesting to me.&nbsp; I'd like to be able to jump around among my various armor sets with just one load of a save file. &nbsp;I use CharacterProfiler and Outfitter to track my various gearsets and keeping everything straight can get confusing.&nbsp; I've got Moonkin, PvP, Healing and Bear sets (I respec pretty often depending on what someone needs me to do that day).<br>\r\n",
    "PostedDate": "2008-08-12T11:02:54.787-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]