[
  {
    "Id": "111630",
    "ThreadId": "33689",
    "Html": "I've setup a wishlist for my hunter twink. It consists mostly of badge and kara gear and full raid buffs.<br>\r\nFor Beastmaster I've selected one-shot rotation. <br>\r\n<br>\r\nNow I got these strange results for ranged weapons:<br>\r\n1.) badge x-bow<br>\r\n2.) legendary<br>\r\n3.) barrel-blade<br>\r\n4.) wolfslayer<br>\r\n5.) tuskbreaker<br>\r\n6.) legionkiller<br>\r\n7.) steelhawk x-bow<br>\r\n...<br>\r\n12.) archimonde bow<br>\r\n...<br>\r\n14.) illidan bow<br>\r\n...<br>\r\n16.) vashj bow<br>\r\n<br>\r\nMy knowledge about hunter theorycraft is very limited, but I still wonder how the opera event gun can beat the illidan bow Oo<br>\r\nI know BM hunters from my raid and I cant recall they passed on vashj/archi/illi weapon.<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n",
    "PostedDate": "2008-08-17T09:58:53.403-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "111646",
    "ThreadId": "33689",
    "Html": "Try different shot rotations. Which rotation you're using drastically affects the DPS you end up with for each weapon.<br>\r\n",
    "PostedDate": "2008-08-17T12:28:25.697-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "111656",
    "ThreadId": "33689",
    "Html": "I understand that. But I've read that you only do the one-shot-rotation (auto-&gt;steady-&gt;auto-&gt;steady) when you've specced BM and I'm trying to optimize my gear according to my talents.<br>\r\n",
    "PostedDate": "2008-08-17T13:36:23.617-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "111666",
    "ThreadId": "33689",
    "Html": "Hmm... I'm pretty sure that even as BM, you may use a 3:2 rotation depending on weapon speed.<br>\r\n",
    "PostedDate": "2008-08-17T15:28:38.283-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "111759",
    "ThreadId": "33689",
    "Html": "The theory that you should use a one to one rotation is just a general frame of reference for a BM hunter and not that accurate anymore.&nbsp; It really depends on your gear.&nbsp; Your dps depends entirely upon your bow speed and how many shots you can get off in a given set.&nbsp; Wolfslayer is indeed an excellent weapon for a BM hunter with little haste because of its low speed, which means in a hard one to one rotation (not mixing in any shots such as arcane or multi) you are almost clipping your auto shot, which is what you aim for in a one to one.&nbsp; The archi and illidan bow are both 3.0 speed, which means a one to one rotation is actually horrible for them unless you have stacked haste like no other.&nbsp; For those you really want a 3-2 rotation.&nbsp; The rest of your gear will really decide which bow is better to use.<br>\r\n<br>\r\nIn my case, being an Orc so I don't get +crit from using a bow and the rest of the gear that I have, the badge crossbow and a 1-1 rotation is better for me DPS wise then the illidan bow and a 3-2.&nbsp; This changes if I ever get the golden bow out of sunwell due to the stats of that bow, in which case, I'll switch to a 3-2 rotation because that bow is a slower speed. (the 4pc t6 bonus also helps that decision because of the increase in steady shot damage, 4pc t5 also influcnces gear stacking and shot rotation due to the increase in steady shot crit)<br>\r\n<br>\r\nIf you do not have much haste gear, a 3-2 rotation will probably give you more DPS and you'll see the results you are looking for.&nbsp; The slower weapons also can edge out in a raid environment where you'll get stacking haste effects such as bloodlust, drums, etc.&nbsp; There is a point of diminishing returns in stacking haste with the faster weapons due to both auto shot clipping and the gcd.&nbsp; It all depends on your gear, and group set up. <br>\r\n",
    "PostedDate": "2008-08-18T06:15:03.423-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "111807",
    "ThreadId": "33689",
    "Html": "Wow thank you, that's one great post ^^<br>\r\nI've visited several forums and nobody could explain. 8[<br>\r\n",
    "PostedDate": "2008-08-18T09:30:39.227-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]