[
  {
    "Id": "111868",
    "ThreadId": "33759",
    "Html": "Hey, I wrote Rawr.Healadin and Rawr.Tankadin, but I quit WoW around 2.5 months ago. But, I am no longer nearly as busy now so I am going to update/finish both of them now. I would like any feedback you could give about any bugs and features you would like to see. Since I have sort of been out of the WoW loop for a few months. Tankadin I never really finished and is very buggy/not correct, mainly with threat, and wasn't really meant to be released in its current form.",
    "PostedDate": "2008-08-18T13:14:30.02-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "111870",
    "ThreadId": "33759",
    "Html": "I posted an issue regarding this, but Protadin doesn't have Combat Table or Relative Stat Values.&nbsp; I can't tell if a 15stam gem is better than a 10 defense gem or a 12 spell damage gem without editing various pieces to try different gemmings.&nbsp; I know rawr.mage, rawr.cat, and rawr.bear all have these figures and I find them very useful, especially when getting started.<br>\r\n<br>\r\nYager<br>\r\n",
    "PostedDate": "2008-08-18T13:42:58.057-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "111921",
    "ThreadId": "33759",
    "Html": "Well for that specific case, there's a Gems chart, Yager.<br>\r\n",
    "PostedDate": "2008-08-18T18:14:17.753-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "112130",
    "ThreadId": "33759",
    "Html": "The problem I am finding with the tankadin setup is when I try to optimize my current gear set with thoroughness set to max or min or anywhere in between it (in my opinion) doesn't take into account the most crucial number, my defense rating.&nbsp; It will let my defense rating completely lapse and stack, for example all stam gems in each slot.&nbsp; I think being uncrushable is vital for a pally tank but I can't find a setting where this becomes priority one.<br>\r\n",
    "PostedDate": "2008-08-19T12:05:47.803-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "112227",
    "ThreadId": "33759",
    "Html": "Great program, been using this since early beta on my druid. For the tankadin model, if it hasn't been suggested already, is to have some sort of a slider or something to add the defense from anticipation, much like the option in retribution to add the talent precision to the hit rating. Hopefully this isn't in place and I somehow missed it. Also, it was showing 493 defense as being .48% chance to be crit?<br>\r\n",
    "PostedDate": "2008-08-19T20:50:08.703-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "112791",
    "ThreadId": "33759",
    "Html": "From EJ:<br>\r\nI played around with the Tankadin model for the first time today, and\r\nwhile it's a good start, there's still a lot to be done. Here are my\r\ninitial impressions:<br>\r\n<br>\r\n-- Balance between mitigation, survival, and threat components in\r\nsignificantly unbalanced to the point where the &quot;overall&quot; ranking is\r\nnot meaningful. That affects all slots, but is particularly notable in\r\nthe neck, ring, and back slots, where you have to scroll way down to\r\nfind tanking options as the top choices are spell damage pieces.\r\nIdeally people should be able to alter the relative weights of threat,\r\nmitigation, and survival, but certainly the default weighting of threat\r\nneeds to be turned way down.<br>\r\n<br>\r\n-- Hit, Expertise, and Spell Hit currently have no effect of threat in\r\nthe model....these stats do play a role in Tankadin threat, especially\r\nExpertise at late-game gear levels.<br>\r\n<br>\r\n-- The mitigation/survival terminology is not something I'm used to\r\nseeing. Typically in the Tankadin community the division is expressed\r\nin terms of mitigation (effective health related, e.g. stam, armor,\r\nblock value) and avoidance (miss/dodge/parry). If you want to use the\r\nexisting terms to be consistent with other modules, the tooltips should\r\nexplain at least roughly what the terms mean.<br>\r\n<br>\r\n-- TPS calculations look to be on the low side, though I haven't dug\r\ninto this in detail yet. At a minimum, it's not taking into account the\r\nthreat gains you&quot;ll get from the mana returns on Spiritual attunement.<br>\r\n",
    "PostedDate": "2008-08-21T15:11:54.603-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "112822",
    "ThreadId": "33759",
    "Html": "Ah yes, I found the sliders. Those sliders and the armor slider should\r\nbe changed to just text boxes though I think because there are too many\r\nvalues to select one precisely, and this is especially needed when it\r\ncomes to armor. Also, the Threat slider scales from 1 to 1000, but the\r\ndefault setting of 100 is already way too high, so that variable should\r\nbe rescaled.<br>\r\n",
    "PostedDate": "2008-08-21T16:59:22.127-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "112892",
    "ThreadId": "33759",
    "Html": "I set the threat slider to 20 and the mitigation slider to around 3750 and it starts to give some accurate details, but as you said it is pretty broken as a whole.&nbsp; I do like the current concept though.&nbsp; I like the ability to set it to build different sets...my overall &quot;best&quot; tanking set, a stam set, and maybe an avoidance set<br>\r\n",
    "PostedDate": "2008-08-22T01:57:35.367-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]