[
  {
    "Id": "112254",
    "ThreadId": "33873",
    "Html": "I'm not sure if I've been setting the optimization requirements incorrectly.&nbsp; Every time I set a Greater Than or Equal To requirement, the optimizer seems to bug out and give a bad optimization.&nbsp; The Less Than or Equal To requirement works just fine.&nbsp; I've tried different types of requirements (Haste Rating, Expertise Rating, etc) and it still turns out very weirdly.&nbsp; I'm trying to use RAWR to find the optimal Bear Tanking set while keeping the Hit Rating above a certain threshold.&nbsp; Any input would be appreciated.<br>\r\n",
    "PostedDate": "2008-08-20T01:01:05.503-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "112361",
    "ThreadId": "33873",
    "Html": "You'd probably want to optimize Overall Rating, with an additional requirement of Missed Attacks &lt;= 20% (or whatever scalar you feel appropriate), if you just care about landing the first few attacks, or Hit Rating &gt; 100 (or whatever scalar you feel appropriate) if you care more about taunt resists.<br>\r\n<br>\r\nIf you still get results you don't think are right, please post the character file and exact requirements used, and we can take a look.<br>\r\n",
    "PostedDate": "2008-08-20T08:45:54.797-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "112375",
    "ThreadId": "33873",
    "Html": "I still seem to be having the same issue with any &gt;= requirements.&nbsp; When the optimization works correctly, the bottom left corner of the optimization screen shows the overall points as it searches through the gear.&nbsp; When I use a Greater than or Equal for some number like 45, all I see as the optimization searches is -45.&nbsp; It also finishes the optimization in about 8 seconds, much quicker than it should.&nbsp; I'm not sure if this is just my computer, I'll try and reinstall the software again.<br>\r\n",
    "PostedDate": "2008-08-20T09:24:54.497-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "112413",
    "ThreadId": "33873",
    "Html": "Negative values mean that it's short by that much in trying to find a set that meets the requirements. Again, please post the character and exact requirements that it's not able to meet.<br>\r\n",
    "PostedDate": "2008-08-20T10:57:46.417-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]