[
  {
    "Id": "114045",
    "ThreadId": "34354",
    "Html": "Hi!<br>\r\n<br>\r\nWhen I right click on an item and ask to &quot;open in wowhead&quot; it opens the webpage at &quot;http://www.wowhead.com/?item=ITEM#&quot; (where ITEM# is the item number)<br>\r\n<br>\r\nWould it be possible to chose the language in rawr to open it at &quot;http://fr.wowhead.com/?item=ITEM#&quot; or at &quot;http://de.wowhead.com/?item=ITEM#&quot; etc. ?<br>\r\n<br>\r\nIf Rawr looks for the item names in wowhead, would it then be possible to have them in german/french/spanish in the program itself (instead of english)?<br>\r\n<br>\r\n<br>\r\nCorwin<br>\r\n",
    "PostedDate": "2008-08-27T01:05:50.737-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "114152",
    "ThreadId": "34354",
    "Html": "Shouldn't be too hard to implement some sort of switch for what wowhead locale site to use. I'll look into doing that, but probably won't make it for b16... Item names in different languages is probably a bit far off at this point, sorry, but I'll keep it in mind for later.<br>\r\n",
    "PostedDate": "2008-08-27T08:35:44.88-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "137615",
    "ThreadId": "34354",
    "Html": "Hello Rawr team<br>\r\n<br>\r\nFirst of all, kudos for this marvelous program. IT has changed my hunter life, by giving me the opportunity to tweak efficiently my items.<br>\r\n<br>\r\n<br>\r\nSo... To avoid opening a new thread, let me use this one to express my support for this localization idea here<br>\r\n<br>\r\nI personnally use Rawr without the given items list. I prefer to keep a short list of items that my current character has access to, or should be able to access soon. As I play with French version, I enter each time the localized name, but any wowhead/armory update will replace them by english version.<br>\r\n<br>\r\nSo a support for locale version of wowhead and also armory would be a major improvment!<br>\r\n<br>\r\ncheers<br>\r\n",
    "PostedDate": "2008-12-04T04:38:53.46-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]