[
  {
    "Id": "115952",
    "ThreadId": "34909",
    "Html": "Hi, firstly let me say thanks for creating and enhancing a great tool!<br>\r\n<br>\r\nI have a couple of points for review that I first noticed in b15 and are still there in b16:<br>\r\n<br>\r\n1)&nbsp; The Greaves of Malorne are shown as by far and away the best Cat DPS leggings, beating many items with far better basic stats.&nbsp; Is this a bug, or am I missing something?<br>\r\n<br>\r\n2)&nbsp; It would be great to include the +2 threat enchant on gloves.<br>\r\n<br>\r\nMany thanks..and keep up the great work :)\r\n",
    "PostedDate": "2008-09-04T03:34:47.913-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "115954",
    "ThreadId": "34909",
    "Html": "Hmmm...the 2t4 +20 energy chance maybe?&nbsp; Surely it's not worth <em>that</em> much DPS increase?\r\n",
    "PostedDate": "2008-09-04T03:42:12.823-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "116028",
    "ThreadId": "34909",
    "Html": "The 2-piece T4 is worth almost 90 DPS in my gear. Yes, the DPS increase is that big (and scales with better gear).<br>\r\n",
    "PostedDate": "2008-09-04T07:43:53.54-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "116052",
    "ThreadId": "34909",
    "Html": "Yes, 2T4 is huge, and should be used until after you've been farming Kil'Jaeden for a while.<br>\r\n<br>\r\n2% threat too gloves is not a good enchant for ferals. For comparison, it's quite easy to tell the value of it; just find 2% of your total TPS.<br>\r\n",
    "PostedDate": "2008-09-04T08:44:25.92-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "116067",
    "ThreadId": "34909",
    "Html": "Both; thanks for such a swift response and comprehensive too.&nbsp; I'll surely be keeping 2t4 for cat at least for some time to come...<br>\r\n<br>\r\nyeah..I have +15agi on my gloves atm, but continue to have real difficulty remaining at the top of all the mobs threat list when tanking 3 or more mobs.&nbsp; It was that problem that prompted me to ask the question.&nbsp; I realise that this is not the place to discuss aggro retention issues - and also suspect that it's more to do with my gameplay than anything else..just wanted to note why I had asked the Q; that's all :)\r\n",
    "PostedDate": "2008-09-04T09:08:23.47-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "116096",
    "ThreadId": "34909",
    "Html": "Yeah, pretty much any time any feral has asked about 2% Threat, it's because they're not using their skills as well as they could. Additionally, if you're gemming all stam, that also hurts your TPS too. Against 3 mobs, you want to to Mangle every time it's up, and fit 3 swipes in between each mangle. Same thing against 2 mobs. Against 1, you want to Lacerate instead of Swipe, unless your Swipes do more TPS than Lacerate (that happens when you get 4T6, or a bit later depending upon gemming).<br>\r\n",
    "PostedDate": "2008-09-04T10:56:10.82-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]