[
  {
    "Id": "812256",
    "ThreadId": "349120",
    "Html": "<p>No this is not saying that I'm dropping as a developer.</p>\n<p>What I am saying is that I'm in the early stages of redesigning the the modules partly in order to get ready for Mist of Pandaria. The Cat and Bear modules were one of the first modules to be in Rawr (actually they could have been the first....meh). Anyway  do to the nature that they were ports of Tangedyn's old web-based calculator, they were starting to show their age.</p>\n<p>Especially during Cata, it was getting extremely difficult to get close approximations between what Rawr was providing and what SimC and Mew were giving. In large part to this was how the rotation was generated for both. They relied HEAVILY on speed, thus  they were cutting a few corners. This also led to giving less accurate results (very close in terms how to gear but in terms of dps, it was hit-or-miss).</p>\n<p>What this means for the future is that I'm going to try and get a better, more accurate rotation going for both. I will try my&nbsp;darnedest&nbsp;to not sacrifice too much on speed. I've just added my first set of coding as a side project to the cat module so that  it does not interfere with what is currently in place. Once I feel more confortable with what I have, I'll merge the new stuff into the cat module and will eventually changed the module name to \"Feral\" in preparation of MoP.</p>\n<p>Afterwards I'll do the same with the Bear module. Hopefully once I have the groundwork in place for the new Feral module I can use it as a basis for the Guardian Module.</p>",
    "PostedDate": "2012-03-18T15:23:15.617-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "813268",
    "ThreadId": "349120",
    "Html": "<p>Yep - Rawr was originally a feral DPS tool way back in the day.&nbsp;&nbsp;&nbsp; I feel old now :)</p>",
    "PostedDate": "2012-03-20T15:57:33.15-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "814030",
    "ThreadId": "349120",
    "Html": "<p>Heh, I remember those days. &nbsp;Mage and Moonkin were pretty much the first non-feral modules added to Rawr. &nbsp;I've been on this project longer than any of my meatspace jobs.</p>",
    "PostedDate": "2012-03-22T06:24:11.277-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "834263",
    "ThreadId": "349120",
    "Html": "<p>Thought I would give an update. I just posted a major update to the Rawr 5 Feral module.</p>\n<p>&nbsp;- Rotation is close to what I'm hoping.</p>\n<p>- DPS scores are a bit off (25k dps in BiS T13 heroic).</p>\n<p>- Mastery Rating is not giving much value.&nbsp;</p>\n<p>- The other thing I have not gotten to is I have yet to get to the new Talents and glyphs.</p>\n<p>Keep in mind that Trinkets and other Special Effects have not been modeled yet, and I'll get to them next.</p>\n<p>&nbsp;</p>\n<p>Edit:</p>\n<p>&nbsp;- Mastery should now be working correctly. Crit Maybe valued a tiny bit too high though, but in T13 Heroic gear Mastery, haste, and Crit are running about the same (currently showing as Mastery &gt; Crit &gt; Haste).</p>",
    "PostedDate": "2012-05-09T13:55:31.577-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]