[
  {
    "Id": "816440",
    "ThreadId": "350288",
    "Html": "<p>Hello, I got som problem with rawr with my mage. I know all statistics about hard and soft cap of haste at fire mage or at Arcane mage. But problem ist that at Fire mage is this very good utility counting haste to next tick of combustion so about 2200+ haste  depending on gear and still too low to crit that is also needed.</p>\n<p>This is from some forum :&nbsp;</p>\n<p><span>You will primarily want Intellect = Hit &gt;&gt; Haste 2005 (1505 t13) &gt; Crit &gt;&gt; Mastery &gt;&gt; Haste. Tier 13 gear is covered in haste; getting the 2005 haste mark for Combustion's haste plateau is very easy and the rest of your gear should be reforged towards  Crit, prioritizing even Mastery over Haste after the 2005 threshold. More information on stat prioritization is TBD, but this is the best we have right now.</span></p>\n<p>&nbsp;</p>\n<p><span>And for arcane mage with T13 2 set, goblin and +5 percent haste rad buff is soft cap 1124.</span></p>\n<p>&nbsp;</p>\n<p><span>So my question is, if there is possibility to count at optimization that you are goblin, 2set of T13, 5 percents of haste raid buf and this soft cap of haste for fire or arcane /i know that with DS gear you arent to able get 1124 haste cause gear is  full of haste/ and set priority to Crit at fire mage. Cause as i have tried at DS bosses , at static fight its good to have extra tick of combustion at adds and so, but at fight that your character is set on boss and no adds is crit better.&nbsp;</span></p>\n<p><span>What do you think, what is prio stat at fire for counting, depending of haste caps or your gear or boss and arcane too :) ? Thanks all for discusion :)</span></p>",
    "PostedDate": "2012-03-28T02:15:14.8-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "816807",
    "ThreadId": "350288",
    "Html": "<p>For arcane it's pretty clear, you don't want haste, you can't get rid of enough of it. Fire it's a bit different, there's two ways to gear for it, one goes for high haste, one for high crit, both result in different playstyle and will have different effect of rng. From theoretical point of view they're usually not far apart, but based on your playstyle you might favor one over the other.</p>\r\n<p>As far as optimization goes, all the things you mentioned are already taken into account.</p>",
    "PostedDate": "2012-03-28T13:53:26.37-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "816817",
    "ThreadId": "350288",
    "Html": "<p>Thanks a lot for response :)</p>\r\n<p>But i havent found where to set options to go to crit or to haste except of setting conditions at optimatization to have at most about 1500 haste at fire mage. So please if there some other way to set this to different kinds of way of playing Fire mage /haste or crit/ please tell me.</p>\r\n<p>Thanks a lot again :)</p>",
    "PostedDate": "2012-03-28T14:10:42.463-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "817496",
    "ThreadId": "350288",
    "Html": "<p>There is no other way, setting optimization conditions is the intended way to achieve that. There are a few ways to go about it. The way I would do it is to set a constraint of Haste &lt;= X, starting with a very high X and keep lowering X until you get  to a balance that you like.</p>",
    "PostedDate": "2012-03-29T19:42:20.233-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "817582",
    "ThreadId": "350288",
    "Html": "<p>Ok thank you very much</p>",
    "PostedDate": "2012-03-30T00:48:46.243-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]