[
  {
    "Id": "117281",
    "ThreadId": "35290",
    "Html": "I am a resto druid looking for tank/cat gear.&nbsp; All my&nbsp;resources go towards healing gear first and it is very rare to get a feral epic/raid drop; so&nbsp;I use whatever I can easily aquire.&nbsp; I have a wishlist&nbsp;I was trying to check stats on and noticed some &quot;lower-level&quot; items(blues or better) missing from certain lists.&nbsp; Not sure if these have been mentioned or not:<br>\r\n&nbsp;&nbsp;&nbsp;&nbsp;Dragonhide Helm/Spaulders to Bear (certain pvp types are listed but not all faction rewards)<br>\r\n&nbsp;&nbsp;&nbsp;&nbsp;Guardian's/Assassin's Alchemist Stone, etc.<br>\r\n&nbsp;&nbsp;&nbsp;&nbsp;Idols - Idol of Brutality, Idol of the Claw etc. -&nbsp;several&nbsp;&quot;lower&quot; level idols are not listed<br>\r\n&nbsp;&nbsp;&nbsp;&nbsp;Expedition Scout's Epaulets to Cat/Naaru's Belt of Precision to Cat&nbsp; - and other &quot;low level&quot;(Blue BC Q/Instance drops) may be&nbsp;missing(from other class lists too??)<br>\r\n&nbsp;&nbsp;&nbsp;&nbsp;Fel Leather Gloves/Boots to Cat<br>\r\n<br>\r\n&nbsp;- Also, I cannot turn off the Clefthoof set bonus for my non-leatherworker.(Fel Hide too??)<br>\r\n<br>\r\nGreat program!&nbsp; Easy to use and informative.&nbsp; Thank you for your time!<br>\r\n<br>\r\n<br>\r\n<br>\r\n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<br>\r\n&nbsp;&nbsp;&nbsp;&nbsp;<br>\r\n&nbsp;&nbsp;&nbsp;&nbsp;\r\n",
    "PostedDate": "2008-09-09T10:45:22.64-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "117431",
    "ThreadId": "35290",
    "Html": "Re: Missing Items - No, no items are 'missing'; see the readme.<br>\r\n<br>\r\nRe: Missing Stats (ie the effects of some pre-bc idols) - We'd need to specifically add support for these, and it's just not worth it. There's always a better, easily obtainable, BC idol.<br>\r\n<br>\r\nRe: LW-only Set bonuses - We don't have support for the profession-requirements on set bonuses. Again, it's not worth bothering with, because the effects are so minor, and don't change the value of other items. Just don't worry about it.<br>\r\n",
    "PostedDate": "2008-09-09T19:46:09.34-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]