[
  {
    "Id": "843310",
    "ThreadId": "357901",
    "Html": "\r\n<p>Looking at the DPS DK model and viewing potential upgrades for Boots I&nbsp; noticed that the &quot;Chono Boots&quot;, a level 378 Tanking item are listed as superior to the &quot;Treads of Crushed Flesh&quot;, a level 384 DPS item.</p>\r\n<p>Reviewing the stats relating to DPS shows the following:</p>\r\n<p>Chrono Boots:<br>\r\nSTR = 281&#43;40 (Socket 1) = 321<br>\r\nEXP = 186<br>\r\nHST =&nbsp; 79 (Reforge from Dodge)<br>\r\nCRT = 0<br>\r\nMST = 0</p>\r\n<p>Treads of Crushed Flesh:<br>\r\nSTR = 280 &#43;40 (Socket 1) &#43;40 (Socket 2) &#43;20 (Socket Bonus) = 380<br>\r\nEXP = 0<br>\r\nHST = 73 (Reforge from CRT)<br>\r\nCRT = 110 (After taking 73 to HST)<br>\r\nMST = 198</p>\r\n<p>I am struggling to understand how it is possible to rank an iLvl 378 item that has -59 STR higher than an iLvl 384 item.</p>\r\n<p>Anyone that follows the EJ theorycrafting will be well aware that STR is by far the most significant stat for DKs, dwarfing everything else by a considerable margin.</p>\r\n<p>Running 10k Patchwerk iterations in SimC whilst varying the equipment used shows the following DPS values:</p>\r\n<p>Chrono Boots: 19895 dps<br>\r\nTreads of CF : 20101 dps</p>\r\n<p>This is the expected outcome but appears at odds with your gear finder result where the Chrono Boots (rated by RAWR at 926.93) are place above the treads of Crushed Flesh (rated by RAWR at 921.01).</p>\r\n<p>So, it appears there is a problem with your gear evaluation. Certainly it is at odds with both common sense and with testing via SimC.</p>\r\n<p>Any comment as to why this anomoly exists?</p>\r\n<p>Also, why is the default Meta Gem recommendation the Chaotic Shadowspirit Diamond, rather than the correct one (Reverberating Shadowspirit)?</p>\r\n<p>I did expect that RAWR would at least suggest the correct one and let me stuff it up if I wanted; rather than suggesting the wrong one and expecting me to correct it. I guess it will be offering &#43;Spirit gems in all sockets next..</p>\r\n<p>For a model that is supposedly &quot;Cata Ready&quot; it sure looks dodgey.</p>\r\n",
    "PostedDate": "2012-05-31T14:21:58.79-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "849105",
    "ThreadId": "357901",
    "Html": "<p>Sorry for the delay... I've been buried in RL stuff.</p>\r\n<p>I can't posit the specific problems with the model w/ the basic info here.&nbsp; I need your full character to see what might be causing the possible discrepancy.&nbsp; Please post the character to an Issue Tracker defect, and I'll take a look.&nbsp; There may be other issues that aren't readily visible based on the limited information provided.</p>\r\n<p>Thanks.</p>",
    "PostedDate": "2012-06-14T09:39:16.2-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]