[
  {
    "Id": "121244",
    "ThreadId": "36554",
    "Html": "I found out about Rawr through a WoW Insider article. WoW Insider is a reputable source of WoW information so the fact that they were recommending an application (as opposed to a website or add-on) gave me some confidence in that application's reliability and popularity. After reading about the program, I was excited to try it out, and downloaded/installed it. Everything worked fine, and it was already providing very useful information. I then saw a menu item saying something to the effect of &quot;Check WoWHead&quot;. Upon clicking this, several popup windows opened up, my wallpaper changed and I had a massive amount of spyware on my laptop. Unfortunately my laptop was pretty old, and this essentially caused the whole thing to crater.<br>\r\n<br>\r\nFortunately I got a replacement laptop at no cost, and I'm back up and running again. But after checking the comments on WoW Insider, and the discussions on this site, I see no mention of anybody else having this issue. So, what happened? Did I do something wrong? Is there something I can use to prevent that from happening? I want to use Rawr as it looks live a very powerful tool, but I don't want to have to get a new laptop everytime I use it.<br>\r\n<br>\r\nAppreciate any help you guys can offer.<br>\r\n<br>\r\n-V\r\n",
    "PostedDate": "2008-09-26T13:56:01.263-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "121272",
    "ThreadId": "36554",
    "Html": "I'm sorry for what happened to you, but it had nothing to do with Rawr. The menu item you refer to, &quot;Open in Wowhead&quot;, just opens a default browser window to &gt;http://www.wowhead.com/?item=ITEMID&lt;. There are two possibilities of what happened... A) Your computer was already infected with all that crap, it just didn't activate until you visited any webpage or something. B) A banner on Wowhead distributed spyware, and you're using an old, unpatched version of IE. Either way, nothing to do with Rawr. I suggest you keep your computer updated with all the latest system updates, and try out Rawr on your new computer.<br>\r\n<br>\r\nIf anyone is concerned about any spyware, viruses, etc, included with Rawr, you're free to view the source code and build it yourself, it's completely available here, on the source code tab.<br>\r\n",
    "PostedDate": "2008-09-26T18:11:07.877-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "121277",
    "ThreadId": "36554",
    "Html": "Thanks for the quick response. I'm not sure how the system got infected, but I had been having some issues with patches before so it may be a security leak got exploited. In any case, I'll give Rawr another shot on a more up to date computer (after backing some things up just in case) and see how it goes.\r\n",
    "PostedDate": "2008-09-26T19:11:23.913-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "121704",
    "ThreadId": "36554",
    "Html": "Another thing I would highly recommend is to install Firefox and set it as your default browser.&nbsp; It is MUCH less prone to spyware and malware than IE.<br>\r\n",
    "PostedDate": "2008-09-29T13:32:44.19-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]