[
  {
    "Id": "125042",
    "ThreadId": "37706",
    "Html": "Hi!<br>\r\n<br>\r\nFirst, I think it's amazing you were able to release the first cut of 2.0 so fast, kudos to everyone!<br>\r\n<br>\r\nI am trying to use 2.0 for my bear druid. However it seems like the items are still using their pre-3.0 values. For example, as we know, all non-arena leather armor that had green values for armor, most notably the heavy clefthoof set in my case, is still showing the original stats for the items. Looking at the armory, it look slike my druid still has the same gear and old stats.<br>\r\n<br>\r\nGiven how rawr uses armory data, how do&nbsp;I use 2.0 today to analyze my current bear gear and upgrades?<br>\r\n<br>\r\nThanks,<br>\r\nNick\r\n",
    "PostedDate": "2008-10-14T09:26:18.827-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "125057",
    "ThreadId": "37706",
    "Html": "The default item cache included in Rawr 2.0.0 included the new armor values for all leather; however, if you loaded a character which uses gemmings of those items that Rawr doesn't already know, it loads the item data from the armory, which still has the old data. So best way is to just wait til the armory is fixed. In the mean time, equip one of the gemmings that came with the default itemcache, and delete the high armor one it loaded.<br>\r\n",
    "PostedDate": "2008-10-14T10:55:23.627-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "125071",
    "ThreadId": "37706",
    "Html": "Mono users will have to wait until the Armory is fixed.&nbsp; No gear is displayed for any slots in the &quot;Chart: Gear &gt; Slot&quot; dropdown menu unless a character is loaded from a saved Rawr character profile.&nbsp; Then only the items that were checked for the optimizer will be displayed.&nbsp; Trying to load a character from the armory results in a crash.&nbsp; Stacktrace:<br>\r\n<br>\r\n&nbsp; at (wrapper managed-to-native) System.Drawing.Carbon.QDEndCGContext (intptr,intptr&amp;) &lt;0x00004&gt;<br>\r\n&nbsp; at (wrapper managed-to-native) System.Drawing.Carbon.QDEndCGContext (intptr,intptr&amp;) &lt;0xffffffff&gt;<br>\r\n&nbsp; at System.Drawing.Carbon.ReleaseContext (intptr,intptr) &lt;0x000c0&gt;<br>\r\n&nbsp; at System.Drawing.Graphics.Dispose () &lt;0x0004f&gt;<br>\r\n&nbsp; at (wrapper remoting-invoke-with-check) System.Drawing.Graphics.Dispose () &lt;0xffffffff&gt;<br>\r\n&nbsp; at System.Drawing.Graphics.Finalize () &lt;0x00013&gt;<br>\r\n&nbsp; at (wrapper runtime-invoke) System.Drawing.Image.runtime_invoke_void (object,intptr,intptr,intptr) &lt;0xffffffff&gt;<br>\r\nAbort<br>\r\n<br>\r\n",
    "PostedDate": "2008-10-14T12:00:22.07-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "125204",
    "ThreadId": "37706",
    "Html": "Armory(US) have been fixed (ad least I see a correct values there). But Rawr still download old armor values :(&nbsp; Item cache also contain some items with old values. Now I am trying to upgrade item cache...<br>\r\nAfter refreshing item cache, all ok now.<br>\r\n",
    "PostedDate": "2008-10-14T23:55:25.823-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]