[
  {
    "Id": "125225",
    "ThreadId": "37765",
    "Html": "Hi <a id=\"ctl00_ctl00_MasterContent_TabContentPanel_Content_ThreadList_ctl07_FirstPostPreview_PostUserName\" href=\"../../site/users/view/Astrylian\">Astrylian</a>. It seems, that new Rawr wrong processing defense stat, See the screen:\r\n<br>\r\n<a id=\"ctl00_ctl00_MasterContent_TabContentPanel_Content_ThreadList_ctl07_FirstPostPreview_PostUserName\" href=\"http://img521.imageshack.us/img521/9904/rawrpx9.gif\">http://img521.imageshack.us/img521/9904/rawrpx9.gif</a>\r\n<br>\r\nAlso at screen, (I have all 3 of &quot;survival of the fittest&quot;) , <strong>Gilded Thorium Cloak</strong><span> vs </span><strong>Thoriumweave Cloak</strong><br>\r\nDose 24 def rating(0,4 miss) so good vs 5 armor and 5 stam at this point?<br>\r\n2.0.1 same behavior...<br>\r\n<br>\r\n",
    "PostedDate": "2008-10-15T02:30:50.613-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "125462",
    "ThreadId": "37765",
    "Html": "The tooltip showing &quot;CRITTABLE&quot; is obviously a bug and not correct. The calculation of defense is indeed correct though; half of defense's value avoids diminishing returns, so is valuable.<br>\r\n",
    "PostedDate": "2008-10-15T17:32:14.997-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "125559",
    "ThreadId": "37765",
    "Html": "I think there may be something not quite right with defence calc. Although I am surprised that defence gems are showing as better than agility for mitigation, I can see that might be the case. However it is showing that 12 defence and 10 defence have exactly the same value. Surely this can't be right. Also 4def/6stam and 5def/7stam have the same mitigation value.\r\n",
    "PostedDate": "2008-10-16T05:16:22.11-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "125621",
    "ThreadId": "37765",
    "Html": "This isn't an error, this is accurate. Defense *skill* gives you avoidance, defense *rating* gives you def skill, in a stepwise manner. Offhand, I think it's like 2.4 def rating per def skill. If you have exactly enough def rating to give you a certain def skill, then adding 1 or even 2 more def rating isn't enough to give you 1 more def skill, so is worthless. Rawr takes that all into account. <br>\r\n<br>\r\nAs for defense being better than agility for mitigation... Yeah, it's possible, at very high dodge levels (due to the miss half of def being nearly unaffected by diminishing returns). I do know that there's one bug with its calculations, where it's applying DR to your base agility, which it shouldn't, but that just raises the bar of when defense is better than agility.<br>\r\n",
    "PostedDate": "2008-10-16T08:56:38.867-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "125816",
    "ThreadId": "37765",
    "Html": "OK, thanks. I didn't realise defence skill was integer. I assumed that even though it only showed whole numbers on the tooltip, the actual calculations would use all your rating.\r\n",
    "PostedDate": "2008-10-17T02:39:01.663-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]