[
  {
    "Id": "127297",
    "ThreadId": "38376",
    "Html": "<p>I just want to start by saying that I am more impressed with the work you are doing here then any other gear program/site to date. I love the interface as well as the intensity of the program.</p>\r\n<p>I myself am a spreadsheet fanatic and create spreadsheets of the best sets of gear for all classes all situations. It is what I do to pass time and help my guildies.</p>\r\n<p>In my day of supplying these spreadsheets to people I have experienced ideas in which you might want to implement. These things are all you call on weight of work to program gain.</p>\r\n<p>This is one of the easier I believe to code... the downfall is that you would need to put in the database exactly which locations items dropped in:<br>\r\nI think it would be great if there was an option in which you could have players select what instances they have access to at this point. This will allow them to find the best gear possible at the progression level they are at. For example...if I was looking at my holy priest and wanted to look for upgrades, you auto created upgrade list (as amazing as it is) would be great if I told it I had access to SSC and The EYE. This would give me an upgrades list according to the gear that I have access to seeing drop or attaining. And Illidan drops would not be in there.</p>\r\n<p>That being said I wouldn't worry about implementing this idea until you hit the 80 benchmark.</p>\r\n<p>For now that is all I wanted to mention and if it isn't worth the effort no big deal. I just thought to be helpful.</p>\r\n<p>Thank you for you time and I code for a living so if you ever need any help feel free to let me know. I live for this sort of thing. I am not sure of a private way to send the creators my email in case the help is needed... a response here will work just fine.</p>\r\n",
    "PostedDate": "2008-10-23T12:24:12.99-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "127305",
    "ThreadId": "38376",
    "Html": "Hey, thanks for the comments, it's appreciated!<br>\r\nWe do intend to expand the filtering functionality, including filtering by item source.<br>\r\n<br>\r\nIf you're experienced with C# and would like to help out, send em an e-mail, cnervig@hotmail.com<br>\r\n",
    "PostedDate": "2008-10-23T12:57:06.833-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "128160",
    "ThreadId": "38376",
    "Html": "<p>This feature will be great, and I hope personaly that it will get implemented.</p>\r\n<p>A related issue that I hope you will work on is the ability to only show the best version of a item,<br>\r\n3 gemslots and 4 different gems of interest can give many iterations of one item spread all over the upgrade list.</p>\r\n<p>Thanks for this wonderfull tool, and keep up the good work,</p>\r\n",
    "PostedDate": "2008-10-27T17:59:01.523-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "128162",
    "ThreadId": "38376",
    "Html": "The item filtering is working in 2.0.3.<br>\r\n",
    "PostedDate": "2008-10-27T18:09:22.83-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]