[
  {
    "Id": "127956",
    "ThreadId": "38575",
    "Html": "Hi guys, <br>\r\n<br>\r\nfirst wanted to say that rawr is a great tool and thanks for updating the tree section the new spell power is pretty confusing for gear choice. One quick question, is there going to be an update to the cat model before the move to level 80 gear? <br>\r\n",
    "PostedDate": "2008-10-27T01:06:23.873-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "127965",
    "ThreadId": "38575",
    "Html": "No, there won't be. It just wasn't worth it, since cats are terrible in 3.0 at 70, and rather complex to model (and alot of that modeling would be wasted when we switched to level 80). So, we're skipping 3.0@70 for cats, and going right to 3.0@80.",
    "PostedDate": "2008-10-27T02:15:48.933-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "128021",
    "ThreadId": "38575",
    "Html": "I didn't know that cats were that hard to model. Thanks for the work. IF you need help I can lend a hand.<br>\r\n",
    "PostedDate": "2008-10-27T08:22:21.35-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "128035",
    "ThreadId": "38575",
    "Html": "I noticed that Toskk released a level 70 version of his calculations;&nbsp; how hard do you think it would be to put those into the current rawr ?&nbsp; I'm just looking for something I can make rough comparisons among gear, using the current cat dps specs (like the AGI to crit conversion).&nbsp; If its not too complicated, I could take a stab at changing the model.<br>\r\n<br>\r\n<br>\r\n",
    "PostedDate": "2008-10-27T09:26:24.307-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "128054",
    "ThreadId": "38575",
    "Html": "It's very complicated. Most importantly, it doesn't matter. Min/maxing requirements for 70 are almost non-existant, and much of the calculations would go out the window in 17 days.",
    "PostedDate": "2008-10-27T10:36:45.077-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "128062",
    "ThreadId": "38575",
    "Html": "I was thinking of being able to use rawr to give rough comparisons of items gained while leveling, rather than using it for min/maxing at maximum level, since I expect to take more than a few days to get to level 80 once the expansion is released :-)<br>\r\n<br>\r\nSince its that complicated, though, I can understand how its not worth the effort;&nbsp; for the time being I guess I'll just add a bunch of the missing items to Toskk's level 70 3.0 model and get by with that for leveling.<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n",
    "PostedDate": "2008-10-27T11:13:29.773-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "128084",
    "ThreadId": "38575",
    "Html": "By leveling, you mean 70-&gt;80? Rawr 2.1 will be out by the time WotLK is released, supporting 80 (and approximately leveling) content.<br>\r\n",
    "PostedDate": "2008-10-27T12:24:10.443-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]