[
  {
    "Id": "128255",
    "ThreadId": "38664",
    "Html": "<p>Hello,</p>\r\n<p>First, thank you very much for an absolutely amazing tool &amp; program that simplifies a really difficult decision-making process &amp; automates it for the most part.</p>\r\n<p>Now I am not by any means questioning the designer's knowledge of the subject, but I would like to confirm whether the patch changes &amp; new talents for the Warrior, for example, especially in the Protection tree have been fully considered &amp; correctly taken into account in the new Rawr model. The version I'm using is 2.0.3. And I am concerned particularly about the new Block Value and Block Rate changes for a Warrior.</p>\r\n<p>The reason I am concerned about this is what I have observed when trying to find gear upgrades for my Protection Warrior using Rawr 2.0.3. Before using the program, I had a hunch feeling that Shield Block Value &amp; Rate are much more important now, and can be very useful in mitigation, survival, and even threat. I noticed that when I use the &quot;Overall&quot; rating of a gear slot to find upgrade, Rawr 2.0.3 tends to favor stamina over anything else, which is fair enough. However, I also noticed that by following almost all the gear upgrades that were indirectly recommended to me using the &quot;Overall&quot; rating (as they were way above the current piece of gear I have in that slot for example when it comes to Overall rating), I ended up with slightly higher defense, considerably more Hit Points (or life), and a lot more armor, yet my shileld block value (or how much damage I'm blocking stayed roughly the same more or less), and my shield block rate (or how often my chance of blocking is) dropped from almost 25% to 13%!</p>\r\n<p>This was probably because I replaced just 2 to 3 trinkets &amp; armor pieces that were considerably increasing my shield block rate, yet they were way down in the list of Overall ratings for that slot in Rawr 2.0.3.</p>\r\n<p>Can someone please shed some light onto this issue? As I mentioned, I am concerned because the little experience I have with the new talent trees gives a fairly strong hunch feeling that Shield Block Rate and Value is really important now for any Protection Warrior who wields a shield, as it it can mitigate damage by avoiding it completely or partially and also contribute to threat by causing damage with the very blocks and highly increasing damage of skills like Shield Slam.</p>\r\n<p>Many thanks.</p>\r\n",
    "PostedDate": "2008-10-28T04:31:00.927-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "128321",
    "ThreadId": "38664",
    "Html": "<p>I did some reading, and noticed two relevant things: Rawr 2.0.3 ProtWarrior model is only partially updated. And agility may still be better for Warriors than Block Value or Rate, as it helps completely avoid damage by dodging, rather than mitigating some of the damage by blocking.</p>\r\n<p>However, I would still be curious to know whether the current ProtWarr model has already taken into account the changes of patch 3.0 that are related to Shield Block &amp; Rate. I would also still be curious &amp; interested to read some comments from any of the developrs or more experienced Warriors, because it seems to me like Rawr was favoring trinkets with a lot of Stamina &amp; armor for the Overall rating, than trinkets with block value &amp; rate. I wonder if this is accurate because it is part of what was updated, or it is still one of the things to be updated for the ProtWarr model.</p>\r\n<p>The reading I did, though, clarified to me another observation I made from looking at how Rawr 2.0.3 rated Overall the same gear items with different gemming, putting agility gemming ahead of strength gemming for the Protection Warrior. From the sound of it, agility helps in raising the dodge chance, thus avoiding all damage, and also increases armor and crit chance, while strength helps reduce damage partially by increasing block value (seems inferior to dodge indeed), and increases attack power (which is only a threat concern). Threat does not seem like a big issue now for a fairly well-equipped Warrior with good cycles going on. With that said, I'd still be interested in reading any comments from more knowledgeable players. Are my conclusions accurate and in-line with the changes of patch 3.0 to the Warrior? And if these conclusions are correct, then why do I keep seeing epic Warrior items favoring strength a lot more than agility?</p>\r\n<p>I totally realize that this is not a forum for Warriors, but my questions are specifically related to understanding why the Rawr model rates ProtWarr gear the way it does, and why it seems sometimes like Blizzard is not in-line with these conclusions when it comes to the epic gear they offer to Warriors, for example.</p>\r\n",
    "PostedDate": "2008-10-28T08:48:40.267-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "128327",
    "ThreadId": "38664",
    "Html": "Hey, thanks for the comments and questions. (And yeah, this is the right place to discuss it)<br>\r\n<br>\r\nAs you suspect, the block rate/value calculations haven't been updated for 3.0. We're still working on it, and will have ProtWarr back up to speed, asap.<br>\r\n",
    "PostedDate": "2008-10-28T08:59:41.34-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "128688",
    "ThreadId": "38664",
    "Html": "Hi. Thank you for replying. This explains enough to me for the time being.<div><br></div><div>I have a question that is not related to shield block or value. I noticed that for the enchanting upgrades, particularly &quot;Overall&quot; rating, for the cloak for example, Major Armor (+120 armor) is rated well higher than Steelweave (+12 Defense Rating). Regardless to block rate &amp; value, is this a correct &quot;Overall&quot; rating or do the current updates needed for the ProtWarr involve something like this too?</div><div><br></div><div>Thank you very much again. And take your time. May you work be easier.</div>",
    "PostedDate": "2008-10-29T11:39:16.253-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "128698",
    "ThreadId": "38664",
    "Html": "So much of the core calculations of ProtWarr are still in progress, that I wouldn't put much weight on anything it says, until we get it fully fleshed out.<br>\r\n",
    "PostedDate": "2008-10-29T12:23:10.45-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "130470",
    "ThreadId": "38664",
    "Html": "Thank you again, Astrylian. I realize this could be a sensitive question as I am going to mention a well known brand name, but I think it is still important, at least for Rawr users, to know what Rawr developers think about the ratings given to gear at WoWhead. They have a comparison tool that allows you to compare 2 items, and you can also make the comparison related to a Protection Warrior or DPS Warrior, for example. How would you rate the reliability of their gear ratings today? Do you think one can partially rely on them until Rawr gets updated fully for Protection Warriors?<br>\r\n",
    "PostedDate": "2008-11-06T03:58:59.477-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "130561",
    "ThreadId": "38664",
    "Html": "Well, first, Wowhead rates gear using weightings. As in, there's a weight assigned to each stat, and each stat on an item is multiplied by its weight and totaled up to give the score for an item. Weighting and Equivalency Point systems are common in theorycrafting, and not really bad, per se, they're just not accurate. They don't try to be accurate. The weights don't change when the value of a stat changes (hit capped? Hit should drop in value. With a weighting system, it doesn't). But weighting systems are easy to understand, and fast to implement and use. So they're good for when you want a quick answer, with no fuss. Just make sure that you understand that the scores you get from a system like this are the value of that item to a &quot;typical&quot; ProtWarr, not the value of the item to you.<div><br></div><div>Second, Wowhead's weightings haven't been updated for 3.0. I'm working on solving that problem, actually.</div><div><br></div><div>And no problem with sensitivity; Rawr is going to support loading item data from Wowhead soon, so has already chosen a side in that war. :)</div>",
    "PostedDate": "2008-11-06T09:14:10.65-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]