[
  {
    "Id": "129007",
    "ThreadId": "38886",
    "Html": "Hello,<br>\r\n<br>\r\nI'm using regularly Rawr to compute the best setting selecting the stuff I have currently access to.<br>\r\n<br>\r\nWhile I'm using more and taking more into account Rawr Cat (well not now as it's not updated) results as 70% of the time I raid is in cat form DPSing, but I ran into this following problem :<br>\r\n<br>\r\nAs I won't likely have twice the same item I would gem and enchant it for dps'ing rather than for tanking ('cause my main role is dpsing in raids), is there a way to retain the gem/enchants of my Cat gear (not allowing regem/reenchant) to let Rawr compute if those items can be useful in bear form or other inferior items I may have in bank but properly gemmed/enchanted to tank would be better than the dps oriented items ? I tried overriding gemming/enchanting but it seems it didn't work and always fill my bear gear with 12 sta gems everywhere, hence not activating my 12 agil/3% crit damage meta on my T4 helm I still use on both gear.<br>\r\n<br>\r\nMore generally (as I think the problem is deeper), how should I use Rawr to sort that out ?<br>\r\n<br>\r\n<br>\r\nSide question : is stuffing for threat in bear form worths it ? Or even with a survivability/mitigation only stuff bears are able to hold aggro against every ferocious dps'er ?<br>\r\n<br>\r\n<br>\r\nThanks !<br>\r\n<br>\r\nHatred<br>\r\n",
    "PostedDate": "2008-10-30T11:18:15.563-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "129060",
    "ThreadId": "38886",
    "Html": "Indeed, there is a way to do what you want. You can mark a specific gemming (and enchanting) of an item available, rather than the item as a whole. Find the gemming of the item that you want in the chart, and ctrl-click the diamond. That'll mark it with a blue diamond instead of a green one, and only that gemming of the item will be considered available. Then you can right click on the diamond and choose an enchant, to force it to use that enchant. Make sure that the item as a whole isn't available (no green diamond next to the other gemmings of the item).<br>\r\n<br>\r\nAnd yeah, bears can just go all survival/mitigation and still hold aggro, currently. That may change at 80, and we'll have Threat working again in Bear, by that time.<br>\r\n",
    "PostedDate": "2008-10-30T16:13:14.283-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "129814",
    "ThreadId": "38886",
    "Html": "Thanks to your answer, I got Rawr working the way I want with your tips !<br>\r\n<br>\r\nI'm now just waiting for an update to Rawr.Cat, I'm such like a blind man without it lol. Cat DPS theorycraft was so much complex not to implement it yet ?\r\n",
    "PostedDate": "2008-11-03T16:15:16.653-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "130809",
    "ThreadId": "38886",
    "Html": "Regarding this &quot;control-click&quot; thing, it so happens that control-click is equivalent to right-clic on a Mac. This means this feature cannot be used on the Mac. Would it be possible to (optionally) use another modifier, such as alt, or maybe add a command to the same effect to the right-clic contextual menu?<div><br></div><div>That would be helpful.</div><div><br></div><div>Thanks.</div>",
    "PostedDate": "2008-11-07T07:06:25.96-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]