[
  {
    "Id": "128984",
    "ThreadId": "38881",
    "Html": "I've been trying to update my itemcache with some LK (mage) items so as to prepare a gear upgrade plan for Naxxramas. However, Rawr itself only talks to the armory and the RawrItemImport utility which Kavan posted towards the end of August isn't working very well anymore - wowhead changed some formatting which breaks e.g. spell power equip bonus. Furthermore, some procs and set bonuses would need to be added explicitly in the source in order for them to be calculated properly. My feeling is that Rawr would be the perfect tool for making such a gear wishlist, especially as it can accurately model my talents, spell rotations and damage at level 80. At the moment however, I am forced to search items in wowhead and manually add them to my itemcache one-by-one.<br>\r\n<br>\r\nSo I'm guessing that the official Rawr line is: once new items are on the armory we'll start supporting them, but I'm wondering has anyone been working on another solution for this? Whether within the Rawr team, or perhaps someone else who somehow built custom itemcache, buffcache, etc.?\r\n",
    "PostedDate": "2008-10-30T10:14:17.727-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "129049",
    "ThreadId": "38881",
    "Html": "We're actively working on it, and will have <em>something</em> for you before WotLK is released.<br>\r\n",
    "PostedDate": "2008-10-30T14:59:52.84-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "129058",
    "ThreadId": "38881",
    "Html": "If you have a list of set bonuses/item procs that would be good to have modelled let me know and I'll start adding it in.\r\n",
    "PostedDate": "2008-10-30T15:29:55.037-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "129236",
    "ThreadId": "38881",
    "Html": "Thank you Astrylian, I guess my concern was that Blizzard won't include LK items in the armory before the release date, which will effectively be too late to make a gear plan.<br>\r\n<br>\r\nKavan, obviously for mages there so far only the 2pc/4pc set bonuses from Frostfire, and the 2pc bonus from the crafted Dreadweave which I'm not interested in but others might be. Mostly I'm wondering how easy it is to implement the procs for some of the uncommon and superior-quality trinkets such as Forge Ember, Pendulum of Telluric Currents, Rune of Infinite Power, Spark of Life. Comparing with the start of TBC you will remember that Quagmirran's Eye was an awesome trinket even up to the release of Zul'Aman, but people didn't realise because haste wasn't understood so well. It would be good to have a clear idea of which one to farm, or if current trinkets will be better on the whole. Then there are the epic-quality trinkets which have various procs: Darkmoon Card: Greatness, Darkmoon Card: Illusion, Dying Curse, Embrace of the Spider, Extract of Necromatic Power, Je'Tze's Bell, Soul of the Dead, Sundial of the Exiled. I would like to compare these between various specs. You never know if there may be a nice synergy to be found somewhere.\r\n",
    "PostedDate": "2008-10-31T10:34:48.267-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "129291",
    "ThreadId": "38881",
    "Html": "Can't promise we'll have all the procs and special effects, but we should have most of the initial wave of WotLK gear in the default item cache, even if it's not on the Armory yet.<br>\r\n",
    "PostedDate": "2008-10-31T14:35:51.33-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]