[
  {
    "Id": "895616",
    "ThreadId": "390300",
    "Html": "\r\n<p>Hello rawr, I have been using rawr for over 2 years now and I congratulate all of you for a brilliant piece of work the addon for wow is fantastic too. My computer died on me and I had to replace my hard drive. I was using rawr via elitist jerks originally\r\n . Following the links and installing silverlight has become a nightmare. I keep installing silverlight exe, silverlight 5 and minefield of other silverlight stuff that i have no idea what they do or meant relevant to rawr. Can you please help a fool to find\r\n the right download and any bits that go with it to start rawr on Elitists web page. I suspect you all work extremely hard in developing rawr for idiots like myself who are not computer literate, but I do so enjoy what you have developed and feel naked without\r\n rawr.&nbsp; Any help will be greatly apreciated.</p>\r\n",
    "PostedDate": "2012-08-04T15:59:32.443-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "896312",
    "ThreadId": "390300",
    "Html": "<p>Sorry for not getting back to you sooner. Are you currently using Windows or Mac?</p>\r\n<p>Minefield...As in Firefox's beta for Firefox?</p>\r\n<p>If so then try using the normal Firefox (I know it works fine in my current version of Firefox).</p>\r\n<p>If you ware using Windows, you maybe running the incorrect version.</p>\r\n<p>Are you using 32-bit Windows or 64-bit. If you don't know go \"Start\"; Right-click \"My Computer\" or \"Computer\" depending the type of Windows you are running; then \"Properties.\" The \"System Type\" will tell you if you are using 32-bit or 64-bit.</p>\r\n<p>32-bit Silverlight 5 -&nbsp;http://go.microsoft.com/fwlink/?LinkId=229323</p>\r\n<p>64-bit Silverlight 5 -&nbsp;http://go.microsoft.com/fwlink/?LinkId=229324</p>\r\n<p>If you are using Mac -&nbsp;http://go.microsoft.com/fwlink/?LinkId=229325</p>\r\n<p>If you are STILL having issues, try Silverlight 4 -&nbsp;http://go.microsoft.com/fwlink/?LinkID=149156&amp;v=4.0</p>\r\n<p>&nbsp;</p>\r\n<p>Rawr was originally designed for Silverlight 4 but is backwards compatible in Silverlight 5. Try the links above. If those don't work let us know.</p>",
    "PostedDate": "2012-08-06T21:00:14.493-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "898915",
    "ThreadId": "390300",
    "Html": "<p>Hello Hinalover, thx for your reply. Didnt give you the details of my computer but you seem to have covered it all above. For the info its a 32-bit windows vista. I am running fire fox and will post you my success once I have downloaded the 32-bit silverlight 5 link. once again thx.</p>",
    "PostedDate": "2012-08-13T14:05:04.037-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "906236",
    "ThreadId": "390300",
    "Html": "<p>Hello again, its been a while since I said I would post my success.....well i wasnt having any success until i remembered I downloaded the WPF 4.3.8 file many months ago. I removed that now and got rawr to load YAY!!&nbsp; I am whole again. Success to you and all the rawr team. Great work!</p>",
    "PostedDate": "2012-08-30T04:05:55.157-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]