[
  {
    "Id": "899243",
    "ThreadId": "391577",
    "Html": "\r\n<p>As mentioned by blue posters, the pre-patch for Mist of Pandaria is August 28th.</p>\r\n<p>You have been warned.</p>\r\n",
    "PostedDate": "2012-08-14T10:56:25.473-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "899681",
    "ThreadId": "391577",
    "Html": "<p>I would still focus on the actual MoP release, don't divert work from level 90 functionality. If there'll be a Rawr release for 5.0.4 it'll probably only be a WPF release use at your own risk version.</p>",
    "PostedDate": "2012-08-15T13:42:20.197-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "899886",
    "ThreadId": "391577",
    "Html": "<p>I've already switched Rawr to use level 90 character profiles, so there is that. &nbsp;Speaking of which, any idea of when BossHandler is going to get bumped to level 93?</p>",
    "PostedDate": "2012-08-16T04:57:53.387-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "899973",
    "ThreadId": "391577",
    "Html": "<p>Well, I can start working on the BossHandler next. Almost at a good stopping point in the bear module. Problem is that we currently don't know the actual physical damage done from bosses. I think I read somewhere that one of the fights, Heroic Wind Lord; which is one of the last bosses in the Heart of Fear raid [T14.5]; I believe was doing 370k damage in 10 man Heroic. But that was early testing so that could change.</p>",
    "PostedDate": "2012-08-16T09:11:31.58-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "901730",
    "ThreadId": "391577",
    "Html": "<p>For tank modules, I can understand the need, but all I need for Moonkin is to bump up the target level so that my values for hit cap are correct.</p>",
    "PostedDate": "2012-08-20T16:04:30.363-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "901749",
    "ThreadId": "391577",
    "Html": "<p>If the levels are not bumped up now, let me know. I updated the base target level in the boss Handler. If that is not happening I'll look into it.</p>",
    "PostedDate": "2012-08-20T18:11:32.333-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]