[
  {
    "Id": "916424",
    "ThreadId": "396599",
    "Html": "\r\n<p>First of all I want to thank all the people working on Rawr for MoP. I know the time and effort is rather consuming and I personally appreciate your work.&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>Any idea on a timeframe of when this will go live for MoP? I'm planning on driving straight to 90 as soon as the servers go live and was hoping for a cheat sheet on gear I'm looking for Pre-raid.</p>\r\n",
    "PostedDate": "2012-09-23T18:31:23.137-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "916430",
    "ThreadId": "396599",
    "Html": "<p>It's quite funny. I literally asked Kavan the same thing not an hour ago.</p>\r\n<p>According to him he plans on releasing 5.0.0 tomorrow evening before Midnight PST.</p>",
    "PostedDate": "2012-09-23T18:55:11.247-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "916491",
    "ThreadId": "396599",
    "Html": "\r\n<p>Just take into account that it'll be very much a beta release, not all models are ready, but we'll push out whatever we'll have at the moment.</p>\r\n<p>This is the list of models that have any level of MOP support (meaning someone at least looked at it once, but that doesn't mean much):</p>\r\n<p>Bear, Feral, Moonkin, DPSDK, TankDK, Hunter, Mage, Brewmaster, Windwalker, ProtPaladin</p>\r\n",
    "PostedDate": "2012-09-24T00:18:04.397-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "917019",
    "ThreadId": "396599",
    "Html": "<p>An update on the mage model:</p>\r\n<p>The first beta release will only support Arcane. Fire and Frost still need cycles modeled, I'll get to it as soon as possible.</p>",
    "PostedDate": "2012-09-24T22:38:58.223-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "917401",
    "ThreadId": "396599",
    "Html": "<p>Also, on the hunter module:</p>\r\n<p>Survival is in the works in terms of being updated, but it's still missing pet damage. &nbsp;It is also using a relatively locked rotation that includes Explosive Shot and does not phase out Explosive Shot for Arcane Shot at high mastery levels (which some have suggested doing). &nbsp;Survival is also very slow because it's being calculated from scratch every time. &nbsp;I'm working on an optimization for that, but it's not in the release code yet. &nbsp;On a First Gen Core i7 it takes close to 90 seconds to calc, on a third gen Core i7 its more like 45 seconds. &nbsp;Just know that it is working and you will get results eventually.</p>\r\n<p>Marksmanship and Beast Mastery are on the list, but I'll likely try to get Survival really close before working on them. &nbsp;Many of the fixes that Survival is getting will be applicable to the others, as I've completely ripped out and replaced the previous state generation code. &nbsp;Feel free to post a request for which of MM or BM you want to see next. &nbsp;BM is in the lead right now because sims are showing it may be significantly higher DPS than MM, but that is obviously subject to change.</p>",
    "PostedDate": "2012-09-25T11:14:26.87-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "917582",
    "ThreadId": "396599",
    "Html": "<p>Enhancement and Elemental Models:&nbsp; Will not be ready for MoP use for at least 2 months.&nbsp; Don't have any time to be working on it at this stage.</p>",
    "PostedDate": "2012-09-25T18:56:24.11-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "917880",
    "ThreadId": "396599",
    "Html": "<p>I should mention that ProtPaladin will have *SOME* functionality, but it is very much a work in progress and, in particular, trinkets and other procs will be utterly broken for some time to come. &nbsp;I am also still working on the final math for the Divine Purpose talent and have not implemented the Glyph of HotR. &nbsp;However, I feel like the code is in a relatively good state for everything else.</p>",
    "PostedDate": "2012-09-26T08:12:45.297-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "917913",
    "ThreadId": "396599",
    "Html": "\r\n<p>I guess I should update as well:</p>\r\n<p>Guardian - Mostly complete. Rotation is really basic at this point and not taking into account Berserk or Incarnation.&nbsp; This also is affecting Force of Nature as a DPS value (not going to model the fact that the trees can taunt). Tier 90 talents are\r\n not modeled as well for the most part. The passives from Heart of the Wild IS modeled, but the damaging and healing activated part is not. When selecting Tier 14 gear, if you wish to evaluate Tier 14 set bonus, make sure to select &quot;Armor of the Eternal Blossom&quot;\r\n and not &quot;Battlegear of the Eternal Blossom&quot;.</p>\r\n<p>Feral - Rotation needs to be redone. I have a rotation in place but was an early concept of what it might be. The rotation will favor haste and crit over Mastery for all times outside T14 4-piece. When selecting Tier 14 gear, if you wish to evaluate Tier\r\n 14 set bonus, make sure to select &quot;Battlegear of the Eternal Blossom&quot; and not &quot;Armor of the Eternal Blossom&quot;.</p>\r\n<p>Brewmaster and Windwalker - I've started the backend work for these, but there is no working support&nbsp;at this point. I will be basing a lot of the Brewmaster work on the Excel file currently being used over on Elitist Jerks.</p>\r\n<p>Items - All rare and epic quality items should be in the database base-line. Source info is in place for most of the items. ~100 - 150 rare items are coming up as unknown on both wowhead and wowdb so I need to wait on where things drop from before updating\r\n them. Tier 14 gear is also not showing source info but these can be turned off if you select Token -&gt; Tier Armor in the filtering tab.</p>\r\n",
    "PostedDate": "2012-09-26T09:14:42.433-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "923207",
    "ThreadId": "396599",
    "Html": "<p>Hey Hinalover :).</p>\r\n<p>The other feral sites are all suggesting that Mastery/Crit is still top for feral and haste is by far the least useful stat even behind hit/expertise.&nbsp; I'm curious to know why your model will favor it so highly?</p>",
    "PostedDate": "2012-10-07T19:07:48.58-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "923240",
    "ThreadId": "396599",
    "Html": "<blockquote style=\"border: solid .1em #ccc; font-style: italic; margin: .25em 1em 0 1em; padding: 0 .25em 0 .25em;\"><strong>khanthal wrote:</strong><br />\r\n<p>Hey Hinalover :).</p>\r\n<p>The other feral sites are all suggesting that Mastery/Crit is still top for feral and haste is by far the least useful stat even behind hit/expertise.&nbsp; I'm curious to know why your model will favor it so highly?</p>\r\n</blockquote>\r\n<p>Like I said earlier, it was something I put in place early in the beta, before the idea of using (NS + HS) and Dream of Cenarious. I actually want to go back and re-do the rotation but I got caught up in the Gaurdian module that I never got back to it. I know currently once you have the T14 4-piece the module starts working better, but until then, it's only giving&nbsp;mediocre&nbsp;results at best.&nbsp;</p>",
    "PostedDate": "2012-10-07T21:50:45.02-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "923569",
    "ThreadId": "396599",
    "Html": "<p>Thanks for the note :).</p>\r\n<p>Even without DoC/NS/HS SimC is showing haste as the lowest. Also the current math is showing Thrash is worth adding to the rotation on OoC procs where you wont clip the bleed too heavy (or in times you are waiting for SR/Rip to fall and are sitting on 5cp and Thrash is off).</p>\r\n<p>But I suspect that will all work it's way out when you have time for the model again :).</p>\r\n<p>Thanks again; I love Rawr, I am hoping to use it again soon.&nbsp; I am using pawn for now with stat weights but it feels dirty and wrong haha.</p>",
    "PostedDate": "2012-10-08T10:36:33.173-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]