[
  {
    "Id": "131848",
    "ThreadId": "39726",
    "Html": "I'm seeing a lot of comments regarding Rawr.Mage overvalueing mana. From my point of view it is valueing it exactly, but I can see how for unexperienced users it might be confusing if they don't know how to set up all the parameters correctly. I'm considering adding an option for mana unrestricted solutions to help these users. What I would like to hear from you is whether it should be set as default or not. The reasoning for default is that the users that would need it are the ones that lack the knowledge of modifying parameters and would never find it if it was disabled by default. Would it be a huge inconvenience for experienced users to disable this when they want to value mana correctly?\r\n",
    "PostedDate": "2008-11-11T16:19:03.067-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "131851",
    "ThreadId": "39726",
    "Html": "What's usually the missing parameters? Buffs, I'm guessing? The mage-specific parameters, you could just use more lenient defaults (ie, 3 min fight duration). If it's mostly buffs, since that's the major thing we can't pull from the armory, would it solve things if we added some conspicuous '<strong>WARNING: You have not selected any buffs! Please select buffs on the Buffs tab, in order to get accurate calculations.</strong>'?<br>\r\n",
    "PostedDate": "2008-11-11T17:00:06.033-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "131865",
    "ThreadId": "39726",
    "Html": "Mostly it's buffs yes. Another possible solution would be to have a predefined default buff selection for new characters that corresponds to common raid setting.\r\n",
    "PostedDate": "2008-11-11T18:08:19.377-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "131871",
    "ThreadId": "39726",
    "Html": "Ah, true... Yeah, that sounds better.<br>\r\n",
    "PostedDate": "2008-11-11T18:55:07.577-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "131883",
    "ThreadId": "39726",
    "Html": "It's probably fair to assume that &quot;all&quot; class buffs would be a reasonable default.  Why? Because most 25 man raids will have nearly every buff category anyway with the class raid buff overlap and that's also an &quot;idealized&quot; situation that raid leaders will stack for.<br>\r\n<br>\r\nThe only real choice is about consumables(food, flask/elixir, &amp; not for long oil) and that is very class &amp; spec specific, but could easily have reasonable defaults.  I suppose you could even &quot;auto-select&quot; consumables like armor.  (ie pick +hit food if your not capped, then attack power/+dmg food, same idea for flasks/elixirs)<br>\r\n<br>\r\nLastly, about fight duration, since V3.0 nearly every fight is &lt; 1/2 the old duration, thus assuming 3 minutes instead of 6 is very reasonable.<br>\r\n<br>\r\nThose are pretty much the settings that I have to hand edit in whenever I load up a new char. \r\n",
    "PostedDate": "2008-11-11T20:15:37.107-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "131901",
    "ThreadId": "39726",
    "Html": "Actually for Naxx I think 5 min is a good default.\r\n",
    "PostedDate": "2008-11-11T21:45:16.05-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "132045",
    "ThreadId": "39726",
    "Html": "Not sure that standard buffs is the way to go, better go with the warning. The reason is that if you set buffs presuming 25-man, but the player is a 10-man raider then this will undervalue mana.\r\n",
    "PostedDate": "2008-11-12T09:04:04.487-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "132071",
    "ThreadId": "39726",
    "Html": "We can just be conservative on the standard buffs. The big one is Replenishment, which almost every 10man will have at least 1 of.<br>\r\n",
    "PostedDate": "2008-11-12T11:08:46.353-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "132078",
    "ThreadId": "39726",
    "Html": "Perhaps we should add some sort of help file?<br>\r\nAt least I would appreciate some space to write about my module: Things (not) implemented, things to consider, etc.<br>\r\nPerhaps some sort of &quot;First Steps&quot; for new users?<br>\r\n",
    "PostedDate": "2008-11-12T11:36:24.217-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "132092",
    "ThreadId": "39726",
    "Html": "Definitely would love to do a help file, just don't have time at the moment.<br>\r\n",
    "PostedDate": "2008-11-12T12:18:25.497-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "132131",
    "ThreadId": "39726",
    "Html": "I have the instructions in the wiki kindof, but I'd say 99% of users don't know it exists.\r\n",
    "PostedDate": "2008-11-12T14:39:48.613-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]