[
  {
    "Id": "921900",
    "ThreadId": "398046",
    "Html": "\r\n<p>I know this is probably asking the wrong end of the horse, but I have a login here but not for SimC discussion pages so thought I would give it a go...</p>\r\n<p>Prior to MoP SimC accepted RAWR .xml files for import, but that now appears to have gone - any ideas why this may have occurred?</p>\r\n<p>RAWR is useful for playing around with gear options, but it can't hold a candle to SimC for DPS simulation, so the mix of the two was extremely useful.</p>\r\n<p>With the import feature in SimC appearing to have gone it looks like RAWR will be replaced by Chardev, which although it is an acceptable product is nowhere near as useful and feature-rich as RAWR.</p>\r\n<p>This is a &quot;last gasp&quot; request prior to bailing from RAWR.</p>\r\n",
    "PostedDate": "2012-10-04T07:38:30.973-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "922237",
    "ThreadId": "398046",
    "Html": "<p>That is mostly on their side since they parse our saved files.</p>",
    "PostedDate": "2012-10-04T18:06:34.403-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "928824",
    "ThreadId": "398046",
    "Html": "<p>I just hacked Rawr Import back into SimC. It only needed specialization parsing, and translating the talent encoding a little bit.</p>\r\n<p>Mage prime glyphs are updated, but the rest will probably be completly out of date ( but that seems to be the case for some rawr class modules as well ).</p>\r\n<p>&nbsp;</p>\r\n<p>Should be included in the next SimC release 505-4, which may take a while.</p>",
    "PostedDate": "2012-10-18T08:58:50.593-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "929078",
    "ThreadId": "398046",
    "Html": "\r\n<p>Monks, Feral, Guardian, Boomkins, Hunters, and possibly Ele/Ehn shamans and Ret/Prot Pallies glyphs should be updated on our side. so you might want to check those out.</p>\r\n",
    "PostedDate": "2012-10-18T16:04:20.05-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]