[
  {
    "Id": "925993",
    "ThreadId": "399172",
    "Html": "\r\n<p>Is there a way to update the item cache without manually adding each individual item?&nbsp; If so how does one do so, and/or is there and update to the RAWR program coming soon with updated character models as well (particularly feral)? I know these things\r\n take a lot of time, any incite would be extremely helpful.</p>\r\n<p>I appreciate everything all of you have done, I've been using this program since I first discovered it back in the early days of BC, and I love it. Keep up the good work!&nbsp; Thank you!</p>\r\n",
    "PostedDate": "2012-10-12T13:42:11.88-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "926036",
    "ThreadId": "399172",
    "Html": "<p>Only refresh of individual items is currently supported. We do plan to make a new release this weekend with updated item cache though.</p>",
    "PostedDate": "2012-10-12T15:20:59.893-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "926037",
    "ThreadId": "399172",
    "Html": "<p>You would have to add each item individually.&nbsp;&nbsp;&nbsp;&nbsp; I haven't noticed anything missing so far though (other than quest greens).&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; In fact, the item cache is pretty up to date even compared to Wowhead.&nbsp;&nbsp;&nbsp;&nbsp; When I updated the justice items to fix for the iLvl 450 -&gt; 458 change it lost the source data and I had to tick the \"unknown\" filter to get them to appear.</p>\r\n<p>&nbsp;</p>\r\n<p>If you have noticed any items missing, i'm sure it would be useful to post them here, either to get them added to the default cache or to work out why they are not showing up if they are already there.</p>\r\n<p>&nbsp;</p>\r\n<p>I also can't wait for an update to the feral module in particular :)</p>",
    "PostedDate": "2012-10-12T15:21:39.25-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "926219",
    "ThreadId": "399172",
    "Html": "<p>Thank you both for your replies.&nbsp; I honestly can't remember, but I have found a few items that weren't currently in the module blues(non \"of the\" items) no big deal I've added them manually.</p>\r\n<p>Kavan, I know you said you were going to make a new release this weekend, is it only for the updated item cache or kitty module too :p&nbsp; I don't like using Sim C, and I know the stat values for kitty are confusing, depending on the particular talents chosen.&nbsp; If there isn't an update for this module could you by chance shed a little incite as to your experiences with talent dps choices for staying complete feral without HotW (I'd rather not have to hop out of kitty switch weapons and start casting. That's just my preference)?&nbsp; I know EJ hasn't really updated or explained much with that either. As always thank you and keep up the incredible job.</p>",
    "PostedDate": "2012-10-13T13:39:03.403-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "926279",
    "ThreadId": "399172",
    "Html": "<p>The release will include all changes on the models, but I don't think there was any additonal work on the feral model. Hinalover can clarify on that though.</p>",
    "PostedDate": "2012-10-13T20:43:10.157-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "926488",
    "ThreadId": "399172",
    "Html": "<p>I haven't done anything to the module itself (though I'll implement the 5.1 changes in this one since everything, according to GC were tooltip corrections).</p>\r\n<p>I'm going to start working on the item cache shortly and should not take that long to do.</p>",
    "PostedDate": "2012-10-14T17:20:13.803-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "926995",
    "ThreadId": "399172",
    "Html": "<p>Hinalover, Thanks for your reply and thank you for your time, effort, and work you've done on this.&nbsp; I wish I knew more about this stuff to be able to help.&nbsp; If you know of someway I can, please let me know.</p>",
    "PostedDate": "2012-10-15T14:48:29.99-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "927391",
    "ThreadId": "399172",
    "Html": "<p>Ok, the item cache should be in the next release.</p>\r\n<p>I also did a temporary adjustment to the Feral rotation before I start working on the Markov process. I basically hard-coded using Thrash 1/3rd of the times when Omen is active. It's a&nbsp;hack fix but should hold until I redo the rotation. But it should now show Mastery &gt; Crit &gt; haste right now.</p>",
    "PostedDate": "2012-10-16T07:00:17.537-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "927619",
    "ThreadId": "399172",
    "Html": "<p>Good to know, thanks!</p>",
    "PostedDate": "2012-10-16T12:37:43.08-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "935457",
    "ThreadId": "399172",
    "Html": "<p>Just wondering if you want feral issues reported at the moment or should I wait till you finish they work you are currently doing on the rotation etc.?</p>\r\n<p>&nbsp;</p>\r\n<p>Off the top of my head there are things like the main hand enchants not seeming to be ranked correctly (dancing steel seems underpowered) and expertise being rated higher than hit even with 100% behind boss selected.</p>\r\n<p>&nbsp;</p>\r\n<p>If it is helpful I can start making a list, but I am more than happy leave it till later once the model is cleaned up.</p>",
    "PostedDate": "2012-11-01T14:53:17.797-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "936989",
    "ThreadId": "399172",
    "Html": "<blockquote style=\"border: solid .1em #ccc; font-style: italic; margin: .25em 1em 0 1em; padding: 0 .25em 0 .25em;\"><strong>RareBeast wrote:</strong><br />\r\n<p>Just wondering if you want feral issues reported at the moment or should I wait till you finish they work you are currently doing on the rotation etc.?</p>\r\n<p>&nbsp;</p>\r\n<p>Off the top of my head there are things like the main hand enchants not seeming to be ranked correctly (dancing steel seems underpowered) and expertise being rated higher than hit even with 100% behind boss selected.</p>\r\n<p>&nbsp;</p>\r\n<p>If it is helpful I can start making a list, but I am more than happy leave it till later once the model is cleaned up.</p>\r\n</blockquote>\r\n<p>Thanks, I actually have not had much time given new job + MoP + Dailycraft sucking 95% of my time.Starting to get exalted with a few reps so I should start seeing more time to work on the module.</p>",
    "PostedDate": "2012-11-05T15:38:35.323-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]