[
  {
    "Id": "133139",
    "ThreadId": "40123",
    "Html": "Hi,I just downloaded latest version of rawr (2.1) and tried to launch it, but it completely fails. The only thing that happens is that it launches the start screen with classes/specs to choose, and then eats up the memory (up to 330MB used), then flushing the memory, then starting to eat it up again, rince n' repeat. It's not possible to select class/spec, it's just looping around while having fun with the memory :p<br>\r\n<br>\r\nI suspect this is because I run vista 64bit since Task Manager shows it as a 64bit program when it should be used as a 32bit program (I guess). Vista64 shows 32bit apps as &quot;name.exe *32&quot; but for rawr it just says &quot;rawr.exe&quot; which implicates it thinks it's a 64bit application. (I'm guessing a bit here).<br>\r\n<br>\r\nOr did anyone get it to work under 64bit vista?<br>\r\n<br>\r\nregards /skalman \r\n",
    "PostedDate": "2008-11-17T08:15:38.24-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "133191",
    "ThreadId": "40123",
    "Html": "It works fine for me under windows server 2008 x64.&nbsp; Not much help, I know...<br>\r\n",
    "PostedDate": "2008-11-17T10:13:51.507-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "133212",
    "ThreadId": "40123",
    "Html": "It's built for both 32bit and 64bit. I run it on Vista 64.<br>\r\n<br>\r\nI don't know of any problem like you describe, though. It never opens the main form?<br>\r\n",
    "PostedDate": "2008-11-17T11:19:32.373-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "133237",
    "ThreadId": "40123",
    "Html": "I get to the starting screen, you know the dark thingy with all the class/spec icons. Then it starts loading....and loading....and loading....infinitely, while eating up the ram up to 300MB usage. Weird, I know. Right now got it to work exactly once, then the same occured again :(<br>\r\n",
    "PostedDate": "2008-11-17T13:01:57.517-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]