[
  {
    "Id": "133205",
    "ThreadId": "40138",
    "Html": "First of all I wanted to again say thanks for RAWR and for the excellent effort in getting this updated while you still continue to add new class models.  I am a little confused in that the readme stated that Feral Bear and Cat were fully updated for 3.0, but also that there is still additional work to be done (which could mean for these or for the other modules not yet updated).  In any case, I am seeing what I believe to be some unexpected results.  I know this is no designed around a level 80 toon (which I'm not yet), but I still can't expalin a few things:<br>\r\n<br>\r\n1)  Using my lvl 72 toon, I started seeing basically no effect from either hit or expertise for either bear or cat, and this appeared to be confirmed by the Relative Stats Values graph which showed no value next to either of these.  Avoided attacks seem stuck on 0% regardless and altering/removing gear with hit or expertise makes no differnece in the results.  I would assume at some point having little or no hit would eventually raise the value of hit, but that didn't occur.<br>\r\n2)  I started playing around with differnt talent builds.  I compared a build with 2/2 Primal Precision which should add 10 expertise, and compared that to an untalented build.  The build with the additional experise was not adding any value to the expertise (or basically acting like I was untalented in this area).<br>\r\n3)  I repeated these with a &quot;New&quot; build with no gearing, and again, 2/2 primal precision did not add any expertise to my stats.<br>\r\n4)  I also tried this by randomly selecting cat gear from the middle fo the sorted list and ended up with similar results - no percieved value to hit or expertise.  And then if I lowered the hit to a low or non-existent amount, still no Relative Stats Values preference for it.<br>\r\n<br>\r\nI know that feral cat shouldn't be overly concerned with hit (i.e., take the item that gives you the best overall DPS), but I'm not seeing any effects of hit or experitse for cat, and I'm not seeing either hit or expertise showing as generating any additional threat for bear, which I beleive would be the case if I'm actually hitting my target better.  As much of the new WotLK gear seems to gfavor haste and/or expertise, I'm really interested in how potential upgrades rate and I am not sure I should be trusting the results I'm seeing right now.<br>\r\n<br>\r\nAlso just curious, I notice as a default for level 80 with no gear or talents, there is a +16 Weapons Damage value.  Where does that come from?<br>\r\n<br>\r\nThanks for any help steering me in the right direction.  \r\n",
    "PostedDate": "2008-11-17T10:50:38.437-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "133214",
    "ThreadId": "40138",
    "Html": "Hit/Exp being broken in Cat is a known bug, I'm working on fixing it. Haven't seen it happen in Bear though, but I'll check on that too.<br>\r\n<br>\r\n16 weapon damage is from Tiger's Fury.<br>\r\n",
    "PostedDate": "2008-11-17T11:22:16.367-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "133230",
    "ThreadId": "40138",
    "Html": "Thanks for the fast response.  I hope you will be able to get that part of the cat model working soon.  That being the case, to clarify on bear, hit and expertise are showing properly with Relative Stats Values.  It is apparently just the 2/2 Primal Precision expertise that I don't see in Bear being added to what appears to be the correct total for expertise by gear only.\r\n",
    "PostedDate": "2008-11-17T12:31:20.663-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]