[
  {
    "Id": "939747",
    "ThreadId": "402731",
    "Html": "\r\n<p>Some of you have probably heard this already, but starting next week I'll no longer be able to work on Rawr. I'll still be around, but I'll mostly be in support role to clarify things if anything comes up with special effects or the optimizer and of course\r\n to help with math questions :)</p>\r\n<p>Starting today I've added Hinalover as a new coordinator. He'll be in charge of day to day operations, which mainly means making releases, but if anyone else wants to help with things that's always welcome.</p>\r\n<p>We're always looking for new developers. Since Cataclysm we've lost quite a few of them so it would be nice if we could bring some more models up to date for MoP. I'd especially like to get someone to help maintain the Mage model. The model is currently\r\n mainly operational for MoP, but it still needs some modeling for glyphs and new aoe rotations.</p>\r\n<p>As always the right way to get up to speed if you would like to help on Rawr is to join us on the IRC channel\r\n<span>#rawr on irc.stratics.com. Also check&nbsp;<a href=\"http://rawr.codeplex.com/wikipage?title=Development%20Applications\">http://rawr.codeplex.com/wikipage?title=Development%20Applications</a>&nbsp;for further information on what is useful to know to be\r\n able to help.</span></p>\r\n",
    "PostedDate": "2012-11-10T17:01:23.707-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "940618",
    "ThreadId": "402731",
    "Html": "<p>I wish you the best of luck with everything you do Kav, been following rawr and all the work you've all been doing and have done.&nbsp; I wish there was someway I could help, but I don't know jack about any of this programming stuff.</p>",
    "PostedDate": "2012-11-12T15:11:30.58-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "940640",
    "ThreadId": "402731",
    "Html": "\r\n<p>Thanks for everything Kavan - and best of luck with whatever you do next.</p>\r\n",
    "PostedDate": "2012-11-12T16:17:08.703-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "942434",
    "ThreadId": "402731",
    "Html": "\r\n<p>Kavan, I wish I knew enough to be helpful, but sadly I don't. &nbsp;I have really (REALLY) appreciated all the work you've put into Rawr over the last few years. &nbsp;It's truly been an integral part of my WoW experience since... well, as long as I can remember.</p>\r\n",
    "PostedDate": "2012-11-15T17:10:36.85-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]