[
  {
    "Id": "133662",
    "ThreadId": "40283",
    "Html": "Hey all. Please plan for our next release to go out on this friday night. Please have everything that you want included checked in by 8pm PST.<br>\r\n",
    "PostedDate": "2008-11-19T08:28:17.873-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "133803",
    "ThreadId": "40283",
    "Html": "Just wondering if the Mongoose enchant will get modeled in this build for Rawr.Cat and others, or is it now outdated by WotLK enchants for sure so it's not even worthy considering it ? \r\n",
    "PostedDate": "2008-11-19T16:52:16.92-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "133874",
    "ThreadId": "40283",
    "Html": "Having issues with 2.1 and was wondering if they will be fixed with 2.1.1. <br>\r\nCurrently having issues with Edit. When I attempt to edit an item Rawr freezes. Also having&nbsp; a problem with the Rogue model it defaults to Druid.<br>\r\nOtherwise love the program keep up the good work! =)<br>\r\n<br>\r\n",
    "PostedDate": "2008-11-20T01:54:28.363-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "133958",
    "ThreadId": "40283",
    "Html": "Will 2.1.1 include fixes to the Cat bugs, and the feral changes that Ghostcrawler posted about http://blue.mmo-champion.com/26/12891010295-upcoming-feral-changes-part-ii.html?<br>\r\n",
    "PostedDate": "2008-11-20T09:58:54.117-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "134008",
    "ThreadId": "40283",
    "Html": "Rawr 2.1.1 will probably not include the WoW 3.0.4 changes (but maybe. If anything, it'll be an option).<br>\r\n<br>\r\nRawr appearing to freeze when you hit Edit is just due to 2.1 including a *ton* of new items, and the first launch of the editor always taking a long time.<br>\r\n<br>\r\nMongoose MAY be modeled, not sure yet.<br>\r\n",
    "PostedDate": "2008-11-20T12:37:54.113-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "134193",
    "ThreadId": "40283",
    "Html": "Hope all the perfect cut gems have been added now because those are pretty much the best available right now over here.<div>Also, any changes upcoming for the retr module? It seems to me like armor penetration rating is getting terribly overrated in the 2.1.0 version and was making items with the armor pen stat 25-35% better then any other item of the same ilvl...</div>",
    "PostedDate": "2008-11-21T03:44:09.763-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "134285",
    "ThreadId": "40283",
    "Html": "You can add whatever items you want, provided they're on Wowhead or Armory.<br>\r\n",
    "PostedDate": "2008-11-21T08:43:19.013-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "134343",
    "ThreadId": "40283",
    "Html": "I've only just started using Rawr, and I think its an awesome tool for comparing gear choices. So first off, thanks for creating this!<br>\r\nI've been using this program for my moonkin and I've noticed that the talent tree you use for Rawr isn't updated to the one that<br>\r\nis now used on live servers. For example, in the balance tree for druids our Moonfury and our Earth and Moon talents are no longer<br>\r\n5 point talents. They now only require 3 points to max.<br>\r\n<br>\r\nMoonfury<br>\r\n&nbsp;Increases damage done by your Starfire, Moonfire, and Wrath by 3% / 6% /10%<br>\r\n<br>\r\nEarth and Moon<br>\r\nYour Wrath and Starfire spells have a 100% chance to apply the Earth and Moon effect, which increases spell<br>\r\ndamage taken by 4% / 9% / 13% for 12 seconds. Also increases your spell damage by 1% / 2% / 3%<br>\r\n<br>\r\nAny chance we could see this changed in this new release?<br>\r\n<br>\r\nEdit: My apologies! If I had scrolled down the discussions a little bit I would have seen the thread that already<br>\r\naddresses this. Sorry for the redundancy! <br>\r\n<br>\r\n<br>\r\n<br>\r\n",
    "PostedDate": "2008-11-21T12:12:11.2-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "134438",
    "ThreadId": "40283",
    "Html": "Ummm.. you forgot to add the new levels for the ret paladin options. Still only allows us to choose level 73 as the bosses level.. Fix this asap please!\r\n",
    "PostedDate": "2008-11-22T04:19:29.923-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]