[
  {
    "Id": "134005",
    "ThreadId": "40374",
    "Html": "Hello, first off I am relatively new to Rawr but I think it is just OUTSTANDING!&nbsp; I looked through all the menus and tried to do a search on discussions but was not able to find an answer to my question.<br>\r\n<br>\r\nIs there any way that I can narrow down the large list of items to just the 2-3 I want to look at?&nbsp; For example if there is a quest with 2 different spell power cloak rewards and I want to compare both to the one I have equipped, can I trim the list down to just those 3 instead of having to scroll through 100 or so to find the specific one I need?&nbsp; I know there are certain filters in place but I would like to just be able to type in the names of the items I want to look at, or click a checkbox or something.<br>\r\n<br>\r\nThank you in advance for any help<br>\r\n",
    "PostedDate": "2008-11-20T12:34:14.36-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "134031",
    "ThreadId": "40374",
    "Html": "Kind of. In the popup to choose an item for a slot, there's a filter bar at the top that will let you type in a partial item name, and it'll filter to that as you type. That's just the one item though. We plan to improve the 'overload of irrelevant data in the charts' problem with future releases.<br>\r\n",
    "PostedDate": "2008-11-20T13:34:39.387-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "134046",
    "ThreadId": "40374",
    "Html": "Actually this is something I wanted to have a few times. Usually I just use the upgrade list, but sometimes when I don't have it or the one I have is slightly out of date I would like to just compute the upgrade value of any particular item. The optimizer already has this functionality, it's just a question of adding a front end for it. I'll probably add a menu option in the context menu for items to compute this. Another benefit will be that since you're computing value for only one/few items you can afford to use full thoroughness and get more accurate results.\r\n",
    "PostedDate": "2008-11-20T14:00:20.803-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]