[
  {
    "Id": "134489",
    "ThreadId": "40539",
    "Html": "Requests for future versions (most of these apply to Rawr.Mage):<br>\r\n<br>\r\n* Update for level 80 specs - All presets are still level 70<br>\r\n* Addition of Potion of Speed and Potion of Wild Magic to consumable options (whereas Destro Pots are the only selector now)<br>\r\n* Glyph Tooltips - All glyphs currently show the &quot;Optomize Armor&quot; tooltip<br>\r\n* Black Duskweave set bonus not implemented<br>\r\n* Figurine - Twilight Serpent showing 2min cooldown, not 5 minute (probably causing the item to be overvalued)<br>\r\n* When a blacksmith socket is added to a belt, it breaks the socket bonus on the belt.<br>\r\n<br>\r\nAnd these are more wishful than anything:<br>\r\n* Have Rawr remember if I imported the last item from wowhead or the armory.&nbsp; I do most of my importing from wowhead and its irritating to have to keep checking that box for every item.<br>\r\n* Is there a way to make the comparisons section (i.e. the right half of the window) properly scrollable with the mouse wheel?&nbsp; I can do it if I hit an arrow key first, but it seems like it should do it natively.<br>\r\n",
    "PostedDate": "2008-11-22T10:45:38.243-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "134501",
    "ThreadId": "40539",
    "Html": "Been using this for a long time now and I love it! handy as I have 4 'mains' and keeping track of the best upgrades is a bit of a headache!<br>\r\nhowever for future release I would love to see the following<br>\r\n<br>\r\n- A way to turn off duplicate items and the best one with the best gem combo been shown only, to make the lists alot shorter and easier to locate the item you are looking for. I am currently getting around this by going to each slot then going thou the list by clicking the delete all duplicates but this gets wiped every time Rawr gets updated :'(<br>\r\n- Ability to add a socket to the relevant slots from Blacksmithing, Add buffs from Skinning and Mining.<br>\r\n- Working Glyphs (Maybe as a new Tab, Stats, Talents, Glyphs, Buffs, Options or similar)<br>\r\n- The Ability to have a bit more power over what items appear, ie for a mail wearer to select both Leather and Mail to appear. A Rouge to be able to select that Druid only gear doesn't appear and visa versa<br>\r\n- Gems to be separated by their Colours<br>\r\n- Finally what would be amazing would be a sheet / tab that valuates your current gear and gives a rating for each stat which can then be exported / added to a in game gear ranking mod. For Example you equip all your gear, the sheet rates Str to be worth 2points and agi to be worth 1 point. These values get added to the mod. You load up the game mouse over your armour piece with 10 Str and 10 agi and at the bottom you get something like Rawr.Cat points - 30. So you can make quick comparisons in game when loot drops. There have been mods in the past that do this but there are all out of date now and they were all specific to the class, I think one that is generic with an easy interface to load your own weight points would be excellent.<br>\r\n<br>\r\nOn a side note Shaman Enhancement seems to be broken at the moment, no values come up on any of the items, and the download advises this section is compleate but here on the forums it says still undergoing work!<br>\r\n<br>\r\nKeep up the great work!<br>\r\n<br>\r\n",
    "PostedDate": "2008-11-22T11:56:31.133-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "134510",
    "ThreadId": "40539",
    "Html": "Thanks for the great feedback, guys.<br>\r\n<br>\r\n&gt;&gt; Update for level 80 specs - All presets are still level 70<br>\r\nAll the models need default talent specs for 80... Will try to get most of them in for 2.1.2, but no promises.<br>\r\n<br>\r\n&gt;&gt; Addition of Potion of Speed and Potion of Wild Magic to consumable options (whereas Destro Pots are the only selector now)<br>\r\nKavan, how do you want to handle this?<br>\r\n<br>\r\n&gt;&gt; Glyph Tooltips - All glyphs currently show the &quot;Optomize Armor&quot; tooltip<br>\r\nThese are just temporary until we get an actual Glyph interface.<br>\r\n<br>\r\n&gt;&gt; Black Duskweave set bonus not implemented<br>\r\n&gt;&gt; Figurine - Twilight Serpent showing 2min cooldown, not 5 minute (probably causing the item to be overvalued)<br>\r\nKavan, wanna fix those?<br>\r\n<br>\r\n&gt;&gt; When a blacksmith socket is added to a belt, it breaks the socket bonus on the belt.<br>\r\nWe'll have an interface for the BS sockets soon.<br>\r\n<br>\r\n&gt;&gt; Have Rawr remember if I imported the last item from wowhead or the\r\narmory.  I do most of my importing from wowhead and its irritating to\r\nhave to keep checking that box for every item.<br>\r\nFair enough, will try to get that done.<br>\r\n<br>\r\n&gt;&gt; Is there a way to make the comparisons section (i.e. the right half\r\nof the window) properly scrollable with the mouse wheel?  I can do it\r\nif I hit an arrow key first, but it seems like it should do it natively.<br>\r\nI'll look into this.<br>\r\n<br>\r\n&gt;&gt; A way to turn off duplicate items and the best one with the best gem\r\ncombo been shown only, to make the lists alot shorter and easier to\r\nlocate the item you are looking for. I am currently getting around this\r\nby going to each slot then going thou the list by clicking the delete\r\nall duplicates but this gets wiped every time Rawr gets updated :'(<br>\r\nWe're planning a redesign of the way items and gemmings are handled, to solve just this issue.<br>\r\n<br>\r\n&gt;&gt; Add buffs from Skinning and Mining.<br>\r\nWill be adding this soon.<br>\r\n<br>\r\n&gt;&gt; Working Glyphs (Maybe as a new Tab, Stats, Talents, Glyphs, Buffs, Options or similar)<br>\r\nAn actual Glyphs interface is coming.<br>\r\n<br>\r\n&gt;&gt; The Ability to have a bit more power over what items appear, ie for a\r\nmail wearer to select both Leather and Mail to appear. A Rouge to be\r\nable to select that Druid only gear doesn't appear and visa versa<br>\r\nThis is already implemented. It's in the Tools menu.<br>\r\n<br>\r\n&gt;&gt; Gems to be separated by their Colours<br>\r\nThey're already color-coded by their color, but perhaps we could make that more obvious; don't want to actually split the gems into separate charts, though.<br>\r\n<br>\r\n&gt;&gt; Finally what would be amazing would be a sheet / tab that valuates\r\nyour current gear and gives a rating for each stat which can then be\r\nexported / added to a in game gear ranking mod. For Example you equip\r\nall your gear, the sheet rates Str to be worth 2points and agi to be\r\nworth 1 point. These values get added to the mod. You load up the game\r\nmouse over your armour piece with 10 Str and 10 agi and at the bottom\r\nyou get something like Rawr.Cat points - 30. So you can make quick\r\ncomparisons in game when loot drops. There have been mods in the past\r\nthat do this but there are all out of date now and they were all\r\nspecific to the class, I think one that is generic with an easy\r\ninterface to load your own weight points would be excellent.<br>\r\nSome models already provide this functionality, including Rawr.Cat. It's the 'Relative Stat Values' chart. Please keep in mind though, that using it that way is, by definition, inaccurate. You only want to use that sort of addon with Relative Stat Values from Rawr for things that you only need a ballpark value for (ie, leveling up, comparing crappy quest rewards).<br>\r\n<br>\r\n&gt;&gt; On a side note Shaman Enhancement seems to be broken at the moment, no\r\nvalues come up on any of the items, and the download advises this\r\nsection is compleate but here on the forums it says still undergoing\r\nwork!<br>\r\nYou need to equip weapons before the Enh model can make any calculations. Beyond that, please post bug reports for Enh.<br>\r\n",
    "PostedDate": "2008-11-22T13:41:40.907-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]