[
  {
    "Id": "951312",
    "ThreadId": "405560",
    "Html": "\r\n<p>Hi</p>\r\n<p>&nbsp;</p>\r\n<p>Any chance of a new release and upload to EJ site soon?</p>\r\n<p>&nbsp;</p>\r\n<p>More long term: Do we still have users interested in updates and corrections to Rawr? Or have we been so slow with the migration that everyone have moved on to other tools?</p>\r\n<p>&nbsp;</p>\r\n",
    "PostedDate": "2012-12-04T10:58:40.02-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "951892",
    "ThreadId": "405560",
    "Html": "\r\n<p>I'm pretty sure where Kavan has left and no one else for admins posts or anything anymore. I've moved on. I'm now using ElitistJerks stats weights manually put in for www.askmrrobot.com.&nbsp; This works out great, even better then anything I've ever used.</p>\r\n<p>I do appreciate everything the rawr team has done over the many years, I'll check back maybe once a month myself, and I wish you all the best of luck.</p>\r\n",
    "PostedDate": "2012-12-05T12:52:52.597-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "952006",
    "ThreadId": "405560",
    "Html": "\r\n<p>I've moved to a simulationcraft / askmrrobot setup, myself. If Rawr had an active Retribution dev though, I would switch back immediately. The whole &quot;generate custom weights, plug into robot, change simcraft setup to match, sim, plug into robot, repeat&quot;\r\n process is time consuming, and annoying. Rawr + Rawr Addon was quick and painless. All-in-one, more flexible, friendly UI. The addon's import functionality (your whole inventory/bank ftw) and upgrade notifications were invaluable.<br>\r\n<br>\r\nI'm not in any way a developer, so can't help. But here's hoping Rawr has a future! :)&nbsp;</p>\r\n",
    "PostedDate": "2012-12-05T18:04:57.66-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "952051",
    "ThreadId": "405560",
    "Html": "\r\n<p>The delay is mainly due to some life issues that Hinalover had to deal with in the past few weeks. He's planning to do a release sometime this week last I heard from him.</p>\r\n",
    "PostedDate": "2012-12-05T22:11:02.027-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "952650",
    "ThreadId": "405560",
    "Html": "\r\n<p>hey, i have always used rawr since i found it years ago, but i was wondering if there is any plans for anything for a warrior? i don't know how to code anything more then html but if there is anything i can do please let me know.</p>\r\n",
    "PostedDate": "2012-12-06T17:58:29.613-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "954814",
    "ThreadId": "405560",
    "Html": "\r\n<p>Please dont let Rawr fall by the way. I know its alot of work and if I knew more programing I would be more than glad to help. You are providing a great service and one that needs to continue. Thanks for all you do.</p>\r\n",
    "PostedDate": "2012-12-11T14:52:51.27-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "958664",
    "ThreadId": "405560",
    "Html": "\r\n<p>Long-time Rawr user for Resto Druid build.&nbsp; I really think that Rawr was THE best program out there and I sincerely hope that the project sees a solid release soon.&nbsp; I want to echo what Manic5 sayd, the Simcraft/Askmrrobot setup is extremely time-consuming\r\n and i think there is solid demand out there for this product.&nbsp; Even if the product was a pay-product, I would 100% think there would be demand for it if it was kept up-to-date.</p>\r\n",
    "PostedDate": "2012-12-19T11:53:31.87-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]