[
  {
    "Id": "134561",
    "ThreadId": "40563",
    "Html": "I have Shredding attacks but Rawr advices to not use shred at all.<br>\r\n<br>\r\nI thought the best rotation is: keep rake up, keep mangle up, shred in between.<br>\r\nWrong? Should I just spam mangle and drop the 2 points from shredding attacks?<br>\r\n",
    "PostedDate": "2008-11-23T02:26:47.31-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "134563",
    "ThreadId": "40563",
    "Html": "Source - http://elitistjerks.com/f73/t36680-feral-cat_megathread/<br>\r\n<br>\r\nDPS Cycle<br>\r\nWhen speaking of cycles, people usually think of a strict order in which to perform their moves: Move A -&gt; Move B -&gt; Move B -&gt; Move C -&gt; Move A -&gt; repeat. With WotLK, this is no longer the case for cat DPS. Instead, we now use what's called a &quot;priority rotation&quot;. Here there is a list of priorities for each ability and the condition under which it should be used. You then use the ability whose conditions are met that is highest on the priority list.<br>\r\n<br>\r\nThe optimal cycle has not been entirely fleshed out yet. And again, it depends a bit on your gear and precise choice of talents. However, it will most likely look somewhat like this:<br>\r\n<br>\r\n1. If Savage Roar is down and you have more than 1cp, use Savage Roar.<br>\r\n2. If you have 5cp and Rip is not up, use Rip.<br>\r\n3. If Mangle is down, use Mangle (skip this if another Feral is doing Mangle or there's an Arms Warrior applying Trauma).<br>\r\n4. If Rake is down, use Rake.<br>\r\n5. If you're at 3+ cp, Rip still has 8+ seconds left, Savage Roar still has 8+ seconds left, use Ferocious Bite.<br>\r\n6. If you're at &lt;40 energy and the TF cooldown is up, use TF.<br>\r\n7. If you have 42+ energy, use Shred.<br>\r\n8. Reapply Faerie Fire (Feral)<br>\r\n<br>\r\nNOTE: I'm not claiming that this is the perfect DPS cycle. Work on this is still being done. The above is just to demonstrate how a priority rotation would look. It has some sensible parts, but alot of it is still open for speculation on what the best course of action is.\r\n",
    "PostedDate": "2008-11-23T03:08:52.573-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "134564",
    "ThreadId": "40563",
    "Html": "Ok I've found out why Rawr suggests to drop shred: it's 2p T6 bonus. Ok so mangle spam all the way till I get rid of another 4 pieces of T6 ^^<br>\r\n",
    "PostedDate": "2008-11-23T03:12:40.323-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]