[
  {
    "Id": "134566",
    "ThreadId": "40564",
    "Html": "Hi,<div><br></div><div>I am very often asked to heal in instances, even though I am feral, and overall, it works quite well. My healing style then is to use lifebloom almost all the time.</div><div><br></div><div>I would like to use the tree model to optimize my healing gear.</div><div><br></div><div>1- Is there any caveat regarding its use for feral healing?</div><div><br></div><div>2- Optimizing for HpS: why so much haste?</div><div><br></div><div>As I am almost never oom, not even needing to use potions, I asked the model to optimize for HpS. I was very surprise by answer: haste, haste, haste. Is haste so much better than spell power?</div><div><br></div><div>3- Why no optimization for Spell Power, even as an option?</div><div><br></div><div>4- Ancillary question: I could not find the Idol of the Emerald Queen. So I tried to add it to the list, but it never appears in the list of available idols. What gives?</div><div><br></div><div>Thanks,</div><div><br></div><div>Jean-Denis</div><div><br></div>",
    "PostedDate": "2008-11-23T03:43:37.37-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "134611",
    "ThreadId": "40564",
    "Html": "I expect there will be some inaccuracies; the tree model is not intended to be used as a feral. Theoretically, it should work, but I wouldn't be surprised if it didn't; we just don't test it that way.<br>\r\n<br>\r\nThat said, it should give you some decent results. When optimizing for HpS, you're obviously going to get alot of haste. HpS is burst healing, maximum healing per second. Optimizing by spell power is not an option because it's not an end result of your gear. We can add it, just wasn't a priority. Emerald Queen not being relevant is probably a bug.  We'll look into that.<br>\r\n",
    "PostedDate": "2008-11-23T13:14:59.94-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "134702",
    "ThreadId": "40564",
    "Html": "<p>it seems that the item text of the idol has changed again --&gt; the parser didn't recognize the idol</p>\r\n<p> --&gt; fixed in the source code</p>\r\n<p>you can add the 47 peridoic healing via item editor until the next release</p>\r\n<p>on a side node - you have to use lifebloom in your rotation (I'm not done yet | default rotation is HT spam) to get the benefits of the idol</p>\r\n<p></p>\r\n<p>PS: Idol of Lush Moss doesn't do anything yet, because Emerald Queen showed some strange behavior ... i'm trying to get that one to test it </p>\r\n",
    "PostedDate": "2008-11-24T01:28:19.783-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]