[
  {
    "Id": "134797",
    "ThreadId": "40648",
    "Html": "I could be wrong, but it looks like Rawr.Cat 2.1.1 is greatly over valuing\r\nhit and expertise.&nbsp; It's showing them to be worth almost as much as\r\nstrength for me, while Toskk's model has them at about the same value\r\nas AP.&nbsp; I'm assuming this is a Rawr problem rather than Toskk's because\r\nRawr's value for hit goes up (and actually surpasses strength) if I\r\ntake the two points out of Primal Precision.<br>\r\n",
    "PostedDate": "2008-11-24T08:05:54.05-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "134815",
    "ThreadId": "40648",
    "Html": "This is correct, the value for hit should go up greatly when you take the points out of Primal Precision. Remember, Primal Precision isn't just expertise, it also reduces the value of hit by making missed finishers only cost 20% energy.<br>\r\n<br>\r\nAs far as whether it should be that high anyway, I've checked the calculations and as far as I can tell, this is correct, though the difference with Toskk's does concern me. If anyone can find an error in the calculations, I'd love to hear about it. This <em>is</em> a brand new model, so I can't say for certain that it's perfectly correct yet, and that I haven't missed anything, but I don't know of anything wrong with it right now.<br>\r\n",
    "PostedDate": "2008-11-24T09:09:45.39-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "134820",
    "ThreadId": "40648",
    "Html": "Heh, not quite sure how I got the Primal Precision part backwards.&nbsp; Going to blame the lack of sleep and pretend I didn't say that.<br>\r\n<br>\r\nI was under the impression that hit still wasn't a great feral stat, especially with PP, but I'm not nearly as sure about that now that my brain fart has been pointed out.&nbsp; If it wasn't for the discrepancy with Toskk's, would you have expected hit to be worth roughly the same as strength with the new mechanics?<br>\r\n",
    "PostedDate": "2008-11-24T09:32:08.103-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]