[
  {
    "Id": "134792",
    "ThreadId": "40645",
    "Html": "<div>Very strangely, the cat model shows me the everbloom idol as worthless (zero dps).</div><div><br></div><div>This happens whether the &quot;Shred&quot; checkbox is checked in the custom rotation pane.</div><div><br></div><div>Is this a known bug, or is this real? Note that Toskk shows it very valuable.</div><div><br></div><div>Btw, I don't understand the meaning of the settings in the Custom Rotation pane. My normal rotation is more or less to maintain Savage roar as long as I have at least 2 combo points, maintain Rip as long as I have at least 4 combo points, maintain Rake, otherwise Shred.</div><div><br></div><div><br></div>",
    "PostedDate": "2008-11-24T08:02:11.627-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "134814",
    "ThreadId": "40645",
    "Html": "Item value calculations are made based on the Optimal rotation, on a per-item basis.<br>\r\n<br>\r\nChecking the box for Shred on the Options tab, under Custom Rotation, includes Shred in the Custom Rotation, not necessarily the Optimal rotation. The Custom rotation is for comparing the DPS of the specified rotation to the DPS of the Optimal rotation.<br>\r\n<br>\r\nEverbloom is worth 0 when the optimal rotation does not include Shred.<br>\r\n",
    "PostedDate": "2008-11-24T09:05:39.96-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "134819",
    "ThreadId": "40645",
    "Html": "OK, I get it now: the Stat page lists my optimal rotation as Mangle+Rip+Roar5, which clearly doesn't include Shred !<div><br></div><div>Yet again I'm note sure what this optimal rotation means:</div><div><br></div><div>- if I Rip after Mangle, I'm clearly going to have at most 2 combo points which seems awful to Rip.</div><div>- or maybe it means Mangle up to 4 (?) or 5 (?) combo points before ripping... Difficult to believe it's optimal as I have no point in improved Mangle.</div><div>- and then Roar5 means roar at 5 combo points I suppose. But how am I supposed to get those combo points? Mangle all the way?</div><div>- then again, all my Mangles are cancelled, since our dps warrior always puts up Trauma (but where do I tell Rawr?). Is Mangle really best?</div><div><br></div><div>So basically, I'm lost here...</div><div><br></div><div><br></div>",
    "PostedDate": "2008-11-24T09:30:27.11-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "134844",
    "ThreadId": "40645",
    "Html": "&quot;Mangle+Rip+Roar5&quot; means that your rotation includes those spells. There's no more 'rotation' really, like a sequence of spells like there used to be (used to be Mangle, Shred to 4+cp, Rip, repeat). Now Cats use a priority system.<br>\r\n<br>\r\nAlways keep SR up (though not always the same # of cp). Always keep Rake up. Always keep Mangle up (handled by Trauma).<br>\r\n<br>\r\nBeyond that, it comes down to what spells to include: Mangle+Rip+Roar5. Shred isn't included, so you use Mangle for combo points (in addition to Rake). Rip is included, so you should keep a 5pt Rip up. Roar5 means to use 5cp Roars.<br>\r\n",
    "PostedDate": "2008-11-24T10:36:56.963-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "134949",
    "ThreadId": "40645",
    "Html": "I was going to post a question about how to use and understand the cycles in Rawr.Cat (not having Rake in the cycles bugged me enough, as well as tossing up a FB when possible), but it got answered below.<br>\r\n<br>\r\nThanks !\r\n",
    "PostedDate": "2008-11-24T17:25:41.387-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "135055",
    "ThreadId": "40645",
    "Html": "Thanks Astrylian, that makes it a lot clearer.<div><br></div><div>A last question, maybe, if you don't mind.</div><div><br></div><div>I am fully aware of the new &quot;priority based&quot; rotation we now need to use. That's what I tried to convey, albeit poorly, in my earlier description of my rotation.</div><div><br></div><div>In my case:</div><div><br></div><div>0- keeping Mangle up is done by our trauma warrior</div><div>1- first priority 1: keep Savage Roar up (with at least 2 combo points, most of the times with 5)</div><div>2- second priority: keep Rip up (with at least 4 combo points)</div><div>3- third priority: keep Rake up (gives 1 or 2 combo points)</div><div><br></div><div>As you can see, the only action there that gives combo points (instead of consuming them) is rake. The real question boils down to: &quot;how do I get my combo points filled in&quot;.</div><div><br></div><div>So Rawr thinks the answer to that question is Mangle, not Shred. *This* is what I find hard to believe, given:</div><div><br></div><div>- my template includes all the shredding attacks and no improved mangle</div><div>- the Mangle debuf is irrelevant since the warrior handles it.</div><div>- individual shreds do far more damage than individual mangles</div><div><br></div><div>So what could account for such a superiority for Mangle? 35 energy vs 42 energy? Hard to believe...</div><div><br></div><div>Yet if this is true, it implies I should remove all talent points in shredding attacks and go for improved mangle, and never bother striking from behind any more.</div><div><br></div><div>Is this really independent from the fact that we have a trauma warrior? Shouldn't Rawr take that into consideration in its model?</div><div><br></div>",
    "PostedDate": "2008-11-25T02:05:52-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "135060",
    "ThreadId": "40645",
    "Html": "The trauma warrior allows you to replace all (not just most) mangles with shreds. That doesn't change which is better, necessarily. You do have one of the huge mangle improvements: 2T6. Still, having Shredding Attacks and no Imp Mangle, I'd expect Shred to be better (that's what it comes up with for me personally, anyway). If you want to post your character file, I can take a look and explain your specific situation better.<br>\r\n",
    "PostedDate": "2008-11-25T02:26:35.727-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "135076",
    "ThreadId": "40645",
    "Html": "I couldn't find how to post my character file here as an attachment, and thought text XML to be a bit too annoying, so you can download it from:<div><br></div><div><span><a href=\"http://muys.net/NoctCat3.xml.zip\">http://muys.net/NoctCat3.xml.zip</a></span><br></div><div><br></div><div>apparently, Rawr says Shred does do more damage than mangle, but I suppose not enough more in regard to its higher energy cost.</div><div><br></div><div>What a change!</div>",
    "PostedDate": "2008-11-25T04:01:15.797-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "135163",
    "ThreadId": "40645",
    "Html": "Took a look at your character. Yeah, Mangle and Shred are really close, but Mangle comes out ahead. It provides higher DPE, and provides more combo points per energy, which translates to more Rip uptime.<br>\r\n",
    "PostedDate": "2008-11-25T08:36:08.38-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "135436",
    "ThreadId": "40645",
    "Html": "Ok thanks.  I can see that Rawr is coherent. Now this means there is a significant discrepancy between your model and Toskk's. I'm not enough of a theorycrafter to lift it, but I sure am interested in it being resolved. For now, I will hedge my bets and maintain two gear sets: a mangle set and a shred set, which will hopefully only differ by their idols.<div><br></div><div><br></div>",
    "PostedDate": "2008-11-26T01:07:39.573-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]