[
  {
    "Id": "957827",
    "ThreadId": "407200",
    "Html": "\r\n<p>Hey,</p>\r\n<p>I'm playing WoW again after taking a break through all of Cataclysm. &nbsp;One of the things that has struck me regarding the gear choices with MoP vs WotLK is how few choices there are, not only for different classes, but also within the same class for\r\n different specs. &nbsp;Rogue, monk and druid gear all look the same, and on the most part feral and guardian druid look the same as well.</p>\r\n<p>So that leaves me as a druid playing feral and guardian, with a number of duplicate pieces and a number of overlapped pieces (i.e. shared between the two). &nbsp;I do have a main spec though, which I'd like to take priority over my second spec. &nbsp;That\r\n means that in the process optimizing, I'd like either to pin down the shared items for my main spec, but let the duplicated ones be optimized freely. &nbsp;In an ideal world, however, I'd want the optimizer to be able to choose the best overlapped gemming\r\n / reforging / enchanting for the shared items. &nbsp;For example, let's say that both my specs benefit from expertise, but my dps one would benefit from hit and my tanking one would benefit from dodge. &nbsp;Ideally I'd find a way to optimize such that the\r\n shared items get reforged to expertise, then the duplicated items get hit & dodge according to spec. &nbsp;This only works if Rawr knew how many of each item I had, or if there was some other feature in it I'm missing.</p>\r\n<p>To make a very long story short, I was wondering how folks who play other classes feel about this and whether it's something they encounter as well. &nbsp;In that case, do you have a workflow that works for you, or do you need to just figure things out by\r\n hand?</p>\r\n<p>Char</p>\r\n",
    "PostedDate": "2012-12-18T10:05:50.81-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "957915",
    "ThreadId": "407200",
    "Html": "\r\n<p>First I must say RAWR is still under beta and needs alot of work, before it is really usable for 5.1 MoP. I play feral and guardian as well. It's not really viable anymore to share pieces, I mean it can be done, but out of the pieces of gear you have they\r\n just won't be able to be the most powerful for each spec, due to gemming, reforging, and enchants. For example, where we have the new talent choices different set-ups require different main stat priority. So for feral if you chose Nature's Vigil and Incarnation,\r\n your stat priority would be <span><span>Agility &gt; Mastery &gt; Crit &gt; Melee Hit = Expertise &gt; Haste.&nbsp; Rawr is telling us we should hit cap and expertise cap for getting by dodge, this is not true.&nbsp; We've never had to hit or expertise cap for dodge.&nbsp; I was following\r\n this method and my dps was incredibly low, I found some useful information on elitist jerks website for stat weight for the different feral specializations, I used these numbers in askmrrobot. Doing this seemed more accurate and my dps shot way up, now I'm\r\n usually the top 1 or 2 in my guild instead of near the lower half.&nbsp; So it really depends on which feral and guardian set-ups you choose.&nbsp; My suggestion would be to choose one as a priority and any upgrades you get for that give the old piece of gear to your\r\n secondary spec.&nbsp; I'm main feral and any new pieces I get go to feral, the old pieces go to guardian.&nbsp; I wish you the best of luck, and I hope you enjoy the incredible new expansion.</span></span></p>\r\n<p><br>\r\nAs for other thoughts, Kavan has stepped down as lead, he's still around though :)&nbsp; Hinalover that does feral and maybe more, I'm not sure has been going through a lot outside of Wow and Rawr, and I hope for the best for Hina. By me trying to help you Charinna\r\n I hope I didn't overstep anyone else or any of the hard work that has gone into RAWR over the years. Take care all.</p>\r\n",
    "PostedDate": "2012-12-18T12:18:54.897-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "957983",
    "ThreadId": "407200",
    "Html": "\r\n<p>The best place for feral theorycrafting at the moment is The Fluid Druid - http://fluiddruid.net/forum/index.php</p>\r\n<p>&nbsp;</p>\r\n<p>Be a little careful with EJ's as the first post is a little out of date now.&nbsp;&nbsp;&nbsp; I certainly agree though that you can't really use Rawr as intended at the moment.&nbsp;&nbsp;&nbsp; A lot of the Feral theorycrafters do actually feel that hit & expertise capping is worthwhile\r\n now.&nbsp;&nbsp; Our rotation is so tight at the moment that a miss or two will result in significant extra downtime of Rip or SR.&nbsp;&nbsp;&nbsp;&nbsp; The slight loss of theoretical DPS is more than made up for in the real world.</p>\r\n<p>&nbsp;</p>\r\n",
    "PostedDate": "2012-12-18T13:53:59.5-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "958132",
    "ThreadId": "407200",
    "Html": "\r\n<p>&nbsp;</p>\r\n<p><span style=\"font-size:11pt; color:#1f497d\">Hi Dark,</span></p>\r\n<p><span style=\"font-size:11pt; color:#1f497d\">&nbsp;</span></p>\r\n<p><span style=\"font-size:11pt; color:#1f497d\">Thanks for the message.&nbsp;&nbsp; You know, the question was not so much about the feral / guardian build as much as it was about using rawr to handle a “big bag of gear.”&nbsp;&nbsp; As for your comment regarding no duplicates,\r\n while I agree with you, it will take a long time to get two of each, particularly with upgrades costing so much and there being a weekly cap on valor badges.&nbsp; What I was hoping for was a way to maximize my off-set in such a way that it does not at all compromise\r\n my main.</span></p>\r\n<p><span style=\"font-size:11pt; color:#1f497d\">&nbsp;</span></p>\r\n<p><span style=\"font-size:11pt; color:#1f497d\">Kavan tells me it is possible to have several of one piece already, I should figure out a way to get that path working again using the addon export path.</span></p>\r\n<p><span style=\"font-size:11pt; color:#1f497d\">&nbsp;</span></p>\r\n<p><span style=\"font-size:11pt; color:#1f497d\">Char</span></p>\r\n",
    "PostedDate": "2012-12-18T22:15:50.26-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "984223",
    "ThreadId": "407200",
    "Html": "\r\n<p>Hi</p>\r\n<p>Although my main spec was resto, towards the end of Cata, I had both a kitty and bear set and also tried to manage this issue.</p>\r\n<p>I have always believed the batch tools can play a role in this, but have never tried them.</p>\r\n<p>Basically the biggest issue on joint optimisation is that you will need to decide the relative importance of the 2 sets and how those 2 scores (tank based scores and dps based scores) would be added together to get the a combined final score.</p>\r\n<p>If you say that the main spec always outweights the secondary:</p>\r\n<p>there is a special case that except for hit and expertise caps, the relative weights of stats typically don't change dramatically as your gear get minor improvements.Thus after your caps are sorted, everything would tend to be reforged to the best 2 stats\r\n (reforge the weakest to the best, if the item already has the best stat, reforge the other stat to the 2nd best stat). If the 2 high priority stats are the same for the 2 specs, your lucky with lots of shared gear.</p>\r\n<p>The approach would be to optimise the main and then lock all items (shift click to get blue diamonds), duplicates you can add extra as normal green diamonds and the extra gear in your bags. Then switch models and run optimiser to get the secondary gearset\r\n sorted, while it figures out whether it is worthwhile to reuse some of your locked items or rather going with the older tier's items in your bags.</p>\r\n<p>If the one spec isn't supposed to completely dominate the secondary spec and you have the issue that the high priority stats of the specs differ, you end up with compromises and ultimately need to decide how your willing to compromise on each side. Then\r\n it almost becomes easiest to manually assign some compromised reforging or gemming options, lock them and the go back to the workflow described previously. Trying to really automate that is difficult since there really is no real answer in terms of how much\r\n to compromise on each side.</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n",
    "PostedDate": "2013-01-08T14:38:41.34-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]