[
  {
    "Id": "135238",
    "ThreadId": "40777",
    "Html": "Damage Per Hit vs Damage Per Swing - <br>\r\nThe values shown for Rip are confusing.&nbsp; I'm guessing damage-per-hit is showing how much Rip does given a less-than-100% Mangle uptime?<br>\r\nThe values shown for Rake are, at the very least, labeled less than perfectly.&nbsp; The damage-per-hit is apparently the damage of the initial hit and the damage-per-swing is the expected hit + the DoT?<br>\r\n<br>\r\nDamage Values<br>\r\nI do not think the damage values shown (example: Melee Damage 429660.8) are very useful.&nbsp; Some values I would prefer to see:<br>\r\nPercentage of Overall Damage,<br>\r\nDamage-Per-Energy (pre combo point OR post combo point),<br>\r\nor even DPS.<br>\r\n<br>\r\nStatistics I would like to see available explicitly, rather than implicitly.&nbsp; Perhaps as mouseovers?<br>\r\n+Hit %<br>\r\n-Dodge/Parry %<br>\r\nHaste % (I realize the approximate Haste % is easily visible from a glance at attack speed, so I can understand tabling this one)<br>\r\n<br>\r\n<br>\r\nInformation concerning the Berserk cycle would also be useful.<br>\r\nPseudo Energy Gained, abilities used (and how many times), DPS over the Berserk duration...are all possiblities<br>\r\n<br>\r\n<br>\r\nAlso, when viewing the &quot;Talents&quot; chart, I would love to see a per-combo-point breakdown.&nbsp; And if that's what I'm already seeing, a label/title to indicate that would be fantastic.<br>\r\n<br>\r\n<br>\r\nKeep up the great work!\r\n",
    "PostedDate": "2008-11-25T11:48:59.77-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "135271",
    "ThreadId": "40777",
    "Html": "Damage per Hit vs Damage per Swing:<br>\r\nDamage per Hit is the damage of actually hitting with that skill. Yes, the Rake one currently shows just the initial damage, that's a bug, it should show the initial + dot damage.<br>\r\nDamage per Swing is the damage of an average swing with the skill. It can be avoided, or white attacks can glance.<br>\r\n<br>\r\nDamage Values... Yeah, I recognize that they're not really useful as is. I'll probably change them to %s of total damage. I'll try to get DPE and CPPE in there too.<br>\r\n<br>\r\nRegarding +Hit and -Dodge, isn't Avoided Attacks enough for that? Mouseover that and it breaks it down into your miss and dodge percent, which is what matters, isn't it? Same deal with haste vs attack speed?<br>\r\n<br>\r\nBerserk... Berserk isn't calculated yet, unfortunately. It's on my TODO list.<br>\r\n<br>\r\nTalents chart is per talent point. I'll try to make that more obvious.<br>\r\n<br>\r\n<br>\r\nThanks for the great feedback.<br>\r\n",
    "PostedDate": "2008-11-25T13:07:07.533-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "135304",
    "ThreadId": "40777",
    "Html": "As to avoided attacks...yes, the information is there.&nbsp; I guess what I'm <em>really </em>after is an easy indicator of my distance from the hit cap/expertise cap.&nbsp; And the way to do that might be some text accompanying the hit rating/expertise rating with a &quot;+31&quot;&nbsp; or a &quot;-120&quot; telling me how I stand with respect to the cap.<br>\r\n<br>\r\nOnce I memorize the level 80 caps, I probably wouldn't even comment on such a feature :)<br>\r\n",
    "PostedDate": "2008-11-25T14:48:30.583-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "135316",
    "ThreadId": "40777",
    "Html": "Ah, you mean like instead of:<br>\r\n2.5% Miss, 4.3% Dodge<br>\r\n<br>\r\nYou'd like to see...<br>\r\n2.5% Miss (67 Hit from cap)<br>\r\n4.3% Dodge (103 Exp from cap)<br>\r\n<br>\r\nOr...<br>\r\n0% Miss (12 Hit over cap)<br>\r\n0% Dodge (31 Exp over cap)<br>\r\n<br>\r\n<br>\r\nYeah, that sounds useful, and not too hard to implement.<br>\r\n",
    "PostedDate": "2008-11-25T15:13:16.453-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]