[
  {
    "Id": "135446",
    "ThreadId": "40846",
    "Html": "Hi there,<br>\r\n<br>\r\nfirst of all - I'm very happy with the actual 2.1.1 version - just one question, I found them nowhere asked before, if it's somewhere, I apoligize in advance.<br>\r\n<br>\r\nIs there anywhere an option, where I can check, which kind of gems I use? I found the Tools-Set default gems for equipement-option, but there I can only choose, which gems for which color. What I would need (or better: what I think, what would be nice) is: choose whether I use epic quality or rare quality or common quality gems. because actually on our realm there are just a few rare gems available just no epic gems. so the most used gem quality at the moment is the common/green gems. and it is kinda confusing, if I have to compare my actually common-gemmed gear with suggestions where epic gems are used. :)<br>\r\n<br>\r\nIf there is no way to check this in 2.1.1, no problem, then this is just a suggestion for maybe a next version :)<br>\r\n<br>\r\nThanks in advance.<br>\r\nlarisha<br>\r\n",
    "PostedDate": "2008-11-26T02:10:01.75-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "135515",
    "ThreadId": "40846",
    "Html": "If you're thinking of the comparisons in the right panel, then you should use that set default gems menu option. For example if you would only like to show gemmings with green gems then enter all gem combinations with green gems that are of value to you and check the option to remove other gemmings. That will remove the current options and just give you the ones you want.\r\n",
    "PostedDate": "2008-11-26T04:25:15.383-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "135537",
    "ThreadId": "40846",
    "Html": "ahh, does that mean, that I can enter more than one possible gem per color? if yes, then I think, it is what I'm looking. A bit more not-automatic, but this should work. thanks :)<br>\r\n",
    "PostedDate": "2008-11-26T05:26:26.193-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "135671",
    "ThreadId": "40846",
    "Html": "You can enter more than one yes. Just enter the first combination, then click on Add another gemming and repeat as many times as you need.\r\n",
    "PostedDate": "2008-11-26T12:05:09.077-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]