[
  {
    "Id": "135453",
    "ThreadId": "40849",
    "Html": "Hi there,<br>\r\n<br>\r\nfirst I want to thank you all for your work, but then I have a question or two.<br>\r\n<br>\r\n1. Could you *pretty please* add a feature like &quot;<strong>Hide</strong> all instances of a gemmed item and only show the best choice of gems&quot; instead of having the need to <strong>delete</strong> them? I have no idea why it wasn't designed like this in the first place.<br>\r\n<br>\r\n2. Could you *pretty please* show item levels in the tooltip of an item in the comparison window? Also drop locations are missing most of the time, which means you have to open <strong>almost every single item</strong> in wowhead to figure out where it drops or what itemlevel it's got. Maybe take a look at maxdps.com - and add instance-symbols next to the items - would be so great...or at least give us a chance to customize the way items are displayed in the comparison window.<br>\r\n<br>\r\nBest wishes to you! :)<br>\r\n",
    "PostedDate": "2008-11-26T02:18:57.773-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "135518",
    "ThreadId": "40849",
    "Html": "I can't help much other than to say we are planning to redesign how gemming is handled.<br>\r\n<br>\r\nWhat I can help is with item source. Whenever you see an item that doesn't have source listed all you have to do is right click on it and select Refresh item data from Wowhead. If Wowhead has source information it will then show it in Rawr.\r\n",
    "PostedDate": "2008-11-26T04:28:26.543-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "135561",
    "ThreadId": "40849",
    "Html": "I just want to throw my support behind request #1.&nbsp; The first thing I do when I start looking through gear is to eliminate alternate gemming.&nbsp; I haven't looked at the source, but I'm prepared to believe that this is a substantial change.<br>\r\n<br>\r\nOccasionally, I like to see it.&nbsp; <br>\r\nMost of the time, it's very much in the way.<br>\r\n<br>\r\n<br>\r\nThank you for all your hard work.<br>\r\n",
    "PostedDate": "2008-11-26T06:21:00.137-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]