[
  {
    "Id": "135972",
    "ThreadId": "40985",
    "Html": "Hi all, a couple of suggestions.<br>\r\n1) Can we have a lvl filter, if there is one I couldn't find it, for example, I am lvl75, I would like to know the next gear item I should be looking for, so say I can filter &quot;Head&quot; lvl 74 to 76, then I have an idea where my next head piece should come from, or the lvl74 one I missed :(<br>\r\n<br>\r\n2) Can we have two instances of Rawr open at the same time please? Then I can download from armoury my mates killer mage see what gear he has, and compare with my stats. At the moment you can only have one instance of Rawl open at a time.<br>\r\n<br>\r\nIf this is a major I'm sorry, just a couple of &quot;usability&quot; ideas.<br>\r\n",
    "PostedDate": "2008-11-27T17:33:09.517-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "135980",
    "ThreadId": "40985",
    "Html": "1) Rawr may be useful for leveling up, but its primary intention is to be used at level cap. However, we will be adding filters by item level.<br>\r\n<br>\r\n2) You already can, just duplicate the whole Rawr folder.<br>\r\n",
    "PostedDate": "2008-11-27T18:39:19.977-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "136169",
    "ThreadId": "40985",
    "Html": "See, you design a hammer, most people use it to &quot;hammer&quot; nails, others use it to open beer bottles :)<br>\r\n{And it does a great job on either)<br>\r\nI use it to work out caps, but also as an equipment tool at my level's <br>\r\n<br>\r\nOn the second point, I have duplicated the installs, thanks.<br>\r\n",
    "PostedDate": "2008-11-28T14:28:23.667-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "136200",
    "ThreadId": "40985",
    "Html": "I think he was meaning items &quot;ilvl&quot;, not just the level required to actually wear them.\r\n",
    "PostedDate": "2008-11-28T20:11:44.647-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]