[
  {
    "Id": "136364",
    "ThreadId": "41129",
    "Html": "So I'm not really sure how this whole codeplex thing works, but I am an experienced Warlock theorycrafter and having played around with other classes' models in Rawr I would really like to get the Warlock model going. Sadly I am not very experienced with C# and while I can read through some of the code, I don't really know what any of it is doing. Is there possibly anyone who has worked on other models that could work with me on the Warlock model such that I could lay rotations, talents, etc out there for them to work with or are we screwed until someone comes along who can both theorycraft AND code?<br>\r\n<br>\r\nThanks in advance.<br>\r\n",
    "PostedDate": "2008-11-30T08:15:02.81-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "136369",
    "ThreadId": "41129",
    "Html": "A Theorycrafter/Coder team should work just fine. We've got a similar offer from Bink for Elem shams.<br>\r\n<br>\r\nWTB 2 C# devs who like warlocks and elemshams! <br>\r\n",
    "PostedDate": "2008-11-30T08:51:49.597-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "136420",
    "ThreadId": "41129",
    "Html": "This will be an extremely noobish question, but I'm not against trying to get my hands dirty with the code. Since the Warlock model is disabled, I've been looking at the code in the Source area. How would I go about enabling it on some kind of build at home so that I could play around with it? Also, the only editor that I really have is Context: do I need some sort of actual compiler program or is there some kind of dev suit for it or am I just going to be editing .dll's. Anything that you can offer would be great and I'm sorry for taking up your time with this if you don't want to bother explaining.<br>\r\n",
    "PostedDate": "2008-11-30T14:57:05.747-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "136462",
    "ThreadId": "41129",
    "Html": "Yeah, you need an actual development suite. Visual Studio 2008 if you want to buy it, or you can get the free version, Visual C# Express 2008. You can download that from Microsoft. You'll probably need to read some tutorials or buy a book on C# or something. It's not something you can just poke at and get right.<br>\r\n",
    "PostedDate": "2008-11-30T19:04:05.583-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]