[
  {
    "Id": "136578",
    "ThreadId": "41187",
    "Html": "hi i been useing rawr with no problems till now,i upgraded to 2.1.2 and when i put my profile in from the armoury it gives me some crazy stats e.g im useing spiked titansteel helm and its saying its 182.40 dps for it but theres a greens and stuff on it with more stats on it e.g vyrkul training helm 851.69 ^^ helm of the crimson drakanoid 855.93,(im pretty sure this is wrong)my friend uses rawr and were pretty much simmilar geared and he says the titansteel is worth over 300 on his and is one of the better helms out there he imported my profile on his and he says its not correct either and he sees what im seing on mine,i even tried doing a clean profile and adding y stuff manually but it still came up with these crazy stats  ,try for yourself Bubboy?Draenor/E.U  ,<br>\r\nhas any 1 else had this problem or is it just my usual fat fingered self and not haveing something ticked or not ticked?? ;) \r\n",
    "PostedDate": "2008-12-01T05:42:45.547-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "136877",
    "ThreadId": "41187",
    "Html": "Yeah, 2.1.2 still isn't right for Ret pallies. 2.1.3 is coming very soon, to resolve that.<br>\r\n",
    "PostedDate": "2008-12-02T03:49:51.603-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "136918",
    "ThreadId": "41187",
    "Html": "Would it be possible to fix the issues with librams and boss levels next I appologise if I am mentioning it again.\r\n",
    "PostedDate": "2008-12-02T06:00:27.1-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "137018",
    "ThreadId": "41187",
    "Html": "Boss levels, yes. Can you give more detail about the problem with Librams?<br>\r\n",
    "PostedDate": "2008-12-02T11:47:16.517-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "137069",
    "ThreadId": "41187",
    "Html": "Good to hear that the boss lvl issue is getting resolved with the new release.<div><br></div><div>On the libram thing: When in the retr module you check the ranged slot charts, they're just empty. At first I thought I just had to add the librams to the Rawr database but while trying that I noticed they were already there. At the moment it just doesn't recognize librams as possibility for a paladin's ranged slot.</div>",
    "PostedDate": "2008-12-02T15:39:17.897-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "137143",
    "ThreadId": "41187",
    "Html": "I dont know if this is related, and its basically moot now, but the executioner enchant was shown as doing 0 for ret on top of the libram issue.<br>\r\n<br>\r\nThe libram thing has been there for a while though since 2.0 <br>\r\n<br>\r\nedit<br>\r\n<br>\r\nAfter seeing the latest version I notice that berserker (enchant) is also not present, executioner is still missing (I think this can largely be ignored)\r\n",
    "PostedDate": "2008-12-02T22:59:00.687-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]