[
  {
    "Id": "136763",
    "ThreadId": "41234",
    "Html": "First of all, thank you so much for putting this in ahead of time.<br>\r\n<br>\r\nI have been messing around with Rawr today to determine what items I should be looking for for neck/back/ring/trinket slots and the 3.0.4 armor mode seems to be working great on all of these slots except the back slot.  For instance it is rating the Thoriumweave Cloak (390 armor and 35 stamina) at 16254.77 points and the Durable Nerubhide Cape (150 armor, 49 dodge, 21 expertise, 75 stamina, and 41 strength) at 11495.64 points.  There is just no way a straight 240 armor beats out 49 dodge, 21 expertise, 40 stamina, and 41 strength especially by almost 5000 points.<br>\r\n<br>\r\nOr am I a complete idiot in thinking cloaks are excluded from the bear armor multiplier because cloth is also stated as giving the multiplier?  Although it is still hard to think 240 armor beats out all of those other stats  :(\r\n",
    "PostedDate": "2008-12-01T15:17:07.53-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "136764",
    "ThreadId": "41234",
    "Html": "As I understand it, the base armor on cloaks is multiplied by bear, but the bonus armor is not.&nbsp; The problem is that there isn't an easy way to tell how much of the listed armor is base, and how much is bonus.&nbsp; You might be able to calculate how much armor a cloak should have with its ilvl, but I don't know how accurate that would be.&nbsp; Without something like that, the +armor cloaks are going to be worth a ridiculous amount in 3.0.4 mode.<br>\r\n",
    "PostedDate": "2008-12-01T15:29:24.2-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "136775",
    "ThreadId": "41234",
    "Html": "Rawr isn't updated for next patches. It will be when those patches are live.\r\n",
    "PostedDate": "2008-12-01T17:25:10.343-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "136776",
    "ThreadId": "41234",
    "Html": "Rawr.Bear has a check box for 3.0.4 armor calculations.<br>\r\n",
    "PostedDate": "2008-12-01T17:32:33.22-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "136889",
    "ThreadId": "41234",
    "Html": "As mentioned all over the place, the 3.0.4 calculations for Bear armor in Rawr 2.1.2 are accurate for all slots except the back. Rawr doesn't yet know the difference between base and bonus armor, so what armor gets multiplied and what doesn't is just handled by what slot each item is in. It does multiply the back slot, when it should multiply *part* of the back slot. In a later version, Rawr will learn to tell the difference between base and bonus armor, so will get the cloak calculations correct.<br>\r\n",
    "PostedDate": "2008-12-02T04:10:35.09-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "137750",
    "ThreadId": "41234",
    "Html": "Well it's also rating defense as a good thing to gem and rating Frost Resist boots over Footwraps of Vile Deceit along with other better pieces, so I wouldn't take it as a good indicator of which piece is actually better :).<br>\r\n<br>\r\nThe gear rating system for moonkin and feral is so far off it's barely even worth looking at for those two specs.\r\n",
    "PostedDate": "2008-12-04T10:46:18.803-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "137769",
    "ThreadId": "41234",
    "Html": "Uhhh.... What?<br>\r\n<br>\r\nI'm guessing this is just a troll, but if not... When you start throwing around insults like that, you might want to back them up.<br>\r\n<br>\r\nDef Rating does actually provide good value to bears, and Polar Boots are so high in stam that they do make good tanking boots in many situations. Def wouldn't be worth gemming except under extreme circumstances, though, and you probably don't need all that survivability of Polar Boots.<br>\r\n<br>\r\nIf anyone has any theorycrafting calculations/data that show that Rawr's calcs/data is wrong, I would always love to hear it.<br>\r\n",
    "PostedDate": "2008-12-04T11:33:02.53-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "138145",
    "ThreadId": "41234",
    "Html": "I think the issue is that he's only looking at the Overall rating rather than examining the Mitigation and Survival ratings in respect to his gear set as a whole.  I know number of people that make this mistake and call items like the polar set &quot;best in slot&quot; because they only look at the Overall rating rather than look at the Mitigation and Survival ratings and comparing those to the needs of the content they are facing.",
    "PostedDate": "2008-12-05T14:09:56.697-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "142606",
    "ThreadId": "41234",
    "Html": "Quick question, other than the issue with cloaks does the 3.0.4 checkbox also equate for the most part to 3.0.8?&nbsp; If so this so-called nerf to armor is actually showing to be a buff when I load my character.&nbsp; Even allowing for the problem with the cloak I am showing a nearly 7000 point INCREASE in my armor rating with the 3.0.4 checkbox checked.&nbsp; The character in question is below if you want to check for anything.<br>\r\n<br>\r\nI love thise tool and respect your work a great deal please keep it up!<br>\r\n<br>\r\nhttp://www.wowarmory.com/character-sheet.xml?r=Stormrage&amp;n=Hotaharn<br>\r\n<br>\r\n-Hot<br>\r\n",
    "PostedDate": "2008-12-23T08:11:19.37-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "142622",
    "ThreadId": "41234",
    "Html": "Yes and no. The armor multiplier for items besides cloaks was close in that 3.0.4 mode, but not quite right. I believe the armor multiplier before was 7.7562 with all talents, whereas it should have been 8.5822. So, your armor should actually be even higher. And based on your gear, that looks right; you only have an armor neck/ring/weapon, and only blue ones at that, so you're not losing alot.<br>\r\n",
    "PostedDate": "2008-12-23T09:37:40.323-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]