[
  {
    "Id": "136891",
    "ThreadId": "41256",
    "Html": "Apologies in advance if I missed some resource that contains the answers to these questions.<br>\r\n<br>\r\nTo me gems seem to be the biggest problem with Rawr.&nbsp; This was a problem in older versions and possibly seems to have got worse.<br>\r\n<br>\r\nFor a start the current version of Rawr seems to have a very random selection of WotLK gems available.&nbsp; I'm not sure how to easily update this list.&nbsp; Yes I can manually add the ones I'm interested in but why does the default install have such a random list of gems?&nbsp; <br>\r\n<br>\r\nIs there an easy way to filter so I only use common quality gems (or rare or epic or whatever)?&nbsp; Not as far as I can see.&nbsp; The default gemming option seems counterproductive as you have to select specific gems but part of the functionality of Rawr should be to work out what's best.&nbsp; You should be able to select the specific gems you have access too but be able to exclude specific cuts of them.&nbsp; Having to include each specific cut of each specific gem is not very user friendly.&nbsp; There isn't even any way to order them sensibly as even ordering by dps seems to give strange results.<br>\r\n<br>\r\nEven after this Rawr comes up with some absolutely crazy choices.&nbsp; I've just had it select a +20 attack power/+10 hit rating gem in my hat despite the fact that I had all +hit only and +hit/+damage gems available.&nbsp; This is despite me being a mage, hit capped and not having selected that gem.&nbsp; Part of this might be specific to the mage model but I imagine the underlying gem issues are common to all.<br>\r\n<br>\r\n<br>\r\n<br>\r\n",
    "PostedDate": "2008-12-02T04:16:54.013-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "136964",
    "ThreadId": "41256",
    "Html": "I would agree that gemming is currently my main concern with Rawr for my feral druid.<br>\r\n<br>\r\nPlease escuse the terminology I use in this post, I am not clear on the correct use of 'epic', 'rare' and so forth as it relates to gems.<br>\r\n<br>\r\nIn Rawr currently, I can see gear with either the 'diamond cut' gems from Burning Crusade (best quality cuts from BC), or the 'square cut' (best quality cuts) gems from Wrath.  Within the gear rankings on the right hand side I do not see any gear with gem slots being filled with the 'round cut' gems from Wrath.  <br>\r\n<br>\r\nThese 'round cut' gems would be the ones I am most interested in currently, since a) no-one seems to have learned the top level ('square cut') gems in Wrath yet and b) I will be replacing my current gear anyway, so only want to maximize my gear using the 'round cut' gems of Wrath for the moment.<br>\r\n<br>\r\nIs there an option I should have selected in Rawr to show these Wrath gems?  When I HAVE socketed a Wrath green quality gem in my gear and then uploaded from Armory into Wrath, it shows up fine.  So they must be there in the item cache?<br>\r\n<br>\r\nHoping someone can shed some light......\r\n",
    "PostedDate": "2008-12-02T08:14:10.817-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "137023",
    "ThreadId": "41256",
    "Html": "I'll try to shed some light on how gems work in Rawr.<br>\r\n<br>\r\nAn item in Rawr contains specific gems. Rawr doesn't dynamically build gemmings of items that are 'best' or anything. What you see is what's in the itemcache. The default item cache includes one typical gemming scheme of each class/spec for all items relevant to that class/spec. That ensures that there's at least something for everyone. However, that doesn't mean the ideal gemmings are there by default, so all gems (aside from Perfect uncommon cuts) are available, and it's super easy to change gems on individual items, or all items.<br>\r\n<br>\r\nTo change the gems in a specific item, right click it, hit Edit. To add your preferred gemming style to all relevant items, use Tools &gt; Set Default Gems for Equipment. On that dialog, you can create one or more gem styles (a gem for each color socket), and hit OK to create those gemmings. Additionally, if you want to not only create those gemmings, but get rid of all the other ones, there's a checkbox to do that on that dialog.<br>\r\n<br>\r\n<br>\r\nThat's how it is, today. However, we're working on a revision to the gemming system, to make this much easier and more dynamic, so you don't have to 'manage' gems so much. That will be in a later version.<br>\r\n",
    "PostedDate": "2008-12-02T12:01:43.123-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]