[
  {
    "Id": "138004",
    "ThreadId": "41588",
    "Html": "First off, awesome program.  It's a godsend.  Just gets better and better with every release.<br>\r\n<br>\r\nSecond, I've been having a lot of crashes since 2.1 especially tring to switch from moonkin to tree, since excellent healer gear is sometimes better than sub par dps gear, and w/ spirit dam/mp5 calcualtions it's what I would think this program would excel at.  Ideally, I would like to be able to plug in all the caster gear in one profile (since I don't do temp respec's, and if I did then I'd expet to make a new profile) and all teh feral gear in a second one and be able to switch back and forth freely in the caster one between moonkin/tree and freely with the feral one between bear/cat,  so that I can comfortably sell off gear that I will never have a use for.  Especially since sometimes I need to tweak for survivalblity and soemtimes for raw heals/dps etc.  This is where I'm getting most of my crashes, but of 2.1.2 many times the program has a unhandled exceptions and just will not finish an optimization both on moonkin and tree (haven't tried the feral in a while).<br>\r\n<br>\r\nIs there anyway to set up automatically sending an error report to you?<br>\r\n<br>\r\nAlso (a minor thing),  I see you fixed the little bug that would have you put 2 unique/quest item trinkets in during opt., but it still has you choose 2 unique/quest reward items for rings.<br>\r\n<br>\r\nDont see the gem preference working at all, plug it in and it never saves it or uses those gems for slots unless you manually deselect gems from the list.  I have seen it mentioned that it would be nice to be able to selct BC/WoLK -or-  good/superior/epic/jewelcrafter gems.  would also save a lot of time and coding I would think.<br>\r\n<br>\r\nKeep up the good work! \r\n",
    "PostedDate": "2008-12-05T06:45:00.787-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "138065",
    "ThreadId": "41588",
    "Html": "Hey. We're looking into the crashes when switching between the druid models. Whenever you get an unhandled exception (or any error), please feel free to copy/paste it here, or screenshot it and post it here.<br>\r\n<br>\r\nUniqueness is handled on all slots that share items, the items just have to be marked as unique (which most quest rewards are not). Right click on the item, Edit item, check the box for Unique, hit OK. Then rerun the optimization.<br>\r\n<br>\r\nI'm not sure I understand the problem with gems, but we're revamping the gemming system in 2.2, so I'm not too worried about it.<br>\r\n<br>\r\nThanks!<br>\r\n",
    "PostedDate": "2008-12-05T09:20:31.693-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "139339",
    "ThreadId": "41588",
    "Html": "Dopefish, gotten a chance to look at this one yet?<br>\r\n",
    "PostedDate": "2008-12-10T09:08:49.68-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "139344",
    "ThreadId": "41588",
    "Html": "If I'm reading the stack trace right, it's an amazingly remarkable coincidence that got this to happen in the first place.&nbsp; I'll look into fixing it so that it's impossible to happen, but I'd love to see the circumstances behind this crash.<br>\r\n",
    "PostedDate": "2008-12-10T09:14:42.33-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "139350",
    "ThreadId": "41588",
    "Html": "I can't reproduce the issue offhand, but I've added code that should make it actually impossible for the error you've described to occur, rather than &quot;practically&quot; impossible.<br>\r\n",
    "PostedDate": "2008-12-10T09:26:17.36-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]