[
  {
    "Id": "138056",
    "ThreadId": "41597",
    "Html": "So this app seems like it will be awesome, but I am a warrior, and I don't tank.<br>\r\nAny idea when the models for 3.0 DPS Warriors will be up?<br>\r\n",
    "PostedDate": "2008-12-05T08:44:22.137-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "138067",
    "ThreadId": "41597",
    "Html": "Unfortunately, we don't have any active development on DPS Warriors right now. But, you can help the situation. Please feel free to spread the word to all DPS theorycrafting discussions you visit, that we're looking for an expert DPSWarr theorycrafter and/or C# dev, to work on the DPSWarr model. Either one person who knows both, or multiple people works just fine. Thanks!<br>\r\n",
    "PostedDate": "2008-12-05T09:24:38.647-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "138164",
    "ThreadId": "41597",
    "Html": "*ahem*<br>\r\n<br>\r\nsend me infos: jothay@jothay.com<br>\r\n<br>\r\nI'll see what I can do, I'm a software engineer for Dell and I'm familiar with several languages including C#. I've also written my own DPS sheet for warriors in Excel.\r\n",
    "PostedDate": "2008-12-05T15:38:13.117-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "138166",
    "ThreadId": "41597",
    "Html": "Jothay, you are my hero!<br>\r\n",
    "PostedDate": "2008-12-05T15:45:30.933-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "139106",
    "ThreadId": "41597",
    "Html": "I'm nobody's hero yet, need to see if I'll be able to write in the model or not before we get our hopes up.\r\n",
    "PostedDate": "2008-12-09T12:39:19.657-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "143313",
    "ThreadId": "41597",
    "Html": "any word yet on if you will be able to write the code in or are we forever doomed?<br>\r\n",
    "PostedDate": "2008-12-29T05:23:29.357-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "155591",
    "ThreadId": "41597",
    "Html": "Just to give everyone an update, I'm finally hooked into this thing and ready to take a look at what I may or may not be able to do with this module.<br>\r\n<br>\r\ncross your fingers<br>\r\n",
    "PostedDate": "2009-02-08T13:03:26.993-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "166643",
    "ThreadId": "41597",
    "Html": "<p>Hey there!  First of all, great work!</p>\r\n<p>With the last release version of the DpsWarr model, there were some minor, and a few major issues.  Most notable among these would be the Optimize error, but this is now fixed!  =D</p>\r\n<p>However, one oversight still seems out of place - mail armor is not an option that can shown in the DpsWarr module.  Actually, some mail pieces, despite the wasted itemization on Intellect, are almost as good as, or sometimes even better than their leather or plate counterparts.  Just as a for-example, the Blue Aspect Helm from Malygos is best-in-slot in almost any gear setup that is not exclusively plate.</p>\r\n<p>Great work!  Looks and works fantastic!  =D</p>\r\n",
    "PostedDate": "2009-03-10T15:52:30.393-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "166895",
    "ThreadId": "41597",
    "Html": "Checked in the change for showing mail armor. DPSWarr isn't forgotten, it's just a very complex model. I'm not sure if Jothay is still looking at it, but I'm also working on it (slowly as my schedule is pretty full). Small changes like this I can usually knock out right away though, so suggest away.<br>\r\n<br>\r\nHoly<br>\r\n",
    "PostedDate": "2009-03-11T08:14:23.85-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "166899",
    "ThreadId": "41597",
    "Html": "Oh, and in it's current state (with the beta) DPSWarr is fully functional I believe. It's not as accurate as it should be though, which is what I'm working on.<br>\r\n<br>\r\nHoly<br>\r\n",
    "PostedDate": "2009-03-11T08:17:43.517-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "166937",
    "ThreadId": "41597",
    "Html": "<p>It's not an absolutely PERFECT model... but it's VERY close!  Like I said, fantastic work on it!  (And, on an unrelated note, the new gemming system is much improved, as well!)</p>\r\n<p>Thanks!  =D</p>\r\n",
    "PostedDate": "2009-03-11T09:06:44.44-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "166975",
    "ThreadId": "41597",
    "Html": "Much as I'd love to take credit for the model. I can't as I have not actually done anything to it XD<br>\r\n<br>\r\nOnce i got it open I was a bit overwhelmed and not sure where to start. So far, i've just been trying to figure out how the damn thing works.<br>\r\n",
    "PostedDate": "2009-03-11T10:28:50.813-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "167036",
    "ThreadId": "41597",
    "Html": "Feel free to get ask get ahold of me. msn = holymist@hotmail.com. Working together would probably make this a lot easier.<br>\r\n<br>\r\nHoly<br>\r\n",
    "PostedDate": "2009-03-11T12:36:32.303-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "167128",
    "ThreadId": "41597",
    "Html": "<p>YES!  Behold: the powers of collaboration!\r\n</p>\r\n<p>In other news, this post contains an appalling lack of substance.</p>\r\n",
    "PostedDate": "2009-03-11T16:12:04.403-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "167745",
    "ThreadId": "41597",
    "Html": "Also, Slam does not seem to be a part of the fury rotation - possibly because Bloodsurge is not implemented?  It is showing up as 0 on the DPS breakdown, and the 2pc T7 does not seem to have any sort of weighting given (It's not a WHOLE lot - but it's not negligible by any means!)\r\n",
    "PostedDate": "2009-03-13T06:52:36.213-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "167788",
    "ThreadId": "41597",
    "Html": "Weird, I'll have a look. Bloodsurge is definately given a value, if you change the number of points in it you'll see your dps change. I'm guessing it's just a display problem.<br>\r\n",
    "PostedDate": "2009-03-13T08:32:16.723-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "167794",
    "ThreadId": "41597",
    "Html": "Ah, yeah, just a display thing. For a fury warrior your slam damage is shown in the bloodsurge section.<br>\r\n",
    "PostedDate": "2009-03-13T08:38:36.913-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "167801",
    "ThreadId": "41597",
    "Html": "And the 2-piece definately has a value, but like you said, it's not a whole lot. Quick test you can do to show it is create a new item and duplicate one of the T7 pieces stats except for the set bonus. Then see the difference between the two when you have one other T7 piece on (so that the next T7 piece would give you the bonus).<br>\r\n",
    "PostedDate": "2009-03-13T08:46:46.317-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "168021",
    "ThreadId": "41597",
    "Html": "The intended (and much easier) way to view the value of a set bonus is to just look at the All Buffs chart. :)",
    "PostedDate": "2009-03-13T21:29:35.637-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "168099",
    "ThreadId": "41597",
    "Html": "Ah yes, that would have been much easier if I had thought of it.",
    "PostedDate": "2009-03-14T10:30:10.517-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "168121",
    "ThreadId": "41597",
    "Html": "<p>New changes with a new build of 3.1.  Most notably, Weapon Mastery and Improved Intercept have switched places in their respective trees.  Good thing I have a nice stock of extra Expertise gear...</p><p>Plus, Arms got a new talent, and a renamed old one.  Modified abilities, as well.</p><p>Anyways, yeah.  Just a quick heads up on new things that can mess with the modeling.  ;)</p>",
    "PostedDate": "2009-03-14T13:16:17.473-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "170464",
    "ThreadId": "41597",
    "Html": "Here is a concise list of Warrior changes: <a href=\"http://elitistjerks.com/f81/t47800-official_3_1_changes_discussion/\">http://elitistjerks.com/f81/t47800-official_3_1_changes_discussion/</a><div><br></div><div>Note the buffs that no longer stack, Battle Stance now give 10% (multiplicative) ArP, and the new ability, Shattering Throw.  Battle Stance may soon become an option for Fury DPS.</div><div><br></div><div>The boss armor selection seems to be a bit off.  The closest (and default) for the v2.2.0b4 is 10900, while the actual value is 10645 (<a href=\"http://elitistjerks.com/f81/t37462-warrior_dps_calculation_spreadsheet/p17/#post1151919\">http://elitistjerks.com/f81/t37462-warrior_dps_calculation_spreadsheet/p17/#post1151919</a> at Elitist Jerks, and make sure to click through to the link in that post, for more analysis, if you wish).</div><div><br></div><div>Any chance we can get the Glyphs implemented, both the updated current ones, and the new ones with 3.1?</div><div><br></div><div>When mousing over items, Armor Penetration is not listed as a relevant stat in the mini-tooltip.  While ArP as a socket bonus shows (ie. the Titanium Impact Band's 4 ArP socket bonus), the normal on-equip ArP does not display (ie. the Titanium Impact Band's 41 ArP). though I believe it is correctly counted in the calculations.<br></div>",
    "PostedDate": "2009-03-21T18:47:49.59-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "170471",
    "ThreadId": "41597",
    "Html": "Continued: The common assumption has been that Expertise truncates, that is, additional Expertise Rating does nothing until reaching the next &quot;plateau&quot; of Expertise.  This widely-held view has recently been disproven, as shown here (<a href=\"http://elitistjerks.com/f31/t29453-combat_ratings_level_80_a/p14/#post1106316\">http://elitistjerks.com/f31/t29453-combat_ratings_level_80_a/p14/#post1106316</a>) and here (<a href=\"http://elitistjerks.com/f78/t38095-retesting_hit_table_assumptions/p3/#post1092985\">http://elitistjerks.com/f78/t38095-retesting_hit_table_assumptions/p3/#post1092985</a>).<div><div><br></div><div>What combat ratings are currently in use in the model?  There have been plenty of conversations about base miss, dual-wield miss, dodge, and glancing blows.  I think the most current accepted values are 16%, 27%, 6.5%, and 24%, respectively.</div><div><br></div><div>Is crit suppression factored in?  Crit reduction against an 83 raid boss is 4.8% (.6% per level difference, 3% for being a skull mob).</div><div><br></div><div>All classes now get +25% more benefit from ArP.  ArP is currently a bit buggy on the PTR, so testing is still being done on nailing conversions, armor values, talents, and all sorts of wonky things are happening with the data.  But that's the announcement that Blizz gave, not just a value that's come up in testing.</div></div>",
    "PostedDate": "2009-03-21T19:31:12.923-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "170877",
    "ThreadId": "41597",
    "Html": "<p>Beserking is not currently given a value.  Try using a regular old weapon, and then put Beserking on it it.  No stat / output change whatesoever, and a zero value on the buffs chart.</p>\r\n<p>Was Haste being undervalued by only increasing weapon speed previously?  I have noticed the &quot;rage proc&quot; listed on items with Haste on them.  If that's the solution to balancing Haste's effects, sure, whatever works in the end.  Not really beneficial to see that on the Rawr &quot;Relevant Stats Tooltip&quot;, though, from an end-user standpoint.</p>\r\n<p></p>\r\n<p>I swear I only critique because I care!</p>\r\n",
    "PostedDate": "2009-03-23T08:14:44.43-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "170891",
    "ThreadId": "41597",
    "Html": "Please, keep it up. :)<div><br></div><div>That 'Extra Rage Proc' thing you saw on many items was a display bug; it's fixed in the latest version.</div>",
    "PostedDate": "2009-03-23T08:39:51.39-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "171337",
    "ThreadId": "41597",
    "Html": "I concur, keep it up. I am reading all this and adding it to my todo list. Berserking isn't modeled at all in the dpswarr module, so yeah, no value for it yet.<br>\r\n",
    "PostedDate": "2009-03-24T07:56:13.85-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "171342",
    "ThreadId": "41597",
    "Html": "<p>I would also like to see options within the Optimizer window for, say, Expertise ≥ 26, Stay Hit Capped, and options for Rage Generation (the latter seems much more difficult, but from what I see on the user-end side, a possibility).  Another cool option would be the number of Plate armor itemsmust be greater than, say, 6/8, 5/8, whatever.</p>\r\n<p>The talent trees have changed, but were not updated to reflect this in either of the last two beta pushes (b4/b5).  Not saying it needs to be updated NOW RIGHT NOW, but just a friendly reminder.  ;)  If somebody wishes to manually tweak for more accurate Fury modeling in the upcoming 3.1 in the meantime, make sure that you take out the two talents from Weapon Mastery in the Fury tree, as they are moving out of reach for a Titan's Grip build when the patch is applied on the live servers.</p>\r\n<p>Also, and this is a big one, but this is all modeled on a stand-and-deliver fight, correct?  Does this model factor in any splash (incidental raid damage) for the purposes?  And, arguably more importantly, does this factor in moving between targets, or any sort of mobility at all?  This is not so much an issue of cast time, as most of our abilities are instant with cooldowns, but staying on-target is our big thing.  Heroic Fury, Improved Intercept, and the biggest issue of them all, Icewalker/Greater Assault versus Tuskarr's Vitality/Cat's Swiftness.  I don't believe there is any model currently in play to factor in movement, mobility, and Time On Target in any sort of mobile fight.</p>\r\n<p>I understand that many of these are situational, and extremely encounter-specific... However, a potential solution might be an option to model a mobility-based versus a tank and spank boss, and further, and option to combine the two with a ratio weighting system for a average.  A slider could be implemented to select the degree of mobility one would like to model, and then how much one would like to weight the mobility model versus the &quot;Patchwerk/Brutallus&quot; model.</p>\r\n<p>What ArP changes have been implemented in the 3.1 modeling so far?  Not looking for an exhaustive list, but there are a number of changes that have been both experienced and announced on the PTR as of this point.  Also, the Expertise Rating &gt; Expertise was a bit wonky there for a while, but has now been restored to it's former (live) value.</p>\r\n<p>[edit] Misspelling</p>\r\n",
    "PostedDate": "2009-03-24T08:00:34.31-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "171345",
    "ThreadId": "41597",
    "Html": "<p>One more thing that I'm going to go to the community about: the Fury talent Enrage.  In 2.4.3 and earlier versions, it was a chance that, upon receiving a critical strike, one would gain a percent damage increase output.  (At least as I remember it.  =D)  It is now a 30% chance upon being the victim of a damaging attack to gan a 2/4/6/8/10% damage buff... if this incudes AoE damage, debuffs, poisons, curses, negative auras, whirlwinds received, etc., then this could be a very powerful talent that we have overlooked.</p>\r\n<p>I will definitely be checking it out, and reporting back when I have some sort of consensus.\r\n</p>\r\n<p>Has the 10% damage nerf that was attached to Titan's Grip been implemented?  The tooltip on the talent in the program is a bit confusing... it still includes the old &quot;chance to hit reduced&quot;, but is showing as zero.  The new penalty for TG reads as follows: &quot;While you have a two-handed weapon equipped in one hand, your physical damage done is reduced by 10%.&quot;  The &quot;One Hand&quot; notation is to clarify what happens of you wear, say, a 2H and a 1H, or a 2H and a shield, not what happens if you wear a lone 2H, and it does not stack to 20% (or rather, 10% + 10%?) for DW 2H.</p>\r\n",
    "PostedDate": "2009-03-24T08:10:38.14-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "171389",
    "ThreadId": "41597",
    "Html": "Pretty much none of the PTR stuff has been put in yet. There was some news today that may make your plate armor restriction moot. With Improved Berserker Stance increasing strength by a percentage instead of ap, plate armor will be much much more attractive since mail and leather never have str.<br>\r\n",
    "PostedDate": "2009-03-24T09:40:56.727-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "171440",
    "ThreadId": "41597",
    "Html": "<p>I agree - the new Improved Beserker Stance change (especially with the opening of discussions of another two tiers in AttT), plate is finally going to have a place at top of most &quot;purely DPS&quot; BiS lists.  It's not a real itemization change, but at least it fixes this glaring problem of leather and mail stacking up against and outright beating plate for DPS purposes.  That's a whole other discussion, though - The &quot;At least this much plate&quot; becomes moot with this change.</p>\r\n<p>Leather and mail will still have their place in the selections, however.</p>\r\n",
    "PostedDate": "2009-03-24T11:48:08.59-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "175809",
    "ThreadId": "41597",
    "Html": "<p><em><strong>Bugs/Notes on 2.2.0b6:</strong></em></p>\r\n<p>The internal Haste x% still displays on the item tooltips.</p>\r\n<p>Expertise no longer truncates (rounds down) - thanks!</p>\r\n<p>Im not sure why exactly expertise is on a per-hand basis.  It should be one Expertise value, not MH/OH, and the total gets +3, +3 +3, or +5, for the different racials.</p>\r\n<p>Beserking (and, to a lesser extent, Mongoose and Executioner) are still unmodeled.</p>\r\n<p>Talents have not been updated for the last few builds.  Weapon Mastery (Fury) should switch places with Improved Intercept (Arms), and Improved Beserker Stance now increases Total Strength by 4/8/12/16/20%.</p>\r\n<p>[edit] The standard ArP still is not showing for items, though socket bonuses of ArP are.  Looking at the Titanium Impact Band as an example, the 41 ArP is not showing on the tooltip, though the 4 for the socket bonus is.  This seems to be merely a display error, as it's being ranked correctly like the 41 ArP is indeed there.</p>\r\n<p>[edit] Titan's Grip penalty still not implemented.  Just throwing it out there as a friendly reminder.</p>\r\n<p><em><strong>Suggestions for 2.2.0b7 and beyond:</strong></em></p>\r\n<p>Expertise and Hit cap met as an optional constraint on the Optimization</p>\r\n<p>I notice that there are two ways to optimize - DPS, and Overall.  Does Overall take into account Stam, or is it simply a mirror of DPS?  Playing with this vague concept of Stam factoring in, could it be possible to set up a sliding scale in the options to value Stam more/less?</p>\r\n<p>Boss armor has been determined to be 10643 (source available).  Mind changing the armor in the Options to reflect this?</p>\r\n<p>New ArP changes.  Though, I believe that's a core issue, not a module one.  Please let me know if I'm incorrect, and you want the new info.  From a Warrior perspective, ArP isreceiving a 25% ArP benefit buff (1.25 multiplier), plus a new formula.  ArP has finally been (almost) nailed down to line up expected values with actual (modified due to bugging) values, see: http://elitistjerks.com/f31/t29453-combat_ratings_level_80_a/p16/#post1170842 , reworded here: http://elitistjerks.com/f31/t29453-combat_ratings_level_80_a/p16/#post1179560 .  Specifically aplicable to the module, Battle Stance, Mace Spec, and ArP are additive, and are additive with the debuff total (sunder and FF are multipicative with each other).  This does mean that ArP can make the armor reduction go past 0%, but is capped when the value reaches 0%.  Values and new formula in the thread linked.</p>\r\n<p>A *(additional data) on hover for Expertise, Hit, Crit, ArP (including Battle Stance if Arms-specced), and Haste showing the final percentage (or relevant display of improvement) after gear and talents (base stats).</p>\r\n<p>Also, a revamping of the buffed combat stats would be great!  Base AP should be separated from Buffed AP.  Crit is a single stat, not MH/OH.</p>\r\n<p>A &quot;smart&quot; detection of which flavor DPS Warrior you are could eliminate all the empty space associated with the &quot;other&quot; DPS Warrior's DPS breakdown (the block of 0s running down the page for the Arms moves, when specced Fury, or vice versa).  I'm thinking just a filter to &quot;mask&quot; the values in this field that equal zero, or alternatiely, are flagged as the &quot;other&quot; flavor.</p>\r\n<p>How is the rotation handled?  Would it be possible to add in a way to define a custom rotation / prioritization?  While this might be less of an issue in Fury, it can be significant for Arms Warriors, and even dynamically different depending on gearing levels.  Options to set a priority list, whether an ability should be allowed to be &quot;pushed back&quot; (delayed due to GCD of a previous ability that is lower on the priority list), and... whew... Execute and rage model interactions.  This one could be a doozy.</p>\r\n<p>Options to select applicable Glyphs.  Possibly sorted into General, Fury, and Arms, for quick reference / selection.</p>\r\n<p>Any way to select time of a given fight?  Modeling for a 76s Sarth10+3D could be drastically different from modeling for a Sarth10+3D normal approach, especially given Heroism and trinket / cooldown uptimes.</p>\r\n<p>Mind removing the Elixir of Demonslaying from the applicable buffs list?  Any Warrior, ever, will use this in a raid exactly 0 times, and can be annoying when selecting the new &quot;optimize elixirs / food buffs&quot; in the Optimizer.</p>\r\n<p>Possibility of a selector for the amount of incoming (rage-generating) splash damage?  Maybe a slider showing a continuum between zero rage generated from incoming damage, to an infinite rage situation?  (Sort of a &quot;hook&quot; into the rage modeling.)</p>\r\n<p><strong><em>Questions:</em></strong></p>\r\n<p>How are trinket effects handled?  Do they take into account time to proc (eg., take into account crit chance, attack speed of main hand and offhand, and chance of proccing, on a trink that has a chance to proc on crit) and internal cooldowns, or are they simply averaged out: [buff x (time / cooldown)]?</p>\r\n<p>How are cooldowns factored in?  Heroism, Death Wish, Recklessness, etc., all generally coincide when used optimally.  Does the module take this into account?  The would coincide heavily with the length of the fight.</p>\r\n<p><em><strong>Other:</strong></em></p>\r\n<p>Time on Target (ToT) and its effect on DPS through Intercept / Improved Intercept / Heroic Fury / Runspeed Increase.  Would it be even considered to model this, and have a selector in the options panel to denote how much moving between targets is an issue?  For Fury, just staying on the target is generally enough, and the only things that this matters is, for example, moving quickly to an endpoint between targets (getting to the portal from a drake in Sarth, Twin Emps in AQ40, etc.).  For Arms, this has a direct bearing on choosing Slam vs. MS (cast time vs. instant).  This is probably more of a &quot;luxury&quot; and situational modeling option, not necessary by any means.  It would, in fact, be much more of an issue for mages, just as one example.  Just throwing this idea out there, as I can always just select &quot;no enchant&quot; for Tuskarr's Vitality, but it would great to set a &quot;moderately mobile fight&quot; and see how TV stacks up against Icewalker (or whatever.)  This is a whole can of worms itself, and probably deserves its own thread (Which I will make/propose when I get the time).</p>\r\n",
    "PostedDate": "2009-04-05T06:29:20.627-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "176385",
    "ThreadId": "41597",
    "Html": "I'll try and respond to the questions that I may know the answers to, I'll leave the rest to Astrylian and holymist.<br>\r\n<br>\r\n<strong>Haste x%</strong><br>\r\nI was unable to reproduce this issue, can you screen shot it and send it to me? (email at bottom)<br>\r\n<br>\r\n<strong>Expertise doesn't truncate (round down)</strong><br>\r\nI've added the Truncate function into the Calculations for Expertise, this should be corrected now.<br>\r\n<br>\r\n<strong>Expertise is per hand</strong><br>\r\nBecause that's how WoW calculates it.<br>\r\nE.g. as a Human carrying a 2h Axe and a 2h Mace, I get exp bonus on the mace only, not the Axe.<br>\r\n<br>\r\n<strong>Berserking, Mongoose and Executioner are still un-modeled</strong><br>\r\nAs soon as me and holy figure out how to model it, it will be in there. Note that Mongoose and Executioner are both outdated but Berserking is a priority.<br>\r\n<br>\r\n<strong>\r\nTalents have not been updated</strong><br>\r\nI have entered the new values for 3.1.0 per the patch notes page into the Talent Trees, if anything is off, let me know. I've not yet put these new numbers into the calcs though.<br>\r\n<br>\r\n<strong>The standard ArP still is not showing for items, though\r\nsocket bonuses of ArP are</strong><br>\r\nThe whole ArP system is seriously screwed up, waiting for Astrylian to make more sense of it before really fixing this.<br>\r\n<br>\r\n<strong>Titan's Grip penalty still not implemented</strong><br>\r\nTitan's Grip changed in 3.1.0 to a 10% physical dmg reduction instead of hit penalty. This has yet ot be modeled by the tt has been updated.<br>\r\n<br>\r\n<strong><em></em>Expertise and Hit cap met as an optional constraint on the Optimization</strong><br>\r\nI don't know how to do this &gt;.&lt;<br>\r\n<br>\r\n<strong>DPS vs Overall in sorting/optimizing</strong><br>\r\nOverall is a generic listing applied to all classes that encompasses each of the individual points. In ProtWarr, Overall is the sum of Threat, Survivability and Mitigation. DPSWarr simply doesn't have any other points to add into it so Overall = DPS in this case. There is no reason to start factorin in Stam, you aren't supposed to be getting hit, the tank is, so your overall health has no bearing on the model. I suppose if there was enough call for it to function DPSWarr's as a partial OT speck there could be a survivability add to the modeling, but I don't see this coming anywhere in the near future.<br>\r\n<br>\r\n<strong>Boss armor values</strong><br>\r\nProvide me the list and I can easily set those. Please also include the bosses that these are pulled form so that I can make it update teh boss names too :)<br>\r\n<br>\r\n<strong>New ArP changes</strong><br>\r\nSee the note about ArP above, until the whole ArP thing is fixed I won't wanna screw with this yet.<br>\r\n<br>\r\n<strong>Additional note data on the Base Stats area</strong><br>\r\nSome idjumumit wrote an entirely separate class to handle the stats to display here. I'm trying to figure out how and why so I can trash it and use the standardized class, which will allow for those tooltips. Presently there is no way to write them into the model that was written. Once this has been done, I will look into adding the additional display fields you mentioned as well as the smart detection of warrior type. Honestly, I believe that Arms Warriors should be a fully separated model from Fury Warriors as the models have to function differently but that's a can of worms I don't want to open.<br>\r\n<br>\r\n<strong>Custom Rotations</strong><br>\r\nThe short answer is, not any time soon. I'd like to one day see a rotation method and an option to allow for execute spamming under 20%, certain gear levels make it so execute spamming actually does less dps than not doing it (at least that could occur in BC, dunno about WotLK yet).<br>\r\n<br>\r\n<strong>Glyphs</strong><br>\r\nGlyphs have been entered in so they can be selected, but they are functionally useless right now. You can find them as a 4th tab in the Talents section. They are sorted as Major vs Minor.<br>\r\n<br>\r\n<strong>Temporal Mechanics</strong><br>\r\nuhhhhhh.... this makes my head spin.<br>\r\n<br>\r\n<strong>Elixir of Demonslaying = Bad Omptimizer</strong><br>\r\nWould that I could, but I can't so I won't.<br>\r\n<br>\r\n<strong>Rage Gen from Splash Damage</strong><br>\r\nI'm pretty sure the model only looks at one target, not multiple as multiple targets is entirely subjective to the fight and whether mob is actually up or not. All in all, there's no real way to say how often, how any and for how long the additional mobs will be there.<br>\r\n<br>\r\n<strong><em></em>Trinket Effects</strong><br>\r\nDo they take into account time to\r\nproc? General activations/procs, I'll as Astrylian to clarify further.<br>\r\nHow are cooldowns factored in? I believe they are run as general, use as cd pops.<br>\r\n<br>\r\n<strong>Time on Target (ToT)</strong><br>\r\nThis follows the same line of reasoning as above with splash damage.<br>\r\n<br>\r\n<em><strong></strong></em>email: <a href=\"jothay@jothay.com\">jothay@jothay.com</a><br>\r\n",
    "PostedDate": "2009-04-06T17:10:22.71-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "176389",
    "ThreadId": "41597",
    "Html": "<p>Oh, and the set bonuses for T8.  I know we were waiting for the set to be finalized, though it's late enough where the set bonuses can safely be assumed as set.</p>\r\n<p>2-piece:  &quot;Heroic Strike and Slam critical strikes have a chance to grant you 150% haste rating for 5 sec.&quot;</p>\r\n<p>http://ptr.wowhead.com/?spell=64938  The tooltip on this is incorrect.  Mouseover the effect - it's really 150 haste bonus, not 150%.  40% proc chance.</p>\r\n<p>4-piece:  &quot;Increases the critical strike chance of Mortal Strike and Bloodthirst by 10%.&quot;</p>\r\n<p>http://ptr.wowhead.com/?spell=64939  Pretty striaght-forward.</p>\r\n",
    "PostedDate": "2009-04-06T17:22:25.01-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "176392",
    "ThreadId": "41597",
    "Html": "<p>Whoa.  You posted right before me.  I'm about to go tank a BWL (LOL), but I have read everything.  Want to follow up on some of it, will post again later tonight.</p>\r\n<p>Got the screenshot, sending in later tonight after this lolretrorun - And the first ArP issue isn't an implementation of mechanics, it's a display thing.  The ArP on items doesn't show up, though it is being factored in.</p>\r\n",
    "PostedDate": "2009-04-06T17:33:52.623-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "178013",
    "ThreadId": "41597",
    "Html": "<p>My apologies - real life stepped in this week, and demanded my attentions.</p>\r\n<p>Sending that email your way now, Jothay.  I hope to have that followup post that I said I would make by tomorrow.</p>\r\n",
    "PostedDate": "2009-04-10T12:04:45.317-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "178050",
    "ThreadId": "41597",
    "Html": "Corrections to my previous post:<br>\r\n<br>\r\n<strong>Expertise doesn't truncate (round down)</strong><br>\r\nI've added the Truncate function into the Calculations for Expertise, this should be corrected now.<br>\r\n<strong><span style=\"color:red\">Correction:</span></strong> This was proven to not actually truncate, see the elitestjerks forums for more details. I've set it back to not truncating.<br>\r\n",
    "PostedDate": "2009-04-10T14:37:53.62-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "178059",
    "ThreadId": "41597",
    "Html": "<p>Oh, on Expertise, I had noted that it no longer truncates a few posts back, and it was corrected as of b6.  I was just noting my thanks. =)\r\n</p>\r\n<p>It had been truncating in the program forever, as per the in-game character sheet, but we know how smart it is to trust that, right?  Right?</p>\r\n<p>[edit] Both screen captures that I sent to you were taken on b6.  All my comments will always be with reference to the most current build.  As I have no knowledge of compilation, I simply note the most recent notes attached to the changes made in the &quot;source code&quot; tab above.</p>\r\n",
    "PostedDate": "2009-04-10T15:40:32.837-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "178283",
    "ThreadId": "41597",
    "Html": "<strong>Haste x%</strong><br>\r\nEmailed<br>\r\n<br>\r\n<strong>Expertise doesn't truncate (round down)</strong><br>\r\nAddressed above<br>\r\n<br>\r\n<strong>Expertise is per hand</strong><br>\r\nSeriously?  I learned something today!<br>\r\n<br>\r\n<strong>Berserking, Mongoose and Executioner are still un-modeled</strong><br>\r\nGotcha.  ;)<br>\r\n<br>\r\n<strong>Talents have not been updated</strong><br>\r\nI have zero knowledge of compilation.  If you feel comfortable running me through the basics sometime over Vent or something, I would love the opportunity to learn.  I may also do some research in my free time on this subject.<br>\r\nBut, on topic, I can’t see anything until the next beta release is… released.<br>\r\n<br>\r\n<strong>The standard ArP still is not showing for items, though socket bonuses of ArP are</strong><br>\r\nThis one wasn’t an issue of mechanics, but of display.  I think I covered it above.<br>\r\n<br>\r\n<strong>Titan's Grip penalty still not implemented</strong><br>\r\nActually, the hit penalty was completely removed as of 3.0.9.  Thanks!<br>\r\n<br>\r\n<strong>Expertise and Hit cap met as an optional constraint on the Optimization</strong><br>\r\nI petition holymist or Astrylian at this point, then.  =)  This is something I would very much like to see implemented.<br>\r\n<br>\r\n<strong>DPS vs Overall in sorting/optimizing</strong><br>\r\n<p>While I would agree in general, consider this example: The optimizer has a choice between socketing a +16Str gem with no socket bonus, or a +8Str/+12Sta gem with a +8Str bonus.  Who in their right mind would choose the +16Str gem in this instance?  While, in general, one should not be getting hit as DPS, that does not change the fact that we WILL inevitably get hit, no matter how good our tanks, or our agro management.  In addition, AoE magic damage, boss splash damage (Whirlwinds, for example), damaging auras are all a fact of raiding.  To say that Stamina (re: health) is completely, 100% irrelevant to a DPS can be arguably off-base.</p>\r\n<p><strong>Boss armor values</strong></p>\r\n<p>The general boss armor (dummy) has been tested to be 10643.  I’ll provide the link to the testing later, but it’s in the Elitist Jerks Combat Rating thead, if I remember correctly.</p>\r\n<br>\r\n<strong>New ArP changes</strong><br>\r\nThe formula has been nailed down very recently (within this last week).  Though it is still bugged, the bugs have been accounted for, and the formula has been found to match the experimental data with the expected values, something that we haven’t been able to do before.<br>\r\n<br>\r\n<strong>Additional note data on the Base Stats area</strong><br>\r\nThe two specs of Warriors are in fact two whole separate deals.<br>\r\n<br>\r\n<strong>Custom Rotations</strong><br>\r\nActually, at nearly all gearing levels in Wrath (at and above average iLvL 176-187 or so), it is better to continue the normal rotation, simply subbing Execute in as the rage dump when it becomes active at 20%.  While custom rotations are not useful for Fury, they are for Arms, with so many more options, and the optimal rotations changing at different gearing levels, in different situations, etc.<br>\r\n<br>\r\n<strong>Glyphs</strong><br>\r\nCool beans.  Again with the compilation deal, I’ll just wait for the next release.<br>\r\n<br>\r\n<strong>Temporal Mechanics</strong><br>\r\nOkay, simplified: slider to select the length of the battle, which will take into account trinket usage, Heroism uptime, cooldown uptime, etc.<br>\r\nClosely related, selector for whether Heroism is available or not – possible?<br>\r\n<br>\r\n<strong>Elixir of Demonslaying = Bad Omptimizer [sic] =)</strong><br>\r\nBad Optimizer indeed!  I know I really only should be using the Flask of Endless Rage, though, so I just don’t allow it to select Demonslaying at all.<br>\r\n<br>\r\n<strong>Rage Gen from Splash Damage</strong><br>\r\nWhile there’s no way for the model to arbitrarily determine the amount of rage intake from damage taken, it is not insignificant.  Possibly a selector to give the rage model more rage per every few seconds for damage taken due to Sapp aura / loose mob / OHMYGODIJUSTGOTHITBYAFLAMEWALLINSARTH! levels of damage taken?  This one seems a bit awkward to implement, but it is absolutely crucial to actual Warrior DPS.<br>\r\n<br>\r\n<strong>Trinket Effects</strong><br>\r\nAlright, cool.<br>\r\n<br>\r\n<strong>Time on Target (ToT)</strong><br>\r\nI really have no idea how the fight is modeled in the program, so I couldn’t contribute possible ideas in this area.  I only have a best guess here (all abilities using average damage, factoring in crit chance/haste/arp/etc., and using average weapon damage).  Again, I am NOT a programmer, and can really only make less-than-educated stabs at how everything is implemented, which does not lend much to the brainstorming process.  :/<br>\r\nAnd after further consideration, while this concept is key to Warrior (re: melee) DPS, I am not really seeing how this might realistically affect gearing choices.  While it ABSOLUTELY excites geeks such as myself and the other theorycrafters in the guild, I think it will come down to personal feel to determine Tuskar’s Vitality over Greater Assault, or whether or not to take Heroic Fury/Imp Intercept, etc.<br>\r\n<br>\r\n<br>\r\n",
    "PostedDate": "2009-04-11T21:45:02.047-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "178486",
    "ThreadId": "41597",
    "Html": "Back on the subject of the unmodeled weapon enchants, Executioner does not seem quite so &quot;outdated&quot;, with the new changes to ArP and AP.  I would personally put it on the same level as Berserking, speaking from a development priority standpoint.\r\n<div><br>\r\n</div>\r\n<div>I also have no doubt that you know that the hit penalty is no longer attahed to Titan's Grip, it was more of an aside than anything else.</div>\r\n<div><br>\r\n</div>\r\n<div>\r\n<div>I don't know how the rage is modeled in the program, though what I imagine is that one could &quot;inject&quot; x bonus rage every y seconds, which would be a variable amount, based on how much splash damage is being modeled (Sapphiron aura, versus planning around pulling one add on Sarth + friends).</div>\r\n<div>\r\n<div><br>\r\n</div>\r\n</div>\r\n</div>\r\n",
    "PostedDate": "2009-04-13T00:57:15.143-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "178872",
    "ThreadId": "41597",
    "Html": "<p>Release 2.2.0.7 out this morning.  I shouldn't be up, but meh.  ;)</p>\r\n<p>Improved Beserker Stance (Fury tree) is incorrectly giving (and showing) +20% AP, instead of the correct +20%Str.  And yes, I did notice the &quot;patch&quot; for this in the issue tracker, but again with the ingorance of compilation deal.</p>\r\n",
    "PostedDate": "2009-04-14T01:08:15.307-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "182127",
    "ThreadId": "41597",
    "Html": "I just spent a couple days rewriting the display values to show up correctly as Astrylian intended, this has caused some inconsistencies and invalid calcs on the tooltips but I'm tired &gt;&lt;<br>\r\n<br>\r\nIn the process i copied the modelling for Executioner and Mongoose from ProtWarr into DPSWarr so there is modeling now but i make no guarantees as to whether it actually works or not.<br>\r\n<br>\r\nOne thing that keeps bugging me is that using the same formulas seen everwhere, 330 AGI only gives 5.xx% crit bonus when it should be 8.xx% and for the life of me i cant wrap my brain around why rawr wont do it right. Hopefully i'll ahve a more clear head tomorrow and maybe holymist will take a look.<br>\r\n",
    "PostedDate": "2009-04-21T21:04:37.677-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "182361",
    "ThreadId": "41597",
    "Html": "5.28% crit is the correct amount for 330 agility. the ratio for warriors is AgilityToCrit = 1.0f / 62.5f, so 330/62.5 = 5.28%<br>\r\n<br>\r\nHoly<br>\r\n",
    "PostedDate": "2009-04-22T08:03:15.727-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "182385",
    "ThreadId": "41597",
    "Html": "A couple more notes that I made were:<br>\r\n<br>\r\nIn the Options panel you can now select Fury stance vs Arms stance, which in the tt's would change the Crit % number by the 3% and in the ArP change by the 10% rating for Arms stance but I didn't quite get that far.<br>\r\n<br>\r\nToughness from Mining can be selected from the Options Panel and it will affect the Stamina number, which in turn affects health. However the Health number was off by about -1600 hp last night while stamina *was* correct &gt;.&lt;<br>\r\n<br>\r\nRight now, with mongoose and executioner modeled in it shows those two as the best options for enchanting your weapons, this is not the case as Berserking is the real one you want at lvl 80, I just need to model it in.<br>\r\n<br>\r\nThe expertise items were pushed to a single display value with a tt that shows the breakdown of individual exp amounts per weapon. However it's trying to recall it as a generic character right now so it's only recognizing it without the racial bonus'. I can fix this by moving the formula call over to another section so that should get done tonight.<br>\r\n<br>\r\nYou will also see similar tooltips show the main percentage on the value, with the value's tt showing the rating number. I'm going to try to write in a &quot;You are ___ rating from the correct amt, you (need more/can free up) ___ rating&quot; message that will take into account your talents. For ease of access to the information, on hit and expertise, mouse over the labels to see the individual numbers per talent point spent to find out how much rating you need.<br>\r\n<br>\r\nHoly, the 5.28% is a value that can be directly done from that formula but WoW says the 8.xx% number on it so either Rawr is wrong or wow is wrong or i'm missing something, but hey i'm at work right now so i cant go look it up =P<br>\r\n<br>\r\nBrWarner, I'll correct the tt on the talent tonight as well. I'll model the str amount in shortly, just want to get all the display values to show up correctly first.<br>\r\n",
    "PostedDate": "2009-04-22T08:40:58.07-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "182431",
    "ThreadId": "41597",
    "Html": "Are you maybe thinking of the Base crit? That's about 3.2% which would bring it up to 8.5ish. In rawr, if I make a naked char with no talents and add all the agility buffs I can, I get to 8.2% crit with 324 agility.<br>\r\n",
    "PostedDate": "2009-04-22T09:57:26.387-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "182435",
    "ThreadId": "41597",
    "Html": "Echoing Holy here.<br>\r\n",
    "PostedDate": "2009-04-22T10:01:43.85-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "182436",
    "ThreadId": "41597",
    "Html": "/facepalm<br>\r\n<br>\r\ni'm a moron \r\n",
    "PostedDate": "2009-04-22T10:03:16.517-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "182440",
    "ThreadId": "41597",
    "Html": "Heh.&nbsp; I haven't gotten much sleep recently, either.&nbsp; xD<br>\r\n<br>\r\nAlso, while Berserker is very nice, I might actually say that you shouldn't worry if the older ones seem a little close - they are still pretty nice enchants.&nbsp; Executioner in particular is much nicer, given the recent ArP changes.<br>\r\n",
    "PostedDate": "2009-04-22T10:07:25.433-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "182517",
    "ThreadId": "41597",
    "Html": "I'm not sure what is going on, but I just downloaded the latest change set (33421). Loading in a guildies' DPS Warrior who is near BiS Naxx gear[Slyzaa - US-Deathwing], and a lot of the special abilities are coming up as 0 DPS. Bloodsurge, Bloodthirst, Mortal Strike, Slam, Sudden Death, Bladestorm, Sword Spec, and Deep Wounds are all coming up as 0. I made sure all enchants and Gem bonuses are in place, as well as the talents/glyphs.<br>\r\n<br>\r\nAlso, I noticed that Armor Pen is not coming up at all in the Gem listing. Even in the relative stats, it's not even listed.<br>\r\n<br>\r\nLastly, have you guys looked at the coding behind Landsoul's Warrior DPS spreadsheet and use some of that in RAWR?<br>\r\n",
    "PostedDate": "2009-04-22T13:28:14.563-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "182520",
    "ThreadId": "41597",
    "Html": "ummm, did the above not make it clear when i said:<br>\r\n<br>\r\n&quot;I just spent a couple days rewriting the display values to show up\r\ncorrectly as Astrylian intended, this has caused some inconsistencies\r\nand invalid calcs on the tooltips&quot;<br>\r\n<br>\r\nand no, i have not looked at Landsoul's in a long time, but if the situation warrants that I need to I will.<br>\r\n",
    "PostedDate": "2009-04-22T13:33:21.393-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "182522",
    "ThreadId": "41597",
    "Html": "/facepalm<br>\r\n<br>\r\nI need to read closer. I thought I read through the thread but I guess not close enough.<br>\r\n<br>\r\n*blames it on final exams* \r\n",
    "PostedDate": "2009-04-22T13:35:34.593-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "182567",
    "ThreadId": "41597",
    "Html": "I've just posted an update, tell me what you think of what i did NOW!!<br>\r\n<br>\r\nAdded Berserking (Both AP bonus and Armor Debuff) (Rawr currently values it about twice as much as either mongoose or executioner when using my character as an example)<br>\r\nUpdated all tt's to show corrected information<br>\r\nMinor formula edits to include Stance Dancing, fury affects str, arms affect ArP<br>\r\n<br>\r\n",
    "PostedDate": "2009-04-22T16:13:38.807-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "183868",
    "ThreadId": "41597",
    "Html": "Hi,&nbsp; Just wanted to say thanks for all the work on the DPSWarr stuff.&nbsp; Also, as far as I can see, Berserker isn't being modelled 100% accurately yet.&nbsp; If I put one on one of my weapons it seems to register but if I put a second casting on my off-hand weapon it seems to ignore it.&nbsp; My understanding is that it, supposedly, stacks completely doubling both the bonus and the negative.&nbsp; I haven't seen anything on wowhead, or anywhere else, to suggest that they changed it recently.<br>\r\n<br>\r\nThanks again for all the work.<br>\r\n",
    "PostedDate": "2009-04-26T18:09:04.01-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "183870",
    "ThreadId": "41597",
    "Html": "Try downloading another copy of the beta, I added that in last night to handle doubling up on Mongoose, Executioner and Berserker.<br>\r\n",
    "PostedDate": "2009-04-26T18:15:59.86-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "186460",
    "ThreadId": "41597",
    "Html": "ArP still does not show up on tooltips.<br>\r\n<br>\r\nMissing buff: Draenei +1% hit aura for party members.<br>\r\n<br>\r\nArP is still a little wonky, but again, I don't know how much of this is module, and how much is core.&nbsp; Either way, the target armor should be 10643 for modeling purposes.&nbsp; I don't think the ArP calculations have been updated for 3.1 quite yet, though I could be wrong.<br>\r\n<br>\r\nThere's some other stuff, but my mind is tired.&nbsp; Ugh.&nbsp; Last final tomorrow.<br>\r\n",
    "PostedDate": "2009-05-04T02:24:17.697-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "186786",
    "ThreadId": "41597",
    "Html": "I just went thru a bunch of the talents that were having no effect on dps and wrote them in. I can't say they are 100% accurate but they are there vs not there now. Same thing for a few of the glyphs.<br>\r\n<br>\r\nIt should now far better reflect Arms DPS than it used to. There's several formulas inside Arms DPS that I would like to benchmark to verify.<br>\r\n",
    "PostedDate": "2009-05-04T20:47:02.563-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "187588",
    "ThreadId": "41597",
    "Html": "<p>Cool stuff.<br> <br> Oh, and T8 set bonuses are not assigned a value.&nbsp; =)</p>\r\n<p>[Edit] Typo corrected.</p>",
    "PostedDate": "2009-05-06T21:53:46.46-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "188210",
    "ThreadId": "41597",
    "Html": "<p>Hey, I just finally got around to checking out the DPS Warrior module of Rawr. &nbsp;I'm using the current release (v2.2.2), and noticed a few things that haven't been addressed yet:</p>\r\n<p>- Unbridled Wrath doesn't seem to add any DPS at all</p>\r\n<p>- Fury of the Five Flights (trinket) is listed as adding 0 DPS. &nbsp;It should be considered as 320ap, unless you add in fixed duration/phased/movement fights (right now it looks like you're just doing Patchwerk).</p>\r\n<p>- It looks like a lot of trinkets aren't factoring in procs (Darkmoon: Greatness, Grim Toll, etc).</p>\r\n<p>&nbsp;</p>\r\n<p>Also, if you're overwhelmed or need a little help, feel free to email me. &nbsp;I spend a lot of time on EJ and TankSpot, so I'm familiar with the theorycrafting/game mechanics (especially on the Fury side of things, but I spent a lot of time as Arms back in 3.0). &nbsp;Also, I'm a developer with Microsoft, experienced with C#, and while I don't have a TON of free time, I'm more than willing to help as I can. &nbsp;You can email me at [my user account name]@gmail.com</p>",
    "PostedDate": "2009-05-08T09:57:21.383-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "188212",
    "ThreadId": "41597",
    "Html": "<div>\r\n<p>ebs2002, send a message to astrylian and he can get you listed as a dev on DPSWarr.</p>\r\n<p>I&rsquo;ll look into trinket procs once I have completed all the Talent factors. I believe that astylian is working on a global DPS modifier for each of the trinket and enchanting procs, etc. so I&rsquo;m waiting a little bit for him to finish that work. I&rsquo;m just now doing the global ratings factors that he added in.</p>\r\n</div>",
    "PostedDate": "2009-05-08T10:07:19.397-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "188662",
    "ThreadId": "41597",
    "Html": "<p>I have not spent much time to pinpoint it, but have noticed another potential issue:<br><br>I recently obtained the Rune Edge.&nbsp; When working with Rawr with the new weapon, however, it tends to favor the Jawbone in the mainhand, with the Rune Edge in the offhand.&nbsp; While the Jawbone is a fantastic main-hand weapon due to its slow speed, the Rune Edge should most likely perform better in the main hand, due to its higher average weapon damage.<br><br>As a check on my gut instinct, Landsoul's Warrior DPS Spreadsheet agrees, and puts RE/tJ about 30 DPS above tJ/RE, given my current gearing.<br><br>I'm going to guess that this may be the result of something to do with weapon speeds, though I could absolutely be wrong on this point.<br><br>I will attach my current character XML in the Issues Tracker for reference's sake.</p>\r\n<p>[Edit] Sample Character XML available, see: http://rawr.codeplex.com/WorkItem/View.aspx?WorkItemId=13201</p>",
    "PostedDate": "2009-05-10T15:10:26.773-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "188663",
    "ThreadId": "41597",
    "Html": "<p>I've started pouring through the warrior stuff, and have a few ideas as to why this is happening.&nbsp; Honestly, there are quite a few bugs that could be skewing the results right now (especially if you're using the latest beta).&nbsp; As I have more time to look at it, I'll update this thread with specific changes.</p>\r\n<p>I have some ideas that I'm going over with Jothay about how to get some of these other features that people have requested in (fixed length fights, executing &lt;20%, multi-mob targetting, etc).</p>",
    "PostedDate": "2009-05-10T15:17:45.393-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "188767",
    "ThreadId": "41597",
    "Html": "<p>Hey guys, nice to see DPS Warr getting some love these days.</p>\r\n<p>There's honestly not much to do on the Prot Warr side of things atm other than fixing the new procs model, and I've been playing a lot of Arms in raids recently on single/two-tank fights (our DK/Prot Paladin don't have good DPS gear) so feel free to give me a buzz if you need any manpower help for Arms logic. :)</p>",
    "PostedDate": "2009-05-11T02:56:20.587-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "189431",
    "ThreadId": "41597",
    "Html": "<p>Hey, Jothay, checking out some of the recent Source Code changes, and my gut instinct on the Agi issue is that it is somehow calling the wrong class benefits for Agi.&nbsp; That i, many classes get AP, as well as crit and armor from it, which would likely put Agi significantly above Str for Warriors if we used Agi in the same manner.&nbsp; It could also be getting the same benefits from Agi multiple times.&nbsp; Just throwing ideas around.&nbsp; ;)</p>",
    "PostedDate": "2009-05-12T11:27:50.46-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "190493",
    "ThreadId": "41597",
    "Html": "<p>Just to clarify BrWarner's somewhat cryptic comment ... in release 2.2.3 (broken gems anyway) and 2.2.4 the calcs for Agility are way off. So much so that it will have you stack Agility over every other stat.</p>\r\n<p>Do not use either 2.2.3 or 2.2.4 unless you want wrong answers.</p>",
    "PostedDate": "2009-05-14T16:55:08.253-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "190498",
    "ThreadId": "41597",
    "Html": "<p>The note regarding agility being calculated incorrectly is in my release notes, we are working on the issue.</p>",
    "PostedDate": "2009-05-14T17:45:10.587-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "191225",
    "ThreadId": "41597",
    "Html": "<p>As a note to all you wonderful users:</p>\r\n<p>Per the push notes, Astrylian and I worked out the kinks on the agility issue and how the procs on items work (Grim Toll, Mirror of Truth, Berserking, Executioner, etc)</p>\r\n<p>Astrylian has noted that if you see items like Mirror Truth having 14x.xx AP instead of saying the actual information from the Proc, run a &quot;Refresh from WowHead&quot; on the item and it will correct the information and allow the model to use the item correctly. This is a far more accurate system for the procs on all items than simply averaging out a number and throwing it on there.</p>\r\n<p>Also, we are getting a lot closer to having real calculations again thanks to the work from myself, Astrylian, Ebs2002, Holymist, Landsoul's spreadsheet (found on elitistjerks.com) and the feedback given in these forums.</p>\r\n<p>Please continue to provide the direct feedback you have been on the most current versions available and we'll get closer and closer every day.</p>\r\n<p>&nbsp;</p>\r\n<p>~Jothay<br>Warrior, Silver Hand<br>Developing Assistant, Rawr (DPSWarr)</p>",
    "PostedDate": "2009-05-17T11:43:26.203-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "191829",
    "ThreadId": "41597",
    "Html": "<p>great! now u can upload the new version. :) all this waiting is agonizing. :E</p>",
    "PostedDate": "2009-05-19T03:53:52.553-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "191855",
    "ThreadId": "41597",
    "Html": "<p>If you're really impatient, you can download the latest source code and compile/run it yourself, just to see where we're at. &nbsp;It's been uploaded, but I'm not sure when Astry's going to integrate it into a build (probably not until we're confident with the numbers it's spitting out, and have taken care of all the crashes).</p>\r\n<p>From the fury perspective, the numbers look pretty solid to me. &nbsp;I'm not sure how arms stacks up to in-game numbers (Jothay plays arms, I play fury). &nbsp;I know for a fact we have a few bugs that cause crashes (namely in trying to run the arms rotation with a fury spec), so that will probably be fixed today. &nbsp;I also know that some numbers are off a little bit right now: Berserking is proccing off of MH and OH hits regardless of which hand it's on; Bleeds aren't being penalized at all (they should ignore armor, but still take other reductions like Titan's Grip into account), and one other that I'm forgetting right now. &nbsp;Those aren't ship-blockers though.</p>\r\n<p>If anybody has the capability to download our source and play around with it, any feedback you can provide (besides the two I mentioned above) would be great :)</p>",
    "PostedDate": "2009-05-19T04:40:32.477-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "191943",
    "ThreadId": "41597",
    "Html": "<p>Thanks for all the work guys!</p>",
    "PostedDate": "2009-05-19T08:28:14.36-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]