[
  {
    "Id": "138144",
    "ThreadId": "41617",
    "Html": "<strong><span style=\"text-decoration:underline\">6 Items:</span></strong><br>\r\n<br>\r\nWhen I mouseover &quot;Chance to Hit&quot; it does not take into account my existing expertise.<br>\r\n<br>\r\nMark of Blood should be used as a buff/debuff. 4% HP back per boss hit would affect mitigation/survivability significantly, putting a lot more emphasis on stamina, blood pact, etc.<br>\r\n<br>\r\nDoes LotP take the 4% HP per crit every 6 seconds into account?<br>\r\n<br>\r\nBlacksmithing offers sockets on Bracers, Gloves, &amp; Waist. Will this be added as I noticed things were skewed when I socketed &amp; imported my toon.<br>\r\n<br>\r\nNo option for Glyphs  :D<br>\r\n<br>\r\n-----------------------<br>\r\n<br>\r\nBTW: Fantastic add on and I thnk you oh so very much. \r\n",
    "PostedDate": "2008-12-05T13:52:03.09-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "139334",
    "ThreadId": "41617",
    "Html": "Hey, thanks. <br>\r\n<br>\r\nWhere is this &quot;Chance to Hit&quot; that you see a wrong tooltip on? On the stats tab, there's Missed Attacks at the bottom, but that does count Expertise.<br>\r\n<br>\r\nMark of Blood and LotP are not valued in any way yet. If you would like to propose some math to show their value, I'd love to see it.<br>\r\n<br>\r\nSupport for Blacksmithing sockets is coming in Rawr 2.2, along with Glyphs.<br>\r\n",
    "PostedDate": "2008-12-10T08:57:34.927-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "139829",
    "ThreadId": "41617",
    "Html": "<p>1)<br>\r\nWhen I changed out a ring that had expertise for one that did not, my chance to dodge &amp; parry didn't change, only the 'hit' changed. That's what I meant.<br>\r\n<br>\r\n2)<br>\r\nWinters Chill &quot;buff&quot; seems to affect healing stats on RAWR, when it's a damage debuff on the boss not an uber Moonkin Aura. Noticed this when I was altering buffs on a holy priest in my guild.</p>\r\n<p>3)<br>\r\nWhen I added the 5% to block value to the Eternal Earthsiege Diamond (I edited the item because it did not have that option), it did not include additional threat due to the increased block value while using a staple tanking threat ability (ShoR). An additional 5% block value is fairly significant.</p>\r\n<p>4)<br>\r\nThe Libram of Obstruction offers +352 Shield Block Value for 5 seconds after a Judgement. With Talent Modifiers, this is 457.6 blocked for 5 seconds out of every 9 seconds (given the best rotation). Since Block Value is used for Threat as mentioned above, we have a 90% modifier on holy damage (ShoR) &amp; typically 2% from enchant, this should be 886.8 threat every 6 seconds, or ~147.8 TPS if done right.<br>\r\n<br>\r\nI don't have a specific example, but there were boots with a lot of block value on them and it didn't seem it was being considered for a 'butt-ton' of threat. I'm sure it was being considered for mitigation, but most likely not threat.<br>\r\n<br>\r\n5)<br>\r\nUnder &quot;Buffs&quot;, Under Attack Power %, you left out Abominations Might. Extremely MINOR tho, since I just put in one of them since they are the same anyway.<br>\r\n<br>\r\n6)<br>\r\nI'm DEFINITELY not the math genius, lol, but I can provide perhaps a basic understand on how I figure LotP &amp; MoB. I think these are exclusive and I think MoB doesn't have an internal cooldown. MoB seems to be the eaisest. Whatever the default attack speed of the mob is, the tank (or target) gets healed for 4% HP. This way tanks would get rewarded for stacking stamina &amp; therefore another form of mitigation. if a tank has 35k HP and is attacked every 1.5 seconds, he is healed for 1,400 every 1.5 seconds, or 933 HPS.<br>\r\n<br>\r\nWith LotP, it's a bit more difficult. This would have to be measured by how many attacks on average per second that have the ability to crit, add in how much that persons crit is, factor in the cooldown of cannot happen more often than every 6 seconds. Perhaps with a lot of +crit affecting buffs &amp; fair amount of haste, a certain tank could have +20% crit &amp; attack every 0.8 seconds on average with abilities that have the ability to crit (probably a druid tank). Perhaps that evens out to proc'ing every 7.6 seconds for a druid's 35k HP, which is 1,400 HP every 7.6 seconds, or 184 HPS.<br>\r\n<br>\r\nOf course MoB &amp; Imp LotP are pointless if the tank is topped off constantly. Tank Paladin's would benefit the least because only their standard melee attack would benefit from this, which would only hit every 1.4 to 1.6 seconds depending on haste.<br>\r\n<br>\r\n------------------------<br>\r\n<br>\r\nI've been using this tool extensively since someone pointed it out about a week ago. This tool is utterly fantastic and I <strong><em><span style=\"text-decoration:underline\">extremely</span></em></strong> thank you for putting it together.</p>\r\n",
    "PostedDate": "2008-12-11T13:20:03.2-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "139839",
    "ThreadId": "41617",
    "Html": "1) Which model are you talking about? Guessing Protadin by your other questions, but want to be sure. Anyway, Expertise doesn't affect your dodge and parry, they reduce the targets chance to dodge/parry. I believe hit is grouped together with exp, since they do almost the same thing. I think if you mouse over it, it'll break it down specifically. Not positive, will look into this.<br>\r\n<br>\r\n2) Yeah, the caster buffs/debuffs showing up for each other is an annoying side effect of how Rawr handles buff stats; a model says they want to see all buffs/debuffs that provide spell crit. It doesn't take into account that you can't really apply Winter's Chill to your healing target, or Amplify Magic to your damage target. Yet, anyway. We're working on that, but for now it's  just up to your common sense.<br>\r\n<br>\r\n3/4) Ermad, any info on Protadin threat calculations?<br>\r\n<br>\r\n5) Will get that added. As you said, doesn't really matter, since it's identical to the other buffs of its category.<br>\r\n<br>\r\n6) MoB: We'd have to handle boss attack speed, which we don't right now (at least for Bear, Protadin might?). Will add it to my todo list. Even still, incoming healing isn't exactly the same as survival/mitiatigation, but one could be used since it's similar. LotP would be harder indeed, because the crit rate, attack speed, and cooldown make the calculations more complex. So yeah, will try to get these in at some point, but won't be soon.<br>\r\n<br>\r\nThanks. :)<br>\r\n",
    "PostedDate": "2008-12-11T13:48:20.607-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "139852",
    "ThreadId": "41617",
    "Html": "1)  I'm not as dumb as I look (which is pretty dumb, so I guess that's not saying much), so I was aware that expertise affects hitting the boss from paladin melee swing and doesn't affect spell damage hits at all.  I'm a simple guy, just noticed it didn't change when I switched out a ring that didn't have expertise from one that did. No need to comment on this one  :D<br>\r\n<br>\r\n2)  Thankfully I have BARELY enough of this... work in progress... the common sense part<br>\r\n<br>\r\n3&amp;4) I know that in some cases the 6/9/6/9 rotation doesn't work on having the libram up for every 5 seconds of every 9 second judgement cooldown, but I'd personally just calculate it as if it were up 5 seconds on every judgement cooldown. It's too much mitigation to pass up, so I'd screw up my rotation if necessary.<br>\r\n<br>\r\n6) I acknowledge it's a huge PITA, but so is RAWR, isn't it?  It's mind boggling the work you've already put into it, sheesh. As our raid leader, I've organized our raid to give tons of passive healing. Blood Aura, Mark of Blood, Imp LotP, Vampiric Embrace, Divine Storm, &amp; of course Tree aura for a bonus 6% healing.<br>\r\n<br>\r\nAn easy one to implement would be blood aura since it heals you for 2% of whatever your actual damage output is. This would reward those who gear for tank DPS &amp; raid buffs accordingly. They are buffing this to 4% in the next content patch which makes it a bit more pimp-tastic.<br>\r\n<br>\r\n",
    "PostedDate": "2008-12-11T14:18:15.097-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "140721",
    "ThreadId": "41617",
    "Html": "Regarding new fantastic RAWR  :D<br>\r\n<br>\r\nThe eternal earthsiege diamond does not show threat for 5% shield block<br>\r\n<br>\r\nMy block value shows at 1,277, however I remember distinctly over 1800 block values floating down on my screen during boss fights in Naxx. My libram only grants 254 with 30% talent + 5% SBV from Meta.<br>\r\n<br>\r\nSpell Damage Taken &amp; Spell Critical Strike Taken does not affect threat. LotP does affect threat however.\r\n",
    "PostedDate": "2008-12-15T13:30:31.85-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]