[
  {
    "Id": "138181",
    "ThreadId": "41628",
    "Html": "In the buffs section I see the option to check WF or Imp Icy Talon for some classes, but not others (even if they are listed as complete and working).&nbsp; Not sure if this was an oversight, or already brought up (I tried doing a few quick searches and didn't see any discussion pertaining to this).&nbsp; Off the top of my head I think it was hunter and DK that they were missing from, but present for rogue and cat druid.<br>\r\n<br>\r\nAlso, I can't seem to get Frost DK dps to appear as anything respectable (less than 1/2 of unholy or blood, all best in slots, fully raid buffed).&nbsp; Do calculations get messed up if I import as an Unholy spec, and then manually remove all the talents and respec to frost dps through the tool?&nbsp; It doesn't appear to cause problems for other classes (hunter, rogue).<br>\r\n<br>\r\nAnd awesome tool!<br>\r\n",
    "PostedDate": "2008-12-05T17:52:18.983-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "139337",
    "ThreadId": "41628",
    "Html": "WindfuryTotem/IcyTalons don't affect ranged attack speed, so don't show up for Hunters. As for DK, there are alot of fixes coming for DPSDK in Rawr 2.2, including things like this.<br>\r\n",
    "PostedDate": "2008-12-10T09:04:12.89-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "165430",
    "ThreadId": "41628",
    "Html": "Windfury/ITalons does in fact show up for hunter buffage. Might want to set it to the proper boosting of PetDPS and not HunterDPS.<br>\r\n",
    "PostedDate": "2009-03-06T09:56:27.517-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "165842",
    "ThreadId": "41628",
    "Html": "I don't see WF totem on Enh Shammy buff list... is it taken automatically into consideration?<br>\r\n",
    "PostedDate": "2009-03-08T12:56:48.377-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "167471",
    "ThreadId": "41628",
    "Html": "The various haste/hit/crit buff options are in the current commit of the Enhancement Shammy module. What version are you using?<br>\r\n",
    "PostedDate": "2009-03-12T11:19:01.393-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]