[
  {
    "Id": "138561",
    "ThreadId": "41749",
    "Html": "I've been trying Rawr Moonkin and at the moment i'm using 3 * T7 from 10 man naxxramaras (Heroes set) and 1 * t7 from 25 man naxxramas (Valarous Set).&nbsp; At the moment when i check at possible gear upgrades for my head piece it rates the Heroes Dreamwalker Cover higher then the Valarous Dreamwalker cover with the same gems / enchants. <br>\r\nI assume this is because it'd be the 4th piece of Heroes T7 for me and the 4 set bonus and that Rawr doesn't realise that the Valarous Dreamwalker headpiece in combination with the Heroes T7 also gives the same 4 piece bonus. Is there any way to fix this in a future release?<br>\r\n",
    "PostedDate": "2008-12-08T04:39:02.707-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "138584",
    "ThreadId": "41749",
    "Html": "Make sure that the Valorous pieces have the same set bonus name as your Heroes pieces.&nbsp; This is a parsing issue and not specific to Moonkin, and it's been annoying us since release, so rest assured we're trying.<br>\r\n",
    "PostedDate": "2008-12-08T05:53:59.23-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "138587",
    "ThreadId": "41749",
    "Html": "2 Set Bonus is: <strong>Insect Swarm Damage</strong><span>Your Insect Swarm deals an additional 10% damage.</span><br>\r\n4 Set Bonus is: <strong>Wrath/Starfire Crit</strong><span>Your Wrath and Starfire spells gain an additional 5% critical strike chance.</span><br>\r\nThe naming for the ability and the description is the same for both sets. Hope you manage to find a solution for it :)<br>\r\n",
    "PostedDate": "2008-12-08T06:16:01.037-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "139365",
    "ThreadId": "41749",
    "Html": "He means the set name on each of the items in Rawr. Right click on an item and hit Edit, and make sure the Set Name matches on all of the pieces. Should be like Dreamwalker Regalia or Dreamwalker Garb (don't recall which of those is moonkin and which is tree).<br>\r\n",
    "PostedDate": "2008-12-10T09:45:40.083-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "139376",
    "ThreadId": "41749",
    "Html": "Dreamwalker Garb is the Moonkin set bonus name.&nbsp; Given the description of the problem, I can just about guarantee that the Valorous Dreamwalker Cover doesn't have the set bonus set to Dreamwalker Garb, whereas the Heroes' Dreamwalker Cover does.<br>\r\n",
    "PostedDate": "2008-12-10T10:10:12.02-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]