[
  {
    "Id": "139165",
    "ThreadId": "41929",
    "Html": "I have heard good things about the Horn of Argent Fury ( http://www.wowhead.com/?item=39889 ) for dps, but since it is a green trinket it doesn't seem to show up by default. When I add it, it's modeled without the proc bonus--understandable, since there's no easy way to parse that.<br>\r\n<br>\r\nI peeked at how Rawr models the damage from Romulo's Poison Vial, a similar chance-on-hit direct damage, and it's treated as a flat weapon damage increase, I would assume averaged over the expected number of procs per minute. The discussion on Wowhead left me still a bit puzzled as to how the damage divides out, and what value it would be best to give it in Rawr?<br>\r\n<br>\r\nAny suggestions, or even a definitive formula for going from average damage per minute against a target dummy to a value for the model, would be good--I can run tests myself if need be, and would be happy to do so to help out the Rawr community. (Only I need four more bars till my experiments will be valid for level 80. &gt;:3<br>\r\n",
    "PostedDate": "2008-12-09T17:22:30.85-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "139352",
    "ThreadId": "41929",
    "Html": "Those comments on Wowhead are only raving about it because it's good for questing, where you reset its internal cooldown while running between mobs. In direct combat, it's not terribly great (it's about as good as you'd expect a lvl75 green trinket to be). We could model its proc, but it's just not worth our time; many blue lvl80 trinkets are better.<br>\r\n",
    "PostedDate": "2008-12-10T09:28:37.76-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "139420",
    "ThreadId": "41929",
    "Html": "Ah, thank you; if the internal cooldown is that bad, I will indeed go with a lvl80 blue once I get one. Thanks!<br>\r\n",
    "PostedDate": "2008-12-10T12:12:26.08-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]