[
  {
    "Id": "139245",
    "ThreadId": "41951",
    "Html": "Hello,<br>\r\n<br>\r\nyesterday I downloaded Rawr for the first time, since a freind told me, that it now works for prot-warriors. But the stats shown in the Rawr window differ a lot from the stats I have in WoW. I understand that dodge, parry and the like are different when you calcualte versus a level 83 boss (WoW always shows these stats versus level 80 opponents) but in WoW I have for example 4000 HP more than in Rawr.<br>\r\n<br>\r\nDid I mess up some configurations or is the ProtWarrior nor yet useable in Rawr?<br>\r\n<br>\r\nRegards<br>\r\nMoondancer \r\n",
    "PostedDate": "2008-12-10T04:04:25.757-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "139264",
    "ThreadId": "41951",
    "Html": "The Prot Warrior module is mostly updated for Wrath. I think the biggest thing missing right now is the level 80 character base stats. At some point it'll need an overhaul of the threat calculations as well.<br>\r\nI'll look into updating the base stats later today.<br>\r\n<br>\r\nHoly<br>\r\n",
    "PostedDate": "2008-12-10T05:53:33.88-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "139278",
    "ThreadId": "41951",
    "Html": "It would be great if you could do that. <br>\r\n<br>\r\nIt looks like Rawr is the tool I was looking for, for such a long time. Never again writing endless excel spreadsheets, no more search in thottbot, wowwiki and armory for gear improvements.<br>\r\n<br>\r\nThanks in advance<br>\r\nMoon<br>\r\n",
    "PostedDate": "2008-12-10T06:39:42.947-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "139303",
    "ThreadId": "41951",
    "Html": "Done, I did a compare against an armory sheet and health was within a hundred or so. Dodge was the only avoidance stat that was off by more than I would expect. I'll need to look into that.<br>\r\n<br>\r\nHoly<br>\r\n",
    "PostedDate": "2008-12-10T07:56:42.76-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "139327",
    "ThreadId": "41951",
    "Html": "Thank you very much :)<br>\r\n<br>\r\nSince I am new here, please forgive me the question, how can I get the changes you made? Just downloading the executable again (unlikely?) or download the sources and build new with Visual Studio (possible) or do I have to wait for a new release?<br>\r\n<br>\r\nMoon<br>\r\n",
    "PostedDate": "2008-12-10T08:45:45.897-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "139359",
    "ThreadId": "41951",
    "Html": "Yeah, you can get the latest source code on the Source Code tab, and build that with Visual Studio 2008 or Visual C# Express 2008 (free from MS). Or, just wait for the next release.<br>\r\n",
    "PostedDate": "2008-12-10T09:37:22.477-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "139368",
    "ThreadId": "41951",
    "Html": "The dodge deal was a missing base stat as well. Got that in there now. All the stats are coming out close to the character sheet now.<br>\r\n<br>\r\nHoly<br>\r\n",
    "PostedDate": "2008-12-10T09:52:31.827-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "139618",
    "ThreadId": "41951",
    "Html": "Thanks again. Have downloaded the latest sources and compiled it. Works much better now. I have still some issues but I am currently debugging to find out the reason for them.<br>\r\n<br>\r\nSeems that one metagem I use isn't implemented yet and I think that the talent &quot;Armed to the Teeth&quot; isn't working as well.<br>\r\n<br>\r\nA really wonderful piece of software you all here have created<br>\r\n<br>\r\nMoon<br>\r\n",
    "PostedDate": "2008-12-11T02:02:51.003-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "139668",
    "ThreadId": "41951",
    "Html": "Which metagem are you looking at?<br>\r\nArmored to the Teeth is a pure threat talent. As I said before ProtWarr needs a full threat overhaul. In it's current form it uses a static number of ability uses in a rotation and doesn't even include one of our highest threat abilities, Shockwave. The static rotation is not very accurate because of Sword and Board, which will completely change the number of Shield Slam uses in fights. Concussion is also a very high threat ability that could go in a rotation if you have the talent.<br>\r\nBasically, right now you should only use the threat part as a very rough guide. Focus on the Survival and Mitigation aspects. In wrath right now threat usually isn't a big concern for tanks anyways.<br>\r\n<br>\r\nHoly\r\n",
    "PostedDate": "2008-12-11T05:41:23.723-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "139945",
    "ThreadId": "41951",
    "Html": "You are of course right, threat isn't a problem in WotLK. I just thought that adding the 3 AP for every 180 Armor wouldn't be a problem. Of course I understand that the whole threat thing is very hard to calculate since the tanking rotation depends on so many things like dodge/parry to enable revenge and the free heroic strike after a revenge when you have the glyph that enables that. Also sword and board is hard to implement.<br>\r\n<br>\r\nThe metagem I use is <span>Austere Earthsiege Diamond </span>(+32 Stamina and 2% Increased Armor Value from Items) and the 2% would add some mitigation :)<br>\r\n<br>\r\nThanks for all your help<br>\r\n<br>\r\nMoon<br>\r\n",
    "PostedDate": "2008-12-11T23:03:38.453-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "140081",
    "ThreadId": "41951",
    "Html": "Rawr isn't getting the 2% armor when loading from the armory.&nbsp; Check the metagem to see if it lists the 2% bonus armor along with the +32 stam.&nbsp; If not, reload the metagem from wowhead (or manually edit to add it), then resocket the helm in question with the fresh copy of the gem and it should work.<br>\r\n<br>\r\nEDIT: you're going to have to either resocket every helm you care about or do a mass replace via Tools-&gt;Set Default Gems for Equipment.<br>\r\n",
    "PostedDate": "2008-12-12T09:09:50.97-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "140185",
    "ThreadId": "41951",
    "Html": "Rangifer is right, but on top of that there was also something wrong in the protwarr module that it wasn't getting the multiplier. I cleaned up the code and made it more like the bear module and now the multiplier is being applied.<br>\r\n<br>\r\nHoly<br>\r\n",
    "PostedDate": "2008-12-12T14:43:27.293-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]