[
  {
    "Id": "139811",
    "ThreadId": "42081",
    "Html": "Sorry if this has been asked a hundred times, I looked, but I did not see anything about this question..<br>\r\n<br>\r\nIs there a version of Rawr that works with Macs?&nbsp; Because I really want to use Rawr (a friend of mine uses it and raves about it!) but I am a Mac user, so I need a non-windows version?&nbsp; Help?<br>\r\n",
    "PostedDate": "2008-12-11T12:56:40.87-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "139850",
    "ThreadId": "42081",
    "Html": "<div>Rawr will work on 10.4, 10.5 OS X with Mono installed</div><div><br></div><div>http://www.go-mono.com/mono-downloads/download.html<br></div><div><br></div><div>/usr/bin/mono Rawr.exe</div><div><br></div><div>./Ben</div>",
    "PostedDate": "2008-12-11T14:12:29.987-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "139867",
    "ThreadId": "42081",
    "Html": "Thank you for your help.&nbsp; Apparently the newest version of Mono will not allow me to run Rawr with it, but I can use it with Bootcamp. <br>\r\n<br>\r\n:)&nbsp; Thanks again!<br>\r\n",
    "PostedDate": "2008-12-11T15:06:52.723-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "139877",
    "ThreadId": "42081",
    "Html": "This has probably been explained before, but once i download Mono (2.0.1 as of now) and open terminal, how do i 'navigate to where you unzipped rawr'. I have 10.5 so the Rawr folder pops up in my download folder(i suppose my computer must have unzipped it automaticlly?): how am i supposed to get there? :)<div><br></div><div>PS. When i tried a file&gt;find for mono, nothing related to it comes up except the original unzipped file. (Even after i've installed it). </div>",
    "PostedDate": "2008-12-11T15:44:52.457-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "140263",
    "ThreadId": "42081",
    "Html": "The answer is for you to do a bit of RTFM. Here is a very short version.<div><br></div><div>The Mono package you downloaded contains an installer. Once you have run that installer, mono is there, but it's not an application. To check it has been correctly installed, open a terminal window and type the &quot;mono --version&quot; command. The output should display the version number of the installed mono (and some other info).</div><div><br></div><div>At that point, you download and uncompress Rawr. This gives you a directory within which the file Rawr.exe is the one to be launched with Mono. To do so, open a terminal window and type the command &quot;mono Rawr.exe&quot;. (you will want to change to current directory beforehand).</div><div><br></div><div>I agree some kind of GUI for all that would be nice. I'm sure this will come in time.</div><div><br></div>",
    "PostedDate": "2008-12-13T09:13:06.603-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "140287",
    "ThreadId": "42081",
    "Html": "jdmuys, he was just asking how to move between folders in Terminal. :)<br>\r\n<br>\r\n'cd ..' goes up a folder. 'cd FolderName' goes into a folder named FolderName.<br>\r\n",
    "PostedDate": "2008-12-13T12:23:28.973-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "140327",
    "ThreadId": "42081",
    "Html": "Ok, i finally got that workin =P. However now i am faced with a different problem: I have navigated to the Rawr folder, and mono is installed (definately), but when i type 'mono Rawr.exe', Terminal goes to a new line (with nothing on it), fades out (as if opening another program), the header of Terminal goes from 'Terminal -- bash -- 80x24' to <div>'Terminal -- mono -- 80x24'.  nothing else happens and it sends me to a new line with the directory of the folder im in.</div><div>Im running a 3 year old iMac  with 10.4.11, perhaps it just doesnt work on my system?</div>",
    "PostedDate": "2008-12-13T18:13:32.257-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]