[
  {
    "Id": "139902",
    "ThreadId": "42097",
    "Html": "Hi!<br>\r\nFirst of all thanks for making this great app. for WoW although I have a few questions:<br>\r\nI was wondering if I could somehow delete the (currently not obtainable) epic gems from the software as I could get a more accurate results for my dps and proper gear without them?<br>\r\nI'd also like to know if I have 3/4 T7 (ret pala) and want to get the 4th part does the software count in the 4-set bonus to my dps or only the 4th part's stats?<br>\r\nI'm unsure about the hit rating as well, I used to have 300+ but now with an item change I have 220 and Rawr says that 80 hit rating is hardly making any difference in my dps... can this be true?\r\n",
    "PostedDate": "2008-12-11T17:14:06.68-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "139957",
    "ThreadId": "42097",
    "Html": "You can do a mass replacement of all gems in items with different gems that you prefer (ie, superior instead of epic quality ones). See Tools &gt; Set Default Gems.<br>\r\nYes, set bonuses are considered when comparing items.<br>\r\nNot sure of the calculations involved here, but last I saw, hit wasn't the most valuable stat for Retadins (str was), so it's not impossible for an item swap to lose 80 hit and still be a net gain in DPS. Err, actually, isn't that way over the hit cap? Isn't the hit cap for Retadins like 165 or something like that?<br>\r\n",
    "PostedDate": "2008-12-12T00:21:09.647-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "140011",
    "ThreadId": "42097",
    "Html": "No, it's 296 atm as Blizzard removed the precision talent which gave us +3%.<br>\r\n",
    "PostedDate": "2008-12-12T04:56:45.933-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "140023",
    "ThreadId": "42097",
    "Html": "Keep in mind there is a bug right now that effects some rets that gives them a free 4% chance to hit. Which would make both of you correct. Not all pallies have the bugged hit so keeping it at 296 as a base with a way to modify it for the free 4% hit would be better. <br>\r\n<br>\r\nkeep in mind while hit is a lesser valued stat if you miss a judgement due to lack of hit there are far bigger concerns than lack dps over a longer fight due to the fact you recieved no mana back through JotW. Keep that in mind when evaluating hit.\r\n",
    "PostedDate": "2008-12-12T05:29:50.987-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]