[
  {
    "Id": "140336",
    "ThreadId": "42252",
    "Html": "Following this thread <a id=\"ctl00_ctl00_MasterContent_Content_ThreadList_ctl08_ThreadLink\" href=\"View.aspx?ThreadId=38302\">help with Vista loading from armory</a> I have a more general question, which might be of interest to others too:<br>\r\nIs there a way to force rawr to download a complete item cache from either armory or wowhead? Just say ... all cloth items ... or all maces ... or just everything my character could use? That would probably take a while - a long while - but could run overnight. Afterwards I could use rawr offline. Or not?<br>\r\n<br>\r\n",
    "PostedDate": "2008-12-13T21:32:04.14-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "140347",
    "ThreadId": "42252",
    "Html": "Tools -&gt; Update Item Cache if you use the default big cache.<br>\r\nTools -&gt; Load Possible Upgrades From Armory also works pretty well (will load all items the armory thinks fits your current spec).<br>\r\n",
    "PostedDate": "2008-12-13T23:29:08.02-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "141198",
    "ThreadId": "42252",
    "Html": "Load Possible Upgrades From Armory gives me pretty weird results if I\r\nuse it from inside the armory and used from rar it seemed to be just\r\nthe same. If all items are in the cache already I wouldn't have to do\r\nthat anyway would I?<br>\r\n<br>\r\n<br>\r\n<br>\r\nDoes ItemCache.xml have all the data parsed from armory/wowhead from the start or do I have to open each model/each talent spec first and use Update Item Cache? If I use Update Item Cache from within one model, will it retrieve the data relevant for that model only or for all? I would like to get as many items (all types, all specs, all level, all whatever) as possible with one update run. Which would be the best way to achieve that aim? Open a &quot;naked&quot; rawr and click Tools -&gt; Update Item Cache? Would that suffice?<br>\r\n<br>\r\n<br>\r\n",
    "PostedDate": "2008-12-16T19:55:21.317-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "141202",
    "ThreadId": "42252",
    "Html": "You should not need to do update item cache for each model. It will only update data for items that are already in the item cache, it will not give you any new items.\r\n",
    "PostedDate": "2008-12-16T20:25:15.883-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "141491",
    "ThreadId": "42252",
    "Html": "How do I get new items then?<br>\r\n",
    "PostedDate": "2008-12-17T18:02:31.437-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "141532",
    "ThreadId": "42252",
    "Html": "Tools-&gt;Edit Items, click on Add.\r\n",
    "PostedDate": "2008-12-18T01:18:27.487-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "142518",
    "ThreadId": "42252",
    "Html": "&quot;Tools-&gt;Edit Items, click on Add.&quot;<br>\r\nHm - I can enter an ID there but that doesn't really help (I don't know the item IDs off all new items) ... entering www.wowhead.com there doesn't work either.<br>\r\n<br>\r\nTo clarify: I don't want to add a specific item, I want to download ALL new items which are not in the itemcache. I want to have a complete itemcache locally and update it regularly. Is that possible somehow?<br>\r\n<br>\r\nedit: As I'm thinking about it: there must be a way - because you guys must have created the first itemcache.xml somehow. I have heard about parsing the armory with pearl-scripts and such things but I have absolutely no idea about stuff like that. It would be nice to achieve this with the help of rawr. \r\n",
    "PostedDate": "2008-12-22T22:38:03.333-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "142536",
    "ThreadId": "42252",
    "Html": "What you're trying to do, you don't need to do. Really. They're all there, as far as we know. If Wowhead finds a few more, you can add those individually. You can also add all items that the Armory thinks will be upgrades. When there are new patches, Rawr also gets updated, and the default itemcache includes the new items of that patch.<br>\r\n<br>\r\nSo really, relax, there's no need to do what you're trying to do. :)<br>\r\n",
    "PostedDate": "2008-12-23T02:36:27.257-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]