[
  {
    "Id": "140397",
    "ThreadId": "42275",
    "Html": "Unfortunately, my bear is still in need of a ring upgrade and is still wearing the Ring of the Stalwart Protector.  This ring was working fine in 2.1.3, but it seems to have disappeared in 2.1.4.  So normally, this is not a big deal, I go to Edit and Add item 34888 and it appears in the Item Cache.  However, it will not show up in the list for the Finger slots.  I was able to reproduce this with an empty New character sheet as well.  Less concerned about this particular ring than this being possibly symptomatic of some other issue.\r\n",
    "PostedDate": "2008-12-14T09:13:37.34-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "140408",
    "ThreadId": "42275",
    "Html": "Classic and BC items are still there, just part of filters that are off by default. Click the filter dropdown in the top right and turn on BC gear.",
    "PostedDate": "2008-12-14T09:58:42.007-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "140450",
    "ThreadId": "42275",
    "Html": "Although with BC Items on, my T6 is gone and i don't find it anymore on the List (rawr.cat).<br>\r\n<br>\r\nMake i something wrong!?<br>\r\n",
    "PostedDate": "2008-12-14T17:04:26.14-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "140454",
    "ThreadId": "42275",
    "Html": "Hmm. Might it be filtered under Unknown or Other? If you've got all filters turned on, everything in the itemcache will be shown.<br>\r\n",
    "PostedDate": "2008-12-14T17:56:02.487-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "140601",
    "ThreadId": "42275",
    "Html": "Turning on the BC and Classic Filters did solve the problem.  I did see that you added filtering in the release notes, but it never occurred to me that you would be turning off certain sets by default.  Nice addition to the feature set though once you know it's there ;-)\r\n",
    "PostedDate": "2008-12-15T07:26:05.283-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]