[
  {
    "Id": "140611",
    "ThreadId": "42337",
    "Html": "So, I downloaded the 2.1.4 and I'm having the same problem as I had in 2.1.3.&nbsp; The problem is I don't want certain items shown, should be no problem that's what the filters are for.&nbsp; But if I turn off the PvP filter, PvP items are still being shown.&nbsp; When I mouse over one of the items the item note says not found on amory, if I right click on the item and update from Wowhead it will drop off.<br>\r\n<br>\r\nI've tried to download upgrades from armory, reload WotLK items from Wowhead and updating the item cache.&nbsp; I've tried those steps in different orders, but I still get issues with the item notes missing.&nbsp; Any thoughts, I'm running Vista and I don't see the .Net framework in my programs so I'm not sure which version I'm running.&nbsp; <br>\r\n<br>\r\n<br>\r\n",
    "PostedDate": "2008-12-15T08:02:47.093-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "140639",
    "ThreadId": "42337",
    "Html": "You'll need to tell us specifically which item fails and from which source.<br>\r\n<br>\r\n",
    "PostedDate": "2008-12-15T09:14:48.293-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "140654",
    "ThreadId": "42337",
    "Html": "Many items, such as most of the new arena gear which isn't out yet, doesn't have complete data on either wowhead or armory. That sounds like what your problem is.<br>\r\n",
    "PostedDate": "2008-12-15T09:44:02.29-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "140677",
    "ThreadId": "42337",
    "Html": "&nbsp;Valorous Redemption Gloves are an example, I'm assuming that it is because they are part of the new Arena gear, but they are listed on wowhead.&nbsp; Rawr just says &quot;Drops from in&quot;&nbsp; In them item description.&nbsp; <br>\r\n<br>\r\nNow that I've updated everything, I get no results in Neck, Back, Trinket or Finger.&nbsp; I still get results in all of the other slots.&nbsp; I've tried both with and without filtering and with and without refining types of items listed.&nbsp; If I update from Armory they will reappear, but if I then update the info from Wowhead they disappear again.&nbsp; <br>\r\n<br>\r\nI love the program and thank you for all of your hardwork.&nbsp; \r\n",
    "PostedDate": "2008-12-15T10:57:44.913-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "140678",
    "ThreadId": "42337",
    "Html": "Ah hah, I'm guessing you're a deathknight. Rawr.DKDPS is very much a work in progress, and the relevancy checks in it are setup wrong at the moment; they show paladin gear instead of DK gear. You could make a filter to exclude all items with Redemption in their name, but that's about it.<br>\r\n<br>\r\nI'm confused about what you could have done to get no results from Neck/Back/Trinket/Finger though. Can you give some detail about that? With all filters turned on, what is it that makes things disappear?<br>\r\n",
    "PostedDate": "2008-12-15T11:09:20.797-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "140683",
    "ThreadId": "42337",
    "Html": "I'm actually a holy pally.&nbsp; <br>\r\n<br>\r\nI had turned off misc under refine item type since I only wanted to see shields.&nbsp; I turned it back on and the trinkets, neck, etc are back.<br>\r\n<br>\r\nThe Pennant Cloak didn't show any item info.&nbsp; I right clicked and clicked refresh from WoWhead.&nbsp; It now shows Drops from Sarathion in The Obsidion Sanctum.<br>\r\n<br>\r\nIs there a specific order that you need to use to update the info?&nbsp;&nbsp;&nbsp; <br>\r\n<br>\r\nIf I refresh the data from WoWhead my character pane loses some of the items, but they reload if I refresh my character from the Armory.&nbsp; <br>\r\n<br>\r\nWhat other info do you need?<br>\r\n",
    "PostedDate": "2008-12-15T11:35:15.02-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "140716",
    "ThreadId": "42337",
    "Html": "Err, I'm confused again. If you're a holy pally, then Valorous Redemption Gloves are your tier 7-25 gloves, not anything PvP related.<br>\r\n<br>\r\nI know there's a bug with reloading items that are equipped from wowhead, but that'll fix itself when you swap items or relaunch Rawr.<br>\r\n<br>\r\nI'm also confused about an 'order' to update the info. What are you trying to achieve? What info are you trying to update that you don't have?<br>\r\n",
    "PostedDate": "2008-12-15T13:05:39.84-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]