[
  {
    "Id": "140818",
    "ThreadId": "42385",
    "Html": "<div>RAWR is really a great tool for equipment comparison and dps simulation.<br></div><div>Really appreciate it!</div><div><br></div><div>I found there might be a bug in attack power calculation in Cat Model.</div><div>Comparing the value showed in game and that in RAWR and doing some calculation, I think the model now probably adds the attack power from weapon twice.</div><div>Maybe you can check it again.<br></div><div><br></div><div><br></div>",
    "PostedDate": "2008-12-15T20:22:07.87-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "140870",
    "ThreadId": "42385",
    "Html": "The attack power shown is with Savage Roar. Weapons also get 20% more attack power from Predatory Strikes.<br>\r\n",
    "PostedDate": "2008-12-16T00:54:27.917-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "141025",
    "ThreadId": "42385",
    "Html": "I believe some error (or difference from the character sheet anyway) is introduced by the fact that RAWR calculations apply the Predatory Strikes bonus not only to the attack power of the weapon, but also any attack power from strength on the weapon.&nbsp; The character sheet only applies this bonus to the raw attack power stats of the weapon.<br>\r\n<br>\r\nFor example, RAWR would currently assess attack power on the Staff of Trickery as follows:<br>\r\n<br>\r\nFAP = ((1845+90*1.06* 2)*1.2)+(89*1.06) = 2537.3<br>\r\n<br>\r\nWhereas the character sheet would see the same calculation like this:<br>\r\n<br>\r\nFAP = (1845*1.2)+(90*1.06*2)+(89*1.06) = 2499.14<br>\r\n<br>\r\nPerhaps after the 3.0.8 patch the modified staffs having strength converted to attack power will be stacked into the attack power that is multiplied by the Predatory Strikes bonus giving us a net gain in attack power instead of the loss we expect, although still a nerf overall when buffs are taken into consideration.&nbsp; For example,<br>\r\n<br>\r\nFAP = ((1845+180)*1.2)+(89*1.06) = 2524.34 <br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n",
    "PostedDate": "2008-12-16T09:27:24.427-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]