[
  {
    "Id": "140965",
    "ThreadId": "42423",
    "Html": "I'm currently using the HolyPriest model for 2.1.4, though I've seen this on the Moonkin model too. The only filters I have sellected are Burning Crusade, World Drop, Dungeons, Faction, Quest, Unknown, and Other. So no PvP, crafted, or anything above a normal dungeon, though I still get items from Heroic Raids, Raids, Heroic Dungeons, Crafted, and some PvP. The PvP items though are &quot;Not found on armory&quot; but even after turning off Unknown and Other, they're still in there. Also, I wanted to get rid of the Sunwell / Black Temple / Hyjal stuff, so I made a new filter, cutting those out of the Burning Crusade filter and pasting them into the new filter, but I'm still getting items from all 3. <br>\r\n<br>\r\nHere is a very small list of some of the items, basically one from each place that is supposed to be filtered out. <br>\r\n<br>\r\nHood of Rationality - (Heroic Raid Filter) Heroic <span>Eye of Eternity<br>\r\n</span><span>Cowl of Sheet Lightning - (Raid Filter) Naxxramas<br>\r\n</span><span></span><span>Crown of Unbridled Magic - (Heroic Dungeon Filter) Heroic Oculus<br>\r\n</span><span></span><span></span><span>Brutal Gladiator's Satin Hood - (PvP Filter) Sold by Griz Gutshank at Blackrock Depths <br>\r\n</span><span>Hat of Wintry Doom - (Crafter Filter) Created via Hat of Wintry Doom<br>\r\nPowerheal 9000 Lens - (Engineering Filter) BoP crafted Engineering(350)<br>\r\n</span><span>Deadly Gladiator's Mooncloth Hood - (Unknown Filter) Not found on armory<br>\r\n</span><span>Cowl of Light's Purity - (my new filter) Sunwell Plateau<br>\r\n<br>\r\nI've been using Rawr since before there were filters, so I don't really mind paging down to the bottom to see the stuff that's in my range of acquiring, but since there are filters... Well, it'd be nice, since I still can't use my scroll wheel on the items part of the main window - that'd be a nice fix too :)<br>\r\n</span>\r\n",
    "PostedDate": "2008-12-16T06:25:05.277-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "141030",
    "ThreadId": "42423",
    "Html": "I agree, and I've been having a lot of problems with this as well (I'm a Feral Druid). The two biggest sources of item filter issues seems to be the Tier 7 set, since they come from tokens which all have a similar name (thus making them difficult to filter by set) and the PvP gear which is apparently bugged in the Armory and unable to locate the source of these items.<br>\r\n",
    "PostedDate": "2008-12-16T09:41:41.143-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "141081",
    "ThreadId": "42423",
    "Html": "Rawr will probably never have 100% reliable filters like you want, just because there isn't 100% reliable data. It does the best it can with what it knows.<br>\r\n<br>\r\nOr are you saying that even though Rawr has the right source location data for an item, it's not being filtered properly?<br>\r\n",
    "PostedDate": "2008-12-16T12:48:24.713-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "141236",
    "ThreadId": "42423",
    "Html": "It has the right location, what I put after the ( ) is what Rawr's tooltip is showing, well, a shortened version of it at least. Like the Hood of Rationality, that should be filtered out by the Heroic Raid filter because, according to Rawr, it drops in &quot;Heroic Eye of Eternity&quot; which is one of the key words in the Heroic Raid filter. The <span>Brutal Gladiator's Satin Hood should be filtered out with the PvP filter 'cause &quot;</span><span>Griz Gutshank&quot; is a key word in there, but even though </span><span>Deadly Gladiator's Mooncloth Hood is a PvP item, it should be filtered out with the &quot;Unknown&quot; filter, 'cause &quot;Not found on armory&quot; is one of its key words. <br>\r\n<br>\r\nAfter a bit of messing around, I found it was the Burning Crusade filter. Turning off all filters gave me a blank item screen (how it should be, right?) Turning on just the Burning Crusade filter gives me the BC stuff and all that other stuff that I don't want. After going through each filter one by one, the Burning Crusade filter is the only one that has items other than what it's supposed to have. The filters that are supposed to filter out those items will have them show up when that filter is turned on (ie, &quot;Hat of Wintry Doom&quot; will show up when just the &quot;Crafted&quot; filter is turned on). <br>\r\n<br>\r\nSo I thought that maybe it might be one of the key words in the Burning Crusade filter. Of the 2 other filters I made (from the BC filter) though, one of them and the original BC filter still bring up all the other stuff. To clarify...<br>\r\n<br>\r\nMy &quot;Burning Crusade&quot; filter now contains: Old Hillsbrad Foothills|Blood Furnace|Slave Pens|Arcatraz|Underbog|Shattered Halls|Hellfire Ramparts|Magisters' Terrace|Auchenai Crypts|Shadow Labyrinth|Sethekk Halls|Steamvault|Mana-Tombs|Botanica|Mechanar|Black Morass|Spirit Shard|<br>\r\n<br>\r\nMy new &quot;BC End Game&quot; filter contains: Sunwell|Black Temple|Hyjal|Yrma|Theremis|Tydormu|Forgotten Vanquisher<br>\r\nThis filter will show what its supposed to when it's the only one selected<br>\r\n<br>\r\nMy new &quot;BC Pre-End Game&quot; filter contains: Serpentshrine Cavern|Tempest Keep|Gruul's Lair|Magtheridon's Lair|Veynna Dawnstar|Karazhan|Zul'Aman|G'eras|Anwehu|Badge of Justice|Asuur|<br>\r\n<br>\r\nObviously, just turning off the BC filters would give me the new items that I want to see, but it would also turn off most of my current gear, making it quite difficult to compare a new item at a glance. <br>\r\n</span>\r\n",
    "PostedDate": "2008-12-16T23:53:06.987-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]