[
  {
    "Id": "141042",
    "ThreadId": "42439",
    "Html": "<strong>quoted from the PTR patch note<br>\r\n<br>\r\nBonus Armor</strong>: The mechanics for items with bonus armor on them\r\nhas changed (any cloth, leather, mail, or plate items with extra armor,\r\nor any other items with any armor). Bonus armor beyond the base armor\r\nof an item will no longer be multiplied by any talents or by the\r\nbonuses of Bear Form, Dire Bear Form, or Frost Presence.<br>\r\n<br>\r\n<br>\r\n<br>\r\nSo, the bonus armor from cloak isnt supposed to be multiplied as its\r\nbonus armor, not base armor. The base armor is the one according to the\r\nilvl of the item, would be appreciated if the maths for the cloak could\r\nbe adjusted to this change. That mean that we'll get a lil les mitigation from cloak, but the BASE armor will still get the bonus from bear and survival of the fittest.<br>\r\n",
    "PostedDate": "2008-12-16T10:11:29.08-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "141077",
    "ThreadId": "42439",
    "Html": "They are fully aware of this issue and have made postings to that effect.  They are working on a solution that will allow Rawr to learn the difference between base and bonus armor, which it currently can't discern and needed access to the current build on the PTR to be able to confirm calculations.\r\n",
    "PostedDate": "2008-12-16T12:38:54.76-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "141360",
    "ThreadId": "42439",
    "Html": "In the current PTR 3.0.8 build, base armor from cloaks (a cloth item) is being appropriately multiplied by thick hide, survival of the fittest, and dire bear form multipliers, with bonus armor added on top (base * 1.1 * 1.66 * 4.7 + bonus). Wowhead has base/bonus armor values available for cloth/leather/mail/plate items with bonus armor. If you hover over the green armor number, you will see how much of it is bonus armor. Perhaps that would be a parsable source.\r\n",
    "PostedDate": "2008-12-17T08:41:36.49-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]