[
  {
    "Id": "141515",
    "ThreadId": "42573",
    "Html": "A lot of the bear gear has shifting dreadstones; however I have yet to see one in game and am not even certain they exist.  I can find very little information on them.  Perhaps prudent to not include them in ratings if they are not even in game.\r\n",
    "PostedDate": "2008-12-17T22:47:23.273-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "141611",
    "ThreadId": "42573",
    "Html": "A Dreadstone is one of the new epic gems.&nbsp; They're in the data files, but not obtainable in the game yet. They're on Wowhead, so they show up in Rawr.&nbsp; If you don't like them, either remove them from your item list or filter them.<br>\r\n<br>\r\nPersonally, I just select the blue gems and let the optimizer run with that.<br>\r\n",
    "PostedDate": "2008-12-18T08:38:10.243-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "141658",
    "ThreadId": "42573",
    "Html": "It's easy enough to just select blue gems when using the optimizer; however I, and I'm sure many users don't use the optimizer when we're looking at options for each slot.  It's great when you know what you have available or what you think you can attain but it would be nice to have a global filter for blue/epic gems outside the optimizer for the gear lists.  <br>\r\n<br>\r\nIt's a moot point when they finally patch them into the game but nearly all the gear selections are based on gems not currently available.  Heck, there isn't even a blue quality 'shifting'  (agil/stam) gem in wolk atm and it does make a difference in gear ranking.<br>\r\n<br>\r\nI'll play around more by using the optimizer as you said.<br>\r\n<br>\r\n",
    "PostedDate": "2008-12-18T12:05:14.203-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "141672",
    "ThreadId": "42573",
    "Html": "Tools &gt; Set Default Gems...<br>\r\n",
    "PostedDate": "2008-12-18T12:44:30.207-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]