[
  {
    "Id": "142616",
    "ThreadId": "42916",
    "Html": "I'm still a little shaky on how the gemming choices are made.&nbsp; I'm working on my DPS cat druid, and when it lists the same item with multiple gem combos, what gem list does it use?&nbsp; I haven't set the default gems because I want RAWR to make suggestions, but it only lists 3 versions of the item (aka 3 different gems combos).&nbsp; Is there a place to see what it uses for the default list?&nbsp; Or, if anyone has a good thread or tutorial on how the gemming works (in RAWR), it would be appreciated.<br>\r\n<br>\r\nOh, also, I think this has been mentioned, but editing an item and then editing gems crashes RAWR in 2.1.4 for me.<br>\r\n",
    "PostedDate": "2008-12-23T09:12:48.977-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "142624",
    "ThreadId": "42916",
    "Html": "If editing an item crashes Rawr for you, you need to <strong>uninstall your currently installed version of the .NET Framework,</strong> install the latest version from Microsoft.<br>\r\n<br>\r\nRawr doesn't 'suggest' any items in its charts, those are simply the gemmings that you have in your item cache. You can manually edit them (once you fix your .NET Framework issue), or you can do a mass replace/delete, using the Tools &gt; Set Default Gems... feature.<br>\r\n<br>\r\nFor Rawr to make suggestions for you, you want to use the Optimizer.<br>\r\n",
    "PostedDate": "2008-12-23T09:40:34.51-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "142669",
    "ThreadId": "42916",
    "Html": "I haven't used the optimizer since the TBC days where I had nearly all possible gear available to me.&nbsp; And my experiences with that version of the optimizer led me to believe that taking away gem choice from the optimizer led to much faster optimization times and more easily processed results.<br>\r\n<br>\r\nWhat I would do is set up a profile with reasonable gear, enchants, buffs.&nbsp; Then browse Charts-&gt;Relative Stat Values.&nbsp; Pick the best attainable gems for a given color that you see there and then go use the option to set default gems based on what you've found.<br>\r\n<br>\r\nAstrylian, if the optimizer is a superior solution, could you give us a quick explanation?<br>\r\n",
    "PostedDate": "2008-12-23T12:18:46.587-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "142682",
    "ThreadId": "42916",
    "Html": "An explanation of what? As you mentioned, the more items you mark available for a slot (<em><strong>especially</strong></em><strong> <em>gems</em></strong>), the longer the optimizer takes.<br>\r\n<br>\r\nThe Optimizer is really simple to use. Mark what you have available for each slot (preferably only things that have any chance of being useful, to save time), and hit Optimize. It'll give you the best gear set made from what you have available. Or, hit Build Upgrade List to create a chart of the potential upgrades that you don't have, and their optimized values.<br>\r\n<br>\r\nYou can also tell the optimizer that you only have a specific gemming/enchanting of an item available as well, if you want, so it won't regem/reenchant it (unless you check the Override checkboxes). That's done by ctrl-clicking the diamond, and right-clicking the diamond.<br>\r\n<br>\r\nIf this doesn't answer your questions, let me know.<br>\r\n",
    "PostedDate": "2008-12-23T12:51:16.133-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "142705",
    "ThreadId": "42916",
    "Html": "Thanks for the rundown, Astrylian.&nbsp; I was unaware of the ctrl and right-clicking behavior, so I appreciate it.<br>\r\n<br>\r\nThere you have it, Happlo.&nbsp; Two ways to figure out what gems you want to use.<br>\r\n<br>\r\n<br>\r\n",
    "PostedDate": "2008-12-23T14:35:07.173-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "143289",
    "ThreadId": "42916",
    "Html": "What's the difference between right-clicking and control-clicking the diamond? In both cases, I get the same apparent behavior: a menu pops up with all the possible enchants. When I select one of those enchants, the diamond then acquires a little red dot at its bottom right.<div><br></div><div>(running Rawr 2.1.4 under Windows XP within a VMWare Fusion 2.0.1 virtual machine, itself running on my Mac under MacOS X 10.5.6).</div><div><br></div>",
    "PostedDate": "2008-12-29T01:58:36.597-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "143358",
    "ThreadId": "42916",
    "Html": "Enchant dropdown should only appear on right click. Ctrl-click should make the diamond blue as opposed to green.\r\n",
    "PostedDate": "2008-12-29T10:52:34.82-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "143398",
    "ThreadId": "42916",
    "Html": "jdmuys, you probably have VMWare Fusion set to treat ctrl-click as right-click. That's probably a setting you can turn off somewhere.<br>\r\n",
    "PostedDate": "2008-12-29T14:02:27.31-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "143469",
    "ThreadId": "42916",
    "Html": "Yes indeed, control-click is treated as right click: this has been the default convention for ages on the Mac.<div><br></div><div>Fortunately enough, I could turn it off. Control-click now turns the diamond blue.</div><div><br></div><div>This action is not very discoverable. Maybe you could also do it from a menu? It would make sense to be a command in the contextual menu (which pops up with right click).</div>",
    "PostedDate": "2008-12-30T01:13:58.053-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "143471",
    "ThreadId": "42916",
    "Html": "Indeed, the whole method for marking items as available is more than a bit of a hack. I hope to improve the situation drastically with the gemming system revamp.<br>\r\n",
    "PostedDate": "2008-12-30T01:24:25.56-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "143541",
    "ThreadId": "42916",
    "Html": "This thread reminded me of something I noticed about &quot;enforce metagem requirements&quot;.&nbsp; Is it true that currently the enforcement is simply not taking credit for the metagem if the currently equipped items don't meet the requirements?&nbsp; If so, would a more accurate system be taking the (usually large) positive impact of the meta gem, then subtracting out the (usually much smaller) impact of gem &quot;demotions&quot; (switching to a gemming with less contribution, but that meets the requirements?)<br>\r\n<br>\r\nI notice this a lot when I look at ranked head slot gear.<br>\r\n",
    "PostedDate": "2008-12-30T09:08:19.47-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "143544",
    "ThreadId": "42916",
    "Html": "That's correct, it does what you describe, and that is indeed the most accurate. If 'Enforce Metagem Requirements' is on, then you only get the benefit of the metagem if you meet its requirements.<br>\r\n",
    "PostedDate": "2008-12-30T09:23:30.433-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "143551",
    "ThreadId": "42916",
    "Html": "Sorry if I wasn't being clear.<br>\r\n<br>\r\nTo pick a representative example, let's say I have a metagem that requires two blue gems to activate, and only 1 other piece of gemmable gear, a chest that currently has two red gems socketed.&nbsp; The metagem is worth +150, the red gems +15, and the blue gems +10.<br>\r\n<br>\r\nMy fear is under the current system, the metagem slot will be valued at zero.&nbsp; In my opinion, the much more accurate valuation would be +140, which is +150 for the metagem and -5 x2 for having to degrade two red gems to two blue gems.<br>\r\n<br>\r\nI agree that zero would be the appropriate value if no gemmings were available which could meet the metagem requiments.<br>\r\n<br>\r\nThe reason I mention all this in this thread, is that it struck me as something that might possibly be difficult to implement today, but might potentially be related to other work in a gemming system revamp.<br>\r\n<br>\r\nEdit: example above leaves out the possibility that a socket bonus on the chest would be gained or lost, which ideally should also fit in the calculation.<br>\r\n",
    "PostedDate": "2008-12-30T09:57:52.233-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "143559",
    "ThreadId": "42916",
    "Html": "No, that would be quite inaccurate, as it doesn't happen that way. Instead, what would be accurate, and doesn't actually happen that way (both in-game and in Rawr) is that the metagem would be worth 0, and the chest with two purple gems would be rated 140 more than the chest with two red gems.<br>\r\n",
    "PostedDate": "2008-12-30T10:45:05.767-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "143583",
    "ThreadId": "42916",
    "Html": "Thanks Astrylian.&nbsp; I really appreciate your taking the time to explain this, and feel bad I'm having so much trouble understanding.&nbsp; In particular I'm having trouble parsing your sentence above about what would be accurate is not what actually happens either in Rawr or in-game.<br>\r\n<br>\r\nI do now see that there may be cases where it is better to compute the metagem contribution at the item slot that provides for the activation (the chest in the case above), vs. at the head slot.&nbsp; That's probably not ideal for my particular current case, where I am comparing head pieces that have a metagem slot vs. my current one which does not.&nbsp; This means the list of chest pieces does not apply any bonus for metagem activation (since it doesn't see a metagem socket in my current gear), and the list of head pieces does not value the metagems (since it doesn't see the requirements met in the current gear worn, and doesn't consider that it would be only a small loss to regem to gain it.)<br>\r\n<br>\r\nIn any event perhaps this will all be moot once the Build Upgrade List works for my class.&nbsp; I haven't had a chance to experience it yet so maybe that's why I'm missing some key perspective.&nbsp; I've been using just the direct upgrade chart, and the charts for each invidiual item slot.<br>\r\n<br>\r\nFor now I'll take it there's good reason for it to be the way it is, that I should probably disable enforce metagem requirements for the particular decision about head slot items, and hope as I keep learning about Rawr I'll one day better understand.<br>\r\n&nbsp;<br>\r\n<br>\r\n",
    "PostedDate": "2008-12-30T12:34:37.4-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "143594",
    "ThreadId": "42916",
    "Html": "Yeah, you probably want to turn off Enforce Metagem Requirements when comparing helms with different metas (that's what it's there for, primarily), and then adjust gems as necessary. The Optimizer is ideal for choosing the best metagem, including considering the other required gem changes.<br>\r\n",
    "PostedDate": "2008-12-30T13:48:09.783-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]