[
  {
    "Id": "142662",
    "ThreadId": "42927",
    "Html": "I'm new to this community and using rawr in general...but it seems most classes have been updated with a way to adjust the boss target level to 83 since we are now fighting against level 83 bosses...I don't know if it was an oversight but the boss level for the enhance shaman module is still stuck to 73 which vastly effects the numbers we need for hit and expertise cap, thus effecting how the gearing is showing up.&nbsp; Is there a plan to fix this in a future version...I realize the enhance shaman module for this application is new but it I do like to use rawr instead of relying on EP values I have to change and upgrade with every piece of gear I get.&nbsp; Sadly I don't know C+ Programming that well to be of any help but if someone does can we please address this problem and fix it for those of us who are enhance shamans.<br>\r\n",
    "PostedDate": "2008-12-23T11:59:59.96-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "142791",
    "ThreadId": "42927",
    "Html": "I think Rawr.Enhance wasnt updated at all for 3.0 and WotLK. And because the whole enhance mechanic and playstyle changed it's quite useless in its current state :-/<br>\r\nWTB update ;P<br>\r\n",
    "PostedDate": "2008-12-24T03:01:32.417-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "147463",
    "ThreadId": "42927",
    "Html": "I really like the modules for healadin and retribution paladin . Recently i started a shaman, and i hope that the shaman.modules will become useful for 3.X again <br>\r\n",
    "PostedDate": "2009-01-15T11:36:01.613-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "147974",
    "ThreadId": "42927",
    "Html": "I'm sure it'll be in working order soon enough, the enhancement module is still pretty new.&nbsp; It didn't exist at all for BC, and as complex as the modelling can get, I'm just glad we're this far along.<br>\r\n<br>\r\nMuch thanks to Toots for taking on the project, not to mention all the work over at EJ.<br>\r\n<br>\r\n<br>\r\nKemosabe<br>\r\nDurotan<br>\r\n",
    "PostedDate": "2009-01-17T12:01:38.743-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]