[
  {
    "Id": "142785",
    "ThreadId": "42964",
    "Html": "I am new to Rawr and i am having a heck of a time trying to find info on what to do when i have Rawr downloaded , i unzip it&nbsp; after i download and it unzips to a folder on my desktop, but from there i can do nothing more, any help would be great, i am using XP . I am just looking for instuctions on what to do after download.<br>\r\n",
    "PostedDate": "2008-12-24T02:20:55.85-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "142846",
    "ThreadId": "42964",
    "Html": "Double-clicking on the Rawr.exe file should start the program.<br>\r\n<br>\r\nHave you downloaded Microsoft .NET Framework, which is needed to use Rawr?  See troubleshooter here - <br>\r\n<br>\r\n<a href=\"http://druid.wikispaces.com/Rawr\">http://druid.wikispaces.com/Rawr</a><br>\r\n<br>\r\nAfter doing what you have done (download, unzip), I copy all the unzipped files into a folder on my D drive uncer D:\\Programs\\Rawr.<br>\r\n<br>\r\nI then create a shortcut to Rawr and cut &amp; paste it onto my desktop.<br>\r\n<br>\r\nClicking on the shortcut then opens the program. <br>\r\n",
    "PostedDate": "2008-12-24T07:36:55.857-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "143011",
    "ThreadId": "42964",
    "Html": "the problem is after i unzip the download my Rawr.exe file is gone, all i have left is a data file and in that is a images file and buff cache, enchant cache.&nbsp; so i have redownloaded about 6times and have redone .net about 5 times and still nothing .&nbsp; ty<br>\r\n",
    "PostedDate": "2008-12-26T03:19:47.88-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "143056",
    "ThreadId": "42964",
    "Html": "Rawr is in a simple zip file. It's just a folder with Rawr.exe and a couple other files, and that Data folder you mention. Really. Just fully unzip, or open it in windows explorer and drag the root folder to your desktop. There's nothing special or difficult about it.<br>\r\n",
    "PostedDate": "2008-12-26T11:33:49.05-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "143080",
    "ThreadId": "42964",
    "Html": "I just want to say that you should make sure you are not downloading it from the &quot;Source Code&quot; tab on this page. That file contains no exe file but a lot of data/code files instead. On the front page there should be a download link which does include the exe file (I actually installed it yesterday).<br>\r\n",
    "PostedDate": "2008-12-26T17:56:29.253-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "143134",
    "ThreadId": "42964",
    "Html": "Ok when i go into the zipped file and select unzip all the only files that are there after the unzip is the file named data and when i click on that all that is in there is a file named images, buff cache,and buff cache, the other files just vanish during the unzip and i have been trying to get this to work for a whole week now, during the unzip my desktop flashes once and then the unzip is done.<br>\r\n",
    "PostedDate": "2008-12-27T09:08:38.237-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "143151",
    "ThreadId": "42964",
    "Html": "Are you perhaps on some heavily-locked-down corporate internet connection that strips all exe's and dll's from zip's or something weird? Some really anal firewall or antivirus software?<br>\r\n",
    "PostedDate": "2008-12-27T13:05:26.137-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "143418",
    "ThreadId": "42964",
    "Html": "med, if you browse through the zip file without actually unzipping it....can you see the EXE?<br>\r\n",
    "PostedDate": "2008-12-29T16:26:46.883-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]