[
  {
    "Id": "143119",
    "ThreadId": "43058",
    "Html": "Hi there, I just had a quick (well, not really) question.<br>\r\n<br>\r\nI was browsing for upgrades, and I am a feral druid currently wearing the Heritage neck piece. I personally would rate it as best in slot, but was puzzled to note that (sorted by mitigation), Heritage is passed by both the Amulet of Autopsy, and the Titanium Earthguard chain. Since it was in 3.04 armor mode, and was correctly adding armor on a 1 to 1 scale, I was wondering why they beat out Heritage when they have a net avoidance of .-47% and -1.01% (ungemmed, otherwise -.6%) respectively.<br>\r\n<br>\r\nSo what I am wondering is, how are you guys rating mitigation and avoidance based stats, and is and/or why might my observation be incorrect. I apologize, but I have no idea if this is the only available rawr forum, so if there is a board where you have numbers and theorycrafting going on, point me there and I'll go read until I can figure it out myself.<br>\r\n<br>\r\nAll help is appreciated, and thanks for a great program!<br>\r\n",
    "PostedDate": "2008-12-27T04:52:51.997-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "143124",
    "ThreadId": "43058",
    "Html": "This is a fine place to discuss this. Most Rawr discussion goes on here, or on EJ, or occasionally DruidWiki.<br>\r\n<br>\r\nIn this case, the calculation is mostly* correct. Despite not being multiplied anymore, Armor still is a very valuable stat for us, of which Heritage has none. It also has a rather high percent of its item budget spent on threat-only stats (hit, str). <br>\r\n<br>\r\n*mostly: Individually, these items are calculated correctly, however the currently released version of Rawr's '3.0.4 armor mode' is not quite correct; it was made before the PTR came up, so the multiplier on Leather is slightly too low, and all of the armor on cloaks is getting that multiplier too, rather than just the base armor like it should be. So your total armor is a bit off, which of course skews the value of all other items a bit too. It's pretty close though.<br>\r\n<br>\r\nIf you mouse over the labels for Mitigation Points and Survival Points, you can see their meaning. Let me know if this hasn't answered your question.<br>\r\n",
    "PostedDate": "2008-12-27T05:11:58.307-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "143427",
    "ThreadId": "43058",
    "Html": "When will the updated version be posted? Rumor is that the patch will come Tuesday.<br>\r\n",
    "PostedDate": "2008-12-29T17:54:48.11-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "143432",
    "ThreadId": "43058",
    "Html": "No, patch won't be released tomorrow; no downtime, just rolling restarts.<br>\r\n",
    "PostedDate": "2008-12-29T18:27:30.313-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]