[
  {
    "Id": "1011545",
    "ThreadId": "435680",
    "Html": "What is happening with a new version? Where are we on this? Is there any way to at least get the new gear into the current version?<br />\n",
    "PostedDate": "2013-03-06T20:39:08.223-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1012569",
    "ThreadId": "435680",
    "Html": "While I've been a big fan of rawr and have appreciated all the hard work and everything that has been done with this project. I have moved on to <a href=\"http://www.askmrrobot.com\" rel=\"nofollow\">www.askmrrobot.com</a>.  I would suggest you do the same.  It will make your life so much easier, and you don't have to install anything :D<br />\n",
    "PostedDate": "2013-03-08T13:49:54.483-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1017610",
    "ThreadId": "435680",
    "Html": "<strong>Novarcaine wrote:</strong><br />\n<blockquote>\nWhat is happening with a new version? Where are we on this? Is there any way to at least get the new gear into the current version?<br />\n</blockquote>\nWhat is the point of getting new gear into the current version if the calculations in the background are for a previous patch?<br />\n",
    "PostedDate": "2013-03-19T04:37:55.277-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1019228",
    "ThreadId": "435680",
    "Html": "I can update the Mage model for 5.2 -- but we need someone to look at Item Cache updates and Build Releases.  What happened to Hinalover?<br />\n",
    "PostedDate": "2013-03-21T15:44:28.917-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1019428",
    "ThreadId": "435680",
    "Html": "Good for you, darkfury. I have my own thoughts about Mr. Robot, which has either consistently failed me as a shield tank, or needed a <strong>LOT</strong> of adjusting in the stat weights. The presets were always wrong for me. Granted, as a quick and dirty lookup for DPS, it's probably just as good as any tool.<br />\nSorry, but in my opinion and experience, Rawr has always been far superior to mrrobot and others.<br />\n",
    "PostedDate": "2013-03-22T03:34:05.27-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1019879",
    "ThreadId": "435680",
    "Html": "You are correct. RAWR has always been a much better product but if we cant use it for what it was intended to be it is no better than a blog by a 13 year old girl about pretty ponies or something such. PLEASE find the people needed to get this back to the tool it once was.<br />\n",
    "PostedDate": "2013-03-22T21:18:13.89-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1023581",
    "ThreadId": "435680",
    "Html": "I agree with you, TheDragon.  Luckily Mr. Robot works out for me, I do realize that there are a few models that aren't accurate.  I would definitely rather use Rawr like I have for so long, but unfortunately where Hinalover and a few others have more important Real life things going on we have to turn to alternative options.  I wish I knew more about programming and such, so I could help out, but I don't.<br />\n",
    "PostedDate": "2013-03-31T18:37:12.75-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1030310",
    "ThreadId": "435680",
    "Html": "If there is anyone that would like to take over making the builds just get in contact with me. I keep maintaining Arcane for my own use, so I could probably share some of what I have, but we definitely need someone to bring this back up to speed.<br />\n",
    "PostedDate": "2013-04-14T13:57:32.93-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1030355",
    "ThreadId": "435680",
    "Html": "I wouldn't mind taking over the builds if that's what it takes.  One problem I have is that Hina really did put in a lot of effort into maintaining the item cache, and I don't know if I can put in that much effort.<br />\n",
    "PostedDate": "2013-04-14T17:55:36.823-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1030359",
    "ThreadId": "435680",
    "Html": "I just don't know about Mr. Robot -- does it just do static weights for stats?  How about things like tier bonuses?  Are they captured too?\r<br />\n<br />\nAlso, I never quite understood why Hina needed to put a lot of manual effort into maintaining the cache.  I'm worried that it just won't scale.  There are so many new items that aren't in Rawr, and having a mysterious, time consuming process to update the cache feels not right.\r<br />\n<br />\nChar<br />\n",
    "PostedDate": "2013-04-14T18:57:58.437-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1030577",
    "ThreadId": "435680",
    "Html": "The majority of time spent in the item cache is making sure that trinket procs are properly captured.  Back in Burning Crusade, when trinket procs were mostly simple and predictable, we had regular expressions that could auto-parse the common trinket procs, but these days the majority of trinkets are complex and/or non-standard and only a relative few follow &quot;typical&quot; wording conventions.  I'm pretty sure importing the items themselves doesn't have to be all that complicated.<br />\n",
    "PostedDate": "2013-04-15T05:33:35.263-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1030807",
    "ThreadId": "435680",
    "Html": "I could take care of adding new-trinket parsing for the Item Cache, but the main issue I have today is that the PPM model is incompatible with most trigger types (e.g. spellHitOrDotTick, etc). Also besides triggers, do we know how solid the PPM code is?<br />\n",
    "PostedDate": "2013-04-15T13:15:40.953-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1032173",
    "ThreadId": "435680",
    "Html": "The main thing that's slow in maintaining item cache is the item source data that is used for filters. If that is skipped it's easy to mass import items by id (or we even used to have import from wowhead filter which shouldn't be much work to add back) and then manually fix trinkets. The PPM model should work correctly I think for all triggers where number of impacts = number of triggers, and if that condition is met it doesn't matter which trigger is selected (other than for model filtering). The only thing I'm not sure about is some recent changes that made it so the proc chance increases if you're above average since it procs. If that changes the average behavior significantly then it would have to be added in.\r<br />\n<br />\ndopefish, I'll contact you directly to get you set up for making releases.<br />\n",
    "PostedDate": "2013-04-17T20:07:04.39-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1032412",
    "ThreadId": "435680",
    "Html": "There's also several trinkets whose proc rate is modified by spec.  I may look into seeing if there's a cleaner way to ID these, because I seem to remember having some small amount of trouble properly identifying specific procs.<br />\n",
    "PostedDate": "2013-04-18T05:46:30.033-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]