[
  {
    "Id": "144837",
    "ThreadId": "43570",
    "Html": "I was trying to do some theoretical combinations for my druid and I noticed quite a few enchants that are not present in the current built. I tried to input several into the database in the program but it would:<br>\r\n<br>\r\na) not allow me to import the enchants from wowhead<br>\r\nb) not allow me to set the enchants as &quot;weapon enchants&quot;<br>\r\n<br>\r\nI'm fairly new to the program but it has helped me plan out what gear I should be aiming for. But with the next patch (3.0.8) releasing <strong></strong><a href=\"http://www.wowhead.com/?item=44945\"><strong>Formula: Enchant Weapon - Titanguard</strong></a> with 75 Stamina to the weapon I was wanting to see how much Health my druid would have with it (after guessing, found out it's about 1,200 Health in bear form; but it's the principle of the thing) and how it fairs with other enchants such as Mongoose.<br>\r\n",
    "PostedDate": "2009-01-06T12:30:28.217-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "144840",
    "ThreadId": "43570",
    "Html": "To add to this, I notice the tailoring cloak embroideries aren't included in available cloak enchants.&nbsp; Everyone's saying greater speed is better than the holy damage proc one, but I would like to see the comparison in rawr.&nbsp; Are there plans to add these cloak embroideries?<br>\r\n",
    "PostedDate": "2009-01-06T12:34:12.627-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "144860",
    "ThreadId": "43570",
    "Html": "What were you trying to do to add enchants? o.O<br>\r\n<br>\r\nYou can add them by editing the EnchantCache.xml file.<br>\r\n<br>\r\n<br>\r\nEmbroideries are coming, but are low priority since they're bad. Lightweave isn't always worse than Greater Speed, but it's never significantly better. On my wife's mage as Arc, Lightweave is like 6dps over Greater Speed.<br>\r\n",
    "PostedDate": "2009-01-06T14:05:24.493-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "144865",
    "ThreadId": "43570",
    "Html": "I did not know about that file. What I was TRYING to do was add the enchant using the &quot;add item&quot; form in the program. However there is no &quot;add enchant&quot; form. Even when you try to &quot;edit&quot; the enchant it goes straight to the &quot;item edit&quot; form. Hence my confusion on where to add the enchant.<br>\r\n",
    "PostedDate": "2009-01-06T14:10:12.833-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "144898",
    "ThreadId": "43570",
    "Html": "Ah hah, I see why you were confused. That's a bug, I'll get that fixed; right click should do nothing on enchants in the popups, just like it does nothing in the charts. Enchants are not items, there's no way to automatically add them.<br>\r\n",
    "PostedDate": "2009-01-06T15:58:59.963-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]