[
  {
    "Id": "145089",
    "ThreadId": "43640",
    "Html": "Hello,<br>\r\n<br>\r\nThe latest releases of Rawr have added a new feature, survivability cap, which is set by default to 140000. Can I have a meaning for this, is it the recommanded cap for tanking Heroic/Normal Naxxramas or Heroics 5-man ? Can we have a scale of what survivability cap to set depending of the content tier the optimization is aimed for ?<br>\r\n<br>\r\nThanks !\r\n",
    "PostedDate": "2009-01-07T08:49:20.517-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "145144",
    "ThreadId": "43640",
    "Html": "The meaning of Survivability can be found by mousing over Survivability Points* on the Stats tab. It's important to note that this is a <em>soft</em> cap, not a hard cap. After passing the cap, the value of Survivability slowly tapers off, but never becomes worthless. 140k is reasonable with decent healers for the hardest hitting content in the game (Sarth+3 25 and Patchwerk 25). I'm personally using 160k to plan for Ulduar, and 100k is probably reasonable for normal 5mans, and 120k for heroic 5mans and normal raids.<br>\r\n",
    "PostedDate": "2009-01-07T10:43:00.833-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "148961",
    "ThreadId": "43640",
    "Html": "*bump*<br>\r\n<br>\r\nThanks for the answer.<br>\r\n<br>\r\nBut I have read on EJ that a bare 50k health is advised for attempting Sarth+3 10&amp;25, and optimizing with 140k give me a bare 40k health with most common raid buffs. Is that suffisent ?<br>\r\n<br>\r\nThanks, and I'm looking forward 2.1.8 that'll fix the optimizer problem! \r\n",
    "PostedDate": "2009-01-20T16:39:43.097-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "148964",
    "ThreadId": "43640",
    "Html": "No, that's quite wrong. 50k is far from required for Sarth+3. If anyone is recommending going that high, they're doing it wrong. 42k is enough. If you do it right, you shouldn't need much more survivability than your standard tanking gear. <br>\r\n<br>\r\n<br>\r\nI use a mix of agi and sta gems personally, with a slant towards agi. For Sarth+3 I equip a stam trinket instead of an armor trinket, and a 2nd chest gemmed for stamina over my normal one gemmed for agi. I commonly hear people say to use Polar gear, because the first Sarth+3 kills were done with bears in Polar gear. They used Polar gear for those kills, because it was easily available, within the 1-2 raid lockouts they had available within that short amount of time. Nobody should be using Polar gear for tanking Sarth+3 anymore.<br>\r\n",
    "PostedDate": "2009-01-20T16:47:43.387-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "161904",
    "ThreadId": "43640",
    "Html": "*bump again*<br>\r\n<br>\r\nMy guild is near to attempt Sartharion +3 Drakes and I'm still wondering why you think stacking stamina is not that required to main tank Sartharion as a Druid. I read everywhere that a huge hit point pool is necessary for this encounter because of the breaths having many, many multipliers at some points of the fight (when the 2 last drakes + both of their disciples are left), and even with it, various cooldowns are needed. Is 42k raid buffed (leads to ~30k with Vesperon's Power) enough to take them in a worst case scenario ?<br>\r\n<br>\r\nWell, just wanted to understand your point here.\r\n",
    "PostedDate": "2009-02-25T07:15:30.5-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "162038",
    "ThreadId": "43640",
    "Html": "There are a wide variety of ways of handling the breaths. You used to be able to attack before the breath to break the twilight torment, now you can't, reliably. That takes away the easiest of the different ways.<div><br></div><div>Polar gear, plus tons of stam gems is one way. Having paladins/priests who aren't retarded, to drop cooldowns on you when needed, is another. Fire resist is another. You can mix and match of course. Personally, I go with a decent chunk of FR, plus a few cooldowns, and a few alternate pieces of gear with high stam. Just stacking ludicrous amounts of stam, using Polar gear, is certainly one option, but I wouldn't recommend it.</div>",
    "PostedDate": "2009-02-25T11:59:00.05-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]