[
  {
    "Id": "146062",
    "ThreadId": "43928",
    "Html": "I have PvP and Jewelcrafting unchecked in the filters.  However, things like the BoP Jewelcrafted +41 Stamina Solid Dragon's Eye and tons of Gladiator's gear show up as possible upgrades.  The Dragon's is especially troublesome since it ranks things very high for my Bear that I can't possibly obtain.  How do I filter out these anomolies?<br>\r\n",
    "PostedDate": "2009-01-11T08:17:07.037-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "146087",
    "ThreadId": "43928",
    "Html": "The gemmings, you can use Tools &gt; Set Default Gems to get rid of any gemmings you ddon't like. As for the PvP gear, some just doesn't have accurate source data from Wowhead/Armory, and some may be falling under the Burning Crusade filter instead of the PvP filter.<br>\r\n",
    "PostedDate": "2009-01-11T10:24:44.363-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "146113",
    "ThreadId": "43928",
    "Html": "Maybe I don't understand how to use that feature but to me it looks like I would have to list every possible gemming I am interested in just so I can click don't include anything I have not listed such as the 41 Stamina gem that only a jewelcrafer can make.  That seems like a lot of work and something that I can't possibly do correctly or maintain.  Is there no way to just say exclude &quot;Solid Dragon's Eye&quot;?  The same would work for all the &quot;Deadly Gladiator&quot; stuff. <br>\r\n<br>\r\nEdit: I also have TBC filter unchecked. \r\n",
    "PostedDate": "2009-01-11T12:22:24.14-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "146148",
    "ThreadId": "43928",
    "Html": "Well I don't know what class/spec you're talking about, but for a bear, for example, you'd only need 1-4 possible gemmings. It's quite easy to do, and there's nothing to 'maintain'.<br>\r\n",
    "PostedDate": "2009-01-11T17:17:53.9-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "146477",
    "ThreadId": "43928",
    "Html": "Astrylian, I have the same issue as Jocund.&nbsp; I haven't used the 'Set Default Gems' tool as I'm not certain whether I have to specify every possible combination of gems and I don't want to end up deleting all my gems and gem combinations if i get something wrong.<br>\r\n<br>\r\nAs a mage, yellow gems have quite a few options, though the others are simpler:<br>\r\n<br>\r\nRed:&nbsp; Runed (spellpower)<br>\r\nBlue: Vivid (hit/stam), Glowing (spellpower/stam)<br>\r\nYellow: Rigid (hit), Veiled (hit/sp), Potent (crit/sp), Reckless (haste/sp).&nbsp; It's may also be worth watching Smooth (crit) and Quick (haste) as gear progresses.<br>\r\nMeta: CSD.<br>\r\n<br>\r\nSo, that's 12 combinations there, more for me with my Jewelcrafting only gems.&nbsp; If they were to add a second viable Meta and a second viable Red that'd jump to 48.<br>\r\n<br>\r\nDo I need to add every single combination as a seperate entry in the 'Set Default Gems' tool?&nbsp; Or can I just add a line with a rigid gem in it and the rest blank, repeat for each gem, and i'll mix and match?<br>\r\n<br>\r\nTBH, I'd much rather a tick box next to each gem that said 'include this when figuring shit out' - it'd be a lot more simple to use, and I'm a bit simple :-\\&nbsp; (As a side note, I'd also really like to see filters for displaying or removing 'TBC - uncommon' 'TBC-rare' 'TBC-epic' 'Wrath-uncommon' 'Wrath-rare' 'Wrath-epic' etc gems.<br>\r\n",
    "PostedDate": "2009-01-12T15:35:37.053-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "146508",
    "ThreadId": "43928",
    "Html": "In the current Rawr in 'Set Default Gems' you have to specify every possible combination that you want to show up in the comparison pane. We're planning for a revamp of gemming system, but we're waiting for 3.0.8 to go live before we make those changes. I would suggest you just list the most common combinations and use 'Build Upgrade List' to keep track on possible other gemming combinations that might be better in specific situations.<br>\r\n<br>\r\nFor filtering I was planning to add an option to apply them to items/gems separately, I guess it's time to check that in.\r\n",
    "PostedDate": "2009-01-12T17:15:05.893-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "146512",
    "ThreadId": "43928",
    "Html": "Sounds good, I'll look forward to both of those changes.&nbsp; Great work Kavan.<br>\r\n",
    "PostedDate": "2009-01-12T17:43:22.39-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "146554",
    "ThreadId": "43928",
    "Html": "Would it be possible to build a tool that let users create their own Exclude List?  For example, when I bring up trinkets, I have ton of &quot;Figurines.&quot;  Since, I am not a jeweler, these are not possible upgrades (I have jewelry unselected in filters).  I know the data coming from Blizzard is spotty so it seems to me that allowing the user to easily filter out gems, figurines and for non PvPers Gladiator items would be a real boon.<br>\r\n",
    "PostedDate": "2009-01-12T21:27:22.6-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "146567",
    "ThreadId": "43928",
    "Html": "If both armory and wowhead import don't give you correct item source data you can enter it yourself in the note if you edit item. Filters will check both armory/wowhead source info and user note to determine filtering.\r\n",
    "PostedDate": "2009-01-12T22:44:32.863-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "146663",
    "ThreadId": "43928",
    "Html": "What do I put in the note to cause the item to be filtered out?  I tried putting &quot;Jewelcrafting&quot; in the note for Figurine - Monarch Crab but it remains on my list of possible upgrades.<br>\r\n",
    "PostedDate": "2009-01-13T05:40:53.883-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "148319",
    "ThreadId": "43928",
    "Html": "I was having a similar issue with some items because they were being covered by two different filters, or the item source was incorrect.&nbsp; If adding the source to the notes field doesn't fix the problem, look through the filters and see if there is any overlap from another filter.&nbsp; To get rid of the BoP crafted items that were showing up, I added &quot;!BoP&quot; to the Crafted filter, i.e. it now has &quot;Created|!BoP&quot;.&nbsp; This seems strange because the non-BoP items are listed as &quot;Created via...&quot; and don't have the tradeskill name in them and the tradeskill filters have &quot;BoP crafted...&quot;.<br>\r\n<br>\r\nTo get rid of the unwanted Gladiator's gear, I added &quot;Magister Brasael|Sergeant Thunderhorn|Lieutenant Tristia|Knight-Lieutenant|PvP&quot; to the filter after refreshing the items to update their source.<br>\r\n*edit*&nbsp; I updated to 2.1.7 this morning and had to reset my filters.&nbsp; Part of the problem with items that are &quot;not found on armory&quot; is that they are covered by the Unknown filter.&nbsp; I removed that phrase from the Unknown filter and added PvP to the comments block on any stray Gladiator gear.<br>\r\n<br>\r\nAnother thing I found is that enchants/emboss/embroider items are not covered by filters either.&nbsp; There is no right-click menu available for these items, so I can't edit/remove them.&nbsp; I was trying to add a &quot;Leatherworking only&quot; filter that would include bracer fur linings and leg reinforcements without success.<br>\r\n",
    "PostedDate": "2009-01-19T05:39:35.85-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]