[
  {
    "Id": "146473",
    "ThreadId": "44042",
    "Html": "<strong>Situation:</strong> I'm a fairly well geared mage, clearing naxx/sarth/maly etc.&nbsp; If I look at, eg trinket slot one, my current trinket is around #4, with a score of 229.24.&nbsp; However, the list of items I can choose from (those available in the comparisons pane) is ~131 items (I've turned off PVP, Burning Crusade and Classic).&nbsp; It's probably safe to say I'm not going to change my current trinket for a level 44 quest reward valued at 16.78 dps, and indeed 116 of those items fall more than 100dps behind my current trinket, meaning they have no relevence to me.<br>\r\n<br>\r\n<strong>Suggestion:</strong> I'd really love some way of clearing the wheat from the chaff.&nbsp; The current filters don't seem to cut it - leaving something like eg. Alchemy selected, shows me the top Wrath Alchemy trinket, which is fine (it's not great but ~vaguely relevent, being top end of Alchemy for Wrath with 117dps), but also shows the Redeemer's (77dps) Mighty Alchemist stone (47 dps) and original Alchemist Stone (4.5dps, rawr!)&nbsp; So filtering by professions doen't really work.<br>\r\n<br>\r\nSome thoughts I had that may work:<br>\r\n<br>\r\n*Set an iLvl filter - only shows items above X iLvl, where X is input by the user.<br>\r\n*Rarity filter - filters to toggle on/off display of Uncommon, Rare, Epic items.<br>\r\n*# of items displayed filter - only shows the top X items, where X is input by the user.<br>\r\n<br>\r\nSummary:&nbsp; I feel this would not only make Rawr much easier to use, but possibly also a lot faster.&nbsp; Thoughts?<br>\r\n<br>\r\n<br>\r\n",
    "PostedDate": "2009-01-12T15:13:46.92-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "146510",
    "ThreadId": "44042",
    "Html": "This is already available. Go to the tools-&gt;edit item filters. For example to create a filter that removes all items below level 200 you would proceed like this:<br>\r\n<br>\r\n-click on + to create a new filter<br>\r\n-enter name, for example &quot;Remove low level items&quot;<br>\r\n-leave pattern empty, change max item level to 199<br>\r\n-uncheck Additive Filter checkbox<br>\r\n<br>\r\nThis will create you a filter that when selected will remove all items with item level between 0-199.<br>\r\n<br>\r\nYou can do similar with rarity or in any combination with item source.\r\n",
    "PostedDate": "2009-01-12T17:25:19.377-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]