[
  {
    "Id": "1036617",
    "ThreadId": "441801",
    "Html": "First, let me just say, thank you so much!\r<br />\n<br />\nI have been using Rawr for a couple of years now and I have loved every single update. When it became silent, I was hoping there would be an update coming out. I play a resto shaman and sure, there are other things out there, but Rawr gave me so much freedom to weigh and craft.\r<br />\n<br />\nI know that this does not have the 5.2 items added and the stat weights and modelling of 5.2, let alone the new RPPM system, but I am so happy that it's getting back on track and I'm looking so forward again for an update. :) \r<br />\n<br />\nMy heart out to the volunteers, developers, contributers, everyone involved into the Rawr program and all it's associated belongings!<br />\n",
    "PostedDate": "2013-04-27T13:34:21.927-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1038969",
    "ThreadId": "441801",
    "Html": "Actually, RPPM is in there, however, since none of the new trinkets are in the item cache, it's doubtful that they are being correctly set up when loaded from the armory.  The item cache is actively being worked on, and I hope to be able to release a full 5.2-compatible version Soon (tm).  No promises as to time, but next week is a distinct possibility if I get enough free time to work on it.  In the meantime, you should now be able to use the Item Editor to set up the trinkets with the correct RPPM values.<br />\n",
    "PostedDate": "2013-05-03T03:47:07.067-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1039341",
    "ThreadId": "441801",
    "Html": "allright, will definetly start to make work of it and looking forward to the new version again :) <br />\n",
    "PostedDate": "2013-05-04T06:04:06.53-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1039431",
    "ThreadId": "441801",
    "Html": "Sorry if this has been explained somewhere else, but can you tell us how to set the RPPM up for trinkets? I assume its in Add Special Effect... in the Item editor, but I'm unsure of which trigger to use, and the other values as well. I have the 522 versions of Renataki's Soul Charm and Talisman of Bloodlust, and would like to set them up with their proper proc in Rawr.<br />\n",
    "PostedDate": "2013-05-04T14:51:18.21-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1039506",
    "ThreadId": "441801",
    "Html": "The Special Effect Editor is a bit complicated and I'm not sure I'm able to explain it entirely, but I can try.  Starting from the top, the box with the &quot;Add&quot; button next to it is special; start typing the name of a stat into it, and you can pick the stat that you want to add to the special effect.  Then click Add, and you can fill in the value of the stat.  The Trigger is the thing that makes the proc go off; I'm not entirely sure as to the subtleties of all the melee triggers, so I'm afraid I won't be of much use to you there; I suggest you just play with it and see what it does to the DPS value.  Duration is how long the proc lasts, Cooldown is the ICD of the proc, and in the Chance box you're going to fill in the RPPM value and select &quot;RPPM&quot; from the dropdown next to it.  Don't freak out if the number you enter disappears; it will save your value exactly as you entered it.  Stacking trinkets should set Max Stacks.  Don't worry about Spell Power or Attack Power scaling, as those are reserved for certain damage trinkets whose proc damage scales.<br />\n",
    "PostedDate": "2013-05-05T05:23:09.92-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1039548",
    "ThreadId": "441801",
    "Html": "First: Thank you a thousand times over for taking this on.  I was forced to use Mr. Robot, which still is a good tool, but not nearly as accurate as RAWR.<br />\n<br />\nI have been manually adding items for my mage build and all is good, except for the trinkets and the legendary meta.  I have added them but do not know the exact rppm value I am supposed to input for a fire mage.  The meta rppm value varies depending on class and I need a little guidance as to the value I need to input for the proc.  Any help with rppm values for all of the 5.2 trinkets would be greatly appreciated.<br />\n",
    "PostedDate": "2013-05-05T08:52:03.997-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1041537",
    "ThreadId": "441801",
    "Html": "<a href=\"http://code.google.com/p/simulationcraft/source/browse/#svn%2Ftrunk%2Fdbc_extract%2Fcache%253Fstate%253Dclosed\" rel=\"nofollow\">http://code.google.com/p/simulationcraft/source/browse/#svn%2Ftrunk%2Fdbc_extract%2Fcache%253Fstate%253Dclosed</a>\r<br />\n<br />\nthat might help you to expand your cache sources.<br />\n",
    "PostedDate": "2013-05-09T13:11:08.32-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]