[
  {
    "Id": "1040610",
    "ThreadId": "442878",
    "Html": "Hey guys, I just pushed out Rawr 5.2.0, which contains the item cache for World of Warcraft 5.2.0!  I know this release has been hotly anticipated, and in order to ensure expectations are set accordingly, I want to note some things that are not/could not be done for this release.<br />\n<ul>\n<li>\nFirst and foremost, we are having technical difficulties deploying the Silverlight version of Rawr.  I highly recommend you download and acquaint yourself with the WPF version from the Downloads page until this issue is fixed.<br />\n</li>\n<li>\nThe legendary meta gems are in, but not all of the procs will work out of the box.  This is because some of this requires development in the models, and not all models have active developers.<br />\n</li>\n<li>\nSimilarly, some trinkets will not work out of the box.  The most notable problem trinkets are Rune of Re-origination and Cha-Ye's Essence of Brilliance.  If you encounter a trinket issue, please check the version notes to see if your model has been updated to include support.<br />\n</li>\n<li>\nThe item update process brought in 3600+ items, not all of which could be reviewed manually to ensure that the item stats or drop/vendor source are correct.  I can also not guarantee that all items added in Patch 5.2 are, in fact, in the item cache.  If you discover a missing item or an item missing some stats or source data, please let me know in this thread.<br />\n</li>\n<li>\nI am trialing some code that will enable loading a character from Battle.Net to bring down your upgraded items.  This requires some work on our server side components, so if you are having trouble downloading your characters, please be patient and try again several times over the span of an hour or so.  I apologize for the inconvenience ahead of time, but it's all in the name of making Rawr more accurate for all.<br />\n</li>\n</ul>\nThanks for your patience, all, and happy Rawr-ing!<br />\n",
    "PostedDate": "2013-05-07T15:30:34.637-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1041682",
    "ThreadId": "442878",
    "Html": "I'm going to bump this up just to note that there have been 2 issues logged concerning being unable to load or optimize a character.  I've narrowed this down to the fact that there appears to exist some gear with random secondary stats that Rawr doesn't recognize, and thus refuses to accept.  We'll try to turn this issue around as soon as we can; thanks for your patience.<br />\n",
    "PostedDate": "2013-05-09T20:03:03.96-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]