[
  {
    "Id": "1042817",
    "ThreadId": "443472",
    "Html": "First of all, I tried to search the forum for this but nothing happens when I press the submit-button.\r<br />\n<br />\nI love the application, I've been using since TBC but I took a four year hiatus until last week and I'm back for now.\r<br />\n<br />\nI'm annoyed that I can't disable the &quot;variants&quot; of the gear suggested as upgrades. I've looked around quite a bit to see if there is a way to turn off the suggestions and just get the basic untampered version of a gear in the list of suggestions.\r<br />\n<br />\nIs there already and I've missed it?<br />\n",
    "PostedDate": "2013-05-13T06:50:07.213-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1043372",
    "ThreadId": "443472",
    "Html": "Why would you want to?  Rawr's purpose is to optimize your gear, and that includes gems/enchants/reforging.  If you're looking at a piece to see if it is an upgrade, I fail to see how it is helpful to see the &quot;untampered version&quot; when the first thing you're going to do is gem/enchant/reforge it.<br />\n",
    "PostedDate": "2013-05-14T06:54:05.59-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1043378",
    "ThreadId": "443472",
    "Html": "It's a personal opinion, to me it would be helpful if either the untampered version of a gear is in the listing among the top three ones or that you can turn off the tampering. Atleast when you hit 90 but still gearing up and you don't want to enchant and gem everything at once. Sure, there is a way around it, but you'll have to log out and in again, and then reload from battle.net and you get the untampered item ranked, but it's tedious if you could just either mark that you don't want tampered items in the ranking or have the untampered plus the top three tampered items.\r<br />\n<br />\nI can't call if there is anything wrong with the tampering, but for one gear rawr wants me to reforge one stat for another. say A &gt; B, but on another gear it wants me to reforge towards the stat that I removed from the first item. like this C &gt; A, and since the conversion is about 10:4 and not 1:1 it seems like a waste. I know it could be because I hit the threshold for a stat, but I doubt it, I just hit 90 and done a bunch of heroics.<br />\n",
    "PostedDate": "2013-05-14T07:08:30.237-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1043819",
    "ThreadId": "443472",
    "Html": "Because stats are dynamic, reforging one piece to one stat may cause the other stat to become &quot;better&quot; for the other piece.  It all depends on the class/spec and your gear level, which are the main determining factors in how valuable each secondary stat is.  With all that said, I understand what you want and why you want it, but there's no option to do so and given the lack of developer involvement in Rawr currently, it's not likely to be high on our priority list.  I appreciate the feedback, at least.<br />\n",
    "PostedDate": "2013-05-15T04:47:42.167-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1043836",
    "ThreadId": "443472",
    "Html": "I see, I'll just keep doing it manually.<br />\n<br />\nHowever, the optmizer doesn't seem to work for me, I tried on two different computers with the same character. When I click optimize nothing happens. the app is using 100% of one cores cpu-power (25% on a quad core) but nothing happens, no progress bar. I'm using the last stable 5.2.0 build.<br />\n<br />\nEdit: Pressing Cancel doesn't do anything. It just keeps running.<br />\n",
    "PostedDate": "2013-05-15T05:28:39.86-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1043846",
    "ThreadId": "443472",
    "Html": "This discussion has been copied to a work item. Click <a href=\"https://rawr.codeplex.com/workitem/24309\" rel=\"nofollow\">here</a> to go to the work item and continue the discussion.<br />\n",
    "PostedDate": "2013-05-15T05:45:53.16-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]