[
  {
    "Id": "147891",
    "ThreadId": "44436",
    "Html": "Is there any chance we can get a save/load option for the buffs and options tabs? When I check my moonkin I tend test with three or four different combinations of buffs and options to cover different scenarios (eg: five man groups, boss mobs in ten mans, in 25 mans etc). It'd be nice if we could save our buffs and then apply them at will rather than going through ticking the various boxes each time.<br>\r\n<br>\r\nObviously not a big thing, but it'd be nice functionality.<br>\r\n",
    "PostedDate": "2009-01-16T18:57:32-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "148136",
    "ThreadId": "44436",
    "Html": "I'll second this.  First thing I do on loading any character from the armory is go through and tick almost all buffs (in 25 mans it would be rare not to have almost everything).<br>\r\n<br>\r\n        \r\n",
    "PostedDate": "2009-01-18T14:28:19.537-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "148210",
    "ThreadId": "44436",
    "Html": "We see this desire, and have plans for helping solve it.<br>\r\n<br>\r\nFirst, we'd like to have a set of default buffs that all characters get when loading from the Armory. Not everything, but just baseline, super common buffs. Untalented Fort, MotW, Int, Replenishment, totems, BoWisdom/BoMight, etc.<br>\r\n<br>\r\nSecond, we'd like to have save/loadable buff sets, just like we have for talent specs.<br>\r\n<br>\r\nBoth those things are planned, but they won't be in the next version.<br>\r\n",
    "PostedDate": "2009-01-18T21:55:42.55-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "258886",
    "ThreadId": "44436",
    "Html": "<p>*Really big bump* (There is a more recent thread that <em>mentions</em> this feature, but this thread is <em>specifically about</em> it. Hope bumping this is okay.)</p>\r\n<p>Has any more work been done on this &quot;Saved Buff Sets&quot; feature? I would absolutely love a feature to configure buffs in a faster manner. It gets very confusing when you have several possible groups you could be in.</p>\r\n<p>According to the discussion in http://rawr.codeplex.com/Thread/View.aspx?ThreadId=63114 there's a sample already in the codebase. is there a way I can turn it on so I can evaluate it? (I can easily compile my own version or Rawr if needed) If you want feedback on the UI before going live with it, I would be more than happy to give it a thorough run-around and get back to you with a detailed report about what I think could be done to improve it if necessary. :)</p>",
    "PostedDate": "2009-11-19T16:15:14.557-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]