[
  {
    "Id": "148047",
    "ThreadId": "44483",
    "Html": "<p style=\"margin-right:0px\" dir=ltr>Hello.<br>\r\n<br>\r\nI just downloaded and extracted Rawr 2.1.6. I noticed on other threads in the discussion forums that updating from US armory is currently bugged/broken, so I went to update from wowhead.<br>\r\n<br>\r\nOn item 6077 of 13686 I get an error popup that says:<br>\r\n<br>\r\n    &quot;Error processing request: Input string was not in the correct format.&quot;<br>\r\n<br>\r\nThe only option is to hit &quot;Okay&quot;, which terminates the update from wowhead.<br>\r\n<br>\r\nI get this error using all 3 client types (Firefox 2, IE 6, IE 7) and from any number of conccurent connections (from 5 to 10).<br>\r\n<br>\r\nAny help would be appreciated.</p>\r\n",
    "PostedDate": "2009-01-18T00:57:47.213-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "148208",
    "ThreadId": "44483",
    "Html": "That item is broken for Wowhead updates; that'll be fixed in the next version. <br>\r\n<br>\r\nIn the mean time, I could use some feedback on that feature in general... I often see people say that they just download a new version, and immediately do a full refresh of the data, such as you. Can you (or anyone else reading this) explain why you do this? There's nothing wrong with doing it, but there's also no need to do it. What indicates to you that you should do this? What do you think/expect that it will do for you? What benefit do you perceive comes from it? Did anyone or anything you read suggest that you do it, and if so, where was this?<br>\r\n<br>\r\nBasically, there should be no reason to do full data refreshes like that, <em>especially</em> right after downloading a new version. I'm guessing there's some misconception of what it does, or perhaps some errant documentation or blog or forum post mistakenly tells you to, or something. I'm thinking of adding a confirmation dialog to it, that explains what it does, and stresses that you should almost never need to do it. And of course, if there anywhere that tells you do this, I'd like to get that fixed.<br>\r\n<br>\r\nThanks for any help anyone can offer on this.<br>\r\n",
    "PostedDate": "2009-01-18T21:50:01.693-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "148239",
    "ThreadId": "44483",
    "Html": "The only reason I've done it is to make sure I have updated information on all the items in the database.<br>\r\n<br>\r\nThis has recently been the case on cloaks, but there is no easy way to update the cache of all the cloaks to reflect the bonus armor.&nbsp; I would have guessed that you would have updated the cache to the latest in each of the builds so that we wouldn't have too unless something changes with the items between releases.&nbsp; If 2.1.6 has had its item cache updated for all the bonus armor items then it doesn't need to be done, but I don't know if it has or not and therefore I run it to be sure.&nbsp; So perhaps make a note in the patch notes saying that the cache has been updated.<br>\r\n<br>\r\nOtherwise if the scan encounters a problem with an item why not make a note of the item, skip it and move on to the rest rather than being fatal.<br>\r\n",
    "PostedDate": "2009-01-19T00:55:44.987-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "148402",
    "ThreadId": "44483",
    "Html": "Indeed, the data is always updated right before each release (apart from that one bug a few versions ago with the pre-WotLK cloaks). And yes, errors in this process won't be fatal anymore.<br>\r\n",
    "PostedDate": "2009-01-19T09:21:50.27-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "148533",
    "ThreadId": "44483",
    "Html": "I found this error when I was trying to update the cache as well.  The reason I was updating the cache is because I noticed that the Valorous items were not showing up for the DPSDK model.  A friend of mine asked me on vent to do a quick lookup for him on Rawr to see which legs were better when his tier pants dropped and I noticed that the pants were not on Rawr at all.  For example you can load the character Kitasawa from the server Laughing Skull and you will notice that the only tier pieces that show up are the pieces that he is wearing.  Is there a reason that these particular items are not showing up?  That was another reason I was attempting to update the cache because I thought if these items were missing what other items may be missing.\r\n",
    "PostedDate": "2009-01-19T14:57:45.6-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "148538",
    "ThreadId": "44483",
    "Html": "Do people expect Update Item Cache from Wowhead/Armory to add new items? (It doesn't, never has, never will, it just updates)<br>\r\n<br>\r\n<br>\r\n",
    "PostedDate": "2009-01-19T15:24:21.48-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "148583",
    "ThreadId": "44483",
    "Html": "I'm sorry if I wasn't clear enough in my original post.<br>\r\n<br>\r\nI had done the &quot;Get updates from Armory&quot; option, and it broke a bunch of my socket bonuses.<br>\r\n<br>\r\nThen I read about the bug with US armory and the suggestion to fix this was to update from wowhead.\r\n",
    "PostedDate": "2009-01-19T20:49:02.753-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "148586",
    "ThreadId": "44483",
    "Html": "That's what this post is about. It's called &quot;Update Item Cache from the Armory&quot; / &quot;Update Item Cache from Wowhead&quot;.<br>\r\n<br>\r\nWe understand why you used the Wowhead one instead of the Armory one, but we're wondering why you wanted to use either of them at all.<br>\r\n",
    "PostedDate": "2009-01-19T20:57:24.587-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "148589",
    "ThreadId": "44483",
    "Html": "I meant specifically, I was using the &quot;Load Possible Upgrades From Armory&quot;.<br>\r\n<br>\r\nI used that after loading my character and setting my buffs.<br>\r\n<br>\r\nI guess I had the assumption that it would do something useful. I wasn't able to find a way to just view the specific upgrades that armory suggested.<br>\r\n<br>\r\nThen I got one of those upgrades. The socket bonus was listed as &quot;None&quot;, but in game it was +6 Hit Rating.<br>\r\n<br>\r\nRead about socket bonuses being broken. Follow the suggestion to update from wowhead to fix sockets. I didn't want to go one-by-one from armory to the program since I didn't know how to get a specific listing of just the upgrades, so I did &quot;all&quot;.<br>\r\n<br>\r\nAnd that puts us here.\r\n",
    "PostedDate": "2009-01-19T21:11:44.787-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "148613",
    "ThreadId": "44483",
    "Html": "Ohhhh, I see. I didn't realize that you were trying to use the update from wowhead to fix the bad upgrades from armory. That makes total sense. Still, the situation I described is common, and I'd love to hear from more users about that.<br>\r\n<br>\r\n",
    "PostedDate": "2009-01-19T23:29:24.833-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "148645",
    "ThreadId": "44483",
    "Html": "I indeed was expecting that &quot;updating the item cache&quot; would add new items, should any be discovered in the process.<div><br></div><div>That may be because English is not my native language though.</div><div><br></div><div>Now I seldom use that feature, if at all because how long it takes. I used it once if I recall correctly to try and update cloak armor, and it broke mi-process.</div><div><br></div><div>May I suggest that this updating process might be launched in a separate background thread, at least optionally? That way, we could go on using Rawr in the meantime. Also, it would be nice to be able to interrupt and resume later.</div><div><br></div>",
    "PostedDate": "2009-01-20T01:26:46.68-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "148767",
    "ThreadId": "44483",
    "Html": "I never do batch updates, but until I read this thread I had no idea that they were incapable of adding previously unknown items to the ItemCache.<br>\r\n<br>\r\nSo yes, you could say that I expected that functionality.&nbsp; I do not, however, need it...<br>\r\n",
    "PostedDate": "2009-01-20T08:39:04.503-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "149146",
    "ThreadId": "44483",
    "Html": "I do full refreshes because even out of the box, it seems like the data is incomplete. I know you do an update before you post it up (this release notwithstanding), but there are plenty of items that come up with &quot;Not found on armory&quot; and generic &quot;Crafted 11(0)&quot; messages that prevent me from using the filters, and I can't take the time to right-click all of them for updates.<br>\r\n<br>\r\nI would love an option that would only update items of these types (or ones with no acquisition data whatsoever) rather than try and update the entirety of known items. Also, perhaps an option to update from one site, but if an error (or no/useless data) is returned by it, automatically try and grab info from the other site as a fallback.<br>\r\n",
    "PostedDate": "2009-01-21T03:12:02.597-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "149307",
    "ThreadId": "44483",
    "Html": "I was also expecting it to be able to add new items from the &quot;Update Cache&quot; options.&nbsp; Somehow my itemcache got corrupted and it wouldn't load any items, so instead of just re-downloading here (Which probably would have been faster anyway, but that's a moot point), I tried to update the cache from wowhead, but the only items it updated were the few items it had created in it's new cache from my imported character.<br>\r\n<br>\r\nI'm kinda surprised there isn't an option to get new items from wowhead.&nbsp; Couldn't you put in an algorithm that would do several search-by-slots and then parse out the stats and stick those onto items.&nbsp; And then maybe give a warning message for any ones that failed at&nbsp; the end, with a link to the wowhead item so a user could go check which items may have been missed?&nbsp; I think this would be a useful feature :)<br>\r\n",
    "PostedDate": "2009-01-21T08:54:43.917-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "149381",
    "ThreadId": "44483",
    "Html": "I've put in a confirmation box that explains in more detail what Update Item Cache does (and that it does not add new items).<br>\r\n<br>\r\nTechnically, we could indeed add support for mass adding new items from Wowhead, but that really isn't worth it, or as helpful as you may think.<br>\r\n<br>\r\nAs long as there's a solid foundation (ie, a mostly complete default itemcache, which you can easily replace if you somehow delete/corrupt yours), the only item additions needed should be specific items, which you can very easily add individually. When there are several new items added, the Load Upgrades from Armory feature works great for getting those. As long as each piece of this system is functioning, there's really no need for a mass insert of items from Wowhead.<br>\r\n<br>\r\nOf course, that system falls down on patch days, but 99% of the time it works quite well. We're really not interested in taking the time to develop a feature that would only be used 1% of the time.<br>\r\n",
    "PostedDate": "2009-01-21T11:19:58.93-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]