[
  {
    "Id": "148605",
    "ThreadId": "44636",
    "Html": "Hi:<br>\r\n<br>\r\nI know the patch is probably coming out tomorrow but I still wanted to ask, is it possible to somehow update the itemcache file from the PTR without having to manually update every item manually?<br>\r\n<br>\r\nI could delete/empty the itemcache file and then load my character from Character Profile but that still leaves out the items my character doesnt own (new gems, new or modified reward weapons, etc).<br>\r\n<br>\r\nIs there some way to import or transfer the info from &lt;Game Folder&gt;/cache/WDB/enUS/itemcache.wdb to Rawr even if it involves third party programs? \r\n",
    "PostedDate": "2009-01-19T22:54:55.23-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "148614",
    "ThreadId": "44636",
    "Html": "No. Rawr relies on Wowhead and Armory to get its data. Once they have updated data, you can use Tools &gt; Update Item Cache from Armory/Wowhead.<br>\r\n",
    "PostedDate": "2009-01-19T23:30:52.207-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "148633",
    "ThreadId": "44636",
    "Html": "Thanks for your promptly reply Astrylian. I am aware of the option to update data from Armory/Wowhead but I was curious if there was some way to update the item data with info from the PTR to try and foresee how my character is going to be affected and what items to add/remove to my wish/complementary list, you know, a way to see changes before the patches actually came out and be better prepared.<br>\r\n",
    "PostedDate": "2009-01-20T00:50:31.753-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "148634",
    "ThreadId": "44636",
    "Html": "Usually, Wowhead updates data as it's discovered on the PTR, but for some reason, they didn't for this patch. We're not sure why, and we hope they update very soon.<br>\r\n",
    "PostedDate": "2009-01-20T00:54:57.957-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "148696",
    "ThreadId": "44636",
    "Html": "I noticed they did add new items as it was being discovered (ex. http://www.wowhead.com/?item=44935 ).<br>\r\n<br>\r\nHow would you handle items that keep the same item number and only the stats change? (ex. Handwraps of Preserved History) unless they temporarily create a PTR/Beta/Test copy of their website like they did for WotLK. And even if they did that, how would you 'convince' Rawr to retrieve the info from this site instead of the normal one? <br>\r\n<br>\r\nYou understand what I'm trying to accomplish? I would just want to have another copy of Rawr on my hard drive which has info from the PTR/Beta instead of the live version. Maybe I should try to modify Character Profiler to create a 'fake' save of my toon with every single item it sees regardless if I have it on my bags or not.<br>\r\n<br>\r\nOf course this is useless now that patch 3.0.8 is just a few hours away from being released but the situation would repeat itself next patch.<br>\r\n",
    "PostedDate": "2009-01-20T04:51:42.137-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]