[
  {
    "Id": "150352",
    "ThreadId": "45092",
    "Html": "Figure maybe one thread might be good to temp fix this for people.<br>\r\n<br>\r\nI noticed a thread on Illustration of the Dragon soul already.&nbsp; To fix this edit it and change spell power to 200 in the spell combat ratings in the Edit Items gui.<br>\r\n<br>\r\nAlso noticed Forge Ember missing the 10s 512 spell power.&nbsp; Update the 10s Spell Power in the Equipment procs section.<br>\r\n<br>\r\nFeel free to add any others you found.<br>\r\n",
    "PostedDate": "2009-01-23T11:34:47.937-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "150376",
    "ThreadId": "45092",
    "Html": "This isn't really the place to compile &quot;issues found&quot; or anything like that eh.<br>\r\n",
    "PostedDate": "2009-01-23T12:34:36.593-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "150388",
    "ThreadId": "45092",
    "Html": "No, this is fine to discuss here.<br>\r\n<br>\r\nKavan's done a sweep of all the ilvl200 trinkets and made sure they were either working, or are some odd proc that we don't support yet. That'll be in the next version.<br>\r\n",
    "PostedDate": "2009-01-23T13:08:00.537-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "150391",
    "ThreadId": "45092",
    "Html": "One of the lower level trinkets (that's surprisingly good) that needs a fix is Thunder Capacitor.\r\n",
    "PostedDate": "2009-01-23T13:13:44.987-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "150544",
    "ThreadId": "45092",
    "Html": "I really like this program but I am not sure how to get the a comlete gem list back or at minimum all ofthe WotlK ones.&nbsp; Right now when I tell the program to download possible upgrades It will not give me the option of getting the other gems also.&nbsp; I know there are different gear requirements between Arcane and Frostfire specs as well but this is not shown very well on your mage model for some reason it does not show this.&nbsp; This was and still is a hot topic on http://elitistjerks.com/&nbsp; and on many forums.&nbsp; The are many debates on mana expenses, damage per mana expense and the importance factor of haste vs crit as a arcane spec.&nbsp; Frostfire bolt specs from my experience tend to favor crit because they want to get the Hotstreak talent to proc more and they have master of elements to refund back their mana.&nbsp; The Frostfire spec also uses the gems differently since you can get the buff &quot;Mana Surge&quot; for the gems they primarily use it for the 2 set bonus buff.&nbsp; Mana expenses tend to be less drastic on the Frostfire bolt spec due to the mana cost per amount of damage of a Frostfire bolt being inheriantly low in comparison to the other spells or specced counterparts of the mage spells that can be casted. The arcane tree does not provide a mechanic like this.&nbsp; The arcane spec seems to be less conservation with the mentality of &quot;This is what you got for a mana pool w/ evos. and gems spend it wisely.&quot;&nbsp; Spirit still does nothing for a mage IMO because it can not be converted into spell power, spell crit or haste.&nbsp; You would have to be outside the FSR to get the mana regen from spirit which means no DPS.&nbsp; A mage not casting for more than 5 seconds during a fight is a mage not doing its' job therefore the spirit equates to nothing.&nbsp; To my understanding it takes 8 spirit to make 1 MP5 outside of the FSR even with the 30% mana regen talent from the arcane tree.&nbsp; That means 8 spirit = 1 MP5 so in order to get 100 MP5 we multiply 8*100= 800 spirit.&nbsp; That MP5 is only good during the five second rule unless you look at the talent which gives you 30% MP5 which makes this talent pure crap unless I am missing something here.&nbsp; So I have deducted that MP5 for a Arcane mage is important and spirit is useless where as neither one of them mean anything to a Frostfirebolt mage in a properly assembled 25 man raid.&nbsp; I am only pointing this out because there is a difference in the gear requirements between the two specs and this has to be accounted for in some way when trying to plan gear for an arcane mage.&nbsp; <br>\r\n",
    "PostedDate": "2009-01-24T10:01:10.943-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "150606",
    "ThreadId": "45092",
    "Html": "Pyrogenics: That's impressive. That's an incredible amount of stupid to condense into one post. <br>\r\n<br>\r\nRawr already handles everything you mention, and handles them correctly. You might want to look into basic mage mechanics on EJ. If you've deleted your gemmings or something in Rawr, revert to the default ItemCache.<br>\r\n",
    "PostedDate": "2009-01-24T16:43:29.313-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "150787",
    "ThreadId": "45092",
    "Html": "I am not trying to be difficult nor am I trying to be insulting by any\r\nmeans.&nbsp; I am basing my information of the new posts listed <br>\r\n<br>\r\n<a href=\"http://elitistjerks.com/f75/t30655-wotlk_mage_talent_ability_guide_3_0_8_part_two/\">http://elitistjerks.com/f75/t30655-wotlk_mage_talent_ability_guide_3_0_8_part_two/</a><br>\r\n<br>\r\nand a few other sources. <br>\r\n<br>\r\nLike I had said in my original posting &quot;unless I am missing something\r\nhere&quot; instead of insulting me why not tell me what I am missing.&nbsp; I\r\ncomplimented you on your work and pointed out some of the things from\r\nthe other forums, patch notes and personal experience that didn't seem to match.&nbsp; I am not here to get an E-Peen nor do I deserve to get this bullshit.&nbsp; I am trying to learn how your software works and find out if I truly am missing something.&nbsp; If there is any misinformation from the reliable source I depicted in this post or the earlier post can you please clarify it? So if people should have questions about the software or mechanics instead of flaming them while you stroke your E-Peen maybe you should actually try an help people.&nbsp; Isn't that the whole purpose of this project and the software you are writing?&nbsp; If you are not out to help people why even waste your time writing the software?<br>\r\nWhy make it available for public download?&nbsp; So if I should notice something that does not seem to make sense and ask for some justification or some clarification whether it's your software or the very same mage mechanics your software is supposed to crunch it's relevant and should get a legitimate answer, instead of getting flamed from someone acting like a self righteous douche.&nbsp; It's not like I came to you empty handed or didn't consult some of the mages on my sever first.&nbsp; Normally when people go to software forums looking for answers to questions they get them without all of the bullshit.&nbsp; I am sorry for making the assumption I was either going\r\nto get some answers or some kind of insight from the forums of the very same program crunching numbers to mechanics of the very same class I was having questions with.&nbsp; I am also sorry for wasting everyone's time . <br>\r\n<br>\r\nHave a nice day.<br>\r\n<br>\r\n<br>\r\n",
    "PostedDate": "2009-01-25T17:26:37.047-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "150788",
    "ThreadId": "45092",
    "Html": "I don't even know where to start reading in your blocks of text. I don't see a point in it, it's just a long stretch of text with nothing specific in it. To point one thing that you're missing, spirit does have a value, arcane specs are able to convert extra mana into more damage. If you really want to learn how the sofware works there's plenty to read here in the wiki and in the Rawr.Mage thread on EJ forums. If there's anything specific you don't understand go ahead and ask, but please for the sake of my time make it to the point.\r\n",
    "PostedDate": "2009-01-25T17:41:50.37-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "151068",
    "ThreadId": "45092",
    "Html": "Sorry to jump in here too, but Pyrogenics seems to be confused as to how Rawr works.<br>\r\n<br>\r\nIf you want to see what gear changes rawr would suggest based on a different talent spec, put that talent spec into the application (with glyphs &amp; other appropriate options), and make it do a gear optimization for you.&nbsp; I noticed a drastic change in &quot;top-notch&quot; gear requirements between a few different specs after doing just this.<br>\r\n<br>\r\nBut like Astrylian and Kavan said, please give us fewer blocks of text, and get to the point in a concise manner (It's hard to tell what you're even asking in the first post, and your second post doesn't appear to have anything of relevance at all).<br>\r\n",
    "PostedDate": "2009-01-26T12:27:56.317-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "151071",
    "ThreadId": "45092",
    "Html": "I vote that we do not call people or their opinions stupid on this forum, this isn't a popularity contest thottbot or slashdot: it's a developer's community.  If you believe a post is uninformed then either ignore it or clarify the issue to the poster.<br>\r\n<br>\r\nAnd to toss a &quot;me too&quot; in there, I'd say that regardless of the length of Pyro's text, adding a few line breaks and/or bullet points will immediately increase the post's readability and make people feel less aggressive towards them.<br>\r\n<br>\r\nChar<br>\r\n",
    "PostedDate": "2009-01-26T12:40:38.403-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "151432",
    "ThreadId": "45092",
    "Html": "What happened with Mirror of Truth Trinket proc value? In v2.1.7 it was listed as close to best in slot for cat dps trinket, with the AP proc factored in.  But in v2.1.8 it is near the bottom of the list, showing only crit value.  Please let me know if this is being fixed or if v2.1.7 was putting an incorrect valuation on the proc.\r\n",
    "PostedDate": "2009-01-27T10:16:50.703-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "151473",
    "ThreadId": "45092",
    "Html": "@baldeagle:&nbsp; Astrylian has pointed out in other threads that the tooltip is bugged, and this reduces Rawr's calculations.&nbsp; I went to an old Rawr version and manually input the AP into 2.18.&nbsp;&nbsp; Right-click on the Mirror of Truth, hit Edit, then input 166.666672 in Attack Power, under &quot;Base Stats&quot;<br>\r\n",
    "PostedDate": "2009-01-27T11:48:41.037-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "151601",
    "ThreadId": "45092",
    "Html": "Thanks for the info, very much appreciate it.\r\n",
    "PostedDate": "2009-01-27T20:00:40.58-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "152007",
    "ThreadId": "45092",
    "Html": "Most of the trinkets effects are missing, if it's not the trinket itself that's missing (Fury of Five Flights doesn't appear, but earlier in this topic all trinkets are supposed to be supported for next version, I'm looking forward it.<br>\r\n<br>\r\nPS : I've manually added 74 haste rating as part of the Meteorite Whetstone proc, and Rawr ranks it a bit higher than a 90 str/90 agi darkmoon card on my character !?\r\n",
    "PostedDate": "2009-01-28T17:40:29.89-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "154474",
    "ThreadId": "45092",
    "Html": "I still do not see a positive difference with the spirit in the items as a mage trying to go all out on a target.&nbsp;&nbsp; A good example of this would be a typical patchwork fight in Naxx while participating in a properly assembled raid.&nbsp; I normally run with plenty of paladins, a couple of shadow priests, a couple of shaman and a boomkin once in a while.&nbsp; According to Kavan&nbsp; &quot;To point one thing that you're missing, spirit does have a value, arcane specs are able to convert extra mana into more damage.&quot;&nbsp; I would like to cite <a href=\"http://www.wowwiki.com/Mana_regeneration\">http://www.wowwiki.com/Mana_regeneration&nbsp; </a>.&nbsp; Please look at the 5 second rule and also understand if a mage is going all out on something it will be using molten armor for the critical spell hit rating and not mage armor.&nbsp; The idea is we want the targets dead yesterday not gradually or have to deal with enrage timers during a confrontation.&nbsp; <br>\r\n<br>\r\nThe best way for me to put this metaphorically is a sports car and its engine are not what propels the car neither is the gas that you put in the sports car.&nbsp; The energy comes from using the car's ability from its' engine to convert the gas that you put into the car to propel that car forward. Neither the gas by itself nor the car and its engine by itself can propel the car forward. The same holds true for the mage.&nbsp; I think of the mana as &quot;Chemical potential energy&quot; as defined in <a href=\"http://en.wikipedia.org/wiki/Potential_energy\">http://en.wikipedia.org/wiki/Potential_energy</a>&nbsp; so it has not met its' potential until a spell has been casted and its' potential just like the car metaphor is based on the characters' attributes.&nbsp; This is why the damage per mana is not the same from one character to the next.<br>\r\n<br>\r\n<ul>\r\n    <li>I still don't see the significance of spirit can you please send me a\r\n    link to a reliable resource or a blue posting denoting that spirit will\r\n    increase my damage, critical strike rating or my spell haste rating\r\n    directly as a mage? </li>\r\n    <li>Can you site somewhere that my line of thinking is wrong from a blue post or a proven mathematical calculation when applying it to a mage?&nbsp; </li>\r\n    <li>Is there any legit posting from Blizzard or anyone credible that will put <strong>Spirit</strong> before <strong>Spell hit rating</strong> ( <em>provided you are not hit capped</em>) , <strong>Spell Damage</strong>, <strong>Spell Critical Strike Rating</strong>, <strong>Spell Haste Rating</strong> or <strong>Intellect</strong> as a direct method of producing damage as a mage?</li>\r\n    <li>Does your program currently support my line of thinking? </li>\r\n</ul>\r\n",
    "PostedDate": "2009-02-04T16:03:15.85-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "154484",
    "ThreadId": "45092",
    "Html": "...Are you serious, Pyrogenics, or is this an elaborate troll? <br>\r\n<br>\r\nhttp://www.wowhead.com/?spell=18464<br>\r\n<br>\r\nArc mages (and any other mages that can't use their highest DPS rotation for the full duration of the fight; ie, go OOM), can convert extra mana into more damage. <br>\r\n<br>\r\n<br>\r\nDebating complex theorycraft is one thing... Trying to teach Kavan about the 5 Second Rule is another.<br>\r\n",
    "PostedDate": "2009-02-04T16:48:48.193-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]