[
  {
    "Id": "151134",
    "ThreadId": "45329",
    "Html": "I'm checking out my resto gear for the pending dual spec function being added.<br>\r\n<br>\r\nHow does the restodruid priorities work with 2H vs MH+OH.<br>\r\n<br>\r\npointwise my blue main hand gavel of the fleshcrafter together with my scepter of the murmuring spirits add up to around 660p if you manually add it together, and my staff alone charmed cierge has 620p. but it's ranked higher on the main hand chart. Does this mean that it would be better than the blue main hand alone, or both the mh+oh together vs the staff? or do you actually count the points to get a real ranking?<br>\r\n<br>\r\nhere's my xml<br>\r\nhttp://wow.creepwood.net/moofootree.xml<br>\r\n<br>\r\n",
    "PostedDate": "2009-01-26T16:42:48.883-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "151136",
    "ThreadId": "45329",
    "Html": "Select the OH in the OH slot. Then look at the MH chart. Staves will be valued by themselves, MHs will be valued as themselves with the OH.<br>\r\n",
    "PostedDate": "2009-01-26T16:50:44.443-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "151524",
    "ThreadId": "45329",
    "Html": "Oh wow, good to know, I was not aware of that feature. Great work!\r\n",
    "PostedDate": "2009-01-27T14:13:58.447-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "151565",
    "ThreadId": "45329",
    "Html": "At the risk of being completely flamed, one option is to treat OH items as gems.<br>\r\n<br>\r\nSo just like you have a dropdown list of items with different gemming combinations, you could have an MH with different OH combinations.  This would allow you to directly compare 2H and MH + OH items from the one Main Hand screen/drop down.<br>\r\n<br>\r\nOfc it means polluting the MH list with combinations of MH + OH items (potentially with different gemmings).<br>\r\n<br>\r\nChar<br>\r\n",
    "PostedDate": "2009-01-27T16:32:14.443-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "151851",
    "ThreadId": "45329",
    "Html": "No, I think the way it currently works, works quite well. There's always the Optimizer too, to try every possible combination.<br>\r\n",
    "PostedDate": "2009-01-28T09:27:02.943-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "151995",
    "ThreadId": "45329",
    "Html": "Well, yes, it works well, but it could work better.  If the optimizer does a perfect job each time, then I have no concerns.  Otoh, if you're trying to compare Weap 1 + OH 1, Weap 2 + OH 2, and Weap 3 + no OH, there's a number of manual steps that need to be made.<br>\r\n<br>\r\nYou can select OH 1 and easily see how Weap 1 + OH 1 compares to Weap 3 with no OH, but you don't get to immediately appreciate the relative values of different weapon &amp; OH combinations.  If OH 1 was strictly better than OH 2, then we just remove OH 2 from the equation.  But in some cases one OH may be better given one weapon than another.<br>\r\n<br>\r\nThat being said, I don't think I'd prioritize such a feature very highly.<br>\r\n<br>\r\nChar\r\n",
    "PostedDate": "2009-01-28T16:46:23.333-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "152010",
    "ThreadId": "45329",
    "Html": "&quot;If the optimizer does a perfect job each time, then I have no concerns.&quot; It does, as far as what you're suggesting.<br>\r\n",
    "PostedDate": "2009-01-28T17:53:07.23-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "152019",
    "ThreadId": "45329",
    "Html": "The optimizer is a heuristic, a starting point IMHO.  Not a finish.  For instance, it is telling me to equip to &quot;On Use&quot; trinkets to maximize my damage.  While I'm 100% sure it's correct, I know that my playing style is such that I don't always pop BOTH trinkets when I need them.  In fact, many times I don't even pop any trinket because I am saving it for a key part of a fight.<br>\r\n<br>\r\nSo I start with the optimizer and then make manual adjustments.<br>\r\n<br>\r\nThis suggestion was a suggestion to make manual adjustments easier.<br>\r\n<br>\r\nChar<br>\r\n",
    "PostedDate": "2009-01-28T18:14:16.417-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]