[
  {
    "Id": "152247",
    "ThreadId": "45626",
    "Html": "So the last time I played a mage, I made my own spreadsheet to evaluate gear. I've just hit 80 with my mage and switched to it as my main for raiding, and I decided to try out Rawr, but the numbers look like they are way off, rendering the program useless for my needs. Example:<br>\r\n<br>\r\nRawr values Reanimator's Cloak (60 SP with socket and 35 int, 37 stam, 38 spirit) higher than Shroud of the Citadel (58 SP, 25 haste, 38 crit, 36 int, 42 stam)<br>\r\n<br>\r\nThis just seems insane to me. How is Rawr actually valuing 38 spirit and 2 SP as more than 38 crit, 25 haste, 1 int and 5 stam? How can that be justified? <br>\r\n<br>\r\nAlso, Rawr is valuing Insightful Earthsiege Diamond, which produces very little damage as the highest valued Meta gem. How can this be? I don't want mana regen, I want damage!!!<br>\r\n<br>\r\nI could list more examples, but really it just seems like these enough to highlight the problem I'm seeing here.<br>\r\n<br>\r\nNote that since I've updated my gear, Shroud passed Reanimator's, but it's just barely and there is simply no point at which Reanimator's should ever be higher valued. \r\n",
    "PostedDate": "2009-01-29T10:11:36.03-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "152250",
    "ThreadId": "45626",
    "Html": "Rawr.Mage is accurate.<br>\r\n<br>\r\nSounds like you're going OOM, hard. I'd suggest making sure you have buffs and fight parameters set correctly.<br>\r\n",
    "PostedDate": "2009-01-29T10:21:52.617-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "152254",
    "ThreadId": "45626",
    "Html": "Rawr.Mage models your entire fight including mana useage. Running out of mana means you produce 0 DPS which then makes mana regen worthwhile. There are several options to model the fight better. Many buffs increase your mana regen, make sure you check the buff tab, reducing the fight length means you need less mana check the options-&gt;fight tab, if you really don't care about mana useage at all then there's the last ditch Unlimited Mana button at the bottom of that fight tab.<br>\r\n<br>\r\nHoly<br>\r\n",
    "PostedDate": "2009-01-29T10:42:34.85-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "152255",
    "ThreadId": "45626",
    "Html": "I'm not going OOM at all, but I do see that including all my buffs makes things a lot different. OTOH, even taking that into account, I really don't want Rawr telling me about mana, just about DPS. I can worry about mana on my own if I'm running out too often, same as I have to do with stam if I'm dying too often.\r\n",
    "PostedDate": "2009-01-29T10:42:41.077-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "152256",
    "ThreadId": "45626",
    "Html": "Ok Holymist, cool, thanks.\r\n",
    "PostedDate": "2009-01-29T10:43:47.65-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "152261",
    "ThreadId": "45626",
    "Html": "It's not a matter of 'not worrying about mana'. Mana IS dps. For some specs, more than others. Unlimited Mana means you're going to get wildly wrong results in some cases. You should just actually fill out the data, it's not hard.<br>\r\n",
    "PostedDate": "2009-01-29T10:50:16.243-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "152276",
    "ThreadId": "45626",
    "Html": "If you setup your typical fight parameters correctly, rawr is *extremely* accurate.&nbsp; I know when I first hit 80 on my Mage, I did 2 heroics, then went straight into a 25-man raid followed by some 10's, and since this was right at launch, I *was definately* running oom on many of the fights.`However now that I have a more sizeable mana pool, and I put in the raid buffs I get in typical raids into rawr, the application is showing me exactly what gear upgrades I should be shooting for.<br>\r\n<br>\r\nIt also appears to be frighteningly accurate in terms of my average DPS.&nbsp; It tells me I should be doing 5400 DPS on a straight-up shoot-him fight like patchwerk for 3 minutes?&nbsp; Well by golly, I do 5300-5500 DPS on that fight.&nbsp; Very accurate indeed.&nbsp; Mana = Damage, for certain specs more than others, but if it's telling you you're going to run oom based on the fight parameters you set, then you are probably going to run oom on a fight that matches that, sorry that's just how it is!<br>\r\n<br>\r\nEdit to add:&nbsp; It already assumes you evoc at ideal times, you pop mana gems&nbsp; and mana potions etc.&nbsp; So you &quot;worrying about mana&quot; yourself and getting more mana yourself won't fix the situation, you will still run oom if rawr says you're going to run oom.&nbsp; Period.&nbsp; (It even has an option for quantities of innervates you get etc)<br>\r\n",
    "PostedDate": "2009-01-29T11:34:34.723-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]