[
  {
    "Id": "152359",
    "ThreadId": "45651",
    "Html": "I'm using a friend's druid:<div>Metrobull</div><div>Detheroc</div><div>to look at some of the ways rawr bear works, and I came across this interesting issue which I'm hoping someone can help me understand. The character is a feral druid with no buffs or any options changed, standard 2.1.8 rawr bear druid form. </div><div><br></div><div>The issue I'm getting is that while looking at the relative stat value page, it seems that by equipping the two high dodge rating trinkets from badges, (maybe 3% increase in dodge) I find that the relative stat value for dodge increases from 33.78 with no dodge trinkets then up to 35.17 with the two dodge trinkets equipped. I find that as I equip more stamina, defense, etc., these values increase in a similar fashion. However, this seems to be opposite of what the relative stat value should be showing. It seems that as I get more and more dodge rating, I should be getting more diminishing returns, and the next couple points of dodge should be worth a lot less because 15 dodge rating at 0% dodge gives a lot more avoidance than 15 dodge rating at 50% dodge.</div><div><br></div><div>So I see this as three possibilities.</div><div>1) its not working as intended. if so plz fix it!!</div><div><br></div><div>2) my understanding of the relative stat value display is incorrect. it seems to me that the relative stat value page would display the value rawr is assigning to stats when examining alternative gear to compare against your current gear set. However, I understand that it could mean something else entirely, perhaps relative stat value displays some sort of summary of what your gear currently is giving, rather than what you should look for in upgrades. If this is the case please let me know!</div><div><br></div><div>3) my understanding of tanking itemization is incorrect. maybe its better to try to stack the stat you have the most of? heh seems like its usually best to be as well rounded as possible, but i would trust you guys if you said otherwise since you definitely have a lot more experience in bear tanking :). If i'm wrong about thinking that stacking dodge gets better as u get closer to the dodge cap, let me know about that too!</div><div><br></div><div>If someone else could check this out and help me figure out whether or not the problem is with me or with rawr, I would be much appreciative! </div><div><br></div><div>Thanks for the help in advance! :)</div>",
    "PostedDate": "2009-01-29T16:15:42.793-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "152369",
    "ThreadId": "45651",
    "Html": "#3.<br>\r\n<br>\r\nThere is indeed diminishing returns on various types of avoidance, however despite those diminishing returns, the value of avoidance still scales up with avoidance.<br>\r\n<br>\r\nThink of it this way. Going from 0 to 10% dodge reduces the damage you take by 10%.  Going from 50% to 60% dodge reduces the damage you take by 20%. Diminishing returns counteracts that, but it doesn't completely negate it. It still increases, albiet slowly (instead of incredibly fast like it was in BC). If X rating gives you 10% dodge at 0%, X rating may give you 5.5% dodge at 50% dodge. 0% to 10% is 10% less damage taken, 50% to 55.5% is 11% less damage taken. 11% is still better than 10%.<br>\r\n",
    "PostedDate": "2009-01-29T16:48:32.24-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "152424",
    "ThreadId": "45651",
    "Html": "<div>Thank you for the speedy response!</div><div><br></div>I think I understand what you're saying, but I'm not quite sure thats right, I dont think we can use percentages of percentages in that way.<div><br></div><div>Consider we have a fight that last exactly 100 hits each hit doing 1 damage.</div><div>if we have 0% dodge, we get hit 100 times for 100 damage total</div><div>if we have 10% dodge we get hit 90 times for 90 damage total</div><div><br></div><div>upgrading 0 -&gt; 10% dodge gives us a 10 damage reduced upgrade.</div><div><br></div><div>if we have 50% dodge we get hit 50 times for 50 damage total</div><div>if we have 60% dodge we get hit 40 times for 40 damage total</div><div><br></div><div>upgrading 50 -&gt; 60% dodge gives us a 10 damage reduced upgrade</div><div><br></div><div>the damage we're eliminating between upgrading 0 -&gt;10% dodge, or upgrading 50 -&gt;60% dodge is the same.</div><div><br></div><div>now what you're saying is that going from 100 damage to 90 damage is a 10% upgrade, but going from 50 damage to 40 damage is a 20% upgrade.</div><div><br></div><div>If we change the situation so that we're comparing the value of 0 -&gt;10% parry against 50 -&gt; 56% dodge, using your method would say that:</div><div><br></div><div>0 -&gt; 10% parry = 10% gain in avoidance</div><div>50 -&gt; 56% dodge = 12% gain in avoidance.</div><div>so the 6% dodge gain is better.</div><div><br></div><div>However, if we look at the total damage taken comparison in our sample 100 hit, 1 damage each fight:</div><div> 0 -&gt;10% parr = 10 damage reduced</div><div>50 -&gt; 56% dodge = 6 damage reduced</div><div><br></div><div>Isnt it better to reduce our total damage taken by 10, instead of 6?</div><div><br></div><div>Thanks again for your time and help :)</div><div><br></div>",
    "PostedDate": "2009-01-29T23:11:34.933-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "152436",
    "ThreadId": "45651",
    "Html": "<div><em>However, if we look at the total damage taken comparison in our sample 100 hit, 1 damage each fight:</em></div>\r\n<div><em> 0 -&gt;10% parr = 10 damage reduced</em></div>\r\n<div><em>50 -&gt; 56% dodge = 6 damage reduced</em></div>\r\n<div><em><br>\r\n</em></div>\r\n<div><em>Isnt it better to reduce our total damage taken by 10, instead of 6?<br>\r\n<br>\r\n</em>Certainly not. You care about incremental changes. Going from 0% to 1% dodge is a minuscule change. Going from 98% to 99% dodge is a drastic change. Obviously, those two different percentages of dodge are not equal in value.<br>\r\n</div>\r\n",
    "PostedDate": "2009-01-30T00:57:00.233-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "152489",
    "ThreadId": "45651",
    "Html": "Let me go a bit further Astrylian:<div><br></div><div>going from 99% to 100% dodge has infinite value</div><div><br></div><div>:-)</div><div><br></div>",
    "PostedDate": "2009-01-30T04:59:10.39-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "152575",
    "ThreadId": "45651",
    "Html": "Consider Astrylian's latest point.... going from 0 to 1% dodge, you chance to <em>be hit </em>is changing from 100% to 99%&nbsp; (Not much of a difference at all, a lousy 1% increase in survivabiltiy), however going from 98% to 99% dodge, your chance to <em>be hit</em> is going from 2% to 1%, a 100% increase in survivability.<br>\r\n<br>\r\nThe percentage gain is really what matters, as Astrylian mentioned in his first post.<br>\r\n<br>\r\n<br>\r\n\r\n",
    "PostedDate": "2009-01-30T08:46:50.957-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "152600",
    "ThreadId": "45651",
    "Html": "<div><em>0 -&gt; 10% parry = 10% gain in avoidance</em></div>\r\n<div><em>50 -&gt; 56% dodge = 12% gain in avoidance.</em></div>\r\n<div><em>so the 6% dodge gain is better.</em></div>\r\n<div><em><br>\r\n</em></div>\r\n<div><em>However, if we look at the total damage taken comparison in our sample 100 hit, 1 damage each fight:</em></div>\r\n<div><em>&nbsp;0 -&gt;10% parr = 10 damage reduced</em></div>\r\n<div><em>50 -&gt; 56% dodge = 6 damage reduced</em></div>\r\n<br>\r\nThe first part is correct.&nbsp; The second isn't.&nbsp; The comparison you provide starts at different points (0% avoidance for the former, 50% avoidance for the latter) so it isn't valid.<br>\r\nThe correct calculations are as follows: you're starting with 0% parry and 50% dodge, thus initially avoiding 50% of attacks (taking 50 of the 100 hits).<br>\r\n0 -&gt;10% parry allows you to avoid [1-(1-0.1)(1-0.5) =] 55% of attacks, so you avoid an additional 5 attacks (5/50 = 10% additional damage avoided).<br>\r\n50 -&gt; 56% dodge allows you to avoid 56% of attacks, so you avoid an additional 6 attacks, or one better than the parry increase (6/50 = 12% additional damage avoided). <br>\r\n<br>\r\n\r\n",
    "PostedDate": "2009-01-30T09:45:48.167-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "152612",
    "ThreadId": "45651",
    "Html": "(I see Rangifer beat me to posting. I think we are saying the same thing, except that as far as I understand a single roll system is being used, thus dodge and parry stack additively (even better), instead of multiplicatively like Rangifer is suggesting)<br>\r\n<br>\r\nInteresting way to think about it. I think I learned something.<br>\r\n<br>\r\nBut I think that xbobohobox is correct as well, according to the way I understand it. <br>\r\n<br>\r\nTaking the example: Upgrading from 50% dodge, 0% parry:<br>\r\n<br>\r\nOption A: 56% dodge, 0% parry: We end up taking 44% of the hits.<br>\r\n<br>\r\nOption B: 50% dodge, 10% parry: We end up taking 40% of the hits.<br>\r\n<br>\r\nOption C: 60% dodge, 0% parry: We end up taking 40% of the hits.<br>\r\n<br>\r\n-Option B and C are better than A, since you reduced the amount of incoming damage more. <br>\r\n-Option B is typically cheaper on an item budget, since you don't get hit with diminishing returns on rating.&nbsp; (Thus tanks that have multiple avoidance options should probably consider being well rounded in terms of avoidance. Bears don't have those options, except for defense which gives some misses.).<br>\r\n<br>\r\nIn essense the rule is that avoidance stacks and gains value in the process. I tend to think in terms of how much damage you ultimately take. Get the amount of damage taken close enough to zero and your stamina becomes irrelevant.<br>\r\n<br>\r\n",
    "PostedDate": "2009-01-30T10:11:42.177-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "152635",
    "ThreadId": "45651",
    "Html": "<p>I find it a lot easier to think about the extreme cases (though the 99% / 100% is a bit too extreme).</p>\r\n<p>To make a simple example, let's ignore the difference between dodge and parry and just call them &quot;mitigated attacks.&quot;  Also, let's ignore how much damage they make and just count how many times you get hit.</p>\r\n<p>So the simple case is to consider adding 1% to your mitigation.</p>\r\n<p>If you had 0% mitigation to start with and got hit 100 times:</p>\r\n<p>Before:<br>\r\n0% mitigated = 100 hits land<br>\r\nAfter<br>\r\n1% mitigated = 99 hits land</p>\r\n<p>The number of hits that land decreased from 100 to 99, which is a 1% decrease.</p>\r\n<p>Now let's say you had 98% mitigation to start with and got hit 100 times:</p>\r\n<p>Before:<br>\r\n98% mitigated = 2 hits land<br>\r\nAfter<br>\r\n99% mitigated = 1 hit lands</p>\r\n<p>The number of hits that land decreased from 2 to 1, which is a 50% decrease.  Even though you got the same 1% increase in mitigation, you are now getting hit half as often <strong>as you were before</strong> instead of just 1% less.</p>\r\n<p>I think I understand the source of the confusion and I'll post it in a follow-up comment because I want this comment to stand on its own with no further complexity.</p>\r\n<p>Char</p>\r\n",
    "PostedDate": "2009-01-30T11:09:36.967-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "152636",
    "ThreadId": "45651",
    "Html": "<p>If you've read the previous post and are satisfied, then you're golden.  This message is more about why I think people have a hard time with the 1% mitigation increase.</p>\r\n<p>The thing is that when we say 1% increase in mitigation, the 1% increase is in absolute terms, not in relative terms.  I can say, for example, that if you have nothing equipped in your chest slot and you equip chest piece xyz with some amount of dodge or agility, you get a 1% increase in mitigation because that amount of dodge equates to a 1% increase.</p>\r\n<p>When I say that, I have no idea how much mitigation you had to start with.  All I know is that if you had 0%, you will now have 1%.  If you had 98%, you will now have 99%.  Basically, it's a 1% increase in absolute terms.  But we saw from the previous post that this can translate to a huge difference in terms of how much actual damage you're taking (in both cases you're getting hit only one time less, but one example was only a 1% reduction of hits whereas the latter case was cutting the number of times you got hit by half)</p>\r\n<p>The confusion is when people start thinking in relative terms.  They say &quot;Well, when I'm in a fight I took 1000 damage, and now with 1% more mitigation I will take 990 damage.&quot;  When you say that, you're thinking in relative terms.  You're thinking that this 1% mitigation refers to how much of the current damage you're taking is being mitigated.  Now nobody can tell you how to reduce your incoming damage by 1% without knowing all the gear you have so they can figure out how much damage you're taking in the first place.</p>\r\n<p>In this latter case, when you're thinking about a 1% reduction relative to what you are already taking, then it doesn't really matter what the stat is and how much of it you already have.  If you can block, parry and dodge, it doesn't really matter if the 1% decrease comes from block, parry or dodge, or even a combination of them, regardless of how high one stat is relative to another</p>\r\n<p>The math here has to do with whether the additional reduction is multiplicative or additive.  I'd go into that but I think my post is probably already OT and too long-winded.</p>\r\n<p>Char</p>\r\n",
    "PostedDate": "2009-01-30T11:11:26.55-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "152652",
    "ThreadId": "45651",
    "Html": "Actually Charinna, I'm rather curious as to whether the additional reduction is multiplicative or additive =p&nbsp; My main's a Mage, so I don't generally pay attention to this sort of thing, but I'm getting my druid to 80 and plan on running raids with her, and I think it would be wise of me to learn about the mechanics for other classes too =p&nbsp; I was thinking most things like dodge + parry are on a two-roll system where first it checks your chance to dodge, then it checks your chance to parry.&nbsp; I know hit/crit are on a two roll system where first your chance to hit the target is checked, and if you do hit the target, another check is done to see if that hit will be a crit, I was thinking mitigations stats would use similar mechanics.<br>\r\n",
    "PostedDate": "2009-01-30T11:41:03.283-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "152653",
    "ThreadId": "45651",
    "Html": "If you want to roll a druid, then the answer to that is very simple: It doesn't matter.  Druids don't block or parry :)<br>\r\n<br>\r\nDodge is the only one.  And then for attacks that you don't successfully dodge, your armor reduces the incoming damage.<br>\r\n<br>\r\nMakes life a lot easier.<br>\r\n<br>\r\nChar\r\n",
    "PostedDate": "2009-01-30T11:49:50.573-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "152671",
    "ThreadId": "45651",
    "Html": "As Char said, it doesn't matter for druid avoidance, but to answer the question...<div><br></div><div>Avoidance is additive. 20% dodge + 20% parry is 40% avoidance. Add 20% Block, and you end up with a 40% chance to avoid the hit, 20% chance to block the hit, and 40% chance to be hit. (assuming uncrittable for simplicity).</div><div><br></div><div>And attacks... <span style=\"font-style:italic\">Some</span> attacks are on a 2roll system, but not all. Most yellow attacks are 2roll, most white are 1roll, but that doesn't always hold true. Varies by class/ability.</div>",
    "PostedDate": "2009-01-30T12:28:46.557-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "152753",
    "ThreadId": "45651",
    "Html": "<div>First off: thanks to all of you who have responded and continue to post in regards to this issue.</div><div><br></div><div>From the responses you have given, I now understand the mistake I was making, So I'll offer my own explanation of why I was seeing the number's I was seeing.</div><br><div><br></div><div>I disagree that there is only 1 avoidance stat for druids.</div><div>Arent ther 4 total avoidance stats? :</div><div>Dodge</div><div>Parry</div><div>Block</div><div>Miss (gained from defense)</div><div>all of which are additive and share separate cap's + diminishing returns</div><div><br></div><div>Druids only get Dodge + Miss</div><div>DK's only get Dodge + Parry + Miss</div><div>Pallies + warriors get all 4</div><div><br></div><div>Among these, the avoidance stats are additive</div><div>if you had 50% dodge + 50 % parry you wouldn't get hit at all (in theory anyway)</div><div>and obviously having 100% avoidance would mean stamina, armor, etc, wouldnt really matter. So we can also say that as you approach 100% avoidance, the values of other stats such as stamina become less important compared to the next points in avoidance.</div><div><br></div><div>I think perhaps I see the nature of the confusion.</div><div>My example involving a 10% parry gain at 0% parry, vs a 6% dodge gain at 50% dodge shows 10% parry is definitely better than 6% dodge.</div><div>The confusion lies within comparing a single avoidance stat, against total avoidance.</div><div><br></div><div>in the parry example</div><div>0 -&gt;10% parry gain = 10% total avoidance gain</div><div>50 -&gt; 56% dodge gain = 6% total avoidance gain.</div><div><br></div><div>0 -&gt; 10% total avoidance gain is, however, much inferior to 50 -&gt; 56% total avoidance gain.</div><div>the reason the 10% parry gain is better is because it is much greater total avoidance gain.</div><div><br></div><div>Thus I think both sides were correct.</div><div><br></div><div>Side A: As total avoidance increases, additional avoidance stats become worth increasingly more, relative to the other tanking stats.</div><div>For example, if you're going to take 100% of the hits, you better have a lot of stamina so that u dont die right away, but if you only take 25% of the hits, you can afford to have much lower hp.</div><div><br></div><div>Side B: However, it is also true that as a particular avoidance stat increases, it receives diminishing returns, thus causing any other avoidance stats to become much more important, for example at 50% dodge and 0% parry, a 10% parry increase is much more valuable than a 6% dodge gain. </div><div><br></div><div>With a warrior, having 4 avoidance stats, we would certainly note that parry, block, and defense become much more valuable than dodge, if we have an exceptionally high dodge chance, and exceptionally low block, parry, defense. Also because the avoidance is split among so many stats, we might even expect that if all avoidance stats are low, as we increase one particular avoidance stat, we see the value of that stat drop not only in relation to the other avoidance stats, but to other tanking stats as well, such as stamina.</div><div><br></div><div>With a druid, who only has 2 avoidance stats, as dodge increases by a large amount, defense increases compared to dodge, however because defense offers so little avoidance for a druid, it can be hard to notice this relative change. </div><div><br></div><div>When I go back to my earlier numbers of relative stat values:</div><div><br></div><div>RSV<span style=\"white-space:pre\">\t\t</span>With Stam trinkets<span style=\"white-space:pre\">\t\t\t</span>With Dodge trinkets</div><div>Stam<span style=\"white-space:pre\">\t</span>:<span style=\"white-space:pre\">\t</span>51.81<span style=\"white-space:pre\">\t\t\t\t\t</span>51.41<span style=\"white-space:pre\">\t\t\t\t</span></div><div>Dodge:<span style=\"white-space:pre\">\t</span>33.78<span style=\"white-space:pre\">\t\t\t\t\t</span>35.17</div><div><br></div><div>If I add in the defense values:</div><div><br></div><div>Defense: <span style=\"white-space:pre\">\t</span>25.38<span style=\"white-space:pre\">\t\t\t\t\t</span>27.41</div><div><br></div><div>the value of dodge increased by 1.39</div><div>but the value of defense increased by 2.03</div><div><br></div><div>so where I expected high dodge values to decrease the value of dodge, it actually is decreasing the value of dodge, only in regards to defense though.</div><div><br></div><div>And since the rawr data verifies this, I believe Char and Astrylian mis-spoke saying that dodge is the only avoidance stat for a druid, technically defense counts too :p</div><div><br></div><div>Thanks again to all for helping me understand this, and I hope this explanation is helpful to others as well. :)</div><div><br></div><div><br></div>",
    "PostedDate": "2009-01-30T18:57:18.603-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "153068",
    "ThreadId": "45651",
    "Html": "<div><em>0 -&gt; 10% total avoidance gain is, however, much inferior to 50 -&gt; 56% total avoidance gain.</em></div>\r\n<div><em>the reason the 10% parry gain is better is because it is much greater total avoidance gain.<br>\r\n<br>\r\n</em>This part still isn't correct :).  Total avoidance isn't really every a concern.  Relative is the only thing that matters.<br>\r\n<br>\r\nOk I take that back slightly, too much avoidance can lead to threat/rage starvation for a warrior without BoSanc.  I'm not sure of ProtWar models this though.</div>\r\n",
    "PostedDate": "2009-02-01T09:52:27.613-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]