[
  {
    "Id": "152533",
    "ThreadId": "45704",
    "Html": "Add an option to use a specific pool of gems (verse assigning specific gems to specific colors) or to not nessecarily match the gem colors to sockets.<br>\r\n<br>\r\nMaybe in the form of a filter?  I suggest a filter because I have multiple toons and I found deleting gems that one toon does not use is not a good idea... (my shadow priest ended up with gem suggests including AP + Hit gems...)  There are also gems listed in rawr that not all my characters have access to (ie the JC specific ones) and gems that are not implemented in the game yet (wrath epic gems).  Even if I turn the JC option off in the filter the JC specific gems remain.<br>\r\n<br>\r\nI would love to see something along the lines of being able to say &quot;I prefer Runed, Rigid, Smooth, Quick, Potent, etc.&quot; and then only those gemming options would appear (and would also give me more accurate numbers/ratings) without removing anything from the default database.<br>\r\n<br>\r\nI do not know if this would be a &quot;simple&quot; solution, but prehaps this could be achieved by making a gem options with check boxes to enable filters.<br>\r\n<br>\r\n<strong><span style=\"text-decoration:underline\">Example:</span></strong><br>\r\n<br>\r\nJewelcrafter: Yes / No<br>\r\n<br>\r\nOutland: Uncommon / Rare / Epic<br>\r\nWrath: Uncommon / Prefect / Rare<br>\r\n<br>\r\nRed: Runed / Bright / Bold / Delicate / Flashing / Fractured / Precise / Subtle<br>\r\nOrange: Accurate / Champion's / etc<br>\r\nYellow: Brilliant / Mystic / Quick / Rigid / Smooth / Thick<br>\r\nGreen:  Dazzling / Enduring / etc<br>\r\nBlue: Lustrous / Solid / Sparkling / Stormy<br>\r\nPurple: Balanced / Defender's / etc<br>\r\n<br>\r\nMetas: (you get the idea)<br>\r\n",
    "PostedDate": "2009-01-30T07:21:20.443-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "152570",
    "ThreadId": "45704",
    "Html": "As already heavily discussed on these forums, major changes are coming for our gemming system.",
    "PostedDate": "2009-01-30T08:31:27.173-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]