[
  {
    "Id": "152766",
    "ThreadId": "45769",
    "Html": "I have a couple of questions on Druid damage.  I hope these were not previously covered.  I looked through the posts and did not find anything so here goes.<br>\r\n<br>\r\n1. On my Relative Stats Tab (Druid Cat), my most important stat is &quot;Weapon Damage&quot;.  Is that DPS, Min Damage, Max Damage?  Not sure how that stat maps to the stats I see on my in-game tool tip. <br>\r\n    1b) If Weapon Damage is not DPS, then how do I get a Relative Stat for Weapon DPS?  i.e. How many points is 1 DPS worth?<br>\r\n<br>\r\n2.  How do I account for the Feral AP now with 3.08?  If a staff says that it has 1109 AP in Cat, Bear or Dire Bear form, is that AP any different from Equipped Item AP?  Also, some items show both a Feral AP and an Equipped item AP.  Do I add these together of does the Feral AP account for both?<br>\r\n<br>\r\nThanks for any insight you can provide.<br>\r\n<br>\r\n-Grench\r\n",
    "PostedDate": "2009-01-30T20:42:21.443-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "152774",
    "ThreadId": "45769",
    "Html": "1. a) Weapon Damage is exactly what is says it is.&nbsp; Every white swing will do that much additional damage, and any specials based off of WD will gain a bonus.&nbsp; However, very few items grant +WD.&nbsp; An example is the <a href=\"http://www.wowhead.com/?item=32654\">Crystalforged Trinket</a>.&nbsp; I don't think there's any gear in Wraith with +WD, so you can pretty much ignore it on the Relative Stats tab.<br>\r\n1. b) Weapon DPS is sort of irrelevant for Ferals, because it's automatically converted to Feral AP, which is also listed on the item, but only visible in-game if you're a druid.&nbsp; FAP on a weapon is roughly 14*DPS - 55, where the 55 (roughly) is the base dps of kitty paws.<br>\r\n<br>\r\n2. AP is granted to you in any form.&nbsp; FAP is only granted in feral forms.&nbsp; FAP is dependent on weapon dps (which in turn is dependent on iLevel) and does not take into account any additional AP that's on the item.&nbsp; Add them together for the total AP granted while in feral forms.<br>\r\n",
    "PostedDate": "2009-01-30T21:56:30.427-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "152781",
    "ThreadId": "45769",
    "Html": "OK,<br>\r\nSo let me see if I have this right.  If my Relative Stat Values are:<br>\r\nWD = 1.15<br>\r\nStr = .50<br>\r\nExpertise = .43<br>\r\nHit = .43<br>\r\nAgility = .40<br>\r\nCrit = .27<br>\r\nAp = .23<br>\r\nPenetration = .21<br>\r\nHaste = .18<br>\r\nStam = .11<br>\r\n<br>\r\nThen if I want to give my Staff of the Forest Lord a point ranking (like for Pawn), then<br>\r\n<br>\r\n<strong><span style=\"text-decoration:underline\">Staff of the Forest Lord</span></strong><br>\r\n321-483 Damage    Speed 3.00<br>\r\n(134.0 damage per second)<br>\r\n+52 Agi<br>\r\n+78 Stam<br>\r\nIncreases attack Power by 1109 in Cat, Bear, Dire Bear, and Moonkin forms only.<br>\r\nEquip: Increases attack power by 100.<br>\r\n<br>\r\n+52 Agi * .40 = 20.8<br>\r\n1109 Ap * .23 = 255.07<br>\r\n<span style=\"text-decoration:underline\">100 Ap * .23 = 23             </span><br>\r\nTotal:                298.87 (in cat form)<br>\r\n<br>\r\nDoes that sound about right?<br>\r\n",
    "PostedDate": "2009-01-30T23:08:15.28-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "152790",
    "ThreadId": "45769",
    "Html": "Yes.<br>\r\n<br>\r\nThough don't forget, doing it that way will always be somewhat inaccurate. To get accurate values, use Rawr.<br>\r\n",
    "PostedDate": "2009-01-31T00:41:13.937-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "152970",
    "ThreadId": "45769",
    "Html": "As to why it's inaccurate...<br>\r\n<br>\r\nMy understanding of the relative stats page is that it gives you the value of one point of a given stat.  After you get that one point of the stat, its value may change.  Here's an example why:<br>\r\n<br>\r\nLet's say that you have a hit cap of 300 to make sure you never miss (a nice round number I just made up), and you currently have no hit at all.  One point in hit is very valuable.  Two points in hit are very valuable.  Once you get 200 points in hit, you're missing less and less, so maybe hit isn't the most important thing at all.  Once you have 300 points in hit, then any additional points of hit are completely worthless...<br>\r\n<br>\r\nSo with 0 hit, the relative stats page would probably weigh hit pretty highly.  That doesn't mean you can take that huge number and assume it would apply to 1000 points of hit.<br>\r\n<br>\r\nChar<br>\r\n",
    "PostedDate": "2009-01-31T18:08:25.153-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "152997",
    "ThreadId": "45769",
    "Html": "Good point.  That's why we need to refresh our Rawr profiles each time we upgrade our gear.  Upgrading gear will cause the Rel Stat Values to change and therefore our Pawn tags should be updated as well.\r\n",
    "PostedDate": "2009-01-31T22:13:27.56-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]