[
  {
    "Id": "153070",
    "ThreadId": "45853",
    "Html": "I have a feature request because this is starting to annoy me :).<br>\r\n<br>\r\nEvery new Rawr version I have to go in and set up my 6-8 (depending how thorough I'm feeling) default gemmings.  In addition when I find a piece of gear missing or something new comes out in a patch I again have to set my default gemmings and reapply them to get the new gear gemmed (or gem it by hand).<br>\r\n<br>\r\nIs there a way we could export/import the default gemmings window? Or have it save somehow other than simply updating the item cache? It saves in-session but then when you close/open the window once again is blank.<br>\r\n<br>\r\nThis issue I reported earier (not showing fixed, have not retested in 2.1.9) would need to be resolved however:<br>\r\n<a href=\"http://www.codeplex.com/Rawr/WorkItem/View.aspx?WorkItemId=12321\">http://www.codeplex.com/Rawr/WorkItem/View.aspx?WorkItemId=12321</a><br>\r\n<br>\r\n",
    "PostedDate": "2009-02-01T09:59:27.167-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "153073",
    "ThreadId": "45853",
    "Html": "Update: tested and the bug above is still present.\r\n",
    "PostedDate": "2009-02-01T10:04:38.92-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "153074",
    "ThreadId": "45853",
    "Html": "RE: feature request<br>\r\n<br>\r\nSee post 4 and reply in post 6 of http://www.codeplex.com/Rawr/Thread/View.aspx?ThreadId=43547 .<br>\r\n",
    "PostedDate": "2009-02-01T10:07:23.173-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "153084",
    "ThreadId": "45853",
    "Html": "Wow that sounds really nice.  I'm not sure how I feel about not showing every gemming you have selected though.  I'm hoping the &quot;show top n gemmings&quot; which was refered to briefly will accept values of 100 or other effectively &quot;infinite&quot; values so that I can always show all gemmings that I have set up regardless of which is &quot;best&quot;.  I'm a firm believer that theorycraft should not be blindly relied on and what is claimed &quot;best&quot; is not always best.  <br>\r\n<br>\r\nSeeing all the gemmings lets me play with things, swap pieces here and there, and see what I come to.  It also lets me see if the way I want to gem something is significatnly &quot;worse&quot; or &quot;better&quot; froma theorycraft standpoint from what is &quot;best&quot;.  Often the way I like to gem and the &quot;best&quot; are only a very small margin different so I feel comfortable in those instances not going for the &quot;best&quot; gemming.  <br>\r\n<br>\r\nSimilarly when I compare, say, pants the way I have gemmed them to another pair of pants I want to compare them to the same gemming scheme as well as to the &quot;best&quot; scheme on the new pair.  <br>\r\n<br>\r\nI guess I just don't see value in hiding gemmings :).\r\n",
    "PostedDate": "2009-02-01T11:08:21.707-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "153097",
    "ThreadId": "45853",
    "Html": "<span style=\"font-size:12pt\">If you really want 5 pages of gemmings for every single item, you'll be able to have it.<br>\r\n</span>\r\n",
    "PostedDate": "2009-02-01T12:10:41.803-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "153099",
    "ThreadId": "45853",
    "Html": "<em>If you really want 5 pages of gemmings for every single item, you'll be able to have it.</em><br>\r\n<br>\r\nHaha I don't go that far, but thank you :)<br>\r\n<br>\r\n<div></div>\r\n",
    "PostedDate": "2009-02-01T12:22:37.837-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "153507",
    "ThreadId": "45853",
    "Html": "There's one value in hiding gemmings--if the gems in question are on Rawr but not on live. Such was the case for Shifting Twilight Opal and Etched Monarch Topaz, among others, before 3.0.8, and is still the case for high-value epic gems not yet implemented.<br>\r\n",
    "PostedDate": "2009-02-02T14:29:08.827-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]