[
  {
    "Id": "153065",
    "ThreadId": "45851",
    "Html": "I'm running into a rather odd problem with the windows in Rawr. As an example, when i open the Optimizer window, the window extends down to the top of the buttons along the bottom. I can't even tell what the buttons are in the window as i can only see the very top of them. This happens in any window I open in Rawr. I run my desktop at 1680 x 1050, and have tried changing it to various different screen resolutions, from 640 x 480 on up, but that does not make any difference. I've searched through a lot of threads here hoping to find some suggestions, but no luck as yet. Anyone have any ideas? I am guessing I'm just missing a simple setting somewhere. Any help would be appreciated.<br>\r\n",
    "PostedDate": "2009-02-01T09:45:12.78-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "153095",
    "ThreadId": "45851",
    "Html": "Your DPI setting is set wrong... Goto Display Properties &gt; Advanced &gt; DPI, set it to Normal.<br>\r\n",
    "PostedDate": "2009-02-01T12:02:05.543-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "153497",
    "ThreadId": "45851",
    "Html": "I'd like to point out that his DPI setting is not <span style=\"font-style:italic\">wrong</span>. More accurate would be to say that Rawr does not properly handle larger font sizes for users who adjust the DPI to match their screen resolution or to adjust for vision difficulties. It's not an unreasonable thing to expect, though I agree proper handling of resolution independant displays is a really difficult problem.",
    "PostedDate": "2009-02-02T14:05:52.52-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "153521",
    "ThreadId": "45851",
    "Html": "WinForms' handling of abnormal DPIs is buggy and poorly-designed enough, that I'd say the word 'wrong' is justified.<br>\r\n",
    "PostedDate": "2009-02-02T14:59:24.93-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "156523",
    "ThreadId": "45851",
    "Html": "Thanks for the feedback, that did get the windows operating normally.<br>\r\n",
    "PostedDate": "2009-02-10T20:21:40.64-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]