[
  {
    "Id": "1097998",
    "ThreadId": "458790",
    "Html": "I just wanted to be up-front with everyone about what's going on with Rawr right now.  Firstly, I apologize for not having a release right out the door when the patch came out.  The new download, when it does come, will contain fixes for the new 5.4 Timeless Isle gear, so if you're experiencing crashes loading characters or optimizing, check to see if you have one of these pieces equipped first.  There are mechanical changes for a couple of classes that are getting squeezed in, as well.  To top it all off, I am going to try to get the Item Cache updated with Siege of Orgrimmar/Timeless Isle gear and the legendary cloaks.  There was a change to RPPM trinkets somewhere during the PTR cycle; I will try, but cannot guarantee, that I will be able to make the appropriate fixes.  The downside to all this is that the item cache by itself is a lot of work, and this means that the release will take a little longer.  Please be patient with us, as we're rather short-staffed and we're doing the best we can as volunteers to do as much as we're capable of doing.<br />\n",
    "PostedDate": "2013-09-23T06:08:06.107-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1099971",
    "ThreadId": "458790",
    "Html": "<strong>dopefish wrote:</strong><br />\n<blockquote>\n...Please be patient with us, as we're rather short-staffed and we're doing the best we can as volunteers to do as much as we're capable of doing.<br />\n</blockquote>\nI already asked multiple times to become a part of the DEV-team for Rawr to commit my fixes (which I already made in several areas of Rawr) - but nobody reply to me so far...<br />\n",
    "PostedDate": "2013-09-27T00:23:33.107-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1100101",
    "ThreadId": "458790",
    "Html": "<strong>ZuranOrb wrote:</strong><br />\n<blockquote>\n<strong>dopefish wrote:</strong><br />\n<blockquote>\n...Please be patient with us, as we're rather short-staffed and we're doing the best we can as volunteers to do as much as we're capable of doing.<br />\n</blockquote>\nI already asked multiple times to become a part of the DEV-team for Rawr to commit my fixes (which I already made in several areas of Rawr) - but nobody reply to me so far...<br />\n</blockquote>\nYeah, I know.  I don't know that we have anybody who has that power anymore.  You can try to send an email to Kavan.<br />\n",
    "PostedDate": "2013-09-27T06:07:04-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1108268",
    "ThreadId": "458790",
    "Html": "<strong>dopefish wrote:</strong><br />\n<blockquote>\n<strong>ZuranOrb wrote:</strong><br />\n<blockquote>\n<strong>dopefish wrote:</strong><br />\n<blockquote>\n...Please be patient with us, as we're rather short-staffed and we're doing the best we can as volunteers to do as much as we're capable of doing.<br />\n</blockquote>\nI already asked multiple times to become a part of the DEV-team for Rawr to commit my fixes (which I already made in several areas of Rawr) - but nobody reply to me so far...<br />\n</blockquote>\nYeah, I know.  I don't know that we have anybody who has that power anymore.  You can try to send an email to Kavan.<br />\n</blockquote>\nThat's what I did already, no response so far from Kavan :-(<br />\n",
    "PostedDate": "2013-10-16T06:05:19.877-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1127531",
    "ThreadId": "458790",
    "Html": "Zuran, I don't know if you've checked, but as of two weeks ago you have been made a developer on this project.  Congratulations and let me know if you need any help getting into it.  Also, just FYI for anyone else reading the thread, I've been promoted to Coordinator so I can approve developer requests.<br />\n",
    "PostedDate": "2013-11-21T05:55:50.553-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1128267",
    "ThreadId": "458790",
    "Html": "This addon is borderline dead. Dopefish your addon was the greatest asset to this thing why wont you update it? I now have to use simcraft because this thing just wont work<br />\n",
    "PostedDate": "2013-11-23T14:25:21.183-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1128693",
    "ThreadId": "458790",
    "Html": "I didn't develop the addon, and more to the point, we are extremely shorthanded on programmers.  I would like to get the addon working again - it's on the list of things to do - but there is just way too much work to go around and not enough people to do it.<br />\n",
    "PostedDate": "2013-11-25T06:31:07.337-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1200259",
    "ThreadId": "458790",
    "Html": "Is there anything I can do to help? Just got back into WoW after a 1 year hiatus. Sad to see this has been squandered. <br />\n",
    "PostedDate": "2014-01-28T19:51:55.607-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1201150",
    "ThreadId": "458790",
    "Html": "So as of now where does this program stand? Because I can see this being a huge help to the World of Warcraft Community.<br />\n",
    "PostedDate": "2014-01-30T16:35:08.62-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1203313",
    "ThreadId": "458790",
    "Html": "I'm not sure it will ever be fully updated. With the end of the next expansion coming within the next few months and reforging being removed the work load to keep this thing updated will be very very very very very minimal. And gemming is going to be easier too. I don't know if people will need a program to tell them where to put the red gem. and with ask mr robot's gear rating from wow head I can't imagine where rawr stands. As is right now I'm getting stat priority all over the place running my mage through it. It doesn't even want me to use my legendary meta gem T.T<br />\n",
    "PostedDate": "2014-02-05T22:54:43.047-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1215629",
    "ThreadId": "458790",
    "Html": "To be fair, Ask Mr. Robot is a very good tool, but it is not as accurate as Rawr because at the end of the day, stat weights are never completely static.  Will it make a difference to the average user?  Probably not, but that doesn't mean we shouldn't try and make it work.<br />\n",
    "PostedDate": "2014-02-27T06:09:34.77-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]