[
  {
    "Id": "153199",
    "ThreadId": "45899",
    "Html": "The topic says it all. Does he even have time to play the game with all the programming and being a champ answering questions here on Codeplex.<br>\r\n<br>\r\nI would like to pay my respect for your effort on bringing us this freebie, especially with the interacting with the fanbase of rawr. It annoys me with all the people &quot;demanding&quot; you to fix stuff on a free program, in a rather rude way to boot. Hang in there, Love your work, and of course all the other model-programmers.<br>\r\n",
    "PostedDate": "2009-02-01T23:21:56.04-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "153203",
    "ThreadId": "45899",
    "Html": "Heh, thanks. :)<br>\r\n<br>\r\n(And yes, I have enough time to clear all current content, aside from Sarth10+3, every week. I don't have much of a life. :) )<br>\r\n",
    "PostedDate": "2009-02-01T23:28:51.393-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "153232",
    "ThreadId": "45899",
    "Html": "I would love to see your feral builds. Do you play as a tank, tell us more about your role when raiding :)<br>\r\n",
    "PostedDate": "2009-02-02T01:27:17.187-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "153391",
    "ThreadId": "45899",
    "Html": "Hip hip!<br>\r\n",
    "PostedDate": "2009-02-02T09:37:48.44-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "153397",
    "ThreadId": "45899",
    "Html": "Yep, I'm a pure bear, 90% of the time. I'm in my normal tanking build on the armory at the moment, though I'm in Cat gear (as you can see, I don't optimize my cat gear too much. I'm missing several cat pieces, and just use the bear ones; I pass to anyone else over taking something for Cat).<br>\r\n",
    "PostedDate": "2009-02-02T09:56:57.703-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "153461",
    "ThreadId": "45899",
    "Html": "That's funny, I would have totally guessed you were a kitty because the only druid build that's included in Rawr by default is a &quot;full kitty build.&quot;<br>\r\n<br>\r\nChar\r\n",
    "PostedDate": "2009-02-02T12:44:17.81-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "153476",
    "ThreadId": "45899",
    "Html": "That's because, even though Rawr is here to quantify everything, there is room for reasonable debate for bear builds :)<br>\r\n",
    "PostedDate": "2009-02-02T13:24:04.903-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "153477",
    "ThreadId": "45899",
    "Html": "an interresting questions is &quot;Does astrylian follow rawr ratings slavishly?&quot; :D<br>\r\n",
    "PostedDate": "2009-02-02T13:25:21.89-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "153511",
    "ThreadId": "45899",
    "Html": "Indeed there is debate.<br>\r\n<br>\r\nPersonally I went for the jack of all trades, master of none build (bear / kitty hybrid).  Sure I could max the stats for one or the other, but since I currently find myself doing both...<br>\r\n<br>\r\nChar\r\n",
    "PostedDate": "2009-02-02T14:38:39.58-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "153520",
    "ThreadId": "45899",
    "Html": "<em>&quot;Does astrylian follow rawr ratings slavishly?&quot;<br>\r\n<br>\r\n</em>I'm not sure if you can call it slavishly, since I design the rating system, but yes. There are a couple exceptions, mostly around things that I know aren't modeled. Like, I still use Defender's Code, even though it's not always BIS anymore, because I know its Use effect isn't modeled. <br>\r\n<br>\r\nAlso, I remember that Rawr's ratings are a tool, and there are some good reasons to go against them, in favor of things that it doesn't handle (cost, being the obvious major one). For example, while initially gearing up at 80, gemming stam was pretty strongly rated, over gemming agi. However, I gemmed for agi anyway, because I didn't want to have to regem (extra cost) in a couple weeks when I was fully geared up, and had enough stam innately on gear. <br>\r\n<br>\r\nRegarding builds... Yeah, if I played as a Cat much, I'd go for a hybrid build (most notably, picking up Shredding Attacks). However, since I'm a Bear 90% of the time, MTing, and the 10% of the time I play as a Cat, my performance doesn't really matter, I optimize my bear talents.<br>\r\n",
    "PostedDate": "2009-02-02T14:57:56.23-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "153548",
    "ThreadId": "45899",
    "Html": "Yeah, I ended up picking up shredding attacks recently.  I did so by giving up 2 points in Infected Wounds...<br>\r\n<br>\r\nChar<br>\r\n",
    "PostedDate": "2009-02-02T17:35:44.537-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "161193",
    "ThreadId": "45899",
    "Html": "Dude, if I had your gear I'm not sure whether I'd find working on Rawr an ego boost (cause there are very few upgrades left for your gear) or rather depressing (cause there are very few upgrades left for your gear).<br>\r\n<br>\r\nWhich is it?<br>\r\n<br>\r\nAlso, shame we're not on the same realm...  Heck, for all the work you've put into Rawr I would have happily mailed you 50g to upgrade that green gem.<br>\r\n<br>\r\nChar<br>\r\n<br>\r\nEdit:  p.s.  Thanks for not being a stam stacker!  I feel that validates my own approach a bit.\r\n",
    "PostedDate": "2009-02-23T16:24:06.557-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "161194",
    "ThreadId": "45899",
    "Html": "Haha, you mean in my necklace? That's an indication of how much I go cat, and how much effort I put into my cat gear. :)<div><br></div><div>PS: Just noticed there's another lvl 80 feral druid named Astrylian, and s/he's on my old server. Odd.</div><div><br></div><div>EDIT: Err, I'm in bear gear on armory at the moment... Maybe you mean the perfect shifting on the legs? There's no shifting twilight opal in the game yet...</div>",
    "PostedDate": "2009-02-23T16:28:10.257-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "161686",
    "ThreadId": "45899",
    "Html": "Yes, I certainly was talking about the green gem dropped into a 226 iLevel item!  If only we all should be so lucky as to have multiple 226 items.<br>\r\n<br>\r\nSomehow I assumed Shifting Twilight Opal was in, heck, Rawr shows me all these epic gems that I keep asking for in trade channel but never get.<br>\r\n<br>\r\nOn my server if someone were to drop a purple (agi + stam) gem it'd be into the red socket, never the blue.  Seems as if tanks are summarized by &quot;How much HP do you have?&quot; with the largest number winning.  Drives me nuts.  I totally felt like I sold out when I had a pair of Polar Boots crafted.  Heck, after weeks I forced myself to buy the mats for the belt but just can't get myself to have it crafted.  Just doesn't feel right.<br>\r\n<br>\r\nChar<br>\r\np.s. Don't respond to the epic gem comment, it was a joke :)<br>\r\n<br>\r\n",
    "PostedDate": "2009-02-24T15:47:56.91-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]