[
  {
    "Id": "154550",
    "ThreadId": "46282",
    "Html": "Hi, <br>\r\n<br>\r\nBeen using Rawr a bit lately and with both 2.1.8 &amp; 2.1.9 i've started having an issue where on deleting an item from the list (eg. some crafted Sunwell items that I will never get) there is a long (sometimes 30sec+ pause before Rawr becomes responsive again.   It has even happened just switching from the leg slot to the chest slot list.  This doesn't happen consistantly and may only occur after an optimisation and seems to get worse.  Closing and re-opening Rawr seems to help.<br>\r\n<br>\r\nIt doesn't happen on my work PC but only happens at home.   I'm running a recent (&lt;1month) clean install of windows with plenty of RAM and sometimes with nothing else open, but usually with WOW &amp; Mozilla open.  Could this be related to the .NET issues I have read about in other threads here (I get no error message so I can't really give specifics). I assume my .NET is up to date but I must admit to not having checked.<br>\r\n<br>\r\nIf nothing else I can keep saving, quitting and reloading every now and then but I would prefer not too :)<br>\r\n<br>\r\nAnyway, love the program regardless :)<br>\r\n<br>\r\n",
    "PostedDate": "2009-02-04T23:23:44.28-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "154560",
    "ThreadId": "46282",
    "Html": "Some situations take longer to calculate than others; none of what you describe has anything to do with what you're actually doing, but rather just that it's recalculating everything in the chart that's to be displayed. Some charts take longer than others, too.<br>\r\n<br>\r\nAnyway, we definitely can work on performance, and especially if you can give us exact examples of what specific recalculations take especially long. Something like, &quot;Here's my character file, which I'm using in the Bear. Switching between charts is decently fast, only takes a second or two... Until you enable Elixir of Uberness, at which point switching between Chest and Legs charts takes 30sec each.&quot; (just making that up, but if you can pinpoint it that much, it would really help.<br>\r\n<br>\r\nI think you're usually feral, but this is all very model-specific, so which model is this happening in? Cat? Bear? Tree? Moonkin? An alt?<br>\r\n",
    "PostedDate": "2009-02-05T00:02:29.29-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "154856",
    "ThreadId": "46282",
    "Html": "Pretty sure it happens to my hunter as well.  Also, I use all four druid models :)<br>\r\n<br>\r\nI'll try and pay attention to what I am doing to get more info.<br>\r\n<br>\r\n",
    "PostedDate": "2009-02-05T15:04:26.78-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]