[
  {
    "Id": "156722",
    "ThreadId": "46855",
    "Html": "I really appreciate the amount of time and effort you guys have put into this. Great job and thank you.<br>\r\n<br>\r\nAs a user, (DPSDK) there are some things that would help me out a great deal and possibly improve on what has been done.<br>\r\n<ul>\r\n    <li>An adavced user button that can be used to alter and or see the stat weights, probably with and idiot reset default button included. This would also allow to turn some weights off/on </li>\r\n    <li>Ghoul dps. As a DK the items with STR value can have a dramatic effect on gear selection/DPS if you use a ghoul, let alone other raid buffs that increase the STR stat. Maybe I have just not noticed it included in RAWR program and if so, my bad. </li>\r\n    <li>+Hit. This is a tricky one because of a DK using spell cap and melee cap. Trying to find the ideal +hit per spec and gear. Best bang for your buck. This is more of a question and has it been looked at rather than just basing the program hit cap off of 8% </li>\r\n</ul>\r\n<p>TY for your time.</p>\r\n",
    "PostedDate": "2009-02-11T10:03:18.08-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "156745",
    "ThreadId": "46855",
    "Html": "Regarding your first point, Rawr doesn't use stat weights. See the readme for details.<br>\r\n<br>\r\nYour second point will need to be handled by the model, which is in progress.<br>\r\n<br>\r\nAnd your third point is already handled; use the Optimizer.<br>\r\n",
    "PostedDate": "2009-02-11T11:19:46.78-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "157169",
    "ThreadId": "46855",
    "Html": "Hello Angar,<br>\r\n<br>\r\nstrength from gear and buffs is included in the ghoul modelling. You should see the difference in strength weighting when you toggle the ghoul on and off.<br>\r\n<br>\r\nRegards<br>\r\n",
    "PostedDate": "2009-02-12T12:07:53.997-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]