[
  {
    "Id": "1132471",
    "ThreadId": "472104",
    "Html": "If you're reading this and you're a programmer of any sort, I want you to come and be a part of our team.  I love Rawr and I think it's a great program that works better than Ask Mr. Robot or any of the theorycrafting spreadsheets as far as user friendliness and accuracy in defining upgrades and the value of gear.  The problem with Rawr is, we need more programmers to come in and replace those who have moved on to other games and other projects, because World of Warcraft is constantly changing and we need to change along with it.  If you're interested in working on a neat tool that does lots of intense math, drop me a line!  We're taking applications for maintainers of class modules, people who want to add new baseline features, and especially someone who might want to take up the project of the Addon, which is our #1 requested feature update.  I'm good, but I can't do it all, at least not in any reasonable time frame for our users.  So come aboard!  We'd love to have you come write code for us.<br />\n",
    "PostedDate": "2013-12-06T05:03:33.133-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1132597",
    "ThreadId": "472104",
    "Html": "Hi Dope,\r<br />\n<br />\nWhere do we stand in terms of maintainers for the class models?  I think that's where there's a big problem with Rawr -- and that's where I'm getting stuck with my motivation.  If we release a tool that works great for one or two models (I'm thinking Mage is the one that gets the most love?), then the tool doesn't look right / doesn't make sense for the other classes.\r<br />\n<br />\nWe really need to make a concerted effort to get that up-to-date.  As for me, I had gotten the addon working for some mop versions (though not the latest), but I lost motivation because the models were out-of-date (so who cares about the addon import / export path if the theorycrafting is broken).  If I get a sense that there is a significant up-take then maybe I can pitch in and do my part.  Heck, my main is a cat / bear, so I am motivated to fix that too, if only it feels like the tool is not dead.\r<br />\n<br />\nHow do we make sure that enough ppl are on board?  I see your plea for help, but is that a sufficient strategy?  Maybe someone should spam the theorycrafting forums too?\r<br />\n<br />\nChar<br />\n",
    "PostedDate": "2013-12-06T10:58:36.387-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1132605",
    "ThreadId": "472104",
    "Html": "That's why I made the discussion.  I'm also going to eat some humble pie and go to Elitist Jerks this weekend; I also plan on opening an official Rawr Twitter account (that will be passed along to whomever the current maintainer is, should I ever give it up) that we can post updates and requests with.  I'm planning on getting some feedback on the official WoW forums, too.  I'm on a Druid podcast that I put in a plug for to hopefully find some Druids out there that might want to help us.  I'm trying to broaden my advertising strategy.  Right now, we have myself on Moonkin, and Omniaa on Mage (and even he's not putting in as much effort as he used to).  We had a guy come along for Warlock, but I have no idea what happened with that.  I am absolutely intending on getting more people to establish at least a respectable set of models; I don't expect to ever have all 34 specs represented and maintained, but I hope to get some reasonable percentage thereof.  And I will be advertising every way I can find, not just here.<br />\n",
    "PostedDate": "2013-12-06T11:30:11.81-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1132708",
    "ThreadId": "472104",
    "Html": "Hi,\r<br />\n<br />\nThanks a lot for your response.  Just to be clear, I wasn't trying to be discouraging, I was just explaining my dilemma / blocking factors to contributing.  If the momentum is there it will probably get me off my butt to pitch in too.\r<br />\n<br />\nI was also wondering if the right thing to do at this point is re-brand Rawr for what it can really do.  For that, I mean, should we just turn off the models that are just out of date?  Or maybe is there room for some kind of generic model that just accumulates stats so if you want to see your stat summary from one set of gear to another (but without any analysis) you can do that?  It's of limited value to be sure, but it's no less value than models that are obsolete and incorrect entirely.\r<br />\n<br />\nChar<br />\n",
    "PostedDate": "2013-12-07T00:29:37.477-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1132742",
    "ThreadId": "472104",
    "Html": "Well, going into Warlords I am absolutely turning off/disabling models that don't work, but largely because I've already changed some core Rawr mechanics and don't want to spend time picking through irrelevant models to fix compile errors.  A default model that has zero deep analysis might help - I know some people get turned off by an application that crashes or does some other unexpected behavior when they load a character, even if they've been told their character isn't supported.  Those are both good suggestions as far as how to do the best with the staff we have, but one thing we definitely need (that I've agreed with you on for a while) is to try to staff up and just get some more working models.  That'll bring people to actually use our program, because you're right - if Mage and Moonkin are the only two functional areas, they're both widely represented classes but it's still only 2 of 34 possible specs!<br />\n",
    "PostedDate": "2013-12-07T05:33:02.29-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1132997",
    "ThreadId": "472104",
    "Html": "I am probably going to be coming back to Rawr soonish; possibly this week. May need to get in touch with Dope about it. Basically had some job issues recently and I have some free time at least until the start of the new year hopefully longer. I don't think I'll be able to get back into the Feral or Guardian modules since I really have not been following the theorycrafting on it recently. Due to switching my main to Monk, I can probably work on that. Considering even after 1 expansion there is disagreement on how to play the Windwalker spec (and Blue posts stating as such), if I can get that working, I think I can get that going.<br />\n",
    "PostedDate": "2013-12-08T19:11:41.823-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1149683",
    "ThreadId": "472104",
    "Html": "Hi. I recently have come back to playing wow and I might be able to help, I am still updating myself on the theorycraft, I am going to download the source and start taking a look at it to see if I can handle it. Haven't really worked with C# just done official courses but i do have experience with web java development, going to fire up visual studio and start taking a look, but please tell me if the project is still active.<br />\n",
    "PostedDate": "2014-01-05T05:44:26.647-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1149923",
    "ThreadId": "472104",
    "Html": "Hey!  Yeah, the project is still active, albeit barely.  Development has been in a bit of a lull because I've had other stuff going on, but I'm hoping to get started on integrating the new secondary stats and cleaning up the old useless stats here Soon (tm).  You're more than welcome to play around with the source code as you like.<br />\n",
    "PostedDate": "2014-01-06T05:52:28.57-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1151363",
    "ThreadId": "472104",
    "Html": "Hi I recently restarted playing Wow. I reached level 90 yesterday. I'm a french player so sorry for my English. I'm a C# developer. I'm not an expert on theorycrafting but, if I can help on development, I may have a look on my personnal time and help with some code too.\r<br />\n<br />\nNico<br />\n",
    "PostedDate": "2014-01-09T07:00:54.357-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1152585",
    "ThreadId": "472104",
    "Html": "I am not playing WoW anymore, but I am still interested in working on this.  I will look into getting the Elemental and Enhance modules back into working order.<br />\n",
    "PostedDate": "2014-01-10T20:55:36.777-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1158323",
    "ThreadId": "472104",
    "Html": "Nicco, I approved your developer request today.  Welcome to the team. :) Timetodance, thank you, that would be wonderful.  I appreciate everyone's help on this, it's a big project but I hope we can make it go again.<br />\n",
    "PostedDate": "2014-01-12T11:03:39-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1160311",
    "ThreadId": "472104",
    "Html": "Thanks. I will download asap the source code. I will need a few time to navigate into the code ;)<br />\n",
    "PostedDate": "2014-01-13T00:41:40.793-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1170125",
    "ThreadId": "472104",
    "Html": "Hey, I'm in the same spot as Nicco, I just started back up but I'd be willing to put in some time to at least try and get the Retribution model up to date. Looks like a good chance to expand my C# knowledge out of ASP.NET a little more. If you need any of my credentials let me know. My resume isn't exactly up to date but I'm sure I can put something together.<br />\n",
    "PostedDate": "2014-01-15T13:26:08.81-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1210824",
    "ThreadId": "472104",
    "Html": "Hello. I would be willing to help. I have been working with C# since it was released.<br />\n",
    "PostedDate": "2014-02-19T16:16:06.307-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1219438",
    "ThreadId": "472104",
    "Html": "The models development page has not been updated since 2012.  My main is priest and I am a senior developer with decades of development experience, including years of C#.  Is priest model needing a maintainer?<br />\n",
    "PostedDate": "2014-03-05T05:43:11.05-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1220185",
    "ThreadId": "472104",
    "Html": "I'll work on updating the <a href=\"https://rawr.codeplex.com/wikipage?title=Models\" rel=\"nofollow\">model status</a> page.<br />\nI am reasonably certain that we do not have anyone maintaining the priest modules.<br />\n<br />\nEdit: Updated the model status page to the best of my knowledge.  For any existing and new developers, could you add yourselves to current developer section beside the module you are working on.<br />\n",
    "PostedDate": "2014-03-07T01:12:34.113-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1234028",
    "ThreadId": "472104",
    "Html": "Included this in my commit note for change 74181 that updates miss/parry/etc. to be in-line with removal of hit/expertise.  As part of this, there needs to be a decision on whether to &quot;rip the bandaid&quot; and take out Rawr.Base references to Hit/Expertise that will be removed in WoD.  That will cause most (all?) class modules to not build, but may give us a far more realistic picture of how far away from viability we are.\r<br />\n<br />\nI know generally the theory is &quot;don't break the build&quot;, but I think that's going to be tough in this situation.  All references to those could be commented out of the individual class modules, but without understanding the individual modules, there's a good chance that will host things up even worse and make it harder to find them to fix.  I did a test removal in Base, and got about 80 bad references in just that module alone.  This one isn't going to be fixed overnight, but wanted to at least get the discussion rolling here.<br />\n",
    "PostedDate": "2014-04-14T12:52:27.443-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1234033",
    "ThreadId": "472104",
    "Html": "I agree that it's the right thing to do.  I'm uncertain if it's the right thing to do right now.  I have a changeset in flight for Moonkin right now; after I'm finished working on these changes, why don't I have a look at how bad it'll be for removing hit/expertise from Base.  I know a bit more about the Base code and I can hopefully figure out how to fix at least that code correctly.<br />\n",
    "PostedDate": "2014-04-14T12:56:58.473-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1253886",
    "ThreadId": "472104",
    "Html": "This project is dead, otherwise you would properly respond to e.g. my application as a developer....<br />\n",
    "PostedDate": "2014-06-06T14:09:59.147-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1253888",
    "ThreadId": "472104",
    "Html": "Well, I'm incredibly sorry that I don't get everything done on your timetable.  Duly noted.<br />\n<br />\nEdit: And considering that you're already a developer, I'm not exactly sure what else you would want me to do.<br />\n",
    "PostedDate": "2014-06-06T14:13:41.123-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1256814",
    "ThreadId": "472104",
    "Html": "I'll be returning as well, but alas not on shaman.  Hard to work on a class I haven't played seriously since the end of ICC.<br />\nThere's just such a massive black hole of decent theorycraft in the holy paladin world, being one gives you not a lot of places to turn for information.<br />\n<br />\nMost just go to icy veins and use AMR to spit out whatever gear it assumes you need.  With randomness coming to gear down the road with special ratings, rare sockets, if there were ever a time to get Rawr back up and running, now would definitely be the time.<br />\n",
    "PostedDate": "2014-06-16T13:10:56.267-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1261918",
    "ThreadId": "472104",
    "Html": "Hi!\r<br />\n<br />\nI'm Rottennerve from EU-Daggerspine, semi-hardcore player since Vanilla till the start of cata. I'm also a game programmer IRL and I'm currently returning to WoW and gearing up.\r<br />\n<br />\nSo:\r<br />\n<br />\nI connected to SVN, downloaded rawr and saw a lot of errors during compilation, strange that ppl keep committing changes that didn't work.\r<br />\n<br />\nAs I'm playing on mage mostly I unloaded other classes and made it to compile only a mage. Doing so I found silly hardcoded default class in Characters.cs although I had a Mage being configured in Settings.Designer.cs.\r<br />\n<br />\nOkay, so yay, it is built and it works! Firstly i will try to update the maximum numbers of upgrades from 2 to 4 for SoO items.\r<br />\n<br />\nPlanning to check the rotation for Frost as I can believe what mr robot says these days about haste&gt;int stuff, but you can't blame mr. robot - it has a static weights table.\r<br />\n<br />\nCheers!\r<br />\n<br />\nYours sincerely Rottennerve @Daggerspine Furious Few guild<br />\n",
    "PostedDate": "2014-07-02T04:32:19.713-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1261924",
    "ThreadId": "472104",
    "Html": "Okay, I have read some previous posts: I get it now why there are some compilation issues :)<br />\n",
    "PostedDate": "2014-07-02T04:48:15.007-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1262028",
    "ThreadId": "472104",
    "Html": "Hi Rotten,\r<br />\n<br />\nGuessing from your second message that you've sorted it out, but basically the stat changes with WoD led us to strip out the stats in the core (Rawr.Base), which resulted in all modules referencing that not building.  I think the general idea was to give a little time for people to fix modules that are active or semi-active, then remove modules from building that are not at all updated.<br />\n\r<br />\nTo All - I'm thinking about a stop-gap here to still allow everything to build where we basically go in and comment out the lines that aren't needed but add exceptions to be thrown if they're actually initialized (selected) in the interface.  That would allow things to build, but still signal clearly what is and is not ready for even basic usage.  Basic goal here is to just &quot;un-break&quot; the build so that people who are trying to get involved don't have a hard up-hill climb to even get the thing to build and enable walking through the code.  Thoughts?\r<br />\n<br />\nOpOv<br />\n",
    "PostedDate": "2014-07-02T09:32:34.243-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]