[
  {
    "Id": "158175",
    "ThreadId": "47267",
    "Html": "Hi there, when I import my armory info into Rawr (hit capped) and look at gear upgrades, everything seems pretty much right on.  It's the gemming that I have issue with.  Like I mentioned I am hit capped (and Rawr recognizes this in the hit % stat), but when I look at say, a chest upgrade to the valorous piece, Rawr is still suggesting gems with +hit on them.  Why is this?\r\n",
    "PostedDate": "2009-02-16T10:45:06.107-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "158211",
    "ThreadId": "47267",
    "Html": "You're probably not buffing yourself. Goto the Buffs tab, and fill out what buffs you typically have.<br>\r\n",
    "PostedDate": "2009-02-16T11:51:24.397-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "158271",
    "ThreadId": "47267",
    "Html": "Well you're partially right - I wasn't doing a full list of typical buffs, but I was including misery for the extra 3% hit - which has me over the hit cap.  Went ahead and did a full list of buffs though - In the 'stats' tab, hit cap for Arcane is 100% (even if I gear myself to be 100% hit for all spells the following happens) - yet when I go to chest gear, it still tells me that the top piece for my spec is Valorous Robe - with a +spellpower/+hit gem.  I thought maybe the bonus from gemming properly came into play, but... the bonus stat from gemming properly is:  +hit.  Makes no sense. \r\n",
    "PostedDate": "2009-02-16T13:52:28.103-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "158276",
    "ThreadId": "47267",
    "Html": "Do you have a hit gem in any equipment with an added socket (Hands/Wrist/Belt)\r\n",
    "PostedDate": "2009-02-16T14:09:54.153-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "158281",
    "ThreadId": "47267",
    "Html": "I don't - all of my hit rating comes from gear, no gems.\r\n",
    "PostedDate": "2009-02-16T14:26:42.067-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "158286",
    "ThreadId": "47267",
    "Html": "Did you perhaps use the Default Gems tool to replace all gems with sp/hit gems or something? ie, are there other gemmings of Valorous Robes there that are rated lower?<br>\r\n",
    "PostedDate": "2009-02-16T14:46:42.433-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "158321",
    "ThreadId": "47267",
    "Html": "I didn't set any gem preferences for gems.  The 2nd best option it's giving me is the same valorous robe but with a spell power/crit gem instead of hit (which again is strange that it's throwing in a crit gem when crit is almost the lowest priority stat for my spec) - I even checked the default gems option and nothing is set.\r\n",
    "PostedDate": "2009-02-16T17:53:07.32-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "158335",
    "ThreadId": "47267",
    "Html": "Post your character and we can take a look.<br>\r\n",
    "PostedDate": "2009-02-16T18:40:36.36-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "158376",
    "ThreadId": "47267",
    "Html": "<a href=\"http://www.wowarmory.com/character-sheet.xml?r=Crushridge&n=Stresstest\">http://www.wowarmory.com/character-sheet.xml?r=Crushridge&amp;n=Stresstest</a><br>\r\n<br>\r\nArmory is not updating my gear tonight - swap out the offhand for Ward of the Violet Citadel and 1st trink for Dying Curse - that's my hit cap gear.\r\n",
    "PostedDate": "2009-02-16T21:42:01.5-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "158390",
    "ThreadId": "47267",
    "Html": "No, we need your actual character file, in order to see where you're going wrong. You can attach it to a new Issue here, or post it somewhere else and link it here.<br>\r\n",
    "PostedDate": "2009-02-16T23:21:06.233-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "158503",
    "ThreadId": "47267",
    "Html": "My bad - just uploaded it to the 'Issues' forum.\r\n",
    "PostedDate": "2009-02-17T07:28:42.593-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "158536",
    "ThreadId": "47267",
    "Html": "Hmm, when I load up your xml in rawr for chestpieces it gives the Valorous chest as the top item, with the gemmings in this order:<br>\r\n<br>\r\nSP SP<br>\r\nSP SP/Haste<br>\r\nSP SP/Int<br>\r\nSP SP/Crit<br>\r\nSP SP/Hit<br>\r\n<br>\r\n<br>\r\n(note these are all rare-quality cuts)<br>\r\n<br>\r\nThis is what I'd expect for an arcane mage, since the socket bonus is currently useless at hit cap, and haste is your best stat besides spellpower - this is the order I would expect to see.<br>\r\n<br>\r\nAre you sure it's only choosing rare-quality cuts for you?&nbsp; Maybe it sees an epic cut with SP/Hit and rates that higher for some reason than a rare or green cut of another type?&nbsp; Any time I get a new item cache I setup my default gemmings over again, because the gems that the default comes with are nigh-unusable.<br>\r\n<br>\r\nI suspect a discrepancy in your gemmings but who knows.<br>\r\n",
    "PostedDate": "2009-02-17T09:15:05.05-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "158555",
    "ThreadId": "47267",
    "Html": "I definitely agree that what it shows for you is optimal for my spec.  That is actually what I'd expect to see... Let me do some more digging on the gemming options.  I suppose maybe the defualt gem status (which has to be in effect here as I've chosen no gem preferences) is the culprit.  In which case, that's odd to me that the program's default is set to show gems that aren't obtainable in game yet.\r\n",
    "PostedDate": "2009-02-17T10:12:20.703-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]