[
  {
    "Id": "158323",
    "ThreadId": "47304",
    "Html": "Several Requests to be added from a protection paladin point of view.<br>\r\n<br>\r\nI have noticed <em>threat scores</em> on items does not reflect shield <em>block value</em> increasing shield of the Righteous damage.&nbsp; I would like this to be fixed.<br>\r\n<br>\r\nI would like <em>Seal options</em>.&nbsp; Seal of Vengeance/Corruption, Seal of the Martyr/Blood, and even Seal of Command.&nbsp; <br>\r\n<br>\r\nI would like <em>glyph options</em>.&nbsp; Glyph of Seal of Vengeance is an important one.<br>\r\n<br>\r\nI would like adjustable <em>spell priorities</em>.&nbsp; One thing that comes to mind.&nbsp; I had spent a great deal of time testing the diffrences between waiting to judge before casting Shield of the Righteous in order to activate my Libram of Obstruction.&nbsp; It would be great to be able to calculate exactly when it is better to just cast Shield of the Righteous when it is available, or to wait for a judgement to increase the block value before casting. &nbsp;&nbsp; <br>\r\n<br>\r\nThere are <em>no librams</em> in the item database.&nbsp; The main one is pretty important to our threat and our mitigation.&nbsp; Libram of Obstruction.&nbsp; <span>Equip: Your Judgement ability also increases your shield block value by 352 for 5 sec.</span><br>\r\n<br>\r\n<em>Number of targets</em> being tanked option.&nbsp; This is important for coming up with good trash, farming, and AoE sets for certain encounters.&nbsp; This also helps choose which spells to prioritize while fighting various numbers of mobs.&nbsp; I remember this being part of tankadin but was somewhere lost during wrath and 3.0 changes.&nbsp; <br>\r\n<br>\r\n<em>Resilience</em> needs to be updated for WotlK.&nbsp; It would be nice if the condition for &gt;5.60% chance to be crit understood resilience.&nbsp; Resilience is the very best way to reduce crits.&nbsp; Point for point Defense is better overall but when you think about the packets resilience comes in vs defense, resilience has a few advantages.&nbsp; The 20 resilience epic gem from Wintergrasp needs to be added.<br>\r\nI see that the shoulder enchant was added by Holy.&nbsp; Thanks BTW.<br>\r\n",
    "PostedDate": "2009-02-16T17:56:13.553-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "158997",
    "ThreadId": "47304",
    "Html": "Ya, there is a bunch of stuff I would like to add to Tankadin. I haven't really done much with it since I initially made it (except for bug fixes). Hopefully I will be able to add more features to it &quot;Soon (tm)&quot;.<br>\r\n",
    "PostedDate": "2009-02-18T07:53:00.35-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "159198",
    "ThreadId": "47304",
    "Html": "Thanks for the reply Ermad.&nbsp; I thought about updating it myself, but I figured it would be better if someone with some rawr developing expierence did it instead.&nbsp; If you would like to contact me to go over some of the math let me know.<br>\r\n",
    "PostedDate": "2009-02-18T16:16:23.36-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "159203",
    "ThreadId": "47304",
    "Html": "If you want to develop for it feel free, I am not to enthused about it since I don't play prot the much anymore. If you any questions please ask me.<br>\r\n",
    "PostedDate": "2009-02-18T16:50:32.12-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "159352",
    "ThreadId": "47304",
    "Html": "You seem very well versed and I would prefer you, or someone else that knows what they are doing, work on some of these requests.&nbsp; My programming background is not very strong.&nbsp; I merely wanted to point out some features that would be nice from a pro prot paladin that uses Rawr a great deal.&nbsp; <br>\r\nI recall there being more options like &quot;Number of targets.&quot; pre 3.0 but perhaps that was lost when it was updated or redone.&nbsp; That would make a huge deal in forming a personal flow chart for what spell to use when fighting a certain number of mobs.&nbsp; This would change the flow of spells being cast in the range of 2-5 mobs.&nbsp; I could see how a large amount of programming would be required to determine all the possible rotations.&nbsp; <br>\r\nEven if it did not try to calculate how much DPS/TPS you would deal with the ideal spell sequence, it would be nice to know whether for example concencrate did more damage total to 5 mobs for one GCD than Hammer of Cleave hitting 3/5 of the targets on average.&nbsp; I prefer using a priority over using the standard 69 rotation for obvious reasons.&nbsp; It would be great to know for certain using Rawr what spells to select at various numbers of mobs.&nbsp; <br>\r\nI was thinking it would be easy to add a Seal of the Martyr and some glyph options since it was done for Ret already.<br>\r\n",
    "PostedDate": "2009-02-19T03:09:16.947-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "160035",
    "ThreadId": "47304",
    "Html": "I've been slowly putting in my own updates but I havent' looked into commiting any of them to source without knowing whether or not someone was still intending to develop it. My coding skills are sub-par but it's only C# or whatnot.<div><br></div><div><div>I am in the middle of adding a seal choice option, but I'd like to hear what your or other member's priorities are in terms of updates or necessary additions. Jenovadin if you want to put our heads together and try to work on the module together, that would be perfectly fine.<br></div><div><br></div><div>My set of priorites are at the moment in this order:</div><div><br></div><div>Switching from a Seal of Righteousness default threat model to a Seal of Vengeance (5 stack assumption for simplicity) model.</div><div>Adding a choice between said two models.</div><div>Glyphs - Seal of Vengeance, Seal of Righteousness, Judgement</div><div>Anticipating 3.1 changes</div><div>Improved Block Value Calculations</div><div>Working on a Priority system between &quot;9-second&quot; filler abilities such as Consecration and Exorcism using a mobility % rating as a base</div><div>Fixing to-be-crit calculations and adding it into the optimizer as a requirement.</div><div>Mana as a consideration: linking Spiritual Attuement to incoming boss damage, Blessing of Sanctuary, etc.</div><div><br></div><div>Number of targets is on my internal list but it is not as clear cut as it was pre-3.0 in my opinion, because of the overlapping duration and cooldown as well as the Blessing of Sanctuary change.</div><div><br></div><div>At the moment I have only worked on the seal change in a tangible fashion, and otherwise I haven't proofread the original module's math either.</div><div><br></div><div><br></div></div>",
    "PostedDate": "2009-02-19T22:01:34.99-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "160037",
    "ThreadId": "47304",
    "Html": "Let me know if either of you need dev access.",
    "PostedDate": "2009-02-19T22:12:57.767-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "160047",
    "ThreadId": "47304",
    "Html": "I am pretty sure that it assumes SoV currently. It also has the math in for the TPS for SoR, but it isn't used in any final rating result.<br>\r\n",
    "PostedDate": "2009-02-19T23:29:31.393-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "160055",
    "ThreadId": "47304",
    "Html": "Admittedly I had *just* found that out shortly after I made that post. I got confused between Seal of Corruption and Seal of Vengeance naming schemes. Boy, is my face red.",
    "PostedDate": "2009-02-20T00:32:33.81-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "160057",
    "ThreadId": "47304",
    "Html": "Yeah i believe it is called SoC (horde version corruption).&nbsp; It is not under options but it is listed under TPS on the main tab.<br>\r\n",
    "PostedDate": "2009-02-20T00:35:54.073-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "160775",
    "ThreadId": "47304",
    "Html": "I requested Dev access via a PM earlier, can you hook me up?",
    "PostedDate": "2009-02-22T18:25:54.757-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "160778",
    "ThreadId": "47304",
    "Html": "Whoops, knew I forgot something. Sorry about that. Fixed, both of you.",
    "PostedDate": "2009-02-22T18:39:09.6-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]