[
  {
    "Id": "160772",
    "ThreadId": "48179",
    "Html": "Hey all. I just finished posting the first beta of Rawr v2.2:<div><br></div><div><a href=\"http://rawr.codeplex.com/Release/ProjectReleases.aspx?ReleaseId=25093\">http://rawr.codeplex.com/Release/ProjectReleases.aspx?ReleaseId=25093</a></div><div><br></div><div>It's not done yet, but we wanted to show everyone what we're working on, since it makes such a big difference. It's beta quality; you'll probably encounter some bugs. Please use this thread to report bugs and give feedback on the new gemming system. Thanks!</div><div><br></div><div>EDIT: Replaced link with v2.2.0b5.</div>",
    "PostedDate": "2009-02-22T18:01:44.553-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "160801",
    "ThreadId": "48179",
    "Html": "FYI, there was a crashing bug in Rawr.Enhance, and a bug with gemming templates for Enhance and ProtWarr being all disabled by default. I fixed those, and reposted v2.2.0b1. The version number hasn't changed, but if you are one of the 90 people who downloaded it before 8:20 PST, and use either of those two models, re-download v2.2.0b1.",
    "PostedDate": "2009-02-22T20:19:49.997-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "160811",
    "ThreadId": "48179",
    "Html": "Ticking BS socket (waist) doesn't update the current item until you switch back and forth with another item.<br>\r\n",
    "PostedDate": "2009-02-22T21:53:27.193-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "160818",
    "ThreadId": "48179",
    "Html": "Well, currently, that's intended. But, I'm not sure if it should be that way, or not. I'm leaning toward yes, it should be the way you describe. However, I'm open to feedback on that. Any other thoughts?",
    "PostedDate": "2009-02-22T22:32:46.47-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "160819",
    "ThreadId": "48179",
    "Html": "Please don't take this the wrong way, as I do appreciate the effort you've taken to improve the gemming system in Rawr.<br>\r\n<br>\r\nIt is still unintuitive and only marginally better than the previous incarnation (for me), as far as I can tell in the time I've had to play with it so far.<br>\r\n<br>\r\nIt boils down to the fact that I still don't &quot;get&quot; the idea of templates. Why not just have:<br>\r\n<br>\r\n<blockquote><em>Select the gems you want us to consider. We'll figure out the best combination to fill your sockets.</em><br>\r\n<br>\r\n<strong>Red:</strong> Runed Scarlet Ruby<br>\r\n<strong>Yellow:</strong> Quick Autumn's Glow<br>\r\n<strong>Blue:</strong><br>\r\n<strong>Green:</strong> Forceful Forest Emerald<br>\r\n<strong>Orange:</strong> Reckless Monarch Topaz, Potent Monarch Topaz<br>\r\n<strong>Purple:</strong> Glowing Twilight Opal<br>\r\n<strong>Meta:</strong> Chaotic Skyflare Diamond<br>\r\n<br>\r\n</blockquote>And have optimizer figure it out from there. There must be something about the benefit of templates that I'm missing. In any case, here's my initial feedback.<br>\r\n<br>\r\nEdit: Apparently gemming templates are only used for the comparison chart and have no affect on optimizer (aside from the option mentioned below).<br>\r\n",
    "PostedDate": "2009-02-22T22:41:00.883-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "160820",
    "ThreadId": "48179",
    "Html": "I don't think it should, buying a bs socket doesn't put a gem in it, and potentially there are several options what you want to put in it. You also don't have to switch back and forth with another item. When you tick bs socket the comparison chart will list all gemmings that utilize the bs socket, in addition it will show the current item without the gem in the socket. All you have to do is equip whichever version of the item you want, no need for two equips.\r\n",
    "PostedDate": "2009-02-22T22:41:54.38-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "160823",
    "ThreadId": "48179",
    "Html": "korey:<br>\r\n<br>\r\nThe main reason why we don't try to determine the best gemming out of all possible combinations is because of performance reasons. It is just not feasible to do that for comparison charts. Besides optimizer already does that.<br>\r\n<br>\r\nAnother thing to note is that the best possible gemming it shows based on templates is most likely the best overall, so maybe the only thing you're missing is the option to hide all except top n gemmings of an item. That is still planned before we put a final release out as noted in the the help section, we just didn't have time to put it in this beta preview.\r\n",
    "PostedDate": "2009-02-22T22:47:39.09-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "160825",
    "ThreadId": "48179",
    "Html": "Kavan: Ohhh. Is the only point of the templates for the comparison charts on the right? If so, then I take my above post back, although it may be good to explain to users what the point of the gemming system is. Optimizer only looks at the available gems you have checked off and has nothing to do with the gemming system?<br>\r\n",
    "PostedDate": "2009-02-22T22:56:34.567-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "160826",
    "ThreadId": "48179",
    "Html": "If I uncheck all of the 'templates' in the gemming templates, but select the gems i like in the comparison charts with the diamond, and run the optimizer, will the optimizer just choose all of the best gemmings regardless of what I chose in templates?&nbsp; I don't think this is how it works (although this is how korey is misinterpreting your statements, as far as I can tell), because otherwise how would it know when, or when not to use Jewelcrafting gems.<br>\r\n",
    "PostedDate": "2009-02-22T23:13:35.293-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "160830",
    "ThreadId": "48179",
    "Html": "The gemming system and the optimizer are <strong>entirely</strong> separate, with only one exception: There is an <em>option</em> (which is ON by default), to count all gems in enabled gemming templates as available to the optimizer. The optimizer will still take all of those gems and find the best possible gemmings for all your gear. That's in Tools &gt; Options &gt; Optimizer Options.<div><br></div><div>The gemming templates are used only for creating gemmings of items for comparisons in the charts. </div><div><br></div><div><br></div><div>Also, that reminds me, I forgot to mention. Another feature to the gemming system that is still coming is that the &quot;Enforce Metagem Requirements&quot; checkbox will soon become &quot;Enforce Gem Requirements*&quot; On hover, it'll say, &quot;When checked, gems will not be counted towards your stats, if you do not meet their requirements. This includes metagems where you don't meet the metagem requirement, <strong>and unique gems where you already have the maximum number of those gems (such as Dragon Eyes, and Enchanted Tears)</strong>&quot;.</div>",
    "PostedDate": "2009-02-22T23:29:49.93-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "160835",
    "ThreadId": "48179",
    "Html": "Yes gemming templates are only used for comparison charts. The main point of gemming templates is that before item cache stored each gemming of an item and as result you'd end up with agi gems in cloth gear and similar. With the new system the item cache only stores the item information, gemmings are created as needed based on what model you are using.<br>\r\n<br>\r\nOptimizer as before only uses whatever gems are marked as available. There is a new option though (enabled by default) to treat gems from enabled templates as enabled for optimizer. This is mainly to make it easier for new users so they can load a character from armory and go straight to optimize without having to mark everything as available. The same as before optimizer looks at all possible combinations of available gems, it is not restricted to combinations available in templates.<br>\r\n<br>\r\nIf you have jewelcrafting gems marked as available the optimizer checks how many total jewelcrafting gems are equipped and if there are more than 3 it marks that gear set as 0 score. This is not done for comparison charts although we might add another option to enforce jewelcrafting gem count similar to how we have enforce meta gem.<br>\r\n<br>\r\nEDIT: I was too slow :)\r\n",
    "PostedDate": "2009-02-22T23:34:15.183-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "160878",
    "ThreadId": "48179",
    "Html": "The new gemming system looks good and does what it should. Good work! <br>\r\n<br>\r\nOne thing (not related to the gemming system): would it be possible to somewhere toggle the set bonuses? E.g. marking a part of the graph with a different color, to see how much the set bonus counts or so? Just a suggestion, because I often wonder how much a tier item if worth with and without the set bonus.<br>\r\n<br>\r\nBezerk<br>\r\n",
    "PostedDate": "2009-02-23T02:14:55.017-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "160983",
    "ThreadId": "48179",
    "Html": "Goto the All Buffs chart, you'll find set bonuses included in that chart.",
    "PostedDate": "2009-02-23T08:42:35.693-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "160990",
    "ThreadId": "48179",
    "Html": "@Kavan:<br>\r\nI see the problem. I was checking it in Rawr.Cat with all prismatic set to Strength gems.<br>\r\nIf you have different possibilities for prismatic choices I can see why it makes sense not to update the equipped item.<br>\r\nThen again, I guess it's a non-issue if belt socket is on by default (or when imported), since you will never un-check it.<br>\r\n",
    "PostedDate": "2009-02-23T08:50:23.407-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "161018",
    "ThreadId": "48179",
    "Html": "I'm using the Ret Pally module and was wondering, are there supposed to be no talents?<br>\r\n",
    "PostedDate": "2009-02-23T09:46:39.987-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "161065",
    "ThreadId": "48179",
    "Html": "Ummm... No talents? Huh?<div><br></div><div>There's no built-in saved talent specs for Ret, if that's what you mean? </div>",
    "PostedDate": "2009-02-23T11:18:37.247-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "161072",
    "ThreadId": "48179",
    "Html": "Ohh weird. Well it looks like the talents are there it's just that there are no icons for them. I just have to move the mouse around where the talent icons should be and click when the popup text comes up.<br>\r\n",
    "PostedDate": "2009-02-23T11:31:19.69-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "161084",
    "ThreadId": "48179",
    "Html": "I have no idea what you're talking about. Can you post a screenshot?",
    "PostedDate": "2009-02-23T12:12:49.51-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "161091",
    "ThreadId": "48179",
    "Html": "Here's what I see when I look at the talent selection area:<br>\r\n<br>\r\nhttp://www.image-shared.com/share-B113_49A30752.html<br>\r\n<br>\r\nAs you can see only the icons for a few talents at the top exist. The rest are still there (as you can tell by &quot;One Handed Weapon Specialization&quot; talent popup toward the bottom of the screen) but they are missing the icons. It's the same way with the Retribution tree but the Holy tree does have all the icon placeholders (all the images are of the guy's head).<br>\r\n",
    "PostedDate": "2009-02-23T12:32:47.07-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "161093",
    "ThreadId": "48179",
    "Html": "Oh, it's that same broken image problem that another user (and you?) have. For some reason, your images are corrupted or locked or something. I'd suggest closing Rawr, opening your Data folder, deleting the 'images' and 'talent_images' folders, and relaunching Rawr.",
    "PostedDate": "2009-02-23T12:36:10.31-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "161152",
    "ThreadId": "48179",
    "Html": "Is there a way to have the option available from V2.1.9 where you can (on the right side of the program) to right click an item and &quot;delete duplicates&quot;?  I found I was able to reduce my choices and then gem the remaining one to a choice I liked?\r\n",
    "PostedDate": "2009-02-23T14:45:51.547-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "161154",
    "ThreadId": "48179",
    "Html": "There no longer are duplicates. Please see Help &gt; Gemming.",
    "PostedDate": "2009-02-23T14:50:14.41-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "161159",
    "ThreadId": "48179",
    "Html": "Edit ** - Duplicate\r\n",
    "PostedDate": "2009-02-23T14:56:33.057-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "161594",
    "ThreadId": "48179",
    "Html": "I'm using the Mage model in 2.2.0b1.&nbsp; I loaded my character that was last saved with 2.1.9, and look at Sequence.&nbsp; The score at the bottom is 59.83, and at the top it say &quot;Sequence Reconstruction was not fully successful, it is recommended that you enable advanced solver by using segment cooldowns and integral mana consumables options!&quot;<br>\r\n<br>\r\nWhen I enable Segment Cooldowns for Display, I get an error that says &quot;SMP algorithm exceeded maximum allowed computation limit. Displaying the last working solution. Increase the limit in options if you would like to compute the correct solution.&quot;&nbsp; I click OK, and Rawr thinks for a bit, then displays the error again.&nbsp; The only way out is to End Proccess with the Task Manager.<br>\r\n<br>\r\nMy SMP Computation Limit is set to 300.&nbsp; My SMP Search Method is BestBound. Bumping Computatoin Limit to 1000 gives the same result.&nbsp; Bumping it to 30,000 makes it take a long time (first using a ton of CPU, then using almost none, but not responding) before it lets me look at the sequence.<br>\r\n",
    "PostedDate": "2009-02-24T12:14:04.043-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "161602",
    "ThreadId": "48179",
    "Html": "Please attach the character file in question. (Post it somewhere and link it here, or attach it to a new issue)",
    "PostedDate": "2009-02-24T12:38:34.78-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "161667",
    "ThreadId": "48179",
    "Html": "Done.&nbsp; Issue is <span id=\"ctl00_ctl00_MasterContent_Content_TitleLabel\">&quot;2.20b1 hang with Segment Cooldowns</span>&quot;<br>\r\n",
    "PostedDate": "2009-02-24T15:00:51.86-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "161679",
    "ThreadId": "48179",
    "Html": "I didn't see anything about enchantments on the already reported bugs, but I can't choose &quot;no enchant&quot; on any slots on my character if for instance I upgraded an item without enchantment.<br>\r\n<br>\r\nAlso if I choose an enchantment on a new character without any data at all I get unhandled exception. of course there wouldn't be any reason to doing this but it's still an issue :)<br>\r\n",
    "PostedDate": "2009-02-24T15:37:16.103-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "161701",
    "ThreadId": "48179",
    "Html": "I really like the changes done to the gemming system. However, I do miss the feature to be able to right-click on an item and be able to Delete it. I don't want the LK Honor 5 items with iLevel 252 in my chart, and before 2.2, you could easily right-click and delete such items.\r\n",
    "PostedDate": "2009-02-24T16:34:13.697-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "161704",
    "ThreadId": "48179",
    "Html": "OK, thanks. ",
    "PostedDate": "2009-02-24T16:45:05.517-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "161744",
    "ThreadId": "48179",
    "Html": "Is there a way to edit notes for the items in question? An example is the Runecaster's Mantle (item code 37196). When I click on Tools &gt; Edit items, and then select the mantle it shows item source as &quot;Unknown Location, please refresh&quot;.  I know I can refresh from Armory or Wowhead, however if I wish to add my own notes, would this be possible?<br>\r\n<br>\r\nThanks in advance.\r\n",
    "PostedDate": "2009-02-24T20:12:46.353-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "161747",
    "ThreadId": "48179",
    "Html": "Yes, you can add that to the note field, just below the source in the item editor.",
    "PostedDate": "2009-02-24T20:18:55.533-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "161749",
    "ThreadId": "48179",
    "Html": "Thanks for that.. I had tried that first off but it didnt hold the data.. I just tried again and now it does hold. I am probably doing something wrong here, but it works now so all is good.. <br>\r\n<br>\r\nThanks for your time..\r\n",
    "PostedDate": "2009-02-24T20:23:49.863-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "161833",
    "ThreadId": "48179",
    "Html": "<p>Having used the application for a bit longer, I finaly realized which changes I would want to see to make it perfect:</p>\r\n<p>1. The delete feature back, which I already mentioned.</p>\r\n<p>2. Be able to turn off thoose horrible epic quality gems when changing in the template.</p>\r\n<p>3. A general filter for iLvl, i e only show iLvl &gt;= 213.</p>\r\n<p>4. While the gem templates are good, it still creates a Lot of instances of each item, making the comparasion tables become too large with unintresting information. At least for my use of the application, the only thing intresting for me is the very best instance of the item. So the option I am looking for is a checkbox for &quot;Showing only the best gemming&quot;, or something like that. In addition to that, it would be nice if there was an option to override that setting with the manually added gemmings.</p>\r\n",
    "PostedDate": "2009-02-25T02:55:13.54-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "161857",
    "ThreadId": "48179",
    "Html": "For 2 and 3 check http://www.codeplex.com/Rawr/Wiki/View.aspx?title=ItemFiltering\r\n",
    "PostedDate": "2009-02-25T04:19:05.09-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "161863",
    "ThreadId": "48179",
    "Html": "Excellent, much better!\r\n",
    "PostedDate": "2009-02-25T04:39:38.85-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "161992",
    "ThreadId": "48179",
    "Html": "I have a suggestion relating to handling gemming for currently equipped gear. <br>\r\nI personally find it a little tedious as a Jewelcrafter to keep track of what sockets I have added a Dragon's Eye to using Rawr, and also just viewing gem socket details in general.<br>\r\nWhy not add the sockets to the equipped item image? That way you could mouse over them to view them/change them.<br>\r\nAlso, if this sort of solution were implemented, it would make sense to add an option somewhere to turn it on/off.<br>\r\nI wish I could post a mockup image I made, but unfortunately, I'm behind the mother of all firewalls.<br>\r\n<br>\r\nThanks for making such a great piece of software! <br>\r\n<br>\r\nEdit: <br>\r\nDespite my picking of nits, the new gemming improvements are <em>much</em> better than the old system.\r\n",
    "PostedDate": "2009-02-25T10:13:56.66-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "161994",
    "ThreadId": "48179",
    "Html": "So far, I think the gemming system is much better and can't wait for it to be fully usable.&nbsp; Thanks!<br>\r\n",
    "PostedDate": "2009-02-25T10:15:58.63-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "162029",
    "ThreadId": "48179",
    "Html": "&quot;http://www.codeplex.com/Rawr/Wiki/View.aspx?title=ItemFiltering&quot;<br>\r\n<br>\r\nWhere would I have found this if I didn't already know where it was?&nbsp; I tried finding it from site navigation, but obviously didn't look in the right spot.&nbsp; Perhaps there are other gems I'm missing...\r\n",
    "PostedDate": "2009-02-25T11:38:14.783-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "162040",
    "ThreadId": "48179",
    "Html": "Click &quot;Help&quot; on the root wiki page, or goto Help &gt; Whatever, in Rawr.",
    "PostedDate": "2009-02-25T12:03:44.107-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "163245",
    "ThreadId": "48179",
    "Html": "i love this program to death and have been using it for a long time now. however, i don't think i can use the new gemming system. maybe i'm missing something but it seems like an awful lot of trouble to go through the template and set up several different gemming options for all gear pieces, which would fill my screen with way more options that i care to look at, if all i want to do is determine which gem in one specific piece of gear would be better than another gem. if i'm looking at 3 or 4 gems and the item has 2 or 3 slots, that is a lot of gem sets to go through. i would like to have the option to change each gem in that one piece of gear separately (the way it is now). i don't mind the template, but can we add an option to change slots in gear one by one for fine tuning purposes?\r\n",
    "PostedDate": "2009-03-01T12:56:06.96-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "163247",
    "ThreadId": "48179",
    "Html": "nevermind, i just found what i was looking for. apparently i need ot learn to read more ;)\r\n",
    "PostedDate": "2009-03-01T12:57:35.937-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "163333",
    "ThreadId": "48179",
    "Html": "Just posted v2.2.0b2, link at the top updated. Let us know how it works! :)",
    "PostedDate": "2009-03-01T20:08:09.95-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "163398",
    "ThreadId": "48179",
    "Html": "Your link still points to beta 1, but the text itself is correct :)<div><br></div><div>When starting Beta 2 it says a new version were released.</div>",
    "PostedDate": "2009-03-02T00:32:39.333-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "163402",
    "ThreadId": "48179",
    "Html": "My apologies, everyone, v2.2.0b2 was a bad build. Just posted v2.2.0b3.",
    "PostedDate": "2009-03-02T00:40:15.897-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "163403",
    "ThreadId": "48179",
    "Html": "Looks like i need to make enchants available for the optimizer in order to make them suggest enchants(This isn't the case with gemmings), and i think it would be more logical to exclude gemmings and enchants from the optimizer.",
    "PostedDate": "2009-03-02T00:55:36.363-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "163406",
    "ThreadId": "48179",
    "Html": "Equipped enchants when loading from the Armory, as well as any gems that are in any enabled gemming templates, are considered available to the optimizer, by default. You can turn that option off in Tools &gt; Options &gt; Optimizer. There's no way to exclude gemmings/enchants from the optimizer; 9 times out of 10, that's primarily what you're optimizing.<div><br></div><div><br></div><div>Also note, if you're one of the 29 people who downloaded v2.2.0b3 before 1AM PST, re-download it. There was a minor bug with it which I fixed and reposted it.</div>",
    "PostedDate": "2009-03-02T01:00:46.61-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "163421",
    "ThreadId": "48179",
    "Html": "Yeah i'm new to this, i heard about it because i was thinking of collecting some tank gear for 3.1, and Rawr is pretty nice to see some stats based on your current gear, so i left all the collected tank gear unechanted and ungemmed, but right now i'd say my gear is pretty nice, so i was wondering what the best combination of gems/enchants would be.<div><br></div><div>And thats where the problems came, because the optimizer didn't have any enchants available to it(As the gear imported didn't have enchants to begin with), but i made it work by making the enchants available for optimizer.</div><div><br></div><div>Anyways, all working now :P</div>",
    "PostedDate": "2009-03-02T01:20:00.88-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "163518",
    "ThreadId": "48179",
    "Html": "Aye, we have a sort of 'Tour of Rawr' walkthrough thing in the works, that should help new users understand how the Optimizer works, a little easier. Anyway, welcome to Rawr. :)",
    "PostedDate": "2009-03-02T09:12:49.86-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "164750",
    "ThreadId": "48179",
    "Html": "In the latest beta build, I can't get the filters to work correctly, when I want to hide epic gems. Is this a bug, or have I missed something? Works perfectly in earlier beta build.\r\n",
    "PostedDate": "2009-03-05T03:49:49.727-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "164834",
    "ThreadId": "48179",
    "Html": "When you uncheck the box next to the epic gems, does it gray out or show up blank?  For me it would gray out and not change anything until I clicked it twice which blanked it out and worked.",
    "PostedDate": "2009-03-05T06:43:44.373-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "165101",
    "ThreadId": "48179",
    "Html": "First of all, I LOVE the new gem system, thank you!&nbsp; I might have found a bug, or I could just be doing something wrong.&nbsp; When I ran the optimizer, I got a few instances of Runed Scarlet Ruby showing up in a blue slot, however none of my selected templates have that gem in a blue slot.<br>\r\n",
    "PostedDate": "2009-03-05T16:10:18.033-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "165122",
    "ThreadId": "48179",
    "Html": "Optimizer does not follow templates, it uses whatever combination is best.\r\n",
    "PostedDate": "2009-03-05T16:52:12.31-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "165129",
    "ThreadId": "48179",
    "Html": "antivyris: No, it looks like all the other filters, and turning it on/off serveral times still leaves the epic gems left.\r\n",
    "PostedDate": "2009-03-05T17:17:10.64-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "165488",
    "ThreadId": "48179",
    "Html": "<strong>Quote: and unique gems where you already have the maximum number of those gems (such as Dragon Eyes, and Enchanted Tears)</strong>&quot;.<br>\r\n<br>\r\nThat's great news I was playing around with it quite a bit last night. So far it looks really good and I like a lot of the changes I've found. I've purely stayed in the Bear calcs for now however.<br>\r\n<br>\r\nIf that change gets implemented that'd be great because I've been using Excel and Mathcad trying to make an optimizer (iterative) for my socket bonuses and my 3 JC epic gems. Trying to figure out what exactly would be the best use for them.. The idea was once I got that to work I'd try to add in 2 more sets. as my kitty gear has gems and my FrR stam gear has gems and to optimize all 3 sets would be the perfect picture... but it's been a slow process. I'm excited to see what you guys have come up with.<br>\r\n<br>\r\nNote: I was playing around with the Gemming templates and the optomizer and initially that was not clear at all to me that they were not linked. Why is it that they arn't linked? <br>\r\n",
    "PostedDate": "2009-03-06T12:33:21.637-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "165513",
    "ThreadId": "48179",
    "Html": "The main reason why optimizer and gemming templates are not linked (besides importing which gems are available) is that the main purpose of gemming templates is to limit number of options. This is exactly what is needed for comparison charts, for optimizer on the other hand we don't want to limit its power as it's well capable of exploring all gemming combinations to find the best possible.\r\n",
    "PostedDate": "2009-03-06T13:41:49.393-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "165520",
    "ThreadId": "48179",
    "Html": "<strong>The idea was once I got that to work I'd try to add in 2 more sets. as my kitty gear has gems and my FrR stam gear has gems and to optimize all 3 sets would be the perfect picture...</strong> <br>\r\n<br>\r\nMan, I know it's out of Rawr's scope, but what I would kill is for Rawr to take a look at _all_ my gear and generate two sets, both gemmed and enchanted so I get a good balance across kitty and bear.<br>\r\n<br>\r\nThis might mean, for example, dropping an agility gem into a slot instead of a strengh gem for something that's shared by both bear and cat sets.  It's stuff I end up doing by hand (but luckily for my stats, but not my bag slots, my number of shared pieces is diminishing).<br>\r\n<br>\r\nChar\r\n",
    "PostedDate": "2009-03-06T13:59:39.413-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "165521",
    "ThreadId": "48179",
    "Html": "@Kavan<br>\r\n<br>\r\nI played with it a lot more today, and I am much more familiar with the optimizer now, it works great, thanks a lot does everything I wanted it to do (with the exception of optomizing JC gems for mulitple sets at a time (some pieces get reused) but thats a stretch so I'm happy :) \r\n",
    "PostedDate": "2009-03-06T14:03:59.587-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "165538",
    "ThreadId": "48179",
    "Html": "Regarding optimizing several sets at a time. You can do this kindof with the batch tools. The reason why I say kind of is because you can't do it in one pass. Check the help page on batch tools, I described there the way I'm using it for multiset optimizations. Basically I'm using the batch upgrade list for multi-set gemming/enchant suggestions and then use batch optimizer on the fixed gemming/enchants to optimize each set.<br>\r\n<br>\r\nOne day I'll probably decide to make the batch optimizer what it should be and optimize cross-set and not just per-set. Basically doing an optimization over selecting gemming/enchants per item and using the weighted per-set optimizer as the valuation for it. Just writing it down makes me squirm from thinking about how slow it would be. If either of you would like to collaborate on this let me know.\r\n",
    "PostedDate": "2009-03-06T15:21:48.247-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "165804",
    "ThreadId": "48179",
    "Html": "<p>The new gemming system has completely changed how I view rawr. Honestly, using rawr before this version has been immensely frustrating. I cannot express how annoying and confusing the old gem system was. I -still- cannot figure out how to filter out epic gems in the current release version (I've tried both adding a custom filter and unchecking additive, and using a default gemming. Neither do anything.)</p>\r\n<p></p>\r\n<p>I am very happy now; this beta makes it easy and intuitive. I'm really loving it.</p>\r\n",
    "PostedDate": "2009-03-08T06:31:26.777-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "165848",
    "ThreadId": "48179",
    "Html": "egoorb: Are you referring to the gem chart when you're talking about epic gems? If so the filter method should work. If you can't get it to work please post ItemFilter.xml from your Data folder and we can check what is going on. The filter should look something like:<br>\r\n<br>\r\n    &lt;ItemFilterRegex&gt;<br>\r\n      &lt;Name&gt;Remove Epic Gems&lt;/Name&gt;<br>\r\n      &lt;Pattern /&gt;<br>\r\n      &lt;MinItemLevel&gt;0&lt;/MinItemLevel&gt;<br>\r\n      &lt;MaxItemLevel&gt;1000&lt;/MaxItemLevel&gt;<br>\r\n      &lt;MinItemQuality&gt;Epic&lt;/MinItemQuality&gt;<br>\r\n      &lt;MaxItemQuality&gt;Heirloom&lt;/MaxItemQuality&gt;<br>\r\n      &lt;AdditiveFilter&gt;false&lt;/AdditiveFilter&gt;<br>\r\n      &lt;AppliesToItems&gt;false&lt;/AppliesToItems&gt;<br>\r\n      &lt;AppliesToGems&gt;true&lt;/AppliesToGems&gt;<br>\r\n      &lt;Enabled&gt;true&lt;/Enabled&gt;<br>\r\n    &lt;/ItemFilterRegex&gt;<br>\r\n",
    "PostedDate": "2009-03-08T13:42:58.36-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "165864",
    "ThreadId": "48179",
    "Html": "<p>I'm not exactly sure what gem chart is. What I was trying to do was have only items with the gemmings I wanted show up under Comparisons on the right side of the main form. I would always get a list with each item repeated 3-6 times, with various epic gemmings. At the very least, not being a JC, not showing epic gems would work. So I added an item filter, named it &quot;kill epic gems&quot; set min item quality to &quot;epic&quot; and unchecked additive filter and applies to items. But it had no effect on which items showed up in the list. I tried several combinations of filters, with various options.</p>\r\n<p>Here's the relevent portion of ItemFilter.xml with that filter added and enabled:</p>\r\n<p>    &lt;ItemFilterRegex&gt;<br>\r\n&lt;Name&gt;kill epic gems&lt;/Name&gt;<br>\r\n&lt;Pattern /&gt;<br>\r\n&lt;MinItemLevel&gt;0&lt;/MinItemLevel&gt;<br>\r\n&lt;MaxItemLevel&gt;1000&lt;/MaxItemLevel&gt;<br>\r\n&lt;MinItemQuality&gt;Epic&lt;/MinItemQuality&gt;<br>\r\n&lt;MaxItemQuality&gt;Heirloom&lt;/MaxItemQuality&gt;<br>\r\n&lt;AdditiveFilter&gt;false&lt;/AdditiveFilter&gt;<br>\r\n&lt;AppliesToItems&gt;false&lt;/AppliesToItems&gt;<br>\r\n&lt;AppliesToGems&gt;true&lt;/AppliesToGems&gt;<br>\r\n&lt;Enabled&gt;true&lt;/Enabled&gt;<br>\r\n&lt;/ItemFilterRegex&gt;</p>\r\n<p>I also tried making an entry under &quot;set default gems for equipment.&quot; After I'd add the gems I wanted and hit OK, the list of items under Comparisons still contains many copies of items, most with epic gems. If I checked &quot;delete non-listed gemmings&quot; then any item with gems other than those would be seemingly permanently removed. I'd have to delete the entire rawr directory and redownload it to get most of my items back.</p>\r\n<p>I guess gems were inseparable from their items in the old system, and you'd have to go in and add a copy of an item with the gems you wanted. I also understand that I probably just don't understand how the old system worked, but after fooling with it for several hours I still couldn't figure it out. Either way, the beta I just grabbed is a godsend. I love it.</p>\r\n",
    "PostedDate": "2009-03-08T15:32:12.22-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "165878",
    "ThreadId": "48179",
    "Html": "Are you saying that it didn't work in the old version or in the beta? I'm really confused.\r\n",
    "PostedDate": "2009-03-08T16:57:36.997-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "165886",
    "ThreadId": "48179",
    "Html": "Egoorb, you're using a very old version, which this thread is not about. This thread is about the new beta, which has a wonderful new gemming system.",
    "PostedDate": "2009-03-08T17:29:04.39-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "165906",
    "ThreadId": "48179",
    "Html": "<p>I apologize. I posted how I love the gemming system in the new beta, which is precisely what this thread is about. I said it was a great improvement from the old system. Then I was asked what troubles I had with the old system that I couldn't get to work, by somebody who is apparently a developer so I replied.</p>\r\n<p>I'm not sure how I can be any more clear. OLD SYSTEM BAD, NEW SYSTEM GOOD.</p>\r\n",
    "PostedDate": "2009-03-08T20:10:23.653-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "165928",
    "ThreadId": "48179",
    "Html": "Gotcha, sorry we missed that part. :)<div><br></div><div>Lets try to keep the discussion about anything v2.1.9-related out of this thread though, please.</div>",
    "PostedDate": "2009-03-08T22:08:56.5-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "166273",
    "ThreadId": "48179",
    "Html": "Most recent set of changes to the gemming system now shows my dragons eyes as faded; what does this mean now?",
    "PostedDate": "2009-03-09T14:45:40.607-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "166284",
    "ThreadId": "48179",
    "Html": "They're disabled, because there are too many of them. You can disable that check by disabling the &quot;Enable Gem Requirements&quot; checkbox.",
    "PostedDate": "2009-03-09T15:12:00.917-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "166360",
    "ThreadId": "48179",
    "Html": "The problem is that the limit is three, and I count three Dragon's Eyes equipped. Maybe the number is accidentally too low; or something fishy is going on.",
    "PostedDate": "2009-03-09T22:30:32.8-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "166448",
    "ThreadId": "48179",
    "Html": "If you could post the character that repros that clearly, that'd really help. Thanks.",
    "PostedDate": "2009-03-10T08:04:17.717-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "167598",
    "ThreadId": "48179",
    "Html": "First of all, I have to say two things.<br>\r\n<br>\r\n1) THANK YOU! Having those moronic epic gems that were data mined during Wrath's beta in the system until 2.1.9 (well past Wrath's release) was annoying.<br>\r\n<br>\r\n2) The new gemming system is A LOT more intuitive.It did take a few tries before realizing how to work it. So for someone new to the system, that could be a liability. However, the system is a lot more manageable then before.<br>\r\n<br>\r\nI cannot really think of any other thing wrong with the gemming system. 2.2 as a whole looks promising. Mage DPS looks a lot more cleaned up for Frostfire spec, and druid kitty dps looks fairly spot on from what I've tested on the PTR. Right now, just need to implement an updated talent info, but that is probably done near the end.<br>\r\n",
    "PostedDate": "2009-03-12T19:24:08.35-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "167971",
    "ThreadId": "48179",
    "Html": "Speaking as someone that is often predisposed to disliking change in general....<br>\r\nSpeaking as someone that thought the prior gemming system was fine other than a couple bugs....<br>\r\nSpeaking as someone that uses the shit out of Rawr constantly....<br>\r\n<br>\r\nThis new gem system is fucking win.  Really good job guys.  <br>\r\n<br>\r\nI was all ready to open it up and tell you how I didn't like it.  I was sold instantly.  It's slick and sweet and awesome.<br>\r\n<br>\r\nIt's also going to be hella-easier now to teach my friends to use Rawr.  I had a bit of trouble teaching them how to use the old system even though I thought it was fine :).\r\n",
    "PostedDate": "2009-03-13T17:08:41.293-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "168023",
    "ThreadId": "48179",
    "Html": "<strong>:D</strong><div><strong><br></strong></div><div>Glad to hear, Hina and Khan. :)</div><div><br></div><div>Look forward to Rawr v2.2.0b4 on Sunday, everyone, with spiffy new multithreading.</div>",
    "PostedDate": "2009-03-13T21:34:50.49-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "168035",
    "ThreadId": "48179",
    "Html": "I'm not sure if I found a bug or I'm doing something wrong...?<br>\r\n<br>\r\nI created custom gemming templates, and I'm seeing items like http://www.wowhead.com/?item=41986 showing up with a 16 spell power gem... when I edit the item it has no slots but it's definitely there in the comparisons :/<br>\r\n",
    "PostedDate": "2009-03-13T23:47:07.493-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "168039",
    "ThreadId": "48179",
    "Html": "That is because it's using a blacksmithing socket. If you don't want to use blacksmithing sockets uncheck the option under the waist slot.\r\n",
    "PostedDate": "2009-03-14T00:30:50.927-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "168110",
    "ThreadId": "48179",
    "Html": "Hi. I'm just a dumb user as far as Rawr-- I downloaded it about 20 minutes ago for the first time. I was very confused when I went to custom-gem my gear on the left side of the screen, however. I added my custom gems after clicking 'add custom gemming', and then it seemed to not save... Being a developer myself, I got the code, and found that the code simply isn't selecting the newly gemmed gear-- just adding it to the list.... This is a little non-intuitive, IMO... If I'm adding custom gemming, it's likely because I want to select that piece of gear... I'd suggest adding the appropriate line of code to _menuItemCustomizeItem_Click in ItemContextualMenu.cs to do this....  Just a usability suggestion.<br>\r\n<br>\r\nAs for Rawr as a whole, it seems awesome! I was thinking of writing something like this myself, but it seemed like such a large project(as I'm sure it is-- and you guys have done so much work making it work for each class/spec).<br>\r\n<br>\r\nGood luck!<br>\r\n<br>\r\n<br>\r\n-- <br>\r\nDerek<br>\r\n",
    "PostedDate": "2009-03-14T12:00:23.603-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "168124",
    "ThreadId": "48179",
    "Html": "Can you explain a bit more what is not working for you? When I add a custom gemming it appears in the chart and when I right click on it I can choose Equip. Which step is not working for you?<br>\r\n<br>\r\nActually this gives me a good idea that I think is what you want. A new option in menu to equip custom gemming, you get the same form to choose gems/enchant and then instead adding it to the charts it just equips it.\r\n",
    "PostedDate": "2009-03-14T13:34:14.3-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "168128",
    "ThreadId": "48179",
    "Html": "I think he just wants it automatically equipped when you create it from a right click on an ItemButton. Sounds good to me.",
    "PostedDate": "2009-03-14T14:05:29.237-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "168212",
    "ThreadId": "48179",
    "Html": "After messing with the new gemming system a little more, I did find one thing that was &quot;missing.&quot; Now this could be something that your still planning for before release; since it's currently un-selectable right now; but the ability to delete custom gemming. I understand your still working on it, so I could be a little early, but it would be nice before release. ;)<br>\r\n<br>\r\nAs far as Dkal's comment, I have to agree with Astrylian's deduction. Me personally, yea it would be nice to automatically switch to the added gems. However, I don't always want to immediately go to it. For example; say I just got my T7 Honor Shoulders. I add a custom gemming for it, but I also want to see how that gemming sequence is handled in the T7 Valor Shoulders as well. I want to stay in my T7 Honor Shoulders but view what the listing puts it with the Valor.<br>\r\n",
    "PostedDate": "2009-03-14T23:04:38.497-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "168219",
    "ThreadId": "48179",
    "Html": "&quot;Delete Custom Gemming&quot; being disabled means that what you right clicked on is not a custom gemming; it's one of the ones built dynamically from an active gemming template.",
    "PostedDate": "2009-03-14T23:52:17.343-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "168311",
    "ThreadId": "48179",
    "Html": "Well it would be nice to be able to manually remove dynamically created gemming. I won't say it's a must but something to consider.<br>\r\n",
    "PostedDate": "2009-03-15T11:40:46.187-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "168316",
    "ThreadId": "48179",
    "Html": "What would that do? It's not saved or anything, it's just one of the gemmings from gemming templates. You can disable that gemming template, via Tools &gt; Gemming Templates...<div><br></div><div>Also, in v2.2.0b4 (coming out later today), there'll be a feature on that dialog to set the maximum number of gemmings to show, which you'll probably find useful.</div>",
    "PostedDate": "2009-03-15T11:48:27.897-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "168354",
    "ThreadId": "48179",
    "Html": "v2.2.0b4 is posted, check it out! :)",
    "PostedDate": "2009-03-15T14:52:59.833-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "168359",
    "ThreadId": "48179",
    "Html": "Oh, also, check out the new Tour of Rawr video: <span><a href=\"http://www.youtube.com/watch?v=OjRM5SUoOoQ\">YouTube - Tour of Rawr</a></span>",
    "PostedDate": "2009-03-15T15:16:59.97-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "169027",
    "ThreadId": "48179",
    "Html": "New gemming system is much better. Much easier to use. Good work!<br>\r\n<br>\r\nOne thing I would still like to see, on the right side, when viewing gems, the ability to filter by color.&nbsp; This would make it easier for me to select a gem to still get the socket bonus, and get the best gem for that purpose based on my sorting selection. Would also make for an easier time creating custom templates should the need arise. <br>\r\n",
    "PostedDate": "2009-03-17T07:51:56.73-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]