[
  {
    "Id": "160807",
    "ThreadId": "48189",
    "Html": "Just a quick question, but how can I have Sunwell Plateu loot items unchecked when using the Filter options of comparison? So far I am unable to unselect this choice of items.. (so far)<br>\r\n<br>\r\nThanks in advance.<br>\r\n<br>\r\n",
    "PostedDate": "2009-02-22T21:26:26.503-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "161143",
    "ThreadId": "48189",
    "Html": "Further trial and error showed unselecting the &quot;Other&quot; option removes these from the pool of choices. Didn't think it would be under that setting.. Still problem solved.<br>\r\n<br>\r\nCheers\r\n",
    "PostedDate": "2009-02-23T14:21:23.593-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "161145",
    "ThreadId": "48189",
    "Html": "We still don't know what you were/are talking about. Can you clarify?",
    "PostedDate": "2009-02-23T14:23:47.55-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "161150",
    "ThreadId": "48189",
    "Html": "Sorry.. I will try to be a little clearer.. Being a new user to this and hitting 80 I was looking at options available basically from Wrath content. When I loaded my armory and had looked on the right side I saw many items from Heroic Raids down. I used the option Filter over there to unselect areas such as Burning Crusade, PvP, Raids etc as my aim was to select items only from 80 Heroic Instances at this stage. I had thought by unselecting Burning Crusade I would also remove the Sunwell raid items as well, however they remained. In the end I discovered that the filter option of &quot;Other&quot; removed the Sunwell seclection of gear choices for me. I just did not think that Sunwell would be under that option..<br>\r\n<br>\r\nThanks for your time.\r\n",
    "PostedDate": "2009-02-23T14:43:38.14-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "161167",
    "ThreadId": "48189",
    "Html": "The filters tend to be somewhat innaccurate, because some items that drop off of, say, <em>heroic trash</em> are on wowhead from multiple mobs, and I guess rawr can't parse that or something so it just declares &quot;Unknown Location&quot; for any item it's unsure of.&nbsp; Makes filtering for specific zones quite the pain indeed.<br>\r\n",
    "PostedDate": "2009-02-23T15:11:30.837-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "161171",
    "ThreadId": "48189",
    "Html": "Check <a href=\"http://www.codeplex.com/Rawr/Wiki/View.aspx?title=ItemFiltering\">http://www.codeplex.com/Rawr/Wiki/View.aspx?title=ItemFiltering</a> to see how you can use item notes to correct the information about where an item drops from if parsing from wowhead/armory doesn't work.\r\n",
    "PostedDate": "2009-02-23T15:21:23.87-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "161718",
    "ThreadId": "48189",
    "Html": "From armory the Sunwell stuff comes up fine and gets filtered (but loses socket bonuses).  From Wowhead it comes up with &quot;Drops from Kil'jaeden in Unknown - 4075&quot;. You can either add a filter for Kil'jaeden and others, or ignore it, or update from armory but be aware of the missing socket bonus.<br>\r\n<br>\r\n    \r\n",
    "PostedDate": "2009-02-24T17:31:31.36-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "169054",
    "ThreadId": "48189",
    "Html": "Apologies in advance for thread necro, as well as randomness.<br>\r\n<br>\r\nI have some issues with the filtering as well. <br>\r\nPvp filter is too broad, separating arena gear from bg gear would be very helpful. Other items show in places they shouldn't based on filters, example filtering out heroic raids and badges, valorous shoulders continue to show.. I don't know if these issues arise from flaws in datamining for item cache, or if the issue is something else. viewing source of an item in edit, it seems that items with multiple sources may be difficult to correctly apply filters to.. perhaps source of item as currently implemented could be enhanced by adding currency used to purchase? <br>\r\n<br>\r\nI thought I had this fairly well thought out when I began to post, however, in the process it fell apart in my mind... hope it makes sense :/<br>\r\n",
    "PostedDate": "2009-03-17T08:57:59.72-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]