[
  {
    "Id": "161480",
    "ThreadId": "48384",
    "Html": "Does anyone know where there is a guide for using the otimizer I am having a hard time understanding how to use it?\r\n",
    "PostedDate": "2009-02-24T08:16:06.02-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "161585",
    "ThreadId": "48384",
    "Html": "Help &gt; Gear Optimization",
    "PostedDate": "2009-02-24T11:50:05.96-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "161603",
    "ThreadId": "48384",
    "Html": "Is there a quick way to Select-&gt;All to enable an entire list of say helms for the optimizer?<br>\r\n",
    "PostedDate": "2009-02-24T12:39:22.86-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "161610",
    "ThreadId": "48384",
    "Html": "No, because you don't want to do that (really).",
    "PostedDate": "2009-02-24T12:53:50.5-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "161613",
    "ThreadId": "48384",
    "Html": "If you want to find the absolute best gear set available in the game? Would you just grab like the top 5 items from each slot and run the optimizer with that?<br>\r\n",
    "PostedDate": "2009-02-24T12:58:48.417-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "161629",
    "ThreadId": "48384",
    "Html": "Correct. Perhaps more than once, if using those makes any others rise to the top somehow.",
    "PostedDate": "2009-02-24T13:38:04.33-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "161654",
    "ThreadId": "48384",
    "Html": "Is it just me or is the optimizer the most confusing tool you've ever seen? So you're saying that if I mark only the top 5 items in each slot as <strong>available </strong>to the optimizer that I might get resulting gear that i didn't label as available?<br>\r\n",
    "PostedDate": "2009-02-24T14:31:53.943-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "161661",
    "ThreadId": "48384",
    "Html": "What? Huh?<div><br></div><div>I think you must be misunderstanding something basic about what the Optimizer does, maybe? Did you read the help topic mentioned above?</div><div><br></div><div>If you mark the top 5 items in each slot as available to the optimizer, the optimizer will return you the best (theoretically) gear set made up of the items you marked available.</div>",
    "PostedDate": "2009-02-24T14:52:30.137-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "161689",
    "ThreadId": "48384",
    "Html": "The reason Astrylian said you have to do it more than once is because as it starts picking from those top 5, the top 5 change.<br>\r\n<br>\r\nAs a simple example, let's say you start out with zero hit rating and it's an important stat for you.  Rawr will gear with loads of hit rating to the top of every gear slot slot.  But maybe once it chooses 4 or 5 pieces of gear (helm, pants, etc.) with a lot of hit rating, you may be hit capped and hit rating is no longer relevant.  Pieces that were once favored for being high on hit are no longer at the top of the list and others are, so you'd have to choose those newly top 5 pieces and reoptimize.<br>\r\n<br>\r\nActually, during BC I had fun playing with simulated mitigation tanking.  Rawr kept insisting that heavy stamina gear was best.  But I was equipping the most dodge &amp; agility heavy gear I saw, and all of the sudden Rawr went mitigation crazy, it was pretty funny.  Gear that was agility heavy suddenly had the most impossibly high scores because they'd make damage taken virtually disappear.  (of course such a bear could never tank because he'd always be rage starved, but that's a different issue)<br>\r\n<br>\r\nIt's something to do when you're bored.<br>\r\n<br>\r\nChar<br>\r\n",
    "PostedDate": "2009-02-24T15:59:03.433-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]