[
  {
    "Id": "161879",
    "ThreadId": "48493",
    "Html": "I have a question regarding the Tankadin and &amp; Tank DK armor values given by Rawr. In my tank theorycrafting it seems to me that as one reaches higher levels of avoidance, armor + damage reduction becomes less important.<div><br></div><div>If I avoid 50% of the attacks, then 60% damage reduction is only half as important as it would be if I had 0 avoidance. If I had 102.4% avoidance, damage reduction from armor would be completely useless.<br><div><br></div><div>In the prot warrior and bear druid models, this follows exactly as I would predict. However, in the Tankadin and Tank DK models, the value of armor seems to increase with avoidance.</div><div><br></div><div>I believe that this is in error. Though I have not extensively looked at how the total calculation is being done in these models, it seems that perhaps by adding another variable of &quot;total %damage avoided&quot; which would be equal to:  avoidance + (102.4 - avoidance)*(damage reduction) + (block value * block chance/ incoming damage after damage reduction)</div><div><br></div><div>might be a confusing little formula, but I think you get the idea. I'm pretty sure these models are currently placing too much value in armor.</div><div><br></div><div> - Stamina Complaint - </div><div>Also I have a side complaint for the tanking models, all of the models are preset with very high weight given to stamina, recommending that I become a soak tank. Though the general consensus seems to be that avoidance is much more important, especially for maintanking. Also the Tankadin model does not allow me to change the value of avoidance and mitigation to be as high as I would like. </div><div><br></div><div>Perhaps a solution to this side issue would be adding a &quot;survival goal&quot; type rule so that if ones hp is below, say 28k, stamina has a much higher value, however, after that point survival takes a substantial drop in value so that avoidance stats take precedence. I think I saw this feature in the druid-tree model, and I believe it would be very useful in the tank models as well. </div><div><br></div><div> - Item Valuation Options -</div><div>Also it would be helpful to see options that allow a person to place weight on avoidance, mitigation, and soak separately. for example if I want to reach unhittable and then maximize my incoming damage reduction for my trash tanking block set, versus if I want to avoid as much damage as possible for a hard hitting boss, versus pushing my hp as far as it can go for a spell damage boss. </div><div><br></div><div> - Spell Damage - </div><div>Perhaps adding features to support how much of a boss's dps is spell damage would be useful too, in calculating the best way to make things easy for your healers on a particular fight</div><div><br></div><div><br></div><div>Let me know what you think! Thanks for the help in advance!</div></div>",
    "PostedDate": "2009-02-25T06:00:37.763-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "161911",
    "ThreadId": "48493",
    "Html": "The bear model already has a soft survivability cap. It does exactly as you recommend with the &quot;survival goal&quot;. The warrior model has several different calculation options that should take care of any needs. I'm not really that familiar with the tankadin or tankdk.<br>\r\n<br>\r\nHoly<br>\r\n",
    "PostedDate": "2009-02-25T07:39:34.967-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "161957",
    "ThreadId": "48493",
    "Html": "I think the overvaluation of stamina comes from TTL calculations.&nbsp; In the Bear model, at least, I can easily review my item scores and choose the gear that has the greater avoidance score over the one with less avoidance but modestly improved soaking capability.&nbsp; I'm not much of an optimizer expert, so I won't drag that into it.<br>\r\n<br>\r\nWith regard to boss damage breakdowns, Rawr doesn't currently model incoming damage in any way that I know of.&nbsp; If Astrylian were to add support for incoming damage modeling, I would expect him to allow selections of specific bosses rather than allowing the user to fudge in their own values.<br>\r\n",
    "PostedDate": "2009-02-25T09:08:29.03-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "162031",
    "ThreadId": "48493",
    "Html": "<p>When I started writing this it was a tiny reply, but let me try to organize a bit more...</p>\r\n<p>Admittedly Rawr.ProtWarr and Rawr.Bear are a lot more robust, and Rawr.Tankadin definitely needs to catch up.</p>\r\n<p>I was planning to move away from Mitigation / Survivability and tending towards something more transparent like DR/EH or something along those lines. Yet some of your post is making me appreciate the more standard Rawr tanking model there.</p>\r\n<p>Rawr.Tankadin does have tracking of &quot;total damage avoided&quot; and I believe it's tied into Mitigation (I'm not near my IDE atm and not staring at the source, correct me if I'm wrong).<br>\r\n<br>\r\n-Weight system refining-<br>\r\nAs for weight values for each point system, the weighting is currently rather arbitrary in my eyes to the point that it feels like the &quot;scale&quot; numbers were fudged so that they look right. That'll be fixed in the long run, though I can't think of any real way to compare Threat to Mitigation without a generally arbitrary number. Threat is leaning on a scale of 10 x tps vs the mitigation and survival values, but it's likely going to change once I determine exactly where it's going.<br>\r\n<br>\r\nThen again, there's always the option that the ProtWarr model went and adding a TankPoints option to provide a different opinion.</p>\r\n<p>-Situational Weights-<br>\r\nI was looking at different situational values, but for what it's worth, Protection Paladins seem to be a lot simpler to model in action than other classes, and throwing wrenches at the simplicity might snowball into something huge. I was generally planning to focus on gearing, glyphing, and seal choices versus a full blown simulator for each encounter, but I'm open to it given enough data.</p>\r\n<p>If you can help think of some situations and what factors it might modify in regards to threat generation, then I'm up for it. One of the few that comes to mind is a &quot;2nd-3rd target tps&quot; which factors in Holy Shield, Hammer of the Righteous, Retribution Aura, and Consecrate, and a &quot;&gt;= 4th target tps&quot; which would remove HotR.</p>\r\n<p>-Value of Stamina-</p>\r\n<p>In my most recent source (haven't gotten to the point of committing yet) I've been working in a Health requirement; but I have not created what I suppose you could call diminishing returns to the value of stamina in this health requirement. Frankly I'd need to work on the math for that, and I'm admittedly more of a theory modeler versus a math whiz.</p>\r\n<p>The same DR of stats thing thing goes for the value of unhittability. Maybe it's a psychological thing but I find that the last % or so to go to cause all incoming hits to be blocked is worth a great deal more; yet I'm not completely sure how to do the math for that, or even where to start... <br>\r\n<br>\r\nI think I might have figured it out, but I can't really put my finger on the specifics. An additional weight scale of &quot;hit the requirement&quot; would change things greatly, especially for other modules which value +Hit and regardless of the logic of &quot;0.01% hit below the cap is only 0.01% less dps,&quot; the Hit-Cap is more desirable. But how would that work?<br>\r\n<br>\r\nOn a complete aside, I want to post a question to the other people deep into Rawr: do you use it to confirm your ideas and provide upgrade suggestions based on them, or do you use it to teach you new ideas and provide a completely different gearing strategy? I'm not a soak-tank type either, nor am I a high-avoidance tank. I use Rawr to figure out what my &quot;all around set&quot; should be given the &quot;Overall rating&quot;, and my Block set only interacts with Rawr to see if I've hit the cit avoidance cap or not when it's all put together. Maybe I'm not looking at it as an &quot;upgrade list&quot; point of view and rather as a &quot;confirmation&quot; point of view.</p>\r\n<p>That was probably way too long winded of a reply. Sorry about that. Hope it answered the questions, though.</p>\r\n",
    "PostedDate": "2009-02-25T11:39:18.747-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "162047",
    "ThreadId": "48493",
    "Html": "Wow, so much here, where to start...<div><br></div><div>OK, armor does not change in value based on avoidance. Whether you avoid 10% of attacks, or 90% of attacks, 50% damage reduction still cuts all the physical damage you take in half.</div><div><br></div><div>Stamina goes down in value once you have 'enough'. Rawr.Bear has a Survivability Soft Cap setting to handle this, and I encourage the developers of the other tanking models to implement a similar feature.</div><div><br></div><div>Weights are not something that users <em>should</em> typically change, ideally. If you're wanting to change weights, it means that you/we are not accurately defining the fight, and calculating the results. Of course, no model is perfect, so there will be times that you run into situations that the model doesn't handle, but those should be few and far between.</div><div><br></div><div>Rawr.Bear v2.2.0.1 does model incoming damage, but you still have to type in damage/speed. I hope to add presets for that, of each boss. </div><div><br></div><div>Rawr.Tankadin has a bunch of features coming (see another thread about this) for optimizing around the hit table.</div><div><br></div><div><br></div>",
    "PostedDate": "2009-02-25T12:17:57.437-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "162131",
    "ThreadId": "48493",
    "Html": "Im happy to see these lengthy responses! Let me try to follow up on as many points as I can for now in as concise a manner as possible :)<div><br></div><div><br></div><div> - - First at Solieu - -</div><div><br></div><div>In the Tankadin model, I see the following Defensive stats: Avoidance, Mitigation, Damage taken (this gives me some percent like 16%, I'm not really sure what this variable is), Damage when hit, Chance to be crit. There are some other similar stats in other categories as well, however, I dont believe I see a &quot;total damage avoided&quot; variable (unless this is the Damage Taken value which I am still unsure of) What I'm looking for would be a summary of both avoidance and mitigation, that is both the damage avoided and damage reduced. So if I have 50% avoidance and 50% damage reduction, in a 100% hit scenario I would avoid 50% of the attacks, and of the remaining attacks I would only take half damage, so I would eliminate 75% of the possible damage. I think that it would be beneficial to place high priority on this value in deciding the optimum gear selections. Instead of saying mitigation is worth x, avoidance is worth y, survival is worth z, if we combine avoidance and mitigation into a singular variable the calculations would account for things such as my hypothesis about an inverse relationship in the values of armor and avoidance.</div><div><br></div><div><br></div><div> &gt;&gt;&gt;&gt; Armor's Inverse Value Correlation With Avoidance Hypothesis&lt;&lt;&lt;&lt;</div><div><br></div><div>My idea behind the armor and avoidance is that if I have 0 avoidance 0 damage reduction, then my first 1% of either would be equal in weight. Gaining 1% damage reduction, or 1% avoidance would provide the same overall eliminated damage taken. However, if I have 50% avoidance, then only half of the attacks will hit me, and so the value of gaining 1% damage reduction is now inferior to gaining 1% avoidance. </div><div><br></div><div>To put it in example if I am tanking a fight where I will get hit 100 times for 100 damage each:</div><div><br></div><div> - at 0% avoidance and 0% damage reduction from armor.</div><div>+1% avoidance = 1 avoided attack = 100 damage elminated</div><div>+1% damage reduction = 1 damage reduced from 100 attacks = 100 damage eliminated</div><div><br></div><div> - at 50% avoidance and 0% damage reduction from armor.</div><div>+1% avoidance = 51 avoided attacks = 5100 damage elminated =  a total gain of 100 damage eliminated</div><div>+1% damage reduction = 1 damage reduced from 50 attacks = 50 damage elminated.</div><div><br></div><div>If I go into the tank models for bear, prot war, tankadin, tank dk, I notice that bear and prot war support my theory, as avoidance increases the &quot;mitigation&quot; value of armor decreases in value. However, currently the tankadin and tank dk models are telling me the opposite, that as avoidance increases, the &quot;mitigation&quot; value from armor increases.  I believe the reason for this is this missing value of &quot;total damage eliminated&quot; that is present in both the bear and prot war models. Though, I could be totally crazy :p</div><div><br></div><div><br></div><div> - - Back to Solieu  Weight System Refining- -</div><div><br></div><div>Regarding your comments about the mitigation scale, as well as other options scaling, let me clarify that although the mitigation scaling number does seem rather ambiguous, I do not mind the number but rather the limit. Defaulting at 7,000 and maxxing at 15,000 provides a little more than a 2x increase in the base mitigation calculation. In the prot war model the default is 1, and allows me to increase mitigation value to 3x. This number is a lot closer to how I determine the value of my gear. Simply allowing a higher maximum value for mitigation would be fine, perhaps 21,000 or higher. I think the threat scaling is fine at the moment, I'm not sure why anyone would want to go all the way to 100x threat valueation but I dont see anything wrong with allowing it. While im on the threat, I happened to notice that there is neither mitigation nor threat value on expertise in the tankadin model I am looking at. I know it is fairly difficult to code in the mitigation value of expertise, but I think a threat value could be added in the meantime, however insignificant it may be.</div><div><br></div><div> - - Situation Weights - - </div><div>Multi-target situations do sound interesting but what I had in mind was something similar to the &quot;boss attack&quot; value. I was thinking that including boss spell damage would be beneficial as well. The higher spell damage could increase the value of talents like [guarded by the light] or resistances or other spell damage reducing effects. For example Sapphiron is a predictable boss in regards to a steady and constant income of spell damage in addition to the physical damage. </div><div>This could be something as complicated as allowing setup for constant versus spike spell damage, as well as independent types of spells, perhaps you would give Naxx 10 a boss attack value of 20k average, Frost spell damage 2k, poison spell damage 1k, and in turn support itemization including particular resistances. Or it could be much simpler and have only a &quot;spell damage&quot; field which would give value to total resistances provided by frost aura or motw buffs, but also talents or abilities that directly reduce spell damage taken.</div><div><br></div><div><br></div><div> - - Value of stamina - - </div><div><br></div><div>As an example I believe that having 24k unbuffed hp is plenty in order to tank 10 man naxx. Perhaps right after hitting level 80, one would want to focus on getting to 24k stamina so that the healers will at least have time to react to incoming spell damage (in case you dont have super amazing 0 latency healers who spam stopcasting macros on you through the entire fight) Once you have enough of a health pool that the healers are able to keep you alive (even if that means spamming heals the entire time) it usually makes the most sense to start minimizing the damage you take, whether through avoidance or damage reduction or some other means. </div><div>The way I saw this implemented in the tree model was that you chose a desired health pool, and assigned a certain heightened importance to that health if you were below that value. So for example If I am a tank who wants 24k hp, I might decide that if I am underneath that value, I want to put twice as much importance on health. In the code this might be done by setting the value for survival = default survival * x.  where we declare x as: x = 1. if(hp &lt; hp desired) then x = x + heightened weight)</div><div>A similar importance could be placed on thing such as reaching unhittable, uncrittable, hit cap, etc, though im not sure this is necessarily a good idea in all cases.</div><div><br></div><div><br></div><div> - Re: side question -</div><div>personally I use rawr mostly for comparing gear to see what really provides the best bang for my buck, especially with the optimizer. best in slot when you're in greens sometimes changes dramatically when youre in full epics.  I also like rawr for giving me a quick run down if a guildie or someone asks me for gearing advice :p</div><div><br></div><div><br></div>",
    "PostedDate": "2009-02-25T17:12:59.593-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "162155",
    "ThreadId": "48493",
    "Html": "<span style=\"font-family:'segoe ui';font-size:13px;color:rgb(48, 51, 45)\">&quot;Damage taken (this gives me some percent like 16%, I'm not really sure what this variable is)&quot; Damage Taken is what percentage of the incoming damage you are going to take. It includes mitigation and damage reduction.</span><div><span style=\"font-family:'segoe ui';font-size:13px;color:rgb(48, 51, 45)\"><br></span><div><span style=\"font-family:'segoe ui';font-size:13px;color:rgb(48, 51, 45)\">In your example the value of armor did not go down. Armor value stays the same, the value of avoidance goes up. the more avoidance you have the more valueable avoidance becomes. This is hampered a little bit by diminishing returns on avoidance, but still holds true on all current gear levels I believe.</span></div><div><span style=\"font-family:'segoe ui';font-size:13px;color:rgb(48, 51, 45)\"><br></span></div><div><span style=\"font-family:'segoe ui';font-size:13px;color:rgb(48, 51, 45)\">Value of Stamina, it doesn't appear that the tankadin model has this quite yet, but in bear and warrior you can set a minimum health value for the optimizer. When you do a tools-&gt;optimize just add an additional requirement for health.</span></div><div><span style=\"font-family:'segoe ui';font-size:13px;color:rgb(48, 51, 45)\"><br></span></div><div><span style=\"font-family:'segoe ui';font-size:13px;color:rgb(48, 51, 45)\">Holy</span></div></div>",
    "PostedDate": "2009-02-25T21:02:29.84-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "162207",
    "ThreadId": "48493",
    "Html": "I've done a few tests comparing my current model and the 2.2.0.1 beta, and Expertise is still out of whack. It *does* provide a threat bonus in my current version, but something is wrong with the formulas and it's giving such a miniscule threat rating as well as applying to skills that get zero benefit from Expertise normally.<div><br></div><div>I guess that's my next priority rather than some of the other things I had going.</div>",
    "PostedDate": "2009-02-26T00:44:52.213-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "162544",
    "ThreadId": "48493",
    "Html": "The survival/mitigation scaling should be fixed in 2.2 for TankDK.<br>\r\nIf I can find some time, I'll add a survival cap, too.<br>\r\n",
    "PostedDate": "2009-02-26T16:21:50.93-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]