[
  {
    "Id": "163058",
    "ThreadId": "48831",
    "Html": "It seems like feral tanking is getting a pretty serious nerf on the PTR by lowering our armor and health a fair amount. A Lot of people seem to be freaking out about this but i would like to think by now Blizz know what their doing and i trust that we will come out OK on the other side. What do you guys think about the nerfs?\r\n",
    "PostedDate": "2009-02-28T08:38:22.637-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "163128",
    "ThreadId": "48831",
    "Html": "Yeah, it's a fair bit of a nerf, but overall, not something to be concerned about, IMO. We aren't suddenly the worst tanks, or anything.",
    "PostedDate": "2009-02-28T18:06:09.22-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "163570",
    "ThreadId": "48831",
    "Html": "Here's what Ghostcrawler said on the forums:<br>\r\n<br>\r\n<strong>In order to keep our goal of having all 4 tank classes capable of\r\nhandling Ulduar, we need to get tank health pools a little closer\r\ntogether.\r\nWhile I won't hide that this is a nerf for bears, we also don't\r\nwant to get to the point of having a &quot;mana sponge&quot; tank, now that we\r\nare making mana more of an issue for healers.&nbsp;\r\nIf druids slip behind as a result of lack of mitigation, avoidance or cooldowns, we will buff them.\r\n</strong><br>\r\n<br>\r\n<a href=\"http://forums.worldofwarcraft.com/thread.html?topicId=15443285411&pageNo=12#228\">http://forums.worldofwarcraft.com/thread.html?topicId=15443285411&amp;pageNo=12#228</a><br>\r\n<br>\r\nI've noticed about a 2K HP drop, and 6K armor drop on the PTR.&nbsp; I think it's too early to tell, and there will be some tweaks before it goes live.&nbsp; I agree with Astrylian, it's not the end of the world -- we will just have to gear/gem around some of the nerfs.<br>\r\n",
    "PostedDate": "2009-03-02T11:48:15.33-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "163636",
    "ThreadId": "48831",
    "Html": "<p>Well, our nerf is one thing, but it looks to me like the tanking specs of the other tanks didn't get nerfed at all, if anything they got very slight buffs (insignificant in some cases).  So it's a question of how are bears doing in relation to other tanks.<br>\r\n<br>\r\nWhat I'm wondering here is whether the knee-jerk reaction will now be to compensate with &quot;Stamina or death&quot; to bring things back to where they were.  Historically bears have always had more health, that mentality has been built into every player (not just druid tanks).</p>\r\n<p>As for druid non-tanking issues, I found a couple of interesting points:</p>\r\n<p>First, I wonder about the savage roar change.  Does this mean that the buff is now only for attacks and not bleeds?  So rip is now getting nerfed?</p>\r\n<p>Second, the lifebloom change will affect the way people think about LB entirely.  It's no longer a cheapo heal that you just toss once every 7 seconds and keep up because of good HPM.  Now with 2x the mana cost, HPM is nerfed in half unless you let the lifebloom pop.  This gives you a nice little spike but at the same time means you're back to the beginning re-rolling the heal.<br>\r\n<br>\r\nChar</p>\r\n",
    "PostedDate": "2009-03-02T15:48:13.287-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "163661",
    "ThreadId": "48831",
    "Html": "No, the SR change isn't a nerf to rip. Rip is still affected. It's just +36% damage instead of +40% AP. It ends up being a slight buff or slight nerf, depending upon the situation.",
    "PostedDate": "2009-03-02T17:57:00.467-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]