[
  {
    "Id": "164577",
    "ThreadId": "49235",
    "Html": "Hi, I just started to play my alt again and decided to spec her Shadow from disc.  I loaded my gear from character profiler and ran it through rawr and the results were odd.  The relative stat values seem all wrong.  It values Spirit first (3.08), Spell Power second (2.57), and hit third (1.89).  I am well below hit cap and have checked the buffs I expect in a 25 man on the buff tab so mana shouldn't be an issue.  I would like to know how to force a change in the relative stat values as the top 3 are somewhat expected (though I would have expected spirit to be lower than 3rd) but completely backwards when I am under hit cap by several percent.  The character is Erijagde (Cenarius US), and I know that the gemmings/gearing is not optimal at all, but I have a habit of shifting back and forth on spec so some gems get slotted so they can be used by both sets (JC +dam) or just one (+hit/shadow +int/disc).  Is there a way to manually change the values on +hit to what some of the spreadsheets or EJ forums imply (Hit to cap -&gt; Spell power -&gt;rest of stats) as the low rating given for 60 pts short of cap is enough to make the optimizations useless to me. \r\n",
    "PostedDate": "2009-03-04T15:19:41.75-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "164626",
    "ThreadId": "49235",
    "Html": "See the readme. Rawr never does rate anything by valuing stats. If you think there's a problem with how it values a character, we need to see the full character. My first guess is that there really is something set such that you're running OOM.",
    "PostedDate": "2009-03-04T19:29:04.237-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "164632",
    "ThreadId": "49235",
    "Html": "I am not sure how I could upload the character file from rawr to wherever you would want it, but I would be glad to.  As I said I know some of the gemmings are not ideal, due to the dual use of some, but not all pieces, but if you load the gearset she is in on the armory and check what Rawr suggests, it will delete 100% of the hit from the gems.  The values of Spirit and Hit both seem wrong if the hit cap is not reached.  I would presume that there is no mana limitation as the value for sustained and burst dps are identical, and it would seem that the burst should be higher if I was OOM or dispersed for any amount of time.  \r\n",
    "PostedDate": "2009-03-04T20:04:49.87-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "164647",
    "ThreadId": "49235",
    "Html": "You can attach the character to an Issue here, or post it somewhere else and link it here.",
    "PostedDate": "2009-03-04T21:17:36.627-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "165198",
    "ThreadId": "49235",
    "Html": "Thank you.  It is now posted in the issues thread <a href=\"http://rawr.codeplex.com/WorkItem/View.aspx?WorkItemId=12753\">http://rawr.codeplex.com/WorkItem/View.aspx?WorkItemId=12753</a> \r\n",
    "PostedDate": "2009-03-05T21:41:06.037-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]