[
  {
    "Id": "164636",
    "ThreadId": "49246",
    "Html": "I realize that the relative stat values are not used as a basis of calculations, but they illustrate my point.<br>\r\n<br>\r\nAccording to previous versions:<br>\r\n<br>\r\nSTR=.71<br>\r\nAG=.58<br>\r\nPene=.56<br>\r\nHit=.49<br>\r\nHaste=.37<br>\r\nCrit=.37<br>\r\n<br>\r\nAccording to the new version:<br>\r\n<br>\r\nAG=.74<br>\r\nSTR=.73<br>\r\nCrit=.61<br>\r\nPene=.57<br>\r\nHit=.48<br>\r\nHaste=.36<br>\r\nAP=.31<br>\r\n<br>\r\nThis is reflected in the new version telling me to replace my +16STR gems w/ +16AG.  I find this very surprising and suspect.<br>\r\n<br>\r\nI also noticed that according to RAWR, my calculated crit is: 44.49%  including MoTW and Kings.<br>\r\n<br>\r\nHowever, if I login to WoW, I have a 47.41% crit without any buffs so something seems to be very wrong. :(<br>\r\n",
    "PostedDate": "2009-03-04T20:09:55.33-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "164644",
    "ThreadId": "49246",
    "Html": "Actually, it makes perfect sense if you break it down<br>\r\n<br>\r\nFirst is the savage roar change, its now 36% damage (glyphed, and what dps druid wouldn't) vs 40% attack power. The implications of this is that it benefits both base damage and attack power based damage and not just attack power based damage,&nbsp; this base damage can crit, so this change favors crit.<br>\r\n<br>\r\nSecond, all our dots now crit.&nbsp; This is the huge one, dots made up what? almost half your dps before?&nbsp; So you were only getting half out of your crit before, now that everything you use can crit, you're getting twice the benefit out of your crit, which is why you see your crit rating has almost doubled and why agi is now better than strength.<br>\r\n<br>\r\nAs far as the crit difference, bosses have a -3% crit from the level difference.&nbsp; That may or may not be where the discrepency is coming from.&nbsp; Ensure that all your stats completely match up (and also if you have imp motw, its giving you 2% stats in the beta version that you won't have live).&nbsp; Might also be a discrepency somewhere else but there's a few ideas until the writer can get back to you.<br>\r\n",
    "PostedDate": "2009-03-04T21:14:28.723-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "164648",
    "ThreadId": "49246",
    "Html": "Pretty much, everything Shmoo said is correct. v2.2.0b3 was the first to include the new Cat changes in 3.1.",
    "PostedDate": "2009-03-04T21:19:43.417-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "164667",
    "ThreadId": "49246",
    "Html": "Thanks for the explanation. I was not aware of the changes in the PTR.<br>\r\n<br>\r\nIs there a way to tell RAWR to use calcs based on 3.0.8 or should I use 2.20b2 for &quot;now&quot; and b3 for the future (or at least the future based upon the current PTR rules...)? <br>\r\n<br>\r\nAny comments re: the difference between Crit% as calculated by RAWR vs what I see in WoW? I see the same issue in 2.19..\r\n",
    "PostedDate": "2009-03-04T23:40:35.793-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "164710",
    "ThreadId": "49246",
    "Html": "v2.2.0b2 should not be used at all, it was a bad build. If you want to optimize for right now, use the latest release version, v2.1.9.<div><br></div><div>As Shmoo said, bosses have a crit chance reduction. (I believe it's 2.6%, not 3%, but don't have the numbers in front of me at the moment)</div>",
    "PostedDate": "2009-03-05T01:55:21.237-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "164756",
    "ThreadId": "49246",
    "Html": "Nice round up of the changes, finally more avoidance in bear form in cat gear ^^<br>\r\nBut the actual 'Primal Gore'-talent hasn't been implemented into rawr yet, has it? Or am I just missing something? ;)<br>\r\n",
    "PostedDate": "2009-03-05T04:12:39.797-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "164866",
    "ThreadId": "49246",
    "Html": "It's not in the talent picker, but it's assumed to be on.",
    "PostedDate": "2009-03-05T08:00:25.213-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "164872",
    "ThreadId": "49246",
    "Html": "Ah, great! So if I adjust the talents to use up 70 points it should be exactly as if the talent was inside the talent-menu and selected?<br>\r\n",
    "PostedDate": "2009-03-05T08:05:59.107-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "164878",
    "ThreadId": "49246",
    "Html": "Correct.",
    "PostedDate": "2009-03-05T08:12:23.953-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "165142",
    "ThreadId": "49246",
    "Html": "Will there be any way to optionize glyphs like savage roar. For me that mostly play as tank in our 10-mans but on fights like heigan and loatheb I go kitty because I do more damage than the other tank in our current specs. For obvious reasons I'm not glyphed for pure dps. Would it be possible to make glyphs optionable like buffs? (I know about dualspec but I'm not sure I'm going to spec for pure kitty for that)<br>\r\n",
    "PostedDate": "2009-03-05T17:55:52.257-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "165159",
    "ThreadId": "49246",
    "Html": "I just installed 2.2.0.b3 (into it's own directory) but I'm still getting the relative stat weightings that seem to be more in line with the older versions of Rawr (eg. str 0.62, agi 0.56, pen 0.44, crit 0.41, hit/exp 0.37).&nbsp; Any thoughts on why this might be happening?<br>\r\n",
    "PostedDate": "2009-03-05T19:16:11.063-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "165212",
    "ThreadId": "49246",
    "Html": "Check the bear model, to see if you see stats for Savage Defense. If you do, you're correctly running the latest beta. Also note that b3 is still using 1.5x crit multiplier on bleeds, instead of 2x as it was just patched in on the PTR, so Agi won't be beating Str for everyone yet.",
    "PostedDate": "2009-03-05T22:38:06.21-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "165215",
    "ThreadId": "49246",
    "Html": "Yup, I see Savage Defense.&nbsp; I'm sure it's the 1.5 crit modifier that's the reason I'm seeing the numbers I am.&nbsp; Thanks for the response.<br>\r\n",
    "PostedDate": "2009-03-05T23:00:16.027-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "167976",
    "ThreadId": "49246",
    "Html": "Does Rawr optimize for DoT uptime based on expected CP and misses?  or simply assume 100% up time?<br>\r\n<br>\r\nThe reason I wonder this is that the recent shifts in our talents have me looking at about 6% miss in what Rawr says is the best stuff of what I own.  I am wondering if this is really true or if I will NOT actually be able to keep my rotation up due to missing and end up with DoTs falling off a lot.\r\n",
    "PostedDate": "2009-03-13T17:39:06.083-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "168025",
    "ThreadId": "49246",
    "Html": "v2.2.0b4 will adjust uptime based on misses.",
    "PostedDate": "2009-03-13T21:36:47.923-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]