[
  {
    "Id": "165386",
    "ThreadId": "49435",
    "Html": "I was just curious as to if you could use Rawr for lets say a lvl 49 twink? <br>\r\nIm not sure if this is outside the parameters of Rawr or if it just takes some time and finesse to set it up.<br>\r\nAny help would be appreciated <br>\r\nThanks\r\n",
    "PostedDate": "2009-03-06T08:35:26.143-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "165403",
    "ThreadId": "49435",
    "Html": "Rawr is designed for level 80 characters.  If you tried to use a level 49 character, all of the equipment, skills, and ratings will be going off level 80 statistics, so there would be no way it would come out right for a 49.",
    "PostedDate": "2009-03-06T09:00:38.387-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "165540",
    "ThreadId": "49435",
    "Html": "I think it's more than that.  I don't think Rawr does PvP very much at all.<br>\r\n<br>\r\nRawr also targets NPCs that are 3 levels higher (though configurable) with whatever stats they bring to the table.  Rawr does not, for example, consider that an enemy might have resilience.  I also think that when looking at things like &quot;shred damage&quot; for a druid cat it is assuming that you can, in fact, stand behind your enemy and spam shred.  If you have a tank standing in front of a boss and holding it (more or less) in one spot that's a good assumption.  If you have a player who is theoretically untankable, that's not so much true.<br>\r\n<br>\r\nI also think that most of the damage causing models in Rawr have a pretty simplistic view of survivability which is something you'd want a more accurate analysis of.  (e.g. how much spell penetration does the enemy have?)<br>\r\n<br>\r\nWhat about time to OOM analysis against players that are draining your mana?<br>\r\n<br>\r\nCertainly not criticizing Rawr here, I just think that none of that is built in.  Could it be?  Absolutely, but it'd be a lot of work.<br>\r\n<br>\r\nChar<br>\r\n<br>\r\n<br>\r\n",
    "PostedDate": "2009-03-06T15:36:39.383-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "165571",
    "ThreadId": "49435",
    "Html": "Modeling PvP is generally a fruitless exercise. Most Rawr models don't even bother trying. The only models we have that are written with PvP in mind at all are HPriest and SPriest. TNSe has done some nice work there, basically letting resil and health scale together to affect your survivability rating, so that you can choose gear with that in mind, for PvP.",
    "PostedDate": "2009-03-06T17:39:20.8-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]