[
  {
    "Id": "165806",
    "ThreadId": "49545",
    "Html": "I was wondering how you modeled lifetap preority.<br>\r\n<br>\r\nConsedering the 4t7 buff and the opcoming lifetap buff it would be nice if locks could choose betwen lifetaping when needed (when oom), lifetaping when posible (when none of the mana gathered will be lost) and lifetaping every 10 second (for the 4t7 buff)\r\n",
    "PostedDate": "2009-03-08T06:55:39.327-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "165809",
    "ThreadId": "49545",
    "Html": "<p>This option was in but I removed it as it made everything (even) slower and hardly changed anything, whether you had the 4T7 or not.</p>\r\n<p>Lifetaps are now added at the end if the current mana is lower than 0.</p>\r\n",
    "PostedDate": "2009-03-08T07:32:55.38-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "165810",
    "ThreadId": "49545",
    "Html": "I´m sorry, I didn´t know that, I´ve started using rawr today ^^<br>\r\n<br>\r\nBut does that mean that if I have 2 mana points it wont lifetap?\r\n",
    "PostedDate": "2009-03-08T07:42:32.637-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "165817",
    "ThreadId": "49545",
    "Html": "<p>Currently it first calculates the whole cast list and after that checks how much mana that cost and which sources you got mana from (Intellect, Replenish and Imp Soul Leech for example).</p>\r\n<p>If the mana that was used is higher than the mana you gained (which it always will be) it starts adding Life Tapsfor the amount of mana that is missing.</p>\r\n",
    "PostedDate": "2009-03-08T09:03:36.81-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "239658",
    "ThreadId": "49545",
    "Html": "<p>If I do not see lifetap in the events tab spell simulation results does that mean I didnt run out of mana during the fight's duration?</p>",
    "PostedDate": "2009-09-28T11:58:33.683-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "240021",
    "ThreadId": "49545",
    "Html": "<p>Not necessarily, life taps are not currently shown in the event list as the mana calculations occur after the cast list has been generated. Check the mana gain chart or the tool tip when you hover over the rotation on the stats page it should say&nbsp; &quot;Number of Life Taps:&nbsp; x&quot;.</p>",
    "PostedDate": "2009-09-29T08:11:01.47-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]