[
  {
    "Id": "165836",
    "ThreadId": "49555",
    "Html": "Hi<br>\r\n<br>\r\nDoes anyone know what typical/good/bad ratios are for replenishment uptime? Does it vary based on the class providing it, the fight or just on the player skill?<br>\r\n<br>\r\nThanks in advance<br>\r\n<br>\r\n",
    "PostedDate": "2009-03-08T11:55:12.127-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "165838",
    "ThreadId": "49555",
    "Html": "As far as I've seen, anyone who needs Replenishment, keeps it, 100% of the time, if there's 1 replenisher. If there are two, everyone keeps it, 100% of the time.",
    "PostedDate": "2009-03-08T12:04:39.827-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "165887",
    "ThreadId": "49555",
    "Html": "That is not true for 25mans, because of the way it chooses who are the 10 people to get Replenishment.<br>\r\n<br>\r\nhttp://www.wowmeteronline.com/combat/ability/2155892/57669/Replenishment for example.<br>\r\n",
    "PostedDate": "2009-03-08T17:54:27.947-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "165904",
    "ThreadId": "49555",
    "Html": "I stand corrected; I thought 2 replenishers wouldn't overwrite each other. ie, 20 people would have it at all times.<div><br></div><div>Regardless, the effect doesn't change much, does it? Anyone who needs replenishment, gets it, near-100% of the time, generally, whether there are 1 or more replenishers there. Right?</div>",
    "PostedDate": "2009-03-08T20:05:19.367-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "165925",
    "ThreadId": "49555",
    "Html": "Unfortunately it severely depends on raid composition.<div><br></div><div>If you have 13 Mana Classes, (And let's be evil, 2 are warlocks), that's 15 mana Users.</div><div><br></div><div>2 Warlock pets are always near 0 mana, there's 2.</div><div><br></div><div>The 5 Mages/Locks are going all out, and go out of mana fast and life-tap or Evoc for the next round.</div><div><br></div><div>The 2 Hunters are Not caring about mana, using viper to get back up.</div><div><br></div><div>The 6 Healers, well, the Shaman of all of them will have the best up-time due to mechanics usually (No clear-casting or Mana return). </div><div><br></div><div>The Warlock pets will have almost a 100% uptime, the Hunters almost 100%, and after they drop in mana the Locks and Mages will get 80+ uptime.  Since we, as healers, try to stretch our mana for so long, this tactic kills the possibility to replenish, and since replenish hits the 10 lowest (I believe it refreshes the buff if you are lower.)</div><div><br></div><div>The only way to guarentee 100% uptime is to only bring 10 mana classes/pets.   I've had nights on my druid I get 85%, and others I get 50%.</div>",
    "PostedDate": "2009-03-08T21:51:16.893-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]