[
  {
    "Id": "165939",
    "ThreadId": "49586",
    "Html": "Seeing the latest Beta's of Rawr are based on the 3.1 changes, it is important that everyone realises that the current version will no longer be accurate due to this latest change :-<br>\r\n<br>\r\n<p><b>Classes: General</b> </p>\r\n<ul>\r\n    <li>Armor Penetration Rating: All classes now receive 25% more benefit from Armor Penetration Rating. </li>\r\n    <li>Haste Rating: Shamans, Paladins, Druids, and Death Knights now receive 30% more melee haste from Haste Rating. </li>\r\n</ul>\r\n<p><br>\r\nI look forward to playing with Rawr once these are built in.   I hope I haven't DE'd any gear that i'll regret!<br>\r\n<br>\r\n    </p>\r\n",
    "PostedDate": "2009-03-08T22:37:49.547-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "165944",
    "ThreadId": "49586",
    "Html": "Also, Expertise Rating provides 25% more Expertise for everyone.<div><br></div><div>I've implemented the ArPenRating change in the base armor calculations shared throughout Rawr, and the haste and exp change in Rawr.Cat and Bear.</div>",
    "PostedDate": "2009-03-08T22:57:30.777-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "165947",
    "ThreadId": "49586",
    "Html": "Someone posted somewhere that they thought that the expertise change might be a bug/mistake.  I haven't seen anything official about it yet, but I haven't exactly been searching :)<br>\r\n<br>\r\n    \r\n",
    "PostedDate": "2009-03-08T23:06:55.247-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "165953",
    "ThreadId": "49586",
    "Html": "Yeah, I've heard that, and also heard that they thought that because the haste wasn't working... except, the haste is working, just only for those 4 classes.<div><br></div><div>It'll be tested thoroughly before 3.1 goes live, I'm sure.</div>",
    "PostedDate": "2009-03-08T23:45:49.573-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]