[
  {
    "Id": "166565",
    "ThreadId": "49768",
    "Html": "Would it be possible to add an option for optomizing food buffs?  I know as a dps caster I do min/max making sure I'm at the hit cap when between spell power food, spell crit/haste food, and +hit.<br>\r\n<br>\r\nI know you can select between different options in the buff menu so Rawr knows what buffs you have from food, but would it be possible to allow the optomizer to actually add the food buff into its calculations for what is optimal?  Should I swap out a piece of gear with 40 hit on it and use the +hit food buff for a higher dps item?  Or does the +42 spl pwr food benefit me more using the piece of gear with hit on it?  (In addition to +haste, +crit, etc).<br>\r\n<br>\r\nAlso would it be possible to have the optomizer tell what spec is optimal for dps?  I have been throwing the idea around about taking talent points out of my +hit talents and putting them into more dps orientated talents, and then swapping +hit gear in to counterract.  I know you can create different talent templates, but is it possible to have the optomizer compare several talent templates and using your gear/gem options tell you which one is optimal?\r\n",
    "PostedDate": "2009-03-10T11:55:49.687-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "166568",
    "ThreadId": "49768",
    "Html": "We're working on these features, and hope to support them in a later version.",
    "PostedDate": "2009-03-10T11:57:56.653-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "166695",
    "ThreadId": "49768",
    "Html": "The way I have been doing that is to use the &quot;All Buffs&quot; chart in the right pane and picking the highest ranked flask/food. Looking at Astrylians answer I guess that might not be the right way though :(<br>\r\n<br>\r\n",
    "PostedDate": "2009-03-10T18:51:57.27-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "166702",
    "ThreadId": "49768",
    "Html": "That is the way to do it currently krendar, the only problem is that it is not guaranteed to be optimal. An analogy would be looking at head item chart and only selecting the best one as available to optimizer.\r\n",
    "PostedDate": "2009-03-10T19:27:18.553-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "167129",
    "ThreadId": "49768",
    "Html": "<p>So, to grasp a little better how the optimizer works... My understanding is that the program looks at all of the user-selected items (&quot;available&quot;), then selects all of the individually highest DPS items, puts them together, then runs a check down the list, seeing if another item will be better given the current gear selections, and repeats that revision process a number of times (as selected by the thoroughness slider)?</p>\r\n<p>If so, then I guess the food is considered a buff, and must be user-selected, as opposed to being considered &quot;gear&quot;, which would put it in with the optimizer settings?</p>\r\n<p>Just brainstorming here, another potential process could be a sort of tree- and variations-system, where all options available are given the full range of potential gearings (1234, 1243, 1342, 1324, 1423, 1432, with 1 being the persisting value here).  This could potentially be VERY system-intensive, though.  On the other hand, this could also probably give a more accurate and flexible optimization.</p>\r\n<p>Again, this is just throwing some ideas around that are restless inside the ole' noggin.  =D</p>\r\n",
    "PostedDate": "2009-03-11T16:21:42.863-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "167151",
    "ThreadId": "49768",
    "Html": "Optimizer is a lot more complex than that. You can read about it in help: <a href=\"http://rawr.codeplex.com/Wiki/View.aspx?title=GearOptimization&referringTitle=Help\">http://rawr.codeplex.com/Wiki/View.aspx?title=GearOptimization</a>\r\n",
    "PostedDate": "2009-03-11T17:22:09.09-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "167152",
    "ThreadId": "49768",
    "Html": "What you describe about it trying every possible variation, is what it does, since some gear is only more useful in combination with one or more other items. But, every gemming or enchanting of an item is a different possible variation. The number of potential combinations is huge, and it would take literally eons to calculate them all. So, a genetic algorithm is used to make educated guesses at which combinations are potentially upgrades, so that it can get done in a reasonable amount of time. The Thoroughness is now long it keeps guessing. It'll always at least do what you described first.",
    "PostedDate": "2009-03-11T17:25:45.7-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]