[
  {
    "Id": "168247",
    "ThreadId": "50250",
    "Html": "This is kinda odd, but on my resto druid when I select some things that I currently have as 'available' to the optimizer (resto druid model atm), and then go into the optimizer to build an upgrade list....why do some items not show up at all?&nbsp; The big huge glaring one I see right now is when I filter by&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Slot:&nbsp; Gear &gt; Main Hand, the ONLY two items shown are &quot;Torch of Holy Fire&quot;&nbsp; (304.53), and &quot;The Soulblade&quot; (24.17).&nbsp; First of all, it's super odd that other items that *do* show up in the item comparisons chart don't show up in the Upgrade Comparison chart.<br>\r\n<br>\r\nin the &quot;Comparisons&quot; charts for Main Hand, the listing looks like this:<br>\r\n<br>\r\n{Item Name}&nbsp;&nbsp;&nbsp; {HealBurst} | {HealSustained} | (total:&nbsp; {Total})<br>\r\nTorch of Holy Fire&nbsp;&nbsp; 1132.87 | 2146.22 | (total:&nbsp; 3283.09)<br>\r\nThe Soulblade&nbsp;&nbsp;&nbsp; 1033.38 | 1967.58 | (total:&nbsp; 3005.25)<br>\r\nThe Impossible Dream&nbsp;&nbsp;&nbsp; 1029.59 | 1945.66 | (total:&nbsp; 2979.35)<br>\r\nIce Spire Scepter&nbsp;&nbsp;&nbsp; 1027.55 | 1941.56 | (total:&nbsp; 2973.30)<br>\r\nHaunting Call&nbsp;&nbsp;&nbsp; 1026.38 | 1918.8 | (total:&nbsp; 2949.58)<br>\r\n<br>\r\nThis goes on for awhile until it finally gets to one of the three i have checked for the optimizer:<br>\r\nTitansteel Guardian&nbsp;&nbsp;&nbsp; 1010.45 | 1729.73 | (total:&nbsp; 2746.58)<br>\r\n<br>\r\netc etc<br>\r\n<br>\r\nNow, the immediate oddity of course is that *none* but the first two of these items even show up in the upgrade comparisons list, not to mention there's 11 &quot;upgrades&quot; to my currently-equipped titansteel guardian, as displayed in the comparisons chart.<br>\r\n<br>\r\nThe next thing is why does the Upgrade Comparison chart say Torch of Holy Fire = 304.53 and The Soulblade = 24.17?&nbsp; If you look at the item comparisons chart these two items don't differ by ANYTHING CLOSE to a factor of 12.&nbsp; (Mousing over each one in upgrade comparison indicates that the optimizer chose the *exact* same gearset for both items, except for the item itself)....where did it get this 304.53 and 24.17 number?&nbsp; I don't see that relating to HealBurst, HealSustained, or Overall, so what numerical value is assigned when optimizing for an upgrade list?&nbsp; I just don't think I get how this upgrade list functionality works so if someone can either let me know what I'm doing wrong, or acknowledge that the program is doing something goofy here.<br>\r\n",
    "PostedDate": "2009-03-15T04:06:34.11-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "168294",
    "ThreadId": "50250",
    "Html": "The numbers shown in the Build Upgrade List are whatever you chose to optimize by (most likely Overall Rating). Build Upgrade List takes into account that you may swap other items in order to better use a potential upgrade. Did you set any additional requirements, perhaps, that would make it exclude other items in the middle of the pack? As always, if you post your character, we can tell you exactly what's going on.<div><br></div><div>EDIT: Oh, and the numbers are in terms of difference from your current set of gear.</div>",
    "PostedDate": "2009-03-15T09:48:04.693-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "168672",
    "ThreadId": "50250",
    "Html": "I'm still having similar issues and I posted about them three weeks ago (http://rawr.codeplex.com/WorkItem/View.aspx?WorkItemId=12661).&nbsp; <br>\r\n<br>\r\nI can't get most items to show up on the upgrade list unless I set my current item to something relatively poor.&nbsp; I've been trying to grab the most recent code base today to check it out, but I can't get a consistent connection via SVN.&nbsp; I'm on a Holy Priest model.&nbsp; It happens on every decently geared 80 holy priest I tried from the Armory.<br>\r\n<br>\r\nEdit: Actually my problems are with the &quot;Direct Upgrade&quot; list, but comparing &quot;Direct Upgrades&quot; to the &quot;Upgrade List&quot; shows just how broken direct upgrades is.<br>\r\n",
    "PostedDate": "2009-03-16T12:00:15.39-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "168693",
    "ThreadId": "50250",
    "Html": "Like I said in that work item, I found the problem, and fixed it this morning.",
    "PostedDate": "2009-03-16T12:36:20.573-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "168707",
    "ThreadId": "50250",
    "Html": "Woot!&nbsp; I didn't see that you had posted earlier.&nbsp; Thanks!<br>\r\n",
    "PostedDate": "2009-03-16T13:02:12.623-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]