[
  {
    "Id": "169224",
    "ThreadId": "50488",
    "Html": "Hi,<br>\r\n<br>\r\nI was wondering if the survivability rating for warlocks is still work in progress (as of beta 4), or if this is simply a dummy rating?<br>\r\n<br>\r\nThanks in advance,<br>\r\nElandril \r\n",
    "PostedDate": "2009-03-17T15:36:56.42-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "169298",
    "ThreadId": "50488",
    "Html": "We intended to get that out completely, but it seems we forgot it somewhere. We'll do that asap.<br>\r\n",
    "PostedDate": "2009-03-18T00:20:39.313-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "169309",
    "ThreadId": "50488",
    "Html": "The survivability rating will be gone in the next release.\r\n",
    "PostedDate": "2009-03-18T01:23:18.853-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "169341",
    "ThreadId": "50488",
    "Html": "Thanks for the clarification!<br>\r\n<br>\r\nI was also wondering, if the percentage for survivability in the warlock options had any influence on the optimization process. Are there any other indicators other than DPS for warlocks planned (e.g. something that takes HP and effects like Life Tap into account)? And are HP taken into account at all (e.g. 10% more DPS doesn't help, if I'm dead 20% faster)? Sorry for the many questions, but I try to understand how the optimizer for warlocks works, because it seems to solely focus on DPS (thus always adding + spell damage gems and enchantments) and completely disregard things like health points/stamina.<br>\r\n<br>\r\nThanks in advance,<br>\r\nElandril<br>\r\n",
    "PostedDate": "2009-03-18T03:09:14.53-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "169351",
    "ThreadId": "50488",
    "Html": "<p>I'm indeed going to remove all references to survivability, so it will not be taken into account in the optimizer.<br>\r\nThe current DPS gear has more than enough stamina on it anyway, if it becomes a problem in the future a target HP amount will be added like in the Tree model.<br>\r\nThe optimizer will focus on total DPS (personal DPS + pet DPS), an option for forcing the hit cap will be added though.</p>\r\n",
    "PostedDate": "2009-03-18T03:30:37.53-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]