[
  {
    "Id": "170250",
    "ThreadId": "50782",
    "Html": "In the Gemming Templates supplied for the current models, how are the gems in the templates used?&nbsp; For example my enh shammy has 10 predefined templates but the gems are the same across a template e.g. 4 Delicate Scarlet Ruby or 4 Rigid Autumn Glow in all the templates while my warrior has 5 predefined templates in the model and the gems vary across a template e.g. Guardians Twighlight Opal, Enduring Forest Emerald and 2 Solid Sky Sapphire.<br>\r\n<ul>\r\n    <li>Is the optimizer free to mix and match from any gem in any of the templates?&nbsp; Say I have an ungemmed gear set with 6 slots, would the optimizer tell me to buy 6 of the same gem or could it mix different gems?</li>\r\n    <li>How is the meta chosen for each model?&nbsp; Some models have the same meta across all templates some have different metas.</li>\r\n    <li>Another related question.&nbsp; If I acquire a new piece, how can I instruct the optimizer that the gems in my existing gear shouldn't be changed, but it's free to choose any gem for the new piece.</li>\r\n</ul>\r\nThanks so much for such an excellent tool.<br>\r\n",
    "PostedDate": "2009-03-20T09:41:56.683-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "170253",
    "ThreadId": "50782",
    "Html": "Take a look at the column headers on the Gemming Templates dialog. A gemming template consists of 5 gems, one for each color socket. (Red, Yellow, Blue, Prismatic, Meta).<div><br></div><div>Gemming Templates are used for creating gemmings in the charts and dropdowns in the main app, not the Optimizer. There's also an option (defaulted to ON), that makes all the gems in any enabled gemming template count as available to the Optimizer.</div><div><br></div><div>What gemming templates you see by default are just what the developer of that model chose to include and enable by default, which may include one or multiple metas. You're free to add your own, disable the built-in ones, etc.</div><div><br></div><div>You can mark a specific gemming/enchanting of an item as available, instead of the whole item universally, which will prevent the Optimizer from regemming/reenchanting it (unless you check those checkboxes in the Optimizer window). To do so, unmark an item as available (so that its diamond isn't filled), and then ctrl-click the diamond. That'll turn it blue, indicating that just that specific gemming is available. Then right click on the diamond, and choose an enchant to force it to use for that gemming, which will put a red dot next to the diamond.</div>",
    "PostedDate": "2009-03-20T09:57:54.043-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]