[
  {
    "Id": "170380",
    "ThreadId": "50837",
    "Html": "This looks like a very useful tool for the game, and I'm wondering if it would be a good match for Windows SideShow.  For example, I've written a WoW Armory gadget that gets stats, gear, rep, etc for your character and your friends and shows the data on SideShow display.  The SideShow display could be a mobile phone (there's a Windows Mobile client), a display on your keyboard, intergrated into your pc, etc.  You can see some older screenshots (new screenshots will be posted soon, as I've just completed a rev of the UI) of this on my blog at <a href=\"http://ssgadgets.wordpress.com/2008/06/14/wow-armory-gadget-now-available/\">http://ssgadgets.wordpress.com/2008/06/14/wow-armory-gadget-now-available/</a>.<br>\r\n<br>\r\nIf this data would be useful to see on your keyboard display while you're playing the game, or useful to look at later on your phone, please let me know.  I'd be interested in adding the SideShow support for you.<br>\r\n<br>\r\nEd\r\n",
    "PostedDate": "2009-03-21T10:25:58.387-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "170386",
    "ThreadId": "50837",
    "Html": "Hey. I'm certainly open to the idea, though I'm not sure what information you'd want to show there. Any ideas?",
    "PostedDate": "2009-03-21T10:40:42.693-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "170390",
    "ThreadId": "50837",
    "Html": "I see there's a ton of stat data in the app.  Is there a core set of info that would be useful to browse through for a group of characters?  There's also some potential for notifcations on the device, such as when gear is improved.  Perhaps a list of recommended item upgrades for each slot would be useful to browse?  It could even have them listed by slot or instance. <br>\r\n<br>\r\nEd\r\n",
    "PostedDate": "2009-03-21T11:00:39.157-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "170419",
    "ThreadId": "50837",
    "Html": "Well, yes, there's all kinds of data, but nothing would update while not in Rawr. I'd guess charts for each slot would be the most useful.",
    "PostedDate": "2009-03-21T13:51:41.747-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]