[
  {
    "Id": "170496",
    "ThreadId": "50874",
    "Html": "I'm using 2.2.0b4, and I can't seem to get anything but rare or higher items (or uncommon items I have equipped) to appear in the list.&nbsp; I've gone through the filters and set the minimum quality to uncommon for all of them (was: temp), but still no.&nbsp; Am I doing something wrong?<br>\r\n",
    "PostedDate": "2009-03-22T00:28:11.237-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "170579",
    "ThreadId": "50874",
    "Html": "Did you add them to Rawr? Rawr is never missing any items; see the readme for adding whatever items you want. Green items were removed from the default item cache, due to their unpopularity.",
    "PostedDate": "2009-03-22T10:10:15.54-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "170601",
    "ThreadId": "50874",
    "Html": "No, OK, I see how to do that now.&nbsp; Odd that 2.1.9 always had the item I was looking for before I was looking for it.&nbsp; Is there a way to batch load items other than &quot;potential upgrades&quot;?<br>\r\n",
    "PostedDate": "2009-03-22T11:34:23.68-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "170609",
    "ThreadId": "50874",
    "Html": "Nope, that's the intended way.",
    "PostedDate": "2009-03-22T12:09:55.873-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "170620",
    "ThreadId": "50874",
    "Html": "Any idea why 2.1.9 had such a large and complete list that I *never* had to do this?&nbsp; Seriously.&nbsp; I never did.&nbsp; My new quest item was always already there.<br>\r\n",
    "PostedDate": "2009-03-22T12:42:36.553-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "170623",
    "ThreadId": "50874",
    "Html": "That's exactly the point. That's intended. 2.1.9 has *tons* of items built in. The more items involved, the slower everything gets. So, for performance reasons we cut it down to just items that had a decent chance of being used. (And of course you can still add any items that you find are missing, in just a couple clicks)<div><br></div><div>It sounds like you're just in a situation where you're in the extreme minority; very very few people are using green quest items for anything. As you reach 77+ blue quality gear, you'll find everything there already.</div>",
    "PostedDate": "2009-03-22T12:54:37.65-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "170625",
    "ThreadId": "50874",
    "Html": "Ahhh, OK.&nbsp; I get you now.&nbsp; I thought you meant it was intended to not have a large list in either version.&nbsp; I'm still leveling a character, and I'm still getting some quest greens, but it's less of an issue now than it would have been when I just got into Northrend.<br>\r\n<br>\r\nThanks, and love the tool!!<br>\r\n",
    "PostedDate": "2009-03-22T13:10:33.343-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "170631",
    "ThreadId": "50874",
    "Html": "Honestly, PeeDub?  I'd say don't even worry about it.  The tool really isn't balanced for that sort of work or intended for use in leveling.  While it may work okay, it's not even going to be close in it's overall modeling, you don't have access to important abilities, and the whole precision thing this modeling is pointed towards is really moot in that situation.<div><br></div><div>When leveling, pick up the best green for your class / spec that happen to come as quest rewards, and grab the blue quest rewards when you can.  You'll be more efficient by just questing and picking up whatever happens to drop, rather than trying to tweak and finagle a delicately balanced tool for level 80 combat ratings, stat conversion model, boss mechanics, and buff system into working for a level 73 Holy Priest who's leveling as Shadow.  Your class / spec / level don't really matter, so much as the drastically different situation as a whole.</div><div><br></div><div>Don't even worry about it.  Just quest, and pick up what happens to coe your way.  =)</div>",
    "PostedDate": "2009-03-22T13:33:05.797-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "170649",
    "ThreadId": "50874",
    "Html": "Actually, that's what I do.&nbsp; I just use the tool to help me get a handle on *which* green or blue is actually an upgrade.&nbsp; I don't run complex optimizations.&nbsp; It answers questions for me (and leads to me answer for myself) is STR better than AP?&nbsp; Defense or dodge?&nbsp; I look at the points, consider the item level and that's about it.&nbsp; It also helps me find items on the AH that are the biggest bang for the buck.&nbsp; I'm not hardcore (yet), but I enjoy having something that can provide a gutcheck on my own choices.<br>\r\n",
    "PostedDate": "2009-03-22T14:51:33.1-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]