[
  {
    "Id": "170683",
    "ThreadId": "50931",
    "Html": "I think this feature is available already, but I'm not sure if I am selecting the right options to run it the right way...<br>\r\n<br>\r\nI have an optomized gear set including gems, enchants, and buffs that is loaded for my a typical 10 man raid setup, specifcally tailored to have max +hit, as my 10 man groups don't typically have a shadow priest with misery nor a druid with improved faerie fire.<br>\r\n<br>\r\nI want Rawr to optomize a set of gear from the current equipped gear set with EXISITING gems and enchants, also pulling from my pool of available gear (selected in each gear menu), for 25 man raids where I will have the additional +3% hit from faerie fire or misery.<br>\r\n<br>\r\nBasically I'm looking one gear set with +14% hit and another with +17% hit using the +17% set as the baseline and then swapping things out from there WITHOUT re-gemming/re-enchanting to build the +14% set.<br>\r\n<br>\r\nI assume this is accomplished by de-selecting &quot;override enchant&quot; and &quot;override regem&quot; in the optomize menu.  When I run the optomize without these options checked though it STILL tries to suggest new gems, etc.<br>\r\n<br>\r\nIs there another way to accomplish what I am trying to do? <br>\r\n<br>\r\nedit:  I'm using 2.2.0b3 as it models the warlock talents from current live build, 3.0.9.  2.2.0b4 and 2.2.0b5 use the PTR talents but at this point I'm working with live content/gear.\r\n",
    "PostedDate": "2009-03-22T18:01:52.547-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "170691",
    "ThreadId": "50931",
    "Html": "<a href=\"http://rawr.codeplex.com/Wiki/View.aspx?title=GearOptimization\">http://rawr.codeplex.com/Wiki/View.aspx?title=GearOptimization</a>\r\n",
    "PostedDate": "2009-03-22T18:51:25.68-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "170696",
    "ThreadId": "50931",
    "Html": "Thank you greatly.  That was exactly what I was looking for!  :)\r\n",
    "PostedDate": "2009-03-22T19:09:20.143-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "171959",
    "ThreadId": "50931",
    "Html": "I read that &quot;guide&quot; and it was very helpful! I want to take it one step further with my question though.<br>\r\n<br>\r\nI am also using two sets (with and without shadow priest / boomkin) but I want to optimize my potions and food too. I'm an alchemist so I'm trying to decide if I should get my hit rating from gear, potion or food for that last 3%. I like my frostwyrm flask, with some hit on gear and eating hit rating food personally but I don't know if its the &quot;best&quot; or most ideal. I was hoping rawr could suggest a good mix for me. All I seem to be able to do is select my buffs and they're static. :-(&nbsp; Is there a food/potion buff optimizer option available that anyone has found?<br>\r\n",
    "PostedDate": "2009-03-25T11:11:42.103-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "171987",
    "ThreadId": "50931",
    "Html": "That sort of optimizer is coming in a future version.",
    "PostedDate": "2009-03-25T11:57:50.287-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "171995",
    "ThreadId": "50931",
    "Html": "I appreciate the speedy reply. Thank you Astrylian. I look forward to such an optimization! Until then, I'll tinker and run it with and without each combo.<br>\r\n<br>\r\nEdit: Is there a user guide for Rawr posted somewhere? I want to read more stuff similar to the link Kavan posted. I have a sneaking suspicion I'm not using Rawr to its full capabilities =)<br>\r\n",
    "PostedDate": "2009-03-25T12:10:40.523-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "171998",
    "ThreadId": "50931",
    "Html": "The Help menu has alot of info like that (in the betas), and there's also a tour video at http://www.youtube.com/watch?v=OjRM5SUoOoQ",
    "PostedDate": "2009-03-25T12:15:56.383-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]