[
  {
    "Id": "170929",
    "ThreadId": "51008",
    "Html": "I'm trying to create a profile for my DK but some of the items she has are missing.&nbsp; I've added them successfully but they still don't appear in the list of available items when I try to add them to the relevant slot.&nbsp; What am I missing?<br>\r\n",
    "PostedDate": "2009-03-23T10:28:06.193-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "170932",
    "ThreadId": "51008",
    "Html": "<p>Which version of Rawr are you using?  How did you add them, through loading up the possible upgrades, or manually inputting the data?</p>\r\n<p>Are you sure that you've selected the correct class / model to use?  Under your character name on the stats tab, there is a dropdown menu to select which class and model you are.</p>\r\n",
    "PostedDate": "2009-03-23T10:34:41.357-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "170940",
    "ThreadId": "51008",
    "Html": "You may also have some items filtered out; check out the Filters dropdown in the top right, and make sure everything is checked.",
    "PostedDate": "2009-03-23T10:51:09.87-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "176179",
    "ThreadId": "51008",
    "Html": "I'm having the same issue.<br>\r\n<br>\r\nFor a feral druid in cat form, was looking for the Fury of the Five Flights, WowHead item # 40431 .&nbsp; I added it using the Edit Items . . . Add function, and the item was found when I entered the id (name, etc. was filled in for me), so I know it was retrieved ok.&nbsp; Yet the item is not listed, either in the ranked item list for the trinket slot, nor in the selection list when clicking on a trinket slot.<br>\r\n",
    "PostedDate": "2009-04-06T09:04:55.27-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "176324",
    "ThreadId": "51008",
    "Html": "I had strange things happen with the item list the last couple days, like I deleted an item and it would show up again later. I fixed it by going into the rawr/data folder and taking OFF the read only flag of all files.  Now I can edit the list.\r\n",
    "PostedDate": "2009-04-06T14:31:42.267-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "176449",
    "ThreadId": "51008",
    "Html": "JoesCat: That trinket isn't modeled yet. You can edit it to give it a static 260 AP (or whatever it is, I forget), and it will show up.<div><br></div><div>BHershey: Yeah, you always want to make sure that all of Rawr's files are writable. By default they are, unless you unzip them to somewhere you don't have full access, such as Program Files or something.</div>",
    "PostedDate": "2009-04-06T21:48:19.08-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "184283",
    "ThreadId": "51008",
    "Html": "Fluethin (Flaygarth alt): I have the same issue - weird thing is that it works on my copy of rawr loaded on my WinXP SP3 machine, but does not work on my MS Vista machine. On the Vista machine I have gone into the rawr/data folder to ensure that read only is clicked off, but still my recently dropped shield - Tharon Ja's Aegis (from Drak Tharon reg) which I have entered manually from wowhead - does not show up. Going through the exact same procedure on my WinXP machine allows me to see the shield as an upgrade. As the shield is a lvl 74 item and I'm currently only lvl 73 (Pally tank) I cannot wear it and reload character from arnory. On my XP machine I can now see this item as a fantastic upgrade - on Vista - nada! Unfortunate as my Vista machine is the one dedicated to WoW! A solution would be great!!\r\n",
    "PostedDate": "2009-04-27T16:58:00.51-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "184795",
    "ThreadId": "51008",
    "Html": "Flaygarth, sounds like you've got some sort of filtering turned on, that's preventing the item from showing. Check the filters dropdown, in the top right.",
    "PostedDate": "2009-04-28T19:51:18.01-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "185276",
    "ThreadId": "51008",
    "Html": "Well - i thought of that and have tried every combination of filters from all on to all off! Still no joy. Meanwhile I've leveled my Pally to 74 and equiped the shield. On refresh from armory there it is! So not a big issue as I can use my XP machine for items not already loaded. As I approach 75 most of the items are pre-loaded so again not a big issue. Be nice to know what caused the blind spot tho :)\r\n",
    "PostedDate": "2009-04-29T18:50:47.417-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]