[
  {
    "Id": "172597",
    "ThreadId": "51472",
    "Html": "I read through the help files and was still unable to nail this down so here goes my question :)<br>\r\n<br>\r\nWhat *exactly* is calculated with Burst DPS versus Sustained DPS?<br>\r\n<br>\r\nIf my goal is to compare gear without ever considering OOM issues, how do I do it? Do I look solely at Burst DPS? (Do I need to tweak anything else?).<br>\r\n<br>\r\nAs it stands right now on my Elemental Shaman, I have never gone OOM on a boss fight even when spamming constantly. With the raid buffs I have, I am secure with my mana. I want to take any mana considerations out of my gear calculations.<br>\r\n<br>\r\nThanks for your time and help :) &lt;3 this program!<br>\r\n<br>\r\n-Misa<br>\r\n",
    "PostedDate": "2009-03-26T19:18:03.56-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "172644",
    "ThreadId": "51472",
    "Html": "That's the difference between Burst and Sustained DPS. Sustained is mana constrained. However, rather than just looking at Burst DPS, you may want to figure out why Rawr thinks you'll go OOM, when you don't in practice.<div><br></div><div>If there's a bug, we want to know about it, and fix it. Did you ensure that you were using all the same buffs you get in raids, are talented the same, etc?</div>",
    "PostedDate": "2009-03-26T23:22:02.677-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "172645",
    "ThreadId": "51472",
    "Html": "Honestly I don't know if its a bug or more a matter of me still trying to fully understand how to utilize Rawr. I just wanted to cut that variable out to make it easier on me to understand the information displayed. I tweaked it a little bit just now and with all my &quot;usual&quot; raid buffs up, the only time I run out of mana is if I have replenishment on me less than 25% of the fight. I honestly have no clue how often replenishment is on me to be absolutely honest. I think with all the patchwerks and archavon fights I've done (best fights to test OOM on), I've only had to pop a potion once and it was because I felt low - not because I actually ran out. <br>\r\n<br>\r\nI'll play around a little more. Elemental shaman is an interesting animal. I played backup healer on Saphiron once when one of our mains went down. I ran out of mana and then switched back to dps because it utilized negative mana to do my normal rotations. Maybe Blizzard does need to 'fix' mana regen? Hmm...<br>\r\n<br>\r\nedit: One thing that does come to mind to investigate further is how often clearcasting is up on my shaman. I think it may be undervalued...<br>\r\n",
    "PostedDate": "2009-03-26T23:50:47.62-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "172661",
    "ThreadId": "51472",
    "Html": "Replenishment only being up 25% of the time would be really really rare. In actual gameplay, replenishment uptime varies by how low you get on mana, but even still, it's usually in the 50-100% range.<div><br></div><div>Regarding Clearcasting, that's one of the complex bits of math; please feel free to examine how it values things compared to how valuable it is in-game. (Do remember though that you can't just calculate an uptime percent based on combat logs, because you don't care about the percent of *time* that Clearcasting is up, but rather the percent of *casts* that Clearcasting is up, which can be substantially different)</div>",
    "PostedDate": "2009-03-27T01:22:35.197-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]