[
  {
    "Id": "174166",
    "ThreadId": "51913",
    "Html": "I, and probably many others, use Rawr to simply build wish lists.  I'll go through and check off the items I want to obtain in the near future, then manually put the info into a spreadsheet and keep it by my side.  I help guildies the same way, and they LOVE the info I give them, but it's time consuming putting together all these lists!<br>\r\n<br>\r\nA 'Wish List' feature would simply list all checked items, by slot, something like this, showing slot name, item description and location...<br>\r\n<br>\r\n \r\n<table cellspacing=0 rules=none border=0>\r\n    <colgroup><col width=71><col width=234><col width=140></colgroup>\r\n    <tbody>\r\n        <tr>\r\n            <td style=\"width:71px;height:17px\" align=left><span style=\"font-size:10px\">Legs 1</span></td>\r\n            <td style=\"width:234px\" align=left><span style=\"font-size:10px\">Valorous Frostfire Leggings </span></td>\r\n            <td style=\"width:140px\" align=left><span style=\"font-size:10px\">Vault</span></td>\r\n        </tr>\r\n        <tr>\r\n            <td style=\"height:17px\" align=left><span style=\"font-size:10px\">Legs 2</span></td>\r\n            <td align=left><span style=\"font-size:10px\">Hero's Frostfire Leggings</span></td>\r\n            <td align=left><span style=\"font-size:10px\">Vault</span></td>\r\n        </tr>\r\n        <tr>\r\n            <td style=\"height:17px\" align=left><span style=\"font-size:10px\">Legs 3</span></td>\r\n            <td align=left><span style=\"font-size:10px\">Woven Bracae Leggings</span></td>\r\n            <td align=left><span style=\"font-size:10px\">Halls of Lightning Heroic</span></td>\r\n        </tr>\r\n        <tr>\r\n            <td style=\"height:17px\" align=left><span style=\"font-size:10px\">Legs 4</span></td>\r\n            <td align=left><span style=\"font-size:10px\">Sorrowgrave's Breeches</span></td>\r\n            <td align=left><span style=\"font-size:10px\">Utgarde Pinnacle Heroic</span></td>\r\n        </tr>\r\n        <tr>\r\n            <td style=\"height:17px\" align=left><span style=\"font-size:10px\">Main Hand 1</span></td>\r\n            <td align=left><span style=\"font-size:10px\">Haunting Call</span></td>\r\n            <td align=left><span style=\"font-size:10px\">Naxx</span></td>\r\n        </tr>\r\n        <tr>\r\n            <td style=\"height:17px\" align=left><span style=\"font-size:10px\">Main Hand 2</span></td>\r\n            <td align=left><span style=\"font-size:10px\">Grieving Spellblade</span></td>\r\n            <td align=left><span style=\"font-size:10px\">Naxx</span></td>\r\n        </tr>\r\n        <tr>\r\n            <td style=\"height:17px\" align=left><span style=\"font-size:10px\">Main Hand 3</span></td>\r\n            <td align=left><span style=\"font-size:10px\">Staff of Draconic Comeback</span></td>\r\n            <td align=left><span style=\"font-size:10px\">Oculus</span></td>\r\n        </tr>\r\n    </tbody>\r\n</table>\r\n<br>\r\nIf I had a screen in Rawr showing this, I would have it up every time I play WoW, as it would help me decide what to do next.  What would REALLY be sweet is to have another column that shows the dps improvement over my current gear (or threat, burst heal, etc.)<br>\r\n<br>\r\nThank you for a GREAT product (the beta version ROCKS).  I hope anyone that uses this will donate!, like I have done :)<br>\r\n<br>\r\nBrian<br>\r\nPA, USA\r\n",
    "PostedDate": "2009-03-31T21:15:26.6-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "174198",
    "ThreadId": "51913",
    "Html": "Hey, have you checked out the export from the Build Upgrade List feature that's new in the beta? We'd like to add more data columns to that, and perhaps support it in the regular charts, but does that at least basically support what you mean?",
    "PostedDate": "2009-04-01T00:08:13.327-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "174288",
    "ThreadId": "51913",
    "Html": "If you're talkling about 'tools/upgrade list', it doesn't work for me... I get the error below when I click on a slot in the dropdown.   Does it only show items that I've selected or all upgrades available?<br>\r\n<br>\r\nI see there's 'Chart/Direct Upgrades', but it shows all upgrades, not just the ones I've selected.  If you add a filter to that list of only selected items (green diamond) and add some data columns like you mentioned that would be perfect.<br>\r\n<br>\r\n************** Exception Text **************<br>\r\nSystem.NullReferenceException: Object reference not set to an instance of an object.<br>\r\n   at Rawr.FormUpgradeComparison.slotToolStripMenuItem_Click(Object sender, EventArgs e)<br>\r\n   at System.Windows.Forms.ToolStripItem.RaiseEvent(Object key, EventArgs e)<br>\r\n   at System.Windows.Forms.ToolStripMenuItem.OnClick(EventArgs e)<br>\r\n   at System.Windows.Forms.ToolStripItem.HandleClick(EventArgs e)<br>\r\n   at System.Windows.Forms.ToolStripItem.HandleMouseUp(MouseEventArgs e)<br>\r\n   at System.Windows.Forms.ToolStripItem.FireEventInteractive(EventArgs e, ToolStripItemEventType met)<br>\r\n   at System.Windows.Forms.ToolStripItem.FireEvent(EventArgs e, ToolStripItemEventType met)<br>\r\n   at System.Windows.Forms.ToolStrip.OnMouseUp(MouseEventArgs mea)<br>\r\n   at System.Windows.Forms.ToolStripDropDown.OnMouseUp(MouseEventArgs mea)<br>\r\n   at System.Windows.Forms.Control.WmMouseUp(Message&amp; m, MouseButtons button, Int32 clicks)<br>\r\n   at System.Windows.Forms.Control.WndProc(Message&amp; m)<br>\r\n   at System.Windows.Forms.ScrollableControl.WndProc(Message&amp; m)<br>\r\n   at System.Windows.Forms.ToolStrip.WndProc(Message&amp; m)<br>\r\n   at System.Windows.Forms.ToolStripDropDown.WndProc(Message&amp; m)<br>\r\n   at System.Windows.Forms.Control.ControlNativeWindow.OnMessage(Message&amp; m)<br>\r\n   at System.Windows.Forms.Control.ControlNativeWindow.WndProc(Message&amp; m)<br>\r\n   at System.Windows.Forms.NativeWindow.Callback(IntPtr hWnd, Int32 msg, IntPtr wparam, IntPtr lparam)<br>\r\n",
    "PostedDate": "2009-04-01T05:22:20.27-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "174494",
    "ThreadId": "51913",
    "Html": "I'll see about getting that fixed; you shouldn't be able to open that form without opening an upgrade list. You want to use Tools &gt; Optimizer &gt; Build Upgrade List to create one.",
    "PostedDate": "2009-04-01T13:29:57.263-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "174565",
    "ThreadId": "51913",
    "Html": "Ahh, ok, glad I was able to uncover a little bug then :)  The optimizer worked fine and the upgrade list works now.  It doesn't fill the need of the original feature request though.  My guildies and I just want to see a list of items that we've already selected with a green diamond.  With just one glance, we could have our wish list and always know where our next upgrades are coming from.  I think if something like that were implemented, it would open up your potential audience to include players not interested in the optimizer functions of Rawr.  If you use myself and my guildies as a snapshot, none of us care about the optimizer stuff, but we REALLY could use wish lists.<br>\r\n<br>\r\nI will not keep buggin about it.. good luck and hope to see more exciting things in the future!\r\n",
    "PostedDate": "2009-04-01T15:46:31-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "174568",
    "ThreadId": "51913",
    "Html": "Well that's the thing; you're using it backwards. Green diamonds are supposed to indicate what you have available. Without a list of what you already have available, there's no way for Rawr to know how much of an upgrade it is, aside from what you're currently wearing. That said, I can include a chart of just all the gear you have marked available, it'd just be displayed in absolute values, not relative values, which isn't helpful as a wish list.<div><br></div><div>Have you and your guildies checked out the Tour of Rawr video? http://www.youtube.com/watch?v=OjRM5SUoOoQ</div><div><br></div><div>So again, is the output from the Upgrade List the sort of output that you're looking for?</div>",
    "PostedDate": "2009-04-01T16:03:25.943-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "174647",
    "ThreadId": "51913",
    "Html": "I'm sure some of my guildies have multiple items sitting around in their bags, but I've never heard them discuss it... I certainly don't, and never will.  We use Rawr to show us what upgrades we don't yet have, and where to go to get them... it's suited almost perfectly to do that!<br>\r\n<br>\r\nFor example, when I look for a neck item upgrade, I sort by DPS and look at the item, where to get it, and how much more DPS it will give me over what I currently have on.  If it's higher in the list, and it's located in a place I'm currently geared for, it gets selected and I manually type it into a list.. and so on for each slot.<br>\r\n<br>\r\nSo, the Upgrade list would be perfect if you add a &quot;Show only available gear&quot; (to use your language :) and be able to add other columns, like location, slot, etc..  Absolute values are fine, because at this point I already know it's an upgrade, the highest absolute DPS values will be higher in the list.  The lowest DPS value for each slot would be the item currently equipped.<br>\r\n<br>\r\nYes I know, we're using it &quot;backwards&quot;, and I realize that after I equip a new item it changes the values of all the available gear... I just make a new wish list after every upgrade!  As with any great program, users will surprise their developers and come up with unforseen uses.<br>\r\n<br>\r\nI can't imagine how a wish list like this would NOT excite any guild leader.  Players LOVE  the output I described in my first message.  I've introduced  a number of people to Rawr, and I hear their comments in Vent when they first check it out.. what do they do?... they typically goto the slot of their lowest item level and start hovering over the items in the comparison list that are above their equipped item, and they say, &quot;oh cool, I can go here to get this item... and maybe on our next Naxx run this one will drop.&quot;, etc.<br>\r\n<br>\r\nSo call it an optimizer, call it a gear explorer, call it whatever.. it's always running when I'm playing WoW :)<br>\r\n",
    "PostedDate": "2009-04-01T22:03:53.227-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "174672",
    "ThreadId": "51913",
    "Html": "I think you're misunderstanding. What you're describing is exactly what Rawr is for, and exactly why Rawr exists. The <em>only</em> thing you're doing backwards is marking things you don't have, as available. You still should be looking through the charts, seeing what's good, where to get it, etc. There's just no reason to mark it as available. Once you do have it, then you mark it available, and use the Optimizer to find the best set of gear for you. That doesn't mean you have to keep multiple items around, it can be as simple as correctly gemming and enchanting it. (Though I do highly recommend keeping alternate pieces of gear so that you can perform better in different situations, but I realize that's not exactly a 'casual' thing to do.)<div><div><br></div><div>This isn't an unforeseen use; this is <strong>the </strong>primary intended use. But what you're missing is that Rawr will do all of that for you, and do it much better, if you let it. The only thing 'backwards' is that you're marking stuff available for no reason. Instead, mark what you currently have available, and use the Build Upgrade List feature, and <em>it will make your wish list, for you.</em></div><div><em><br></em></div><div>Again, I strongly recommend you check out the video I linked above; it should clear up your misunderstanding.</div></div>",
    "PostedDate": "2009-04-01T23:59:42.84-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "174788",
    "ThreadId": "51913",
    "Html": "I've seen the video, and understand how you want people to use the program.  I have no reason to use the Optimizer, and the Build Upgrade List feature returns hundreds of items I would never want.... I just want to pick what items I'm currently working for and have that list in front of me.  I'm still using what I see as Rawr's stength, and that's the numbers behind the comparison list and sorting the gear by dps, burst healing, etc..<br>\r\n<br>\r\nI'm not sure why there's such a disconnect here... I select the gear I want to acquire next... Rawr helps me do that perfectly in the comparisons windows. I just want to see that list and be able to send it to my guildies for their characters to say, ok, this is what we'll be working for over the next week or so.  <br>\r\n<br>\r\nYou seem to be saying now that Rawr does all this and more and should be fine the way it is.  I'm saying the Build Upgrade List is way too bloated with items I would never want.  I'm not going to print out a list of 400 items from the upgrade list and put it on my desk beside me or send that to a guildie.  I want to filter it by my own choices, add some columns to it and voila :)<br>\r\n<br>\r\n",
    "PostedDate": "2009-04-02T05:49:51.173-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "174824",
    "ThreadId": "51913",
    "Html": "Does adding filters in Rawr not work for you? If you are currently working on 10-man contant and don't want it to show all 25-man, you can filter those out easily for example.<br>\r\n",
    "PostedDate": "2009-04-02T07:44:50.36-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "174827",
    "ThreadId": "51913",
    "Html": "Well, the filter works great as long as the item source contains valid data.  A lot of the stuff has the &quot;Unknown location ...&quot;.  I would love to be able to go into the item edit and update the source (location) but that is not an editable field.  Is that because it is in a different XML file that is linked to the itemcache?  [NOTE: That is on MY wishlist.  The ability to update the source location.]  Once that has valid data then filtering would work great.  There are a lot of items that can be purchased through Emblems of Heroism/Valor that aren't marked and lots of items from 3.1 instances that I can't filter out yet.\r\n",
    "PostedDate": "2009-04-02T07:52:23.16-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "174842",
    "ThreadId": "51913",
    "Html": "Yeah, I think the main issue with building upgrade lists as I've experienced is that it does run through -everything-, which can take some time even with the current optimizations and multi-threading. Having the ability to set up more specific filters (e.g. ilevel filters, dungeon source filters, etc.) quickly when building an upgrade list would be nice.<br>\r\n<br>\r\nAt least for me, just being able to look at certain ilevel ranges would solve most of the percieved problems associated with the &quot;Build Upgrade List&quot; feature. Also, as noted, the source data is not always super-accurate for everything (I've noticed a lot of trouble with badge items, for instance, often showing as Unknown) which is probably something which could improve a little as well.<br>\r\n<br>\r\nThe other thing I'd mention is that I know a lot of people like using the Optimizer with specific criteria to try to put together an optimal set in future content to know which items to try to get ahold of first. The reason they do that is that the Upgrade List is quite large an verbose, whereas the Optimizer will give a simple &quot;best set given your criteria&quot; output which clearly shows what items to add to one's wishlist. This is probably why many people flag the items then run the optimizer, rather than Build Upgrade List.<br>\r\n<br>\r\nGenerally, people seem to want an answer to the seemingly simple question of: &quot;What is the best set of gear I can get at my progress level and where do I go to get it?&quot;<br>\r\n<br>\r\nJust some musings on the topic. The Optimizer has gotten a lot better recently, and it's a great tool so polishing it up a bit would be awesome. :)\r\n",
    "PostedDate": "2009-04-02T08:12:29.253-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "174854",
    "ThreadId": "51913",
    "Html": "Theryon, you can edit the Notes field on an item, which are included in source filters.<div><br></div><div>bhershey, the issue with what you're doing is that the data you're using isn't accurate. We want you to be able to easily use accurate data. If you're using it in this way, others surely are (such as your guild). We don't want Rawr to mislead you, and the way you're using it, it is.</div><div><br></div><div>Don't get me wrong, I'm not saying you're at fault or anything. Rather, I'm trying to understand <em>why</em> you're using it the way you are, so that I can better tune things to point people such as you to using it the right way, so as to get accurate data. So please, don't get put off by my persistence, I just want to make the situation better for everyone. :)</div><div><br></div><div>So, getting back into it, what you're describing is what filters are for. Not too overly restrictive, but you probably can cut that upgrade list of 400 items down to 200 without much trouble (sidenote, we will have much better filters by default in a future beta). Then from that upgrade list, you'll want to export that to CSV (that export is coming in b6, you don't have it yet). In that CSV in Excel, <em>that</em> is where you want to pick and choose what upgrades you're looking for.</div><div><br></div><div>Do you understand the difference (and why what you're doing, reusing a meaningful field for something else, is misleading you with completely wrong data)?</div><div><br></div><div>Bottom line is that we don't want you to be mislead by wrong data (or rather, reading right data as something that it's not). Please help us understand how to best guide you to getting the data you want. :) </div><div><br></div><div>EDIT: Also, if it would help, lets chat about this over IM: cnervig@hotmail.com on MSN, Astro tSD on AIM.</div><div><br></div><div><br></div><div>EvanM, what are you talking about? o.O   Rawr has filters, and items that are filtered out are not checked when doing a Build Upgrade List. You can write ilvl specific filters, and dungeon-specific filters.</div><div><br></div><div>When someone wants to know &quot;What is the best set of gear I can get at my progress level and where do I go to get it?&quot; they should filter to their progress level, and use Build Upgrade List. If they're not, we need to better hint to the user that that's the correct way to get the data they want.</div>",
    "PostedDate": "2009-04-02T08:24:50.687-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "174959",
    "ThreadId": "51913",
    "Html": "Thanks.  I do edit the Notes but I like the suggestion about moving them to their own XML file so that updates (or overwrites) of the itemcache file don't get rid of the notes.  But what I was saying is that the Source of an item (right above the Notes) is not editable.  I wish it could be so that I can put a true source on these &quot;Unknown location&quot;s.  I'd like to be able to filter out stuff that way.\r\n",
    "PostedDate": "2009-04-02T12:36:57.83-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "174961",
    "ThreadId": "51913",
    "Html": "The reason those aren't editable is because they aren't text. There's specific data about item source, such as whether it's a drop, purchased, what zone it's in, who it drops from, etc. We just display that as formatted text, but it'd really be a whole bunch of fields, if it were editable.",
    "PostedDate": "2009-04-02T12:41:34.75-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "175071",
    "ThreadId": "51913",
    "Html": "Ty to all of you for the back and forth on this one.  <br>\r\n<br>\r\nAdding more columns to the Upgrade list would certainly make life easier, as long as 'Slot&quot; and &quot;Location&quot; are two of the new columns :)  Then I could bring into excel and narrow down what I want.  I've got the list down to 200+ with the filters (nice work on that by the way... I had to change &quot;Heroic Obsidian Sanctum&quot; to &quot;Heroic The Obsidian Sanctum&quot;, but no big deal ).  If you could have a &quot;Equipped&quot; column to show what I currently have on, that would be awesome as well.<br>\r\n<br>\r\nI'm concerned with one thing <a href=\"http://www.codeplex.com/site/users/view/Astrylian\" id=\"ctl00_ctl00_MasterContent_Content_PostRepeater_ctl28_UserNameLink\"><span style=\"color:#3e62a6\">Astrylian</span></a> said about using the wrong data.  In the Comparisons window using the Mage model, sorted by DPS, the numbers show the DPS contribution of each item, correct?  If that's how I'm building my wish-list, by selecting items which increase my DPS, I'm wondering how could I go wrong with that?<br>\r\n <br>\r\n",
    "PostedDate": "2009-04-02T17:44:24.48-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "175074",
    "ThreadId": "51913",
    "Html": "When building a wish list, you don't care about the DPS contribution of the wished item, you care about the DPS <em>upgrade</em> provided by the new item.<div><br></div><div>Suppose you've got a chest that gives 1000 dps, and there's a new chest that gives 1200 dps. You've got gloves that give 200dps, and there's a new pair of gloves that give 800 dps. The new gloves are actually 3 times more valuable to you than the new chest (+600dps gloves vs +200dps chest), but you can't tell that by looking at their absolute dps contribution. The Upgrade List shows items in terms of their upgrade value. You could manually calculate that, but the Upgrade List will do it for you, automatically, <em>and include the additional upgrade provided by swapping other items/gems/enchants</em>, which would be hard for you to manually calculate. </div><div><br></div><div>EDIT: I'm posting b6 momentarily, please give it a try, I think you'll like it. :)</div>",
    "PostedDate": "2009-04-02T17:56:34.017-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "175192",
    "ThreadId": "51913",
    "Html": "It seems to me the OP is using the &quot;available&quot; marks as a &quot;custom filter&quot;, changing its meaning to &quot;personal selection of accessible items&quot;.<div><br></div><div>So maybe one way to solve this is let us build a custom filter which would simply be a list of items to consider. The HI to build that list is unclear. Adding *another* check box to the item list might be one way to do it.</div><div><br></div><div>I personally check items I don't have available for a character I named &quot;best is slot&quot;. Then I run the optimizer. The goal is to know the best possible set of gear. Indeed, due to cap effects, some items in that set would be a downgrade with my current gear, but I would still want to spend DKP (EPGP in our case) on such items as an &quot;investment for future use&quot;.</div><div><br></div><div>AFAIK, the build upgrades list feature doesn't let me do that (and I don't use it very often, as it's very slow).</div><div><br></div>",
    "PostedDate": "2009-04-03T02:40:36.227-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "175227",
    "ThreadId": "51913",
    "Html": "<blockquote dir=ltr style=\"margin-right:0px\">\r\n<div>EvanM, what are you talking about? o.O   Rawr has filters, and items that are filtered out are not checked when doing a Build Upgrade List. You can write ilvl specific filters, and dungeon-specific filters.<br>\r\n</div>\r\n<div><br>\r\nWhen someone wants to know &quot;What is the best set of gear I can get at my progress level and where do I go to get it?&quot; they should filter to their progress level, and use Build Upgrade List. If they're not, we need to better hint to the user that that's the correct way to get the data they want.<br>\r\n<br>\r\n<br>\r\n</div>\r\n</blockquote>\r\n<div dir=ltr>Well, I think there is a difference between possible and easy/practical/obvious which is more the issue here than anything else. <br>\r\n<br>\r\nThe last post by jdmuys reflects what I'm trying to say, being how people expect to be able to use the system vs. how it's currently tuned to work. Most people would like the ability to generate a BiS set rather than a list of specific items. The upgrade list is useful in some situations, and less useful in others--especially in the case of complex criteria. <br>\r\n<br>\r\nThis is probably more the case with tanks when you would like to build a set with uncrittability, a certain minimum HP threshold, a certain TPS threshold, a certain expertise/hit threshold, and then optimize for mitigation or something along those lines. The Upgrade List doesn't help with this, which is why most people use the optimizer in how jdmuys described.<br>\r\n<br>\r\nThe average user is also not going to go to the trouble of setting up custom filters, applying it to the normal comparisons list, then assuming that will also apply to running Build Upgrade List. It's a bit awkward and unintuitive of a process at present. It would probably be better if there was a way to easily specify what to include in an Upgrade List upon running it rather than it using whatever filters you have turned on in the Comparisons list.<br>\r\n<br>\r\nBut I think the main conflict, as mentioned above, is that the Optimizer fulfills a very useful purpose in terms of optimizing potential gear sets, but you cannot do that without flagging items as them being available. Thus, many users just flag items as being available manually in order to use the Optimizer in that fashion. Also, the instructions in the Optimizer window itself leads the user to do this, with the comment &quot;Before using the optimizer, you need to mark which items you have available.&quot;</div>\r\n",
    "PostedDate": "2009-04-03T04:05:39.757-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "175244",
    "ThreadId": "51913",
    "Html": "The b6 beta is very nice with all the available columns to export, so to get the wish list that I use, I setup a number of custom filters, then build the upgrade list with minimum thouroughness.  If the upgrade list would include the current equipped items, then I could export to csv, open in Excel and then sort and narrow the list down further.  The way to do it now is to export the &quot;Current Gear/Enchant/Buffs&quot; chart in comparisons, then paste that in with the upgrade list output.  Only thing wrong with that is the numbers aren't the same to sort properly... output below.  If the numbers were comparable, there's the perfect wish list!<br>\r\n<br>\r\n \r\n<table cellspacing=0 rules=none border=0>\r\n    <colgroup><col width=271><col width=75><col width=73><col width=476><col width=60></colgroup>\r\n    <tbody>\r\n        <tr>\r\n            <td style=\"width:271px;height:17px\" align=left>Ward of the Violet Citadel</td>\r\n            <td style=\"width:75px\" align=right>FALSE</td>\r\n            <td style=\"width:73px\" align=left>OffHand</td>\r\n            <td style=\"width:476px\" align=left>Purchasable with 25 [Emblem of Heroism]</td>\r\n            <td style=\"width:60px\" align=right>232.74</td>\r\n        </tr>\r\n        <tr>\r\n            <td style=\"height:17px\" align=left>Handbook of Obscure Remedies</td>\r\n            <td align=right>FALSE</td>\r\n            <td align=left>OffHand</td>\r\n            <td align=left>Purchasable with 25 [Emblem of Heroism]</td>\r\n            <td align=right>226.15</td>\r\n        </tr>\r\n        <tr>\r\n            <td style=\"height:17px\" align=left>Urn of Lost Memories</td>\r\n            <td align=right>FALSE</td>\r\n            <td align=left>OffHand</td>\r\n            <td align=left>Found in Four Horsemen Chest in Naxxramas</td>\r\n            <td align=right>194.24</td>\r\n        </tr>\r\n        <tr>\r\n            <td style=\"height:17px\" align=left>Rolfsen's Ripper</td>\r\n            <td align=right>FALSE</td>\r\n            <td align=left>OffHand</td>\r\n            <td align=left>Purchasable with 50 [Emblem of Heroism]</td>\r\n            <td align=right>189.16</td>\r\n        </tr>\r\n        <tr>\r\n            <td style=\"height:17px\" align=left>Grasscutter</td>\r\n            <td align=right>FALSE</td>\r\n            <td align=left>OffHand</td>\r\n            <td align=left>Purchasable with 50 [Emblem of Heroism]</td>\r\n            <td align=right>176.7</td>\r\n        </tr>\r\n        <tr>\r\n            <td style=\"height:17px\" align=left>Watchful Eye</td>\r\n            <td align=right>FALSE</td>\r\n            <td align=left>OffHand</td>\r\n            <td align=left>Drops from Grand Widow Faerlina in Naxxramas</td>\r\n            <td align=right>65.94</td>\r\n        </tr>\r\n        <tr>\r\n            <td style=\"height:17px;background-color:#00ffff\" align=left>Handbook of Obscure Remedies</td>\r\n            <td style=\"background-color:#00ffff\" align=right>TRUE</td>\r\n            <td style=\"background-color:#00ffff\" align=left>OffHand</td>\r\n            <td style=\"background-color:#00ffff\" align=left>Purchasable with 25 [Emblem of Heroism]</td>\r\n            <td style=\"background-color:#00ffff\" align=right>56.63</td>\r\n        </tr>\r\n        <tr>\r\n            <td style=\"height:17px\" align=left>Scepter of Murmuring Spirits</td>\r\n            <td align=right>FALSE</td>\r\n            <td align=left>OffHand</td>\r\n            <td align=left>Drops from Instructor Razuvious in Naxxramas</td>\r\n            <td align=right>50.26</td>\r\n        </tr>\r\n        <tr>\r\n            <td style=\"height:17px\" align=left>Iron-bound Tome</td>\r\n            <td align=right>FALSE</td>\r\n            <td align=left>OffHand</td>\r\n            <td align=left>Created via Iron-bound Tome</td>\r\n            <td align=right>47.9</td>\r\n        </tr>\r\n        <tr>\r\n            <td style=\"height:17px\" align=left>Wand of the Archlich</td>\r\n            <td align=right>FALSE</td>\r\n            <td align=left>Ranged</td>\r\n            <td align=left>Drops from Kel'Thuzad in Naxxramas</td>\r\n            <td align=right>132.79</td>\r\n        </tr>\r\n        <tr>\r\n            <td style=\"height:17px\" align=left>Contortion</td>\r\n            <td align=right>FALSE</td>\r\n            <td align=left>Ranged</td>\r\n            <td align=left>World Drop</td>\r\n            <td align=right>79.72</td>\r\n        </tr>\r\n        <tr>\r\n            <td style=\"height:17px\" align=left>Rod of the Fallen Monarch</td>\r\n            <td align=right>FALSE</td>\r\n            <td align=left>Ranged</td>\r\n            <td align=left>Drops from Anub'arak in Heroic Azjol-Nerub</td>\r\n            <td align=right>33.5</td>\r\n        </tr>\r\n        <tr>\r\n            <td style=\"height:17px;background-color:#00ffff\" align=left>Wand of the San'layn</td>\r\n            <td style=\"background-color:#00ffff\" align=right>TRUE</td>\r\n            <td style=\"background-color:#00ffff\" align=left>Ranged</td>\r\n            <td style=\"background-color:#00ffff\" align=left>Drops from Prince Keleseth in Heroic Utgarde Keep</td>\r\n            <td style=\"background-color:#00ffff\" align=right>29.11</td>\r\n        </tr>\r\n        <tr>\r\n            <td style=\"height:17px\" align=left>Wand of Ahn'kahet</td>\r\n            <td align=right>FALSE</td>\r\n            <td align=left>Ranged</td>\r\n            <td align=left>Drops from Herald Volazj in Heroic Ahn'kahet: The Old Kingdom</td>\r\n            <td align=right>26.38</td>\r\n        </tr>\r\n        <tr>\r\n            <td style=\"height:17px\" align=left>Valorous Frostfire Shoulderpads</td>\r\n            <td align=right>FALSE</td>\r\n            <td align=left>Shoulders</td>\r\n            <td align=left>Purchasable with 1 [Mantle of the Lost Vanquisher]</td>\r\n            <td align=right>221.28</td>\r\n        </tr>\r\n        <tr>\r\n            <td style=\"height:17px\" align=left>Mantle of the Corrupted</td>\r\n            <td align=right>FALSE</td>\r\n            <td align=left>Shoulders</td>\r\n            <td align=left>Found in Four Horsemen Chest in Naxxramas</td>\r\n            <td align=right>152.5</td>\r\n        </tr>\r\n        <tr>\r\n            <td style=\"height:17px\" align=left>Heroes' Frostfire Shoulderpads</td>\r\n            <td align=right>FALSE</td>\r\n            <td align=left>Shoulders</td>\r\n            <td align=left>Purchasable with 1 [Spaulders of the Lost Vanquisher]</td>\r\n            <td align=right>140.13</td>\r\n        </tr>\r\n        <tr>\r\n            <td style=\"height:17px;background-color:#00ffff\" align=left>Dark Runic Mantle</td>\r\n            <td style=\"background-color:#00ffff\" align=right>TRUE</td>\r\n            <td style=\"background-color:#00ffff\" align=left>Shoulders</td>\r\n            <td style=\"background-color:#00ffff\" align=left>World Drop</td>\r\n            <td style=\"background-color:#00ffff\" align=right>96.82</td>\r\n        </tr>\r\n        <tr>\r\n            <td style=\"height:17px\" align=left>Miasma Mantle</td>\r\n            <td align=right>FALSE</td>\r\n            <td align=left>Shoulders</td>\r\n            <td align=left>Drops from Grobbulus in Naxxramas</td>\r\n            <td align=right>72.99</td>\r\n        </tr>\r\n        <tr>\r\n            <td style=\"height:17px\" align=left>Mantle of the Extensive Mind</td>\r\n            <td align=right>FALSE</td>\r\n            <td align=left>Shoulders</td>\r\n            <td align=left>Drops from Instructor Razuvious in Naxxramas</td>\r\n            <td align=right>48.29</td>\r\n        </tr>\r\n        <tr>\r\n            <td style=\"height:17px\" align=left>Hateful Gladiator's Silk Amice</td>\r\n            <td align=right>FALSE</td>\r\n            <td align=left>Shoulders</td>\r\n            <td align=left>Purchasable for 9600 Honor Points</td>\r\n            <td align=right>45.77</td>\r\n        </tr>\r\n    </tbody>\r\n</table>\r\n",
    "PostedDate": "2009-04-03T05:28:17.197-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "175308",
    "ThreadId": "51913",
    "Html": "That's kinda the point though; if they're equipped, you have them, they have no upgrade value (apart from potentially better optimizing their gems/enchants). So you can just put 0s in for the equipped ones, for now.",
    "PostedDate": "2009-04-03T08:20:14.753-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "175315",
    "ThreadId": "51913",
    "Html": "OK I get that part, but please describe one example from the chart above to help me understand what it's telling me.  On the comparison chart I see items listed by DPS... &quot;Ward of the Violet Citadel&quot; is lower than &quot;Handbook of Obscure Remedies&quot;, but here they are reversed.  <br>\r\n<br>\r\nIs the Upgrade list looking at each slot individually or as some kind of set?<br>\r\n<br>\r\nIs the score in the Upgrade list overall or DPS only?<br>\r\n<br>\r\nWhy exactly is &quot;Handbook of Obscure Remedies&quot; listed twice above?<br>\r\n <br>\r\nI'm thinking the numbers are the overall scores.. how can I just maximize DPS without regard to overall?<br>\r\n<br>\r\nTY!!\r\n",
    "PostedDate": "2009-04-03T08:36:18.48-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "175324",
    "ThreadId": "51913",
    "Html": "In the Optimizer Dialog, there's a dropdown to choose what you want to optimize. It defaults to Overall Rating. You probably want to change that to DPS. The numbers in the upgrade list are whatever you choose to Optimize.<div><br></div><div>Handbook of Obscure Remedies is there twice because it's both an upgrade for you (probably because it would let you regem for more hit or something? Would need to look at your specific character file to be sure), and you have it equipped.</div><div><br></div><div>Basically, the upgrade value shown in Build Upgrade List says that you <em>could </em>increase your DPS by that much, if you had that item available to you. For example, if you're hit capped, but using a bunch of hit gems to get hit capped, an item with a bunch of hit on it may appear only slightly higher than your current item. On the Upgrade List, it would appear significantly higher, since you could equip it, then regem for just spellpower everywhere, and get a huge DPS upgrade out of it.</div>",
    "PostedDate": "2009-04-03T08:56:25.75-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "175367",
    "ThreadId": "51913",
    "Html": "That's the advantage then of using the upgrade list in the optimizer as opposed to looking at the numbers in the comparisons chart.  The comparisons chart will show you the numbers for an individual item, while the upgrade list will show you that item's contribution assuming you have the optimum combination of items.  If that's correct, it took me a long time to understand that! :)  Maybe something to think about for a tooltip to drive home to users.\r\n",
    "PostedDate": "2009-04-03T10:32:45.017-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "175394",
    "ThreadId": "51913",
    "Html": "That's exactly correct. I'll see about how we can better explain that advantage.",
    "PostedDate": "2009-04-03T11:24:09.493-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "175399",
    "ThreadId": "51913",
    "Html": "This was very informative -- the upgrade list was a mystery to me as well until I read this.  Now I see I've been going about my upgrade strategy all wrong.  What I have been doing is optimizing my current gear, writing down each slot's values, then going to each slot and calc'ing a diff between the current item and any item above it (yes, I'm that anal).  Then, when an item drops in a raid, I can decide if it's worth paying RP for based on the amount of upgrade.<div><br></div><div>But as you said, sometimes, an item that might seem very valuable stats-wise, may be less valuable due to the fact that it lowers a value below my desired threshold (say, crit, for example) and forces me to swap in a sub-optimal item in another slot to meet that constraint.  But it sounds like if I use the upgrade list instead, that's taken care of for me, correct?</div>",
    "PostedDate": "2009-04-03T11:34:16.607-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "175433",
    "ThreadId": "51913",
    "Html": "Join the anal crowd then... &lt;lol&gt; I've been doing the same thing :)  The question is now, how do you stair-step your way to the optimum set without constraint setbacks?<br>\r\n<br>\r\nI'm thinking of doing this... <br>\r\n<br>\r\n1 - setup filters to only see items in the comparison chart that may be available soon, based on raid/instance progression, item levels, your own preferences of where you fight, etc.<br>\r\n<br>\r\n2 - in the comparison chart, sort by preferred stat (for me it's DPS as a mage) and left-click all items above your equipped items in every slot.<br>\r\n<br>\r\n3 - run the optimizer/upgrade list and take note of the highest item for each slot<br>\r\n<br>\r\n4 - go back and uncheck all items in the comparisons list and start fresh<br>\r\n<br>\r\n5 - now pick one item from step 3, left-click it, then run the optimizer/upgrade list on just that item, and take note of the score.  Do this for each of the step 3 items.<br>\r\n<br>\r\n6 - you should have some that don't show up in the optimizer/upgrade list... you can still aquire them for later, but don't equip yet.<br>\r\n<br>\r\n7 - some will be in the optimizer/upgrade list because they will increase your stats now, so once you aquire one of these positive stat items, equip it and go back to step 2.<br>\r\n<br>\r\nOK, so who's gonna automate step 2 through 7 with a button?  lol :)<br>\r\n<br>\r\nI'd like to ask a developer, in the above scenario, would I run the optimizer or the upgrade list in steps 3 and 5?<br>\r\n<br>\r\nTY!!<br>\r\n<br>\r\n",
    "PostedDate": "2009-04-03T12:58:28.407-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "175457",
    "ThreadId": "51913",
    "Html": "The problem for me is that I'm a healer (disc priest), so there's no real easy stat to optimize.  I have to optimize mana regen until I have enough to not go OOM, and then I optimize SPP for throughput.  However, the addition of haste items really makes this tricky since adding more haste increases your throughput but decreases your effective regen (since now I need to regen more mana).  Add in crits and magic returns such as rapture and it get messy fast.<div><br></div><div>What I do now is set a few stat targets (I'm currently shooting for unbuffed values of 30% holy crit and 6% haste).  Then I optimize for (burst+substained healing).  Even that doesn't get me really where I want because regen is like +hit for DPS -- once you get enough, more is useless.  So, I'm still tweaking...</div>",
    "PostedDate": "2009-04-03T13:38:49.98-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "175462",
    "ThreadId": "51913",
    "Html": "I'd suggest to read through <a href=\"http://rawr.codeplex.com/Wiki/View.aspx?title=GearOptimization\">http://rawr.codeplex.com/Wiki/View.aspx?title=GearOptimization</a> if you haven't yet. It should answer most gear optimization questions.<br>\r\n<br>\r\nFor your last question I would suggest the following. It seems like the intended use is that you know what gear you have now and now you'd like to know how much of an upgrade a certain item is. Here's what I would suggest:<br>\r\n<br>\r\n1 - as you said setup filters to only see items that are accessible to you/you are interested in<br>\r\n<br>\r\n2 - left-click only your equipped items and any other gear that you have in bags/bank<br>\r\n<br>\r\n3 - run optimizer to see what is the best possible with your current gear (highest thoroughness)<br>\r\n<br>\r\n4 - run build upgrade list with minimum thoroughness, main reason to do minimum thoroughness is because it takes a long time otherwise, if you're willing to wait increase it a bit<br>\r\n<br>\r\n5 - now you have a nice upgrade list, you should probably save it<br>\r\n<br>\r\n6 - if you would like to get even more accurate upgrade value go back to optimizer and change thoroughness to highest and then close the optimizer (click cancel)<br>\r\n<br>\r\n7 - for any item that you would like to check, right click and select evaluate upgrade, it'll give you upgrade score for just that item (you can do this step even if you skip 4-5)\r\n",
    "PostedDate": "2009-04-03T13:47:53.33-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "175510",
    "ThreadId": "51913",
    "Html": "dfscott, thats one of the bigger problems for a Healing model. Its always a good thing to overshoot mana as a healer, as long as you need to use your cooldowns (Mana Potion/Shadowfiend). If you dont ask the right question, you wont get the right answer. Finding the right question is that much harder for a healer. For a DPS its just DPS most of the time. For a tank its effective health and avoidance.\r\n",
    "PostedDate": "2009-04-03T15:30:39.217-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]