[
  {
    "Id": "174702",
    "ThreadId": "52056",
    "Html": "Using Rawr to choose gear for my druid tree, I'm having a hard time choosing between weapons.<br>\r\n<br>\r\nThe best items seems to be mostly 2-handers, however that isn't really the case. When combining 1H weapons with a suitable off hand item, then the 2-hander is mostly inferior. <br>\r\n<br>\r\nRight now, I check the Rawr value of my off hand item, and manually add that to the 1-hand weapons. Then I get a good score for them, and I can compare them to the 2-handers.<br>\r\n<br>\r\nAny good suggestion how this should be handled?<br>\r\n",
    "PostedDate": "2009-04-02T01:15:01.99-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "174732",
    "ThreadId": "52056",
    "Html": "Rawr already handles this. Equip an offhand, and the Main Hand chart/picker will compare 2Hs vs 1Hs+OH.<div><br></div><div>EDIT: Note that it's totally fine to equip an offhand along with a 2H. The offhand will not be counted, despite being equipped, and it will appear faded to indicate that. It will be reenabled when paired with a 1H.</div>",
    "PostedDate": "2009-04-02T02:47:37.94-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "174753",
    "ThreadId": "52056",
    "Html": "Oh, that's excellent! Thanks!<br>\r\n<br>\r\nHow was I supposed to know? Perhaps I should have guessed that since the 1H and 2H were so similarly scored...<br>\r\n",
    "PostedDate": "2009-04-02T03:57:18.67-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "174754",
    "ThreadId": "52056",
    "Html": "The dimming and undimming of the OH is supposed to be the clue. If you have a better suggestion for indicating how this works, let us know.",
    "PostedDate": "2009-04-02T04:00:29.493-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "174756",
    "ThreadId": "52056",
    "Html": "2 ways to handle it:<br>\r\n1) At the top of the main hand chart, there's a text &quot;Available to the optimizer&quot;. After that you could add the text &quot;1H weapons include the stats from &lt;off hand item&gt;&quot;<br>\r\n<br>\r\nor<br>\r\n<br>\r\n2) When using mouse over on an item we get a tooltip with the name, stats, etc. Would it be possible to have, when having mouse over a 1-hand weapon, to have a tooltip that consists of 2 boxes, first the 1-hand weapon, and below that, the currently equipped off hand item. That would clearly indicate that 1-hand weapons are counted as more than one item.<br>\r\n",
    "PostedDate": "2009-04-02T04:08:01.647-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "175061",
    "ThreadId": "52056",
    "Html": "Also, if you don't have an off-hand item equipped, I'd recommend putting something like an exclamation point next to the icons of 1H weapons, which, when you mouse over, explains that the score of your 1H is low because there is no OH equipped.<br>\r\n<br>\r\nSpeaking of the optimizer, when you select the optimizer but don't select gems or enchants it would warn you that none are selected.  I suppose it could see if any 1H weapons are selected, and if so, make sure that an OH has also been selected.  If not, it could emit a warning.<br>\r\n<br>\r\nChar<br>\r\n",
    "PostedDate": "2009-04-02T16:50:44.583-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "175063",
    "ThreadId": "52056",
    "Html": "Good ideas, guys. We'll see what we can do to make this more clear to the user.",
    "PostedDate": "2009-04-02T17:05:01.317-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]