[
  {
    "Id": "174975",
    "ThreadId": "52113",
    "Html": "I think my discussion about ItemCache and ItemSource started to diverge from the other conversation.  But I do have questions about these files.  I understand that running the Update from Armory / Wowhead doesn't add items to the database so when do we overwrite ItemCache with let's say the ones in source code (DefaultDataFiles)?  What does that change?  Also, since ItemSource is a separate XML, does running the Updates update that data as well?  So in my case, that might fix the Unknowns sitting out there? \r\n",
    "PostedDate": "2009-04-02T13:12:09.1-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "174981",
    "ThreadId": "52113",
    "Html": "Updating data from Wowhead or Armory simply updates all of the data for all items already in the ItemCache. That does include updating ItemSource. If you overwrite the ItemCache or ItemSource files with the ones from the DefaultDataFiles, that's effectively resetting them to default data. Does that answer your question?<div><br></div><div>Note that you'll almost never be able to get rid of all of the Unknowns; Wowhead/Armory simply don't have source data for many items. If you find items that Wowhead/Armory DOES have source data for, but Rawr doesn't load, let me know.</div>",
    "PostedDate": "2009-04-02T13:22:17.63-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "174996",
    "ThreadId": "52113",
    "Html": "Thanks for the response.  I guess the reason for the questions is that I keep Rawr open in the background while playing WoW and check gear on my &quot;wishlist&quot; from Rawr but a lot of times the mouseover provides Unknown for the source of that item.  I'm just trying to keep the confusion down to a minimum while trying to figure out upgrades on raid drops.<br>\r\n<br>\r\nbtw, love the program.  A friend of mine at work turned me onto it.  I grab the latest source each day and recompile it and run it from a flash drive.  It is so much more straightforward that MaxDPS.com which a guildmate recommended to me.  The numbers are broken down, the gems templates and re-equipping comes in very handy especially when evaluating my DPS output with gear upgrades.<br>\r\n<br>\r\nThank you.\r\n",
    "PostedDate": "2009-04-02T13:52:41.383-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]