[
  {
    "Id": "175334",
    "ThreadId": "52203",
    "Html": "After reading some of the things I didn't know in &quot;Did you know?&quot; and also the wish list thread, I started playing a little more with optimize and the newer features.  But when I went to pick a Crit Rating in Additional Requirements, I found it wasn't there.  An accident?  Or is it missing on purpose?  I realize it isn't on the main Optimize dropdown but I wouldn't mind being able to optimize my DPS Rating with a certain level of hit, haste and crit.\r\n",
    "PostedDate": "2009-04-03T09:22:38.627-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "175345",
    "ThreadId": "52203",
    "Html": "Those sort of things are called Optimizable Stats, and it's up to the model to provide them to the Optimizer. Some models provide lots of optimizable stats, some don't. Let us know which model you're using, and what stats you'd like to see. It's not too difficult to add them, we just need to know which all stats you'd like to optimize/require for each model.<div><br></div><div>Keep in mind that these optimizable stats would be in terms of the stats that actually make a difference; ie, it'd be Crit %, not Crit Rating.</div>",
    "PostedDate": "2009-04-03T09:56:43.933-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "175368",
    "ThreadId": "52203",
    "Html": "Well, I'm using the Mage model.  I was looking at the two numbers displayed, Crit Rate (%) and the Crit Rating (numerical value).  Either way would be great to include.  The model provides the availability of Hit Rating and Haste Rating so I simply was looking at including Crit Rating because each of these would be the numeric value rather than the percentage that number evaluates into.  (If it was the Crit Rate or % then it might be a little confusing since the other numbers are the &quot;Rating&quot;.)\r\n",
    "PostedDate": "2009-04-03T10:37:50.743-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "175397",
    "ThreadId": "52203",
    "Html": "Well, I suppose it should be both, if not just the %s. Consider how if you're 1 crit rating under that crit rating requirement, it'd prioritize an item with 1 crit rating, over an item with 20 spirit, which would provide more crit %.<div><br></div><div>Kavan, thoughts?</div>",
    "PostedDate": "2009-04-03T11:32:29.573-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "175467",
    "ThreadId": "52203",
    "Html": "My thoughts are that I don't want to encourage optimization requirements that are misguided. If you have a reasonable use for a certain stat to be used as a constraint I'll consider adding it. Then again it doesn't hurt me to add them other than it clutters the list, so I might also be persuaded by popular demand. :)\r\n",
    "PostedDate": "2009-04-03T13:59:07.927-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]