[
  {
    "Id": "175865",
    "ThreadId": "52342",
    "Html": "<div><div>For the purposes of shortening the menu used to look and compare upgrades<br></div><div>the change in the menu system is a very good one. However, flipping through</div><div> my item slots to see what's still an upgrade for my dps and where it drops has</div><div> become more difficult in this latest (beta) version. In order to look at the gear-list </div><div>for each slot I have to:</div></div><div><br></div><div>*click menu&quot;</div><div>*drag to sub-menu*</div><div>*click on sub-menu to flip between slots*</div><div><br></div><div>Would it be possible to change it so that when you click on an item-slot on the left side,</div><div>the list of gear for the relevant slot pops up on the right side? This could easily extend to </div><div>enchantments as well. The current functionality (the pop-up menu that lets you equip gear)</div><div>can be retained  by clicking and holding the mouse button and by having the mouse_up event </div><div> to select an item to swap out. Alternatively you could have the menu on the right adopt that</div><div> bit of  functionality (not a bad idea imo as it's got more room, and would make for a cleaner interface)</div><div><br></div>",
    "PostedDate": "2009-04-05T12:03:23.997-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "175887",
    "ThreadId": "52342",
    "Html": "What if it worked like the menus in Wowhead?<div><br></div><div>Currently: [Gear &gt; Head]</div><div>                 (current menu system)</div><div><br></div><div>What if: [Gear] &gt; [Head]</div><div>          (current)     (just gear slots)</div><div><br></div><div>And of course if you selected the Gems &gt; Normal chart, the 2nd menu would just contain Normal and Meta. Or the 2nd menu would disappear if you selected Talent Specs.</div>",
    "PostedDate": "2009-04-05T12:53:39.917-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "175896",
    "ThreadId": "52342",
    "Html": "I'm not quite sure if I'm interpreting  your response correctly.<div><br></div><div>So the inital menu selection would go as it is now. <div>However once you were flipping through the equipment lists, you would </div><div>be able to select the slot from a sub-menu any bypass the initial one?</div><div><br></div><div>(*nods* kinda like it is in wowhead where you can activate a menu from</div><div>the current item slot, and from there pick from other lists at the same level of granularity?)</div><div><br></div><div>This wasn't quite what I was originally suggesting, but it would serve to make navigation</div><div>much easier when dealing with related menus. (It could be also readily extended for enchantments)</div><div><br></div><div><br></div><div><br></div><div> </div></div>",
    "PostedDate": "2009-04-05T13:46:47.217-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "175930",
    "ThreadId": "52342",
    "Html": "Yeah, you'd still be able to do everything through the first menu, exactly as you can now. The 2nd menu would just be a sort of shortcut to whatever submenu you're currently in.",
    "PostedDate": "2009-04-05T17:28:35.8-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "175942",
    "ThreadId": "52342",
    "Html": "That sounds excellent!  I like where the new menu is heading, and this setup you are describing sounds like yet another step forward.\r\n",
    "PostedDate": "2009-04-05T18:43:38.347-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "176023",
    "ThreadId": "52342",
    "Html": "I second the request, and possibly the suggestion, if I understood it correctly.<div><br></div><div>In more general terms, it's a good thing to limit the use of hierarchical menus to the extent it's possible.</div><div><br></div><div>This is all the more so that hierarchical menus are *much more* cumbersome to use on Windows than on my Mac. On Windows the mouse path needs to be:</div><div><br></div><div>1) click and move the mouse vertically to the hierarchical menu item. The hierarchical menu pops up.</div><div>2) move the mouse horizontally to the right to the hierarchical menu that just popped up.</div><div>3) move the mouse vertically to the item you want to choose.</div><div><br></div><div><strong>If at any time during step 2 &amp; 3, you move the mouse outside the menu, it pops off, and you need to start over at step one.</strong></div><div><strong><br></strong></div><div><strong>In particular, this disallows the following path commonly used on the Mac:</strong></div><div><strong><br></strong></div><div><strong><span style=\"font-weight:normal\"><div>1) click and move the mouse vertically to the hierarchical menu item. The hierarchical menu pops up.</div><div>2) move the mouse <em>diagonally, directly to the item you want to choose</em>.</div><div><br></div><div>That much more efficient move doesn't work on Windows because the diagonal path makes you leave the menu, which pops off.</div><div><br></div><div>The windows way requires a much more precise hand coordination, and a longer, less efficient path. Moreover, it drives us Mac users crazy, because the more efficient Mac way is carved in our muscle memory.</div></span></strong></div>",
    "PostedDate": "2009-04-06T01:15:23-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]