[
  {
    "Id": "175956",
    "ThreadId": "52369",
    "Html": "I noticed Build Upgrade List will suggest an item at the top that does not match the top item in Optimize.  <br>\r\n<br>\r\nIs that because Build Upgrade List reports overall score and Optimize breaks it down to Overall, DPS, etc.?  <br>\r\n<br>\r\nIs it because the model results stay in memory and multiple runs will potentially be different?<br>\r\n<br>\r\nIs it because they have two different code bases?<br>\r\n<br>\r\nIf they are indeed the same code base, why keep them separate? (you could ask at the end of the run if you want to equip the top items).<br>\r\n<br>\r\nTY!<br>\r\nBrian\r\n",
    "PostedDate": "2009-04-05T20:41:27.837-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "175968",
    "ThreadId": "52369",
    "Html": "I don't understand what you're asking. Upgrade Lists and Optimizations are different things. Build Upgrade List uses the Optimizer (many many many times), and they do share common code. (Build Upgrade List is the same as Optimize, just run once for each potential upgrade)<div><br></div><div>Optimization is never guaranteed, results do vary sometimes, from one Optimization to the next. That's what the thoroughness slider is for. The higher the thoroughness, the harder it will look for better solutions. It's very likely to find the best solution, even at low thoroughness, and extremely likely at high thoroughness, but it's never guaranteed. </div><div><br></div><div>Regardless of all that, there's no 'top' item in Optimization, so I don't know what you're comparing to.</div>",
    "PostedDate": "2009-04-05T21:24:13.36-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "176072",
    "ThreadId": "52369",
    "Html": "<br>\r\n - there's no 'top' item in Optimization, so I don't know what you're comparing to.<br>\r\n<br>\r\nAt the end Optimize asks ...&quot;Would you like to equip the optimized gear?&quot;.  You answer yes and you get the &quot;top&quot;, or &quot;best&quot; item equipped in each slot.<br>\r\nWhen you build an Upgrade List, you get multiple items for each slot sorted by Overall score.... the highest score for each slot is the &quot;top&quot;, or &quot;best&quot; item in each slot.<br>\r\n<br>\r\nThose &quot;top&quot; items don't always match... should they?<br>\r\n<br>\r\nBuild Upgrade List reports overall score... why doesn't it also report DPS, threat, mitigation, etc.?<br>\r\n<br>\r\nI always run at the highest thoroughness, with about 5 to 10 items for each slot checked.<br>\r\n<br>\r\nTY!<br>\r\nBrian \r\n",
    "PostedDate": "2009-04-06T04:55:44.897-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "176159",
    "ThreadId": "52369",
    "Html": "No of course they won't.<br>\r\n<br>\r\nThe top individual item in each slot doesn't necessarily mean that if you take the top item in each slot you have the best gear. There would be zero need for the optimiser if that was the case. For instance. Lets say you are 20 points shy of the hit cap for your class. The top item in each slot might have extra 20 hit rating, however if you equipped them all you could be massively over the hit cap. So simply equipping the best item per slot won't give you the best gear.<br>\r\n<br>\r\nThis is the fundamental flaw of EP values. Getting a fixed EP value for each item is great and shows you how good items are relative to each other but it CANNOT show you how good the overall combination is. Rawr on the other hand CAN work out if you swap around lots of different pieces which combination of gear gives best results. This is why the best way of working with Rawr, is maintaining a set of gear then clicking to add a new item to the mix and have Rawr play around with the combinations to work out what works best trying to max out all the caps.<br>\r\n",
    "PostedDate": "2009-04-06T08:23:41.617-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "176349",
    "ThreadId": "52369",
    "Html": "Ok, so you're saying the build upgrade list does NOT use hit caps, etc., so it's only upgrading pieces individually with no consideration of other gear?  So Upgrade List is just a guide then, and the Optimizer does all the good stuff and shows you the ultimate combination of gear using items marked available.<br>\r\n<br>\r\nMy goodness... I can almost join Mensa, and I develop and sell software on the side, my day job is a Data Analyst, and for the life of me I can't understand the pieces of this product and how they fit together, and if I do finally understand it it's after days or weeks of back and forth and pouring over all these messages and responses.  <br>\r\n<br>\r\nIt means I'm either over-the-hill at 40 something, or you gals/guys have to do some serious work if you want Rawr to be accepted into the mainstream..  You need to simplify the client facing GUI, but leave the good technical stuff just under the hood to satisfy the hard core users.<br>\r\n<br>\r\nI want to know for my level of play and where I like to play, what's the best out there for each slot and where do I go to get it.  Once I obtain each piece I want to know how to enchant and gem it.  I have yet to hear clear acknowledgement that it's acceptable to use Rawr for this purpose (granted a developer has expressed something similar, so it's a step in the right direction:)... I keep getting told it's only useful for gear I already have, oh and don't ever select more that a few items in each slot... for what reason who can guess, but it's getting very vague and unsettling.<br>\r\n<br>\r\nThis Rawr developer community that I've been sending money too lately is doing good work.. good TECHNICAL work.. you need communication help on a major scale.. clear text listing the differences between the major reports... Comparison, Build Upgrade List, Optimizer, etc..  If there's a limit to how many items the Optimizer can handle before giving bad results... suck it up and tell us!<br>\r\n<br>\r\nI set my filter to only show items in places I play... if I'm not supposed to use Optimizer on that list of gear then Rawr is not the tool for me, period.  I'll take 10 minutes or so and left-click each item, because the developers don't want to include a select all button.  Why is that?  Wouldn't it save users like myself time and frustration?  If there's a limit to how many items Rawr can handle then advertise that number and don't let the select all button go beyond that and put a warning up to the user.<br>\r\n<br>\r\nAnyway, I'll relax and keep using the upgrade list to GENERALLY tell me what items to acquire.  When I get one, I'll run Optimizer on full thoroughness with just that item selected along with my equipped items and see if the Optimizer wants to equip it on me.  Out of all the scenarios I've thrown out there, maybe THAT's the way I can be using this program to do what I want?<br>\r\n<br>\r\nSorry for the tone, it's just frustration coming though... like I said I support this product and use it... I just want clarity on what it does.<br>\r\n<br>\r\nBest to you,<br>\r\nBrian \r\n",
    "PostedDate": "2009-04-06T15:20:12.663-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "176358",
    "ThreadId": "52369",
    "Html": "I have asked before, I'll ask again. Have you read <a href=\"http://rawr.codeplex.com/Wiki/View.aspx?title=GearOptimization\">http://rawr.codeplex.com/Wiki/View.aspx?title=GearOptimization</a> ?<br>\r\n<br>\r\nBuild upgrade list uses all the same thing as optimizer, including hit caps etc. Upgrade value of an item as defined for upgrade list is as follows:<br>\r\n<br>\r\nvalue of (best possible gear set constructed from available gear + a new item) - value of (best possible gear set constructed from available gear).<br>\r\n<br>\r\nIt basically means if you add that item to your available gear set how much you can improve your value. This also means that upgrade list will only consider adding one item to your available set at a time. It won't see that if you got 3 new items you might be able to get an improvement even if adding just any one of them would not. If what you want to do is find best in slot items out of all possible gear in game then do as the wiki says. Mark top few items in each slot as available and run optimizer to find best in slot items. Just understand that they are best in slot only when you have all of them, if you're missing one of them there might be other items that give better results.<br>\r\n<br>\r\nThere is no technical limit to selecting all items for optimization other than it would take days to get any result out of it. We don't think users want to wait that long.<br>\r\n<br>\r\n",
    "PostedDate": "2009-04-06T15:54:27.02-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "176363",
    "ThreadId": "52369",
    "Html": "I understand bhersey's frustration as I share it as well.  There's also some overloaded terms, such as &quot;Upgrade list.&quot;  Is this the &quot;Build Upgrade List&quot; button on the Optimize dialog, or the Direct Upgrades list on the menu?  I would guess that you mean the former, but then you talk about how it's the &quot;best possible gear set constructed from available gear + a new item&quot; but that's not what that button does when I run it.  Instead, it shows you what *combinations* of upgrades are an improvement.  So while it might say that swapping out your gloves would upgrade you X points, it means you'd also have to aquire chest A and wrist B (which Imay not have marked for optimization).",
    "PostedDate": "2009-04-06T16:12:26.203-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "176390",
    "ThreadId": "52369",
    "Html": "Yes I've read it many times, and viewed the video a couple times as well.  <br>\r\n<br>\r\nI don't understand why the Optimizer's Build Upgrade List has items that I didn't mark.<br>\r\n<br>\r\nYou said... &quot;If what you want to do is find best in slot items out of all possible gear in game&quot;.  I've never said that... nobody is able to spell out how to get what I want.  <br>\r\n<br>\r\nI realize Optimize finds the best set.. it finds it, then equips it.  Once again, I mark as available all items that I could aquire, given where I'm playing.  No problem with Optimizer.. I select my hundred+ items, select max thoroughness and then equip the results and save the file... that is the ultimate list to put together given where I fight and the filters I put in place. I can hang this on the wall and proudly say... &quot;THIS IS MY ULTIMATE SET! April 2009&quot;.  Where I fight 2 months from now may change, so it's something to shoot for depending where and how I'm playing.<br>\r\n<br>\r\nIf I then run &quot;Build Upgrade List&quot; with the same item selections, it should tell me what items to generally go after that will upgrade my values UNTIL I get the ultimate set spelled out in the previous step.  If I aquire an item in the Build Upgrade List while fighting, I'll equip it and see if it improves my numbers... if not, and it's not an item from my Optimized list from the previous step, I'll get rid of it.  If the item DOES improve my numbers, I'll just equip it and keep going.<br>\r\n <br>\r\nCan ANYONE ANYWHERE tell me if the last two paragraphs describe one valid scenario of using Rawr?  If it is NOT valid, instead of telling me to read something or explaining why I have it wrong, take a different approach please and tell me how Rawr can do what I want.<br>\r\n<br>\r\nTY!<br>\r\nBrian<br>\r\n",
    "PostedDate": "2009-04-06T17:30:34.47-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "176405",
    "ThreadId": "52369",
    "Html": "The problem is that we don't really know what you want.<br>\r\n<br>\r\nFrom what I can gather you want the following. You have your actual items that you have in game in bags and bank. Let's call this availability set A. You can call optimize on it and it will tell you how to gem/enchant it for best performance. Now you set as available top items in each slot. Let's call this availability set B. You can call optimize on it and it will give you best in slot items. Now you add these items on your shopping list. But while you're working towards that best in slot set you still don't want to miss items that are upgrade to you, but are not best in slot. For this you should use your availability set A and run build upgrade list. If an item shows on that list then it is an upgrade for you. To see how to use it you can either select Equip All from the upgrade list (the optimizer upgrade list, not direct upgrades, in general I would not suggest using direct upgrades) or add it to your availability set A and run optimize again.<br>\r\n<br>\r\nDoes this sound remotely what you want? If not please explain in more details what you want to achieve.\r\n",
    "PostedDate": "2009-04-06T17:58:12.483-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "176440",
    "ThreadId": "52369",
    "Html": "Kavan, That's close enuff.. from your response and others I got privately, I can use Rawr to build my wish lists and optimize as I aquire them.  Just one difference from your response above...  I don't have gear items in my bags or bank... my availability set is built with filters based on how and where I'm currently playing.<br>\r\n<br>\r\nTY and keep up the good work!<br>\r\nBrian <br>\r\n<br>\r\n<br>\r\n<br>\r\n",
    "PostedDate": "2009-04-06T21:27:00.437-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "176454",
    "ThreadId": "52369",
    "Html": "I'm <strong>absolutely</strong> sure that we can do a better job explaining what features do, but this <em>really</em> isn't Mensa level stuff.<div><br></div><div><strong>Optimize is for what you DO have.</strong></div><div>Optimize creates the best set of gear from what you already have available.</div><div><br></div><div><strong>Upgrade Lists are for what you DON'T have.</strong></div><div>Build Upgrade List creates a list of items that would be upgrades for you, and how much of an upgrade they would be. If you already have the optimal set from what you currently have available, an Upgrade List will not contain anything you already have.</div><div><br></div><div><br></div><div>I'm sure we could do a better job explaining when to use each feature, and if you have suggestions on how to do so, please do share.</div>",
    "PostedDate": "2009-04-06T22:08:51.69-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "176457",
    "ThreadId": "52369",
    "Html": "Brian does understand (now, at least). I think you're replying to something old or taking the wrong message out of what he had just said..<div><br></div><div><span style=\"color:rgb(48, 51, 45);font-family:'segoe ui';font-size:13px\"> &quot;I can use Rawr to build my wish lists and optimize as I aquire them.&quot; would read more like &quot;I can use Rawr to see my upgrade list, and as I acquire these items, I equip them, and optimize that newly equipped set to see if the upgrade list changes.&quot;</span><br></div><div><br></div><div>In a nutshell: he wanted to make a &quot;dream set&quot; as something to aspire to. He selected the items he has a possibility of getting for his dream set, and optimized that. He now has a Current Gear list of a &quot;character who already has all the gear he might think he want in his bags&quot; on hand for funsies.</div><div><br></div><div>Making dream sets is something a *lot* of people do, whether we like it or not. Hell, I do it with Ulduar gear. &quot;What does a Prot Paladin with full hard mode tier 8 look like?&quot; Is a fun part of this tool. I had to go through and select those ulduar items individually on top of my normal character, but it provided some neat information: how much health I can expect to have, my avoidance, my threat... </div><div><br></div><div>It's even a testing tool. I know when I was doing some debugging, I had come across an error that would only appear on certain gear levels. How else can I easily say &quot;Rawr, make me a character using best in slot gear from Heroics and Heroic Badges&quot; and do that without merely selecting a bunch of stuff under a filter? Rawr also makes &quot;smart sets&quot; for this purpose.</div>",
    "PostedDate": "2009-04-06T22:50:36.43-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "176459",
    "ThreadId": "52369",
    "Html": "I replied to you in private... I'll no longer be a part of the discussions here.<br>\r\n<br>\r\nBest to you Rawr developers!<br>\r\nBrian\r\n",
    "PostedDate": "2009-04-06T22:51:17.35-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "176464",
    "ThreadId": "52369",
    "Html": "It looks like I have been doing things correctly, but the bug in the latest beta (the upgrade list taking multiple gear upgrades into account at once) looks like it will keep me from using it from the time being.  However, I'm glad to see I was taking the right approach.<div><br></div><div>And Astrylian:  I like your explanation -- the only thing I'd suggest is that you add an explanation of the usage of &quot;Direct Upgrades.&quot;  I know you've put it as a explanation in that section, but what I'm thinking could improve things is having a section with use cases.  Basically, &quot;Q: how do I do X&quot;  -- &quot;A: Use &lt;this option&gt;&quot;</div>",
    "PostedDate": "2009-04-06T23:33:41.437-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "176466",
    "ThreadId": "52369",
    "Html": "<span style=\"color:rgb(48, 51, 45);font-family:'segoe ui';font-size:13px\"><div><strong>Direct Upgrades are for what you DON'T have, when you don't want to change any of your gear, apart from swapping in the new item.</strong></div><div>Direct Upgrades is just a comparison chart of all items, filtered to only items which are valued higher than your currently equipped item. Nothing more complex. It's a 'dumb' chart, basically.</div></span>",
    "PostedDate": "2009-04-06T23:39:58.81-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "176477",
    "ThreadId": "52369",
    "Html": "Also, because it's important that everyone understand, it's worth repeating:<div><strong>v2.2.0b6's Build Upgrade List feature is bugged. It is <em>not</em> returning correct results. Please do not be confused by the odd results from b6. If you want to use the Build Upgrade List feature, please revert to v2.2.0b5.</strong></div>",
    "PostedDate": "2009-04-07T00:33:40.51-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "176497",
    "ThreadId": "52369",
    "Html": "BHershey, and others in a similar situation, does this help explain the purposes of each feature?<div><br></div><div><a href=\"http://dl.getdropbox.com/u/38028/UpdatedOptimizerWindow.png\">http://dl.getdropbox.com/u/38028/UpdatedOptimizerWindow.png</a><br></div>",
    "PostedDate": "2009-04-07T01:38:55.703-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "176523",
    "ThreadId": "52369",
    "Html": "<span style=\"color:rgb(48, 51, 45);font-family:'segoe ui';font-size:13px\"><div>Astrylian, your mock up seems pretty clear to me. I think the main reason for BHershey's frustration is that he tried to use the green diamond as a &quot;custom filter&quot; feature.</div><div><br></div><div>Also regarding what you wrote above:</div><div><strong><br></strong></div></span><blockquote style=\"margin-top:0px;margin-right:0px;margin-bottom:0px;margin-left:40px;border-top-style:none;border-right-style:none;border-bottom-style:none;border-left-style:none;border-width:initial;border-color:initial;padding-top:0px;padding-right:0px;padding-bottom:0px;padding-left:0px\"><span style=\"color:rgb(48, 51, 45);font-family:'segoe ui';font-size:13px;font-weight:bold\">Optimize is for what you DO have.</span><br><span style=\"color:rgb(48, 51, 45);font-family:'segoe ui';font-size:13px\">Optimize creates the best set of gear from what you already have available.</span><br><span style=\"font-family:'segoe ui';color:rgb(48, 51, 45);font-size:13px\"><br></span><span style=\"color:rgb(48, 51, 45);font-family:'segoe ui';font-size:13px;font-weight:bold\">Upgrade Lists are for what you DON'T have.</span><br><span style=\"color:rgb(48, 51, 45);font-family:'segoe ui';font-size:13px\">Build Upgrade List creates a list of items that would be upgrades for you, and how much of an upgrade they would be. If you already have the optimal set from what you currently have available, an Upgrade List will not contain anything you already have.</span><br><span style=\"font-family:'segoe ui';color:rgb(48, 51, 45);font-size:13px\"><br></span><span style=\"color:rgb(48, 51, 45);font-family:'segoe ui';font-size:13px;font-weight:bold\">Direct Upgrades are for what you DON'T have, when you don't want to change any of your gear, apart from swapping in the new item.</span><br><span style=\"color:rgb(48, 51, 45);font-family:'segoe ui';font-size:13px\">Direct Upgrades is just a comparison chart of all items, filtered to only items which are valued higher than your currently equipped item. Nothing more complex. It's a 'dumb' chart, basically.</span></blockquote><span style=\"color:rgb(48, 51, 45);font-family:'segoe ui';font-size:13px\"><div><span style=\"font-family:'segoe ui'\"><div><br></div><div>From this description, the difference between upgrade lists and direct upgrades is not clear to me.</div><div><br></div><div>My previous understanding is that direct upgrades is an upgrade list for one slot only. Is that correct? It may not, because then, I'm not sure why it's an item on the contextual menu.</div><div><br></div><div><br></div></span></div></span>",
    "PostedDate": "2009-04-07T02:52:27.48-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "176537",
    "ThreadId": "52369",
    "Html": "Direct upgrades is the same as normal comparison charts, it just shows all slots in one place and doesn't show items below your currently equipped item. It just swaps that item in that slot in currently equipped gear to get upgrade value.<br>\r\n<br>\r\nThere's two things that are different with build upgrade list. First it takes into account all gear marked as available, not just what you have currently equipped. Second it considers reenchanting and gemming combinations that direct upgrades does not.\r\n",
    "PostedDate": "2009-04-07T03:45:23.827-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "176594",
    "ThreadId": "52369",
    "Html": "<div><span style=\"font-family:'segoe ui';color:rgb(48, 51, 45);font-size:13px\"><strong><span style=\"color:rgb(0, 0, 0);font-family:'times new roman';font-size:16px;font-weight:normal\">I think this is very close.  However, I would like to suggest some slight clarificiations (examples in italics below):</span><br></strong></span></div><div><br></div><blockquote style=\"margin-top:0px;margin-right:0px;margin-bottom:0px;margin-left:40px;border-top-style:none;border-right-style:none;border-bottom-style:none;border-left-style:none;border-width:initial;border-color:initial;padding-top:0px;padding-right:0px;padding-bottom:0px;padding-left:0px\"><span style=\"color:rgb(48, 51, 45);font-family:'segoe ui';font-size:13px;font-weight:bold\">Upgrade Lists are for what you DON'T have.</span><br><span style=\"color:rgb(48, 51, 45);font-family:'segoe ui';font-size:13px\">Build Upgrade List creates a list of items that would be upgrades for you, and how much of an upgrade they would be. If you already have the optimal set from what you currently have available, an Upgrade List will not contain anything you already have.  <em>Rawr may swap in other gear that you already have in order to optimize the set for the new item.</em></span><br><span style=\"font-family:'segoe ui';color:rgb(48, 51, 45);font-size:13px\"><br></span><span style=\"color:rgb(48, 51, 45);font-family:'segoe ui';font-size:13px;font-weight:bold\">Direct Upgrades are for what you DON'T have, when you don't want to change any of your gear, apart from swapping in the new item.</span><br><span style=\"color:rgb(48, 51, 45);font-family:'segoe ui';font-size:13px\">Direct Upgrades is just a comparison chart of all items, filtered to only items which are valued higher than your currently equipped item. Nothing more complex. It's a 'dumb' chart, basically, <em>which simply swaps in new items one at a time and displays the results.</em></span><br></blockquote><div><br></div>BTW, guys -- I really appreciate your efforts to make this clearer.  You guys have worked with these concepts so much that I'm sure it's hard to view it from a newbie point of view. :)<div><br></div><div><br></div>",
    "PostedDate": "2009-04-07T05:58:57.917-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "176659",
    "ThreadId": "52369",
    "Html": "So let me see if I understand this: If I want to see the BiS gear available in the game then I can select the top items in each slot and run the optimizer, correct? But that doesn't necessarily mean that if I acquire one of the items I should equip it right away since the optimizer is only showing me the best COMBINATION of gear. If I want to outline an upgrade path to that BiS theoretical gear than I should use the Build Upgrade List feature making sure to only select items I own as available, correct?<br>\r\n",
    "PostedDate": "2009-04-07T08:55:22.39-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "176703",
    "ThreadId": "52369",
    "Html": "That's correct, Alcapwnd.<div><br></div><div>And dfscott, thanks very much. I'll see about where we can get that info into the app.</div>",
    "PostedDate": "2009-04-07T10:32:46.513-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "176792",
    "ThreadId": "52369",
    "Html": "<p dir=ltr style=\"margin-right:0px\">Honestly, I think we can do a bit better still, but I think dfscott's changes are definitely useful.<br>\r\n<br>\r\nNowhere in Rawr is there a checkbox that says &quot;I have this,&quot; or &quot;I don't have this.&quot;  Instead, there are little green boxes with occasional red dots (feedback: colored shapes + random dots = usability 101 failure at work) which represent items &quot;Available for Optimizer.&quot;<br>\r\n<br>\r\nIf &quot;I have this&quot; is equivalent to &quot;Item is available for optimizer&quot; then that needs to be made clear.  You can't switch lingo when trying to explain things to folks, it's just confusing, particularly when what you are trying to explain is confusing enough.  I'm not even a fan of the word optimize honestly.  We use it in CS often enough to talk about finding a minimal or maximal set of stuff, but honestly, it's a scary word.<br>\r\n<br>\r\nDisclaimer: I am certainly not an expert in this as these are features I do not use.  (I use the optimizer, but not the upgrade lists).  This is my understanding, and please correct me if I'm wrong:<br>\r\n<br>\r\n1. Optimize.  I pick a bunch of items with green or blue diamonds with optional red dots (this needs to be changed, honestly).  These are things that &quot;I have&quot; or I feel are within my reach.  I run the optimizer and it tells me, given that set of items, which ones to use.  This much I know and I use this part of Rawr all the time.<br>\r\n<br>\r\n2. Build upgrade list.  Same as in #1, I pick a bunch of items that I either have or thing that I can get easily enough.  Now Rawr will go through the list of all the items (including those I have not selected), and, one by one, pretend I have it and then run optimize with my selected gear.  Basically it goes through all the gear and says &quot;Well, if you <em>did</em> have this, and considering all the other gear in your inventory, this is the best you could do with this piece.&quot;  Then that list of items sorted by the best potential incremental score they could provide.<br>\r\n<br>\r\nIf my understanding of #1 and #2 is correct, I'm still baffled why nobody plainly answered Brian's question:<br>\r\n<br>\r\n<strong>&gt; I don't understand why the Optimizer's Build Upgrade List has items that I didn't mark.<br>\r\n</strong><br>\r\nBecause that's exactly what the feature does.  It assumes you already have everything you've marked and tries to tell you what gear you should go after next.  Rawr assumes you've got your ultimate set already and shows you how to make it better still.  It also tells you if you could do a better job with the gear you currently have.<br>\r\n<br>\r\nAs for the features themselves &amp; my opinions:<br>\r\n<br>\r\nI do use the optimizer regularly and am glad it's there, but...<br>\r\n<br>\r\nThat being said, my frustration using the optimizer and the upgrade list is that I never know what the heck it did.  I run the optimizer and it tells me it found 100 more points for me.  I'm thrilled.  Now I have to go through the guessing game to see what changed.  I think it needs to tell you &quot;I replaced the gems in slot x and added an enchant in slot y and swapped out the gear in slot z.&quot;<br>\r\n<br>\r\nSimilarly, the &quot;Build Upgrade List&quot; is somewhat confusing.  I just imported my character from the armory (using b4 since b6 is supposed to be busted), and just for kicks I marked one enchant that I know to be better than mine as available...  And every piece of my gear shows up as a potential upgrade.  Only by looking at them one by one do I figure out just what combination of gems &amp; enchants it chose and how they are different than my current setup.  And for the newbie user, if you don't set the optimization thoroughness to maximum, each one of those slots shows up with a different score.  Honestly, I think we would have lost people way before then, but if we didn't, this would be the straw that breaks the camel's back.  If you try to discuss genetic algorithms to explain why it is happening, then you may as well go have a conversation with a napkin.  Many people don't know and don't care.<br>\r\n<br>\r\nSo if I had to summarize:<br>\r\n<br>\r\n1. Green diamonds, blue diamonds and red dots do not a friendly UI make.<br>\r\n2. You can't tell people that the build upgrade lists takes into consideration gear you have when I cannot see any option in Rawr to say &quot;I have this.&quot;  &quot;Available for Optimizer&quot; is not &quot;I have this.&quot;  (I realize technically they are the same, but the words are different and don't equate).<br>\r\n3. Optimizer finds a good set for you, but you have to guess what's good about it.  It equips it without telling you what it changed.<br>\r\n4. Same thing for build upgrade list.<br>\r\n5. Be clear:  Build upgrade list assumes you have things that you've marked and tries to find you other things you should get.  These may include things that you've marked if there is a more efficient way to use them (e.g. regemming, reenchanting, or just swapping out gear), but it will also include items that you did not mark.  They are the items you should consider saving your DKP for (or farming for, having crafted, whatever).  If you want to control what items show up in the upgrade list, do it through filters, not through diamonds.  The diamonds are there to tell it what pieces it gets to play with as it evaluates each new item as a potential upgrade.<br>\r\n6. As for upgrade list of low thoroughness showing your current gear with different scores...  I'm at a loss here.  I think that will be hard to explain to people.<br>\r\n<br>\r\nChar</p>\r\n",
    "PostedDate": "2009-04-07T12:57:13.843-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "176801",
    "ThreadId": "52369",
    "Html": "&quot;That being said, my frustration using the optimizer and the upgrade\r\nlist is that I never know what the heck it did.&nbsp; I run the optimizer\r\nand it tells me it found 100 more points for me.&nbsp; I'm thrilled.&nbsp; Now I\r\nhave to go through the guessing game to see what changed.&nbsp;<strong> I think it\r\nneeds to tell you &quot;I replaced the gems in slot x and added an enchant\r\nin slot y and swapped out the gear in slot z.</strong>&quot;&quot;<br>\r\n<br>\r\nThis would be awesome. Something like a diff listing of all the changes the optimizer is proposing to your currently equipped gear. If the gear in a particular slot changes then list that change. If the gear in a slot didn't change but the gem or enchant changed then list that. Add something to the Optimizer results pop-up window like:<br>\r\n<br>\r\n1. Changed Gear in Head Slot from &quot;Spiked Titansteel Helm&quot; to &quot;Obsidian Greathelm&quot;. Check the new item for it's optimized gems and enchants.<br>\r\n2. Changed the gem in Chest Slot gear &quot;Valorous Redemption Chestpiece&quot; for Blue Slot 1 from &quot;Bold Scarlet Ruby&quot; to &quot;Sovereign Twilight Opal&quot;.<br>\r\n3. Changed enchant in Main Weapon Slot for gear &quot;Betrayer of Humanity&quot; from &quot;Massacre&quot; to &quot;Berserking&quot;\r\n",
    "PostedDate": "2009-04-07T13:26:56.71-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "176858",
    "ThreadId": "52369",
    "Html": "<span style=\"color:rgb(48, 51, 45);font-family:'segoe ui';font-size:13px;font-style:italic\">1. Green diamonds, blue diamonds and red dots do not a friendly UI make.</span><div><span style=\"color:rgb(48, 51, 45);font-family:'segoe ui';font-size:13px;font-style:italic\">2. You can't tell people that the build upgrade lists takes into consideration gear you have when I cannot see any option in Rawr to say &quot;I have this.&quot;  &quot;Available for Optimizer&quot; is not &quot;I have this.&quot;  (I realize technically they are the same, but the words are different and don't equate).</span><br></div><div><span style=\"color:rgb(0, 0, 0);font-family:'times new roman';font-size:16px;font-style:normal\"><div><span style=\"color:rgb(48, 51, 45);font-family:'segoe ui';font-size:13px\"><span style=\"white-space:pre\">\t</span>Absolutely agree. Lets change it to something more usable. Lets just go completely clear, and change the whole &quot;available&quot; thing to... what? &quot;I have this&quot;? That doesn't sound too bad, but perhaps there's a better wording. Any suggestions? For UI, how about just a checkbox instead of the green diamond, with a column header of &quot;I have this&quot; or whatever? But what about the 'specific gemming/enchanting' though? Not sure how to best handle the UI for that.</span></div><div><span style=\"color:rgb(48, 51, 45);font-family:'segoe ui';font-size:13px\"><br></span></div></span></div><div><span style=\"color:rgb(48, 51, 45);font-family:'segoe ui';font-size:13px;font-style:italic\"><br></span></div><div><span style=\"color:rgb(48, 51, 45);font-family:'segoe ui';font-size:13px;font-style:italic\">3. Optimizer finds a good set for you, but you have to guess what's good about it.  It equips it without telling you what it changed.</span></div><div><span style=\"color:rgb(48, 51, 45);font-family:'segoe ui';font-size:13px;font-style:italic\"><span style=\"white-space:pre\">\t</span><span style=\"font-style:normal\">I'd definitely like to have a summary screen at the end of the Optimizer, showing what it changed, and the resulting improvements, etc. Just haven't gotten to this yet.</span><br></span></div><div><span style=\"color:rgb(48, 51, 45);font-family:'segoe ui';font-size:13px;font-style:italic\"><br>4. Same thing for build upgrade list.</span></div><div><span style=\"color:rgb(48, 51, 45);font-family:'segoe ui';font-size:13px;font-style:italic\"><span style=\"white-space:pre\">\t</span><span style=\"font-style:normal\">This is a little simpler for the Upgrade Lists. It already shows the complete list of the gear set for each item. I imagine it wouldn't be too difficult to just highlight the differences from your current gearset, in that tooltip.</span></span></div><div><span style=\"color:rgb(48, 51, 45);font-family:'segoe ui';font-size:13px;font-style:italic\"><span style=\"font-style:normal\"><br></span>5. Be clear:  Build upgrade list assumes you have things that you've marked and tries to find you other things you should get.  These may include things that you've marked if there is a more efficient way to use them (e.g. regemming, reenchanting, or just swapping out gear), but it will also include items that you did not mark.  They are the items you should consider saving your DKP for (or farming for, having crafted, whatever).  If you want to control what items show up in the upgrade list, do it through filters, not through diamonds.  The diamonds are there to tell it what pieces it gets to play with as it evaluates each new item as a potential upgrade.</span></div><div><span style=\"color:rgb(48, 51, 45);font-family:'segoe ui';font-size:13px;font-style:italic\"><span style=\"white-space:pre\">\t</span><span style=\"font-style:normal\">Is this already covered by the &quot;available&quot;-&gt;&quot;I have this&quot; change, combined with the added descriptions (see screenshot linked above)?</span><br></span></div><div><span style=\"color:rgb(48, 51, 45);font-family:'segoe ui';font-size:13px;font-style:italic\"><br>6. As for upgrade list of low thoroughness showing your current gear with different scores...  I'm at a loss here.  I think that will be hard to explain to people.</span></div><div><span style=\"color:rgb(48, 51, 45);font-family:'segoe ui';font-size:13px;font-style:italic\"><span style=\"white-space:pre\">\t</span><span style=\"font-style:normal\">Available items will show up in build upgrade lists when your current gearset isn't optimal. The calculation technically is [(value of the optimal set with that item equipped) - (value of the current set)]. If your current set isn't optimal, items in your current set will show up as upgrades. I'm not sure if we should change that. Kavan, should we perhaps change that to </span><span style=\"font-style:normal\">[(value of the optimal set with that item equipped) - (value of the current <span style=\"font-weight:bold\">optimal</span> set)]? Would only mean one more optimization to run, and I think it may produce more meaningful values (?). At least, could we not include upgrades which produce less of an upgrade than just optimizing the current available items?</span><br></span></div>",
    "PostedDate": "2009-04-07T15:49:45.787-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "176870",
    "ThreadId": "52369",
    "Html": "<p><span style=\"font-size:13px;color:rgb(48,51,45);font-style:italic;font-family:'segoe ui'\">1. Green diamonds, blue diamonds and red dots do not a friendly UI make.</span> </p>\r\n<div><span style=\"font-size:13px;color:rgb(48,51,45);font-style:italic;font-family:'segoe ui'\">2. You can't tell people that the build upgrade lists takes into consideration gear you have when I cannot see any option in Rawr to say &quot;I have this.&quot;  &quot;Available for Optimizer&quot; is not &quot;I have this.&quot;  (I realize technically they are the same, but the words are different and don't equate).</span><br>\r\n</div>\r\n<div><span style=\"font-size:16px;color:rgb(0,0,0);font-style:normal;font-family:'times new roman'\">\r\n<div><span style=\"font-size:13px;color:rgb(48,51,45);font-family:'segoe ui'\"><span style=\"white-space:pre\"></span>&gt; Absolutely agree. Lets change it to something more usable. Lets just go completely clear, and change the whole &quot;available&quot; thing to... what? &quot;I have this&quot;? That doesn't sound too bad, but perhaps there's a better wording. Any suggestions? For UI, how about just a checkbox instead of the green diamond, with a column header of &quot;I have this&quot; or whatever? But what about the 'specific gemming/enchanting' though? Not sure how to best handle the UI for that.</span></div>\r\n<span style=\"font-size:13px;color:rgb(48,51,45);font-family:'segoe ui'\">\r\n<div><br>\r\nYeah, let's think about this.  There's a balance between making it more usable and dumbing it too far down to be condascending.  On the other hand, let me say this:  World of Warcraft is a game.  Rawr, in a way, is an extension of that experience.  There's nothing wrong with it being a little fun and even a bit whimsical as long as it still maintains its usefulness.  Why not a dropdown with icons that make sense?  Imagine a no smoking sign (circle with line across + cigarette in the middle) but with the word &quot;gem&quot; instead of a cigarette.  That means don't mess with my gems.  Similar could be used for enchantments.  In fact, it could be two little checkboxes / dropdowns that are active only once you click on the &quot;I have this item&quot; box.<br>\r\n</div>\r\n<div>On the subject of fun, wouldn't it be cool to see a character decked in all that gear...?  (I know, I know...)  But still...  You could use Rawr to make uber kick ass gear set, or to pick the most attractive pimp outfit.  Shame there doesn't appear a way to get at the hair / color / markings of a character.  Even CharacterProfiler, that exports everything under the sun, doesn't include that.</div>\r\n<div></div>\r\n<div><span style=\"font-size:13px;color:rgb(48,51,45);font-style:italic;font-family:'segoe ui'\">3. Optimizer finds a good set for you, but you have to guess what's good about it.  It equips it without telling you what it changed.</span></div>\r\n<div><span style=\"font-size:13px;color:rgb(48,51,45);font-style:italic;font-family:'segoe ui'\"><span style=\"white-space:pre\"></span><span style=\"font-style:normal\">&gt; I'd definitely like to have a summary screen at the end of the Optimizer, showing what it changed, and the resulting improvements, etc. Just haven't gotten to this yet.<br>\r\n<br>\r\nWell, while you're thinking about it, let me just offer one more suggestion.  It's really useful to have &quot;before&quot; and &quot;after&quot; visible somehow.  If I had to choose one feature, it would be &quot;show me what changed.&quot;  If I could choose two, it would be &quot;Show me what changed, from what to what.&quot;<br>\r\n<br>\r\n<em><span style=\"font-size:13px\">4. Same thing for build upgrade list.</span></em>\r\n<div><span style=\"font-size:13px;color:rgb(48,51,45);font-style:italic;font-family:'segoe ui'\"><span style=\"white-space:pre\"></span><span style=\"font-style:normal\">&gt; This is a little simpler for the Upgrade Lists. It already shows the complete list of the gear set for each item. I imagine it wouldn't be too difficult to just highlight the differences from your current gearset, in that tooltip.<br>\r\n<br>\r\n/agree, but same as #3.  One nitpick about the upgrade list is that the order of items rearrange because they exclude the item indicated as an upgrade.<br>\r\n<br>\r\n<em><span style=\"font-size:13px\">5. Be clear:  Build upgrade list assumes you have things that you've marked and tries to find you other things you should get.  These may include things that you've marked if there is a more efficient way to use them (e.g. regemming, reenchanting, or just swapping out gear), but it will also include items that you did not mark.  They are the items you should consider saving your DKP for (or farming for, having crafted, whatever).  If you want to control what items show up in the upgrade list, do it through filters, not through diamonds.  The diamonds are there to tell it what pieces it gets to play with as it evaluates each new item as a potential upgrade.</span></em>\r\n<div><span style=\"font-size:13px;color:rgb(48,51,45);font-style:italic;font-family:'segoe ui'\"><span style=\"white-space:pre\"></span><span style=\"font-style:normal\">&gt; Is this already covered by the &quot;available&quot;-&gt;&quot;I have this&quot; change, combined with the added descriptions (see screenshot linked above)<br>\r\n<br>\r\nIt's definitely a vast improement over what we have now.  My criticism about that screen shot is that it's getting a bit busy and there's a whole lot to read.    I just hope that isn't too scary.  As a more general comment, some of Rawr's most powerful features (specifically the optimizer &amp; batch tools) are hidden in menus and are not first class citizens.  I only joined up after both features were already in Rawr, but I'll go out on a limb and guess that they came out after the initial version of Rawr and were tacked on.  How about an extra tab for optimizer options (THAT CAN BE SAVED WITH YOUR CHARACTER FILE!!!), and actually put the optimize button &amp; upgrade list right on the main screen?  After all, here I am presented with a list of gear choices, why not have a button to help me make the best decision?  Tooltips can go a long way to clarifying stuff without bombarding a user with volumes text on a single screen.<br>\r\n<br>\r\n<em><span style=\"font-size:13px\">6. As for upgrade list of low thoroughness showing your current gear with different scores...  I'm at a loss here.  I think that will be hard to explain to people.</span></em>\r\n<div><span style=\"font-size:13px;color:rgb(48,51,45);font-style:italic;font-family:'segoe ui'\"><span style=\"white-space:pre\"></span><span style=\"font-style:normal\">Available items will show up in build upgrade lists when your current gearset isn't optimal. The calculation technically is [(value of the optimal set with that item equipped) - (value of the current set)]. If your current set isn't optimal, items in your current set will show up as upgrades. I'm not sure if we should change that. Kavan, should we perhaps change that to </span><span style=\"font-style:normal\">[(value of the optimal set with that item equipped) - (value of the current <span style=\"font-weight:bold\">optimal</span> set)]? Would only mean one more optimization to run, and I think it may produce more meaningful values (?). At least, could we not include upgrades which produce less of an upgrade than just optimizing the current available items?<br>\r\n</span></span></div>\r\n<br>\r\nI think you misunderstood me here.  I understand fully what is happening and why, but I have no idea how to explain that to someone who does not &quot;belong to mensa.&quot;  And unfortuately, Kavan will tell you that there's no such thing as an optimal set :(  Just repeat my experiment -- open up a character from the armory, select one enhancement (e.g. a better enchant), and build upgrade list with max thoroughness.  Even in that case the scores are not identical.  They're pretty close, but not exactly the same.  If you do it with medium optimization settings, then they are all over the place.<br>\r\n<br>\r\nIf you want to see this in action, just pull my character up (Charinna @ Shadowsong), wait till you're done laughing at my meager gear, switch to weapon enchants, green diamond berserking, and the build upgrade lists with maximum thoroughness.  I would expect all of my items to show up with the exact same score, but they don't.  This is tricky to explain to people.  Now if you reduce the thoroughness to the mid-level (which is Rawr's default), the point spread becomes even bigger.<br>\r\n<br>\r\nI'm not proposing we change it, but it's just a sad inconsistency that I'm guessing will confuse some people sometime if we do a good job of explaining these features to folks.<br>\r\n<br>\r\nChar<br>\r\np.s. Also, on the subject of usability, please please make &quot;File-&gt;Open&quot; work with batch files!  Instead you get an error that is wrong.<br>\r\n</span></span></div>\r\n</span></span></div>\r\n</span></span></div>\r\n</span></span></div>\r\n",
    "PostedDate": "2009-04-07T16:37:33.57-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "176876",
    "ThreadId": "52369",
    "Html": "Meaning of diamonds is not &quot;I have this&quot;. The correct meaning is &quot;Available for Optimizer&quot;. &quot;I have this&quot; is one possible interpretation for it, but it is not the only valid one.\r\n",
    "PostedDate": "2009-04-07T16:50:37.647-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "176882",
    "ThreadId": "52369",
    "Html": "Of course, and I think we all know this.  But &quot;Available for Optimizer,&quot; despite its meaning, is probably meaningless to many people<br>\r\n<br>\r\nThis is <em>exactly</em> the problem.<br>\r\n<br>\r\nChar<br>\r\n",
    "PostedDate": "2009-04-07T17:11:46.577-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "176893",
    "ThreadId": "52369",
    "Html": "This is a REALLY helpful discussion I must say I've learnt a lot about the design intent of Rawr from reading this one thread. <br>\r\n<br>\r\nWhen I started as a Rawr.Enhance developer I was working blind, struggling to work out how it all hung together, Astrylian was very helpful on MSN to clear up some things, and I learnt by picking apart how other models tackled stuff. However many aspects just looked daunting and it wasn't at all clear what they were or how to use them. The Optimiser and the Batch tools, I now appreciate are core tools in Rawr design, I genuinely had no real clue as to what they were and how to use them properly until I saw the video. It is perhaps unsurprising therefore that so many other users share this lack of knowledge. <br>\r\n<br>\r\nI would recommend that we include a few more videos to explain various Rawr features and that the program has a few extra buttons/links at relevant places that launch the videos in your browser. It might be an idea to have a &quot;new user&quot; flag with helpful video links, so if you are flagged as a new user for the first time you use a feature you could get a popup saying &quot;Would you like to view a video on how to use this feature?&quot;. You basically have a list of new features and associated videos and flag them as seen, or ticking a don't tell me about this again box.<br>\r\n<br>\r\nOn trying out the current code with the optimiser one thing that struck me was that after I said yes to accept the new list of gear, Rawr at that point has _character &amp; BestCharacter variables with two sets of gear and just overwrites the _character with the best gear. This is fine and works but it would be useful if it was possible to get a list of what was actually changed. At present you have to mouse over everthing and try to recall what exactly was there before. In the end I resorted to saving the two files and comparing them that way.<br>\r\n<br>\r\nI feel it would be a useful addition to have a popup form once you accept the change that showed what was changed. I'm not exactly sure from the code but would FormUpgradeComparison be compatible with this desire for an output form? Please understand I'm not suggesting I code anything at this stage as I'm still not comfortable I understand how this works so I plan to leave well alone. <br>\r\n<br>\r\nI do however note that the main model uses a Genetic Algorithm, something I know only a little about however my best mate is a lecturer in Computing whose specialist subject is Genetic Algorithms, he has written a book on the subject and several academic papers that he has had accepted to international conferences on GA programming. He does play WoW with myself on a regular basis and could be persuaded to have a look at the code if there is any specific issues that would be interesting to investigate. His interest was piqued when I mentioned that Rawr used a GA.<br>\r\n",
    "PostedDate": "2009-04-07T17:36:44.15-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "176913",
    "ThreadId": "52369",
    "Html": "<div>If only we could explain things this well to all users, concisely... </div><div><br></div>We'd need a new form to display the before vs after and changes of the Optimizer. I'd love to do it, I just don't have time at the moment.<div><br></div><div>I don't know about a 'new user flag', but just a flag of whether they've visited each feature before, and offering a video when they first visit a feature could be good. </div><div><br></div><div>I'll try to make more videos, they just take time from both of us, which neither of us have at the moment. Won't be before 3.1, for certain.</div><div><br></div><div><br></div><div>I'm kinda torn about &quot;Available&quot; vs &quot;I have&quot;... &quot;I have&quot; is the meaning we <strong>want</strong> it to have for <em>most</em> users. I think the more advanced users will understand that they can 'pretend' they have stuff. If we want to be more verbose, how about &quot;Character Has This&quot;?</div><div><br></div><div><br></div><div>Perhaps instead of a checkbox, we could just have a small dropdown, of &quot;Character has this (any gemming/enchanting)&quot;, &quot;Character has this gemming&quot;, &quot;Character has this enchanting&quot;, &quot;Character has this enchanting/gemming&quot;? Seems really verbose, but perhaps something down that path?</div>",
    "PostedDate": "2009-04-07T18:58:57.733-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "176917",
    "ThreadId": "52369",
    "Html": "I think &quot;Character has this&quot; is a good compromise. The main concern I have with &quot;I have this&quot; is that it will confuse users that want to use optimizer for best in slot sets and from my experience it seems a lot of users want to do that.\r\n",
    "PostedDate": "2009-04-07T19:06:55.927-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "176918",
    "ThreadId": "52369",
    "Html": "Perhaps we need a 3rd action in the Optimizer window... &quot;Find Best-In-Slot Set&quot;, which would find the best set of all items not currently filtered out?",
    "PostedDate": "2009-04-07T19:12:55.227-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "176921",
    "ThreadId": "52369",
    "Html": "That is not a bad idea. It would also help all users that are trying to mark everything as available by doing it the right way.\r\n",
    "PostedDate": "2009-04-07T19:17:17.233-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "176922",
    "ThreadId": "52369",
    "Html": "Yeah, it pretty much removes the reason that people perceive have for doing it the wrong way.",
    "PostedDate": "2009-04-07T19:19:47-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "176946",
    "ThreadId": "52369",
    "Html": "Also, as far as &quot;I have,&quot; it doesn't literally need to read that.<br>\r\n<br>\r\nHowever the checkbox reads, it should be clear the relationship between those items selected, the optimizer, and the upgrade list.<br>\r\n<br>\r\nChar<br>\r\n",
    "PostedDate": "2009-04-07T20:54:06.837-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "177059",
    "ThreadId": "52369",
    "Html": "At the point where Rawr's optimiser indicates its finished and offers to equip the new set, it has both old and new sets as complete item lists. Writing a small loop to create a difference set would be relatively easy and something I'd be happy to put in time with. What I'm not sure about is whether this needs a new form to display the changes? Whether this form could simply be a report style? Whether the existing FormUpgradeComparison could be used by just supplying it with an ItemInstance array of changed items?<br>\r\n<br>\r\nI was thinking that the simplest would be generating a webpage style report with a list of changes. eg: two columns old and new. To tart it up it could use wowhead.com style mouseovers as is used in lots and lots of sites (its a bit of Javascript that could just sit as a file in the Rawr resources directory or similar location). My skills lie in the creation of the data for the form and upto basic functionality of displaying it and adding the wowhead mouseover functionality. Making it look cool is a design issue and needs someone who understands colours and layout. I'm happy to do the coding for the report though if that would be helpful.<br>\r\n<br>\r\nIf so I'd propose that I create a new FormWebReport (so it could be used generically for any other reports we might want at a later date) and simply populate it with the html layout of the changed data as described above.<br>\r\n",
    "PostedDate": "2009-04-08T02:39:11.52-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "177131",
    "ThreadId": "52369",
    "Html": "Err... No? Heh, no. Nothing should be web-based or html-based. :)<div><br></div><div>Yes, it needs to be a new form, FormUpgradeComparison will not work.</div><div><br></div><div>I'd say for now (until I or another winforms dev can design the form), just enhance the messagebox that's there.</div><div><br></div><div>&quot;The Optimizer has found a gearset with a score of {0}.</div><div>Your currently equipped gearset has a score of {1}.</div><div><br></div><div>This involves the following changes:</div><div>{Slot}: Changed {OldItem} with {OldGem1}+{OldGem2}+{OldGem3}+{OldEnchant}</div><div> to {NewItem} with {NewGem1}+{NewGem2}+{NewGem3}+{NewEnchant}</div><div>{Slot}: Changed {OldItem} with {OldGem1}+{OldGem2}+{OldGem3}+{OldEnchant}</div><div> to {NewItem} with {NewGem1}+{NewGem2}+{NewGem3}+{NewEnchant}</div><div>{Slot}: Changed {OldItem} with {OldGem1}+{OldGem2}+{OldGem3}+{OldEnchant}</div><div> to {NewItem} with {NewGem1}+{NewGem2}+{NewGem3}+{NewEnchant}</div><div><br></div><div>Would you like to equip the new gearset?&quot;</div><div><br></div><div>Sure, it's ugly, but it gets the data across, and when we have time we'll build a snazzy form for it with icons and tooltips and such.</div>",
    "PostedDate": "2009-04-08T05:45:13.597-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "177173",
    "ThreadId": "52369",
    "Html": "Ah ok, if its not to be HTML based then I cannot assist. Not really the best person to be building a win form. Shame as with HTML you can of course be very very creative far beyond what's possible on a winform, hence the worldwide move to web based apps. I'm not really sure where your objection to html is, however I respect you have a reason for it. I'm sure someone might take it up at some point in the future, it's just not at all my skill set, so unfortunately it won't be me.<br>\r\n<br>\r\nI suppose I could commit the text comparison stuff though.<br>\r\n",
    "PostedDate": "2009-04-08T07:10:29.997-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "177215",
    "ThreadId": "52369",
    "Html": "Changes committed. The OptimizerResults class at present contains one method to output a string with the results formatted as you described. Obviously this could be extended to return specific differences or item lists or however the results form (to be implemented) needs the data.<br>\r\n",
    "PostedDate": "2009-04-08T08:45:43.613-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "177225",
    "ThreadId": "52369",
    "Html": "I think just a simple checkbox with the vernacular &quot;Character Has This Item&quot;, and the new optimizer mode to find BIS gear set will be the best for our users. To support ability to select only a certain gemming/enchanting we can use the right click drop down we have now for selecting enchants, but add gemming options to it.<br>\r\n<br>\r\nI might be able to make the better comparison form, I'll give a shot at it soon and see how it goes.<br>\r\n",
    "PostedDate": "2009-04-08T09:06:29.423-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]