[
  {
    "Id": "176099",
    "ThreadId": "52407",
    "Html": "Hi all,<br>\r\n<br>\r\nA friend of mine recommended this utility to improve my gear on WoW, so I decided to download and make a try with it. I took a look to requeriments to work and I acomplished at full, a recently installed Vista x64 Ultimate with all Windows Update packages applied, including of course .NET Framework 3.5 SP1.<br>\r\n<br>\r\nWell, I loaded the program and my profile from WoW Armory without problems, and then go to Optimize options, and started my problems. When I push Build Upgrade List, the error message appears:<br>\r\n<br>\r\n<a href=\"http://i39.tinypic.com/117a5p3.jpg\">ERROR THAT APPEARS ON OPTIMIZE</a><br>\r\n<br>\r\n(well, now you're thinking about so many times the people annoyed you with this problem... let me continue, please)<br>\r\n<br>\r\nSo, as I saw on Readme.txt and so many discussions here, I proceed to uninstall/reinstall .NET Framework (a long time, but with the hope that all will work). No way man, another time the window reporting the error message submited before. I downloaded package from this location:<br>\r\n<br>\r\n<a href=\"http://www.microsoft.com/downloads/details.aspx?FamilyID=AB99342F-5D1A-413D-8319-81DA479AB0D7&displaylang=en\">http://www.microsoft.com/downloads/details.aspx?FamilyID=AB99342F-5D1A-413D-8319-81DA479AB0D7&amp;displaylang=en</a><br>\r\n<br>\r\nMmmm, let me try to install Rawr in another machine, an old laptop I have to make tests with O.S. and so... Download Rawr, install .NET Framework 3.5 SP1, run Rawr, run Optimize... and another time the same error. The same error on two machines... why me?<br>\r\n<br>\r\nOk, take a long breath. Tomorrow I will test again.<br>\r\n<br>\r\nThis morning I started from zero. I formatted the laptop and install Windows XP SP2 Spanish, no updates, only .NET Framework 3.5 SP1 and Rawr.<br>\r\n<br>\r\nAnd here is again my problem. <br>\r\n<br>\r\nOk, one more time. Windows XP SP2 English (to avoid possible language issues, perhaps this is the problem), no updates, only .NET Framework 3.5 SP1 and Rawr. Ouch...<br>\r\n<br>\r\nTaking a look to Microsoft webpage, they said that is recommended to install some updates after installing .NET Framework 3.5 SP1, so I tried too...<br>\r\n<br>\r\n<a href=\"http://www.microsoft.com/downloads/details.aspx?familyid=6c095bba-6100-4ec9-9c54-6450b0212565&displaylang=en&displaylang=en\">http://www.microsoft.com/downloads/details.aspx?familyid=6c095bba-6100-4ec9-9c54-6450b0212565&amp;amp;displaylang=en&amp;displaylang=en</a><br>\r\n<br>\r\nNo no and no...<br>\r\n<br>\r\nOk, if I try to install .NET Framework 2.0? Ok, try it man. Format, download, install...<br>\r\n<br>\r\n<a href=\"http://www.microsoft.com/downloads/details.aspx?familyid=0856EACB-4362-4B0D-8EDD-AAB15C5E04F5&displaylang=en\">http://www.microsoft.com/downloads/details.aspx?familyid=0856EACB-4362-4B0D-8EDD-AAB15C5E04F5&amp;displaylang=en</a><br>\r\n<br>\r\nError.<br>\r\n<br>\r\nAnd if I install .NET Framework 2.0 and .NET Framework 2.0 SP1?<br>\r\n<br>\r\n<a href=\"http://www.microsoft.com/downloads/details.aspx?familyid=79BC3B77-E02C-4AD3-AACF-A7633F706BA5&displaylang=en\">http://www.microsoft.com/downloads/details.aspx?familyid=79BC3B77-E02C-4AD3-AACF-A7633F706BA5&amp;displaylang=en</a><br>\r\n<br>\r\nHere I am now. The progam never worked fine for me, and as you can see, I made all possible combinations. So, any possible solution will be received, because I'm sure that you inverted too many hours to made it work, and I want to enjoy with his use, but it won't work... \r\n",
    "PostedDate": "2009-04-06T06:24:17.283-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "176121",
    "ThreadId": "52407",
    "Html": "What version of Rawr did you install?  That message used to appear for me in the older versions, but went away recently.  You can also try one of the betas -- that are getting pretty stable now.<div><br></div><div>In any case, I would go back and reinstall .net 3.5 -- that *is* the correct version to use.  :(</div>",
    "PostedDate": "2009-04-06T07:24:04.147-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "176158",
    "ThreadId": "52407",
    "Html": "This bug should be fixed in v2.2.0b6 the issue was that you were clicking optimise without having selected the gear you had available to optimise. Prior to beta 6 Rawr wasn't checking if the lists were empty and so crashed.<br>\r\n<br>\r\n.Net 3.5 SP1 is the correct version to use, backrevving to old versions is a REALLY REALLY bad idea and will screw up your machine something rotten. Microsoft products work in an &quot;always forward&quot; model, you risk ruin by installing an older Microsoft product on top of a newer one. This is also why its NEVER a good idea to &quot;just reinstall windows&quot; (fresh install on clean empty disk works but a reinstall is always doomed to failure).<br>\r\n",
    "PostedDate": "2009-04-06T08:16:24.53-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "176191",
    "ThreadId": "52407",
    "Html": "I'm trying with 2.1.9 version, the actual working version on the page. I tried too with beta version 2.2.0b6, and seems to do anything when I push Optimize, the progress bar runs and these things, but arrives one point that explodes another time with same error.<br>\r\n<br>\r\nSo, then, what's the correct way to operate with the program? I don't understand your phrase &quot;you were clicking optimise without having selected the gear you had available to optimise&quot;, sorry.<br>\r\n<br>\r\nI have no idea what's happening\r\n",
    "PostedDate": "2009-04-06T09:29:08.423-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "176438",
    "ThreadId": "52407",
    "Html": "Well, you'll have to tell us what the error actually is that you're having, not just that there was an error. Regardless, none of this has anything to do with different versions of .NET. Just install the latest version and leave it at that. We can't tell you what the 'correct way to operate the program' is, because we don't know what you're trying to do. You should view the Tour of Rawr video if you haven't, and I suggest you use the latest beta version.",
    "PostedDate": "2009-04-06T21:22:38.807-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "176578",
    "ThreadId": "52407",
    "Html": "As I said, I get the error message when I loaded my info from Armory and try to Build Upgrade List through Optimize option. As I said, I installed the last .NET Framework version, 3.5 SP1 one. As I said, I tried the 2.2.0b6 version. I made all tests on a formatted laptop with Windows + .NetFramework + Rawr, no updates, no upgrades, no patches. Didn't read my whole message?<br>\r\n<br>\r\nI'll take a look to the video, but I'm sure that I'm doing the things correctly... Thanks anyway for your answer, Astrylian. \r\n",
    "PostedDate": "2009-04-07T05:29:55.35-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "176588",
    "ThreadId": "52407",
    "Html": "Yes but when the program &quot;explodes&quot; it gives you a detailed error message. We NEED that detailed error message if we are to find the issue. In your first message you were trying to be helpful and posted exactly what you did this is welcome. A couple of mistakes though. You didn't mention the version. You posted a screenshot of the error but without the vital details button clicked, the title of the error tells us very little the devil as they say is in the detail.<br>\r\n<br>\r\nWe do appreciate your frustration and do want to assist however we can only do this if we know exactly what the error is, what you are trying to do, and how we can replicate the error. So a little bit more info and I'm sure we can solve it together.<br>\r\n",
    "PostedDate": "2009-04-07T05:45:20.967-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "176589",
    "ThreadId": "52407",
    "Html": "<p>What Astrylian is saying is that it doesn't help that an error occurred, in general.  When it pops up and says the name / number of the error, combined with what you have sad, <em>that </em>is beneficial.  It's the specifics that matter here.</p>\r\n<p>The error code is like the machine that mechanics will plug in to check the computer on your car.  It's a diagnosis of sorts, letting them now what went wrong, and where, so they can go about resolving the issue.</p>\r\n<p>The data most needed is in that button to the far left of the error window you showed us in your first screen capture.  Click it, and post the full data found there.</p>\r\n",
    "PostedDate": "2009-04-07T05:46:24.997-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "176696",
    "ThreadId": "52407",
    "Html": "Thanks, we'll look into this. In the mean time, check out that video. I think that error may be caused by not marking anything as available (but I'm not sure, just going off memory at the moment, sorry if I'm wrong).",
    "PostedDate": "2009-04-07T10:17:25.687-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "176779",
    "ThreadId": "52407",
    "Html": "May be that the problem is I'm running Rawr with a 75 character? Just tried with a 80 character and worked fine...\r\n",
    "PostedDate": "2009-04-07T12:41:54.36-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "176786",
    "ThreadId": "52407",
    "Html": "Well, that may be related. Rawr won't give accurate results with lower level characters; it's designed for 80 only. But it still shouldn't actually <span style=\"font-style:italic\">crash. </span>Can you please attach the character file that we can reproduce this with to a new issue in the Issue Tracker, along with the full error text? Thanks.",
    "PostedDate": "2009-04-07T12:52:30.37-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "176843",
    "ThreadId": "52407",
    "Html": "Sure.<br>\r\n",
    "PostedDate": "2009-04-07T15:00:06.29-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]