[
  {
    "Id": "176317",
    "ThreadId": "52468",
    "Html": "So, I'm still a little confused about the &quot;Build Upgrade List&quot; option.  I've noticed that it seems to include multiple upgrades, not just the item I'm looking for.  For example, I'm using Gloves of Glistening Runes instead of Glove of Token respect on my holy priest because I have a crit restriction on optimize.  Even though the GoTR show up as a higher overall healing value, the optimizer skips them in favor of the GoGR since I need those to get my crit to it's target value.<div><br></div><div>However, if I then run &quot;Build Upgrade List&quot;, the GoTR show up as an upgrade.  If I equip those, I'm now below my desired crit target.  I *can* hit the crit target if I select &quot;equip all,&quot; since that includes several items that I don't even have yet.  </div><div><br></div><div>Am I misunderstanding how this function works?  Should I be using the &quot;direct upgrade&quot; list if I'm just looking at items that I can use to swap out with my current gear and still keep my stats?  </div>",
    "PostedDate": "2009-04-06T14:18:01.397-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "176331",
    "ThreadId": "52468",
    "Html": "The upgrade list is meant to be used with &quot;Equip All&quot; like you had used. It's sort of answering &quot;in what gear setups is X item better than what I have equipped?&quot;",
    "PostedDate": "2009-04-06T14:48:22.81-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "176361",
    "ThreadId": "52468",
    "Html": "Ah, ok -- so if I'm just looking to see what drops will improve my gear setup, I'm better off just going to the direct upgrades list and hitting &quot;Evaluate upgrade&quot; on each item?",
    "PostedDate": "2009-04-06T16:06:00.373-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "176366",
    "ThreadId": "52468",
    "Html": "Also build upgrade list is currently bugged in b6, it will try to use more than just one additional item at a time.\r\n",
    "PostedDate": "2009-04-06T16:18:34.463-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "176367",
    "ThreadId": "52468",
    "Html": "Ok, so it sounds like I was doing the right thing, it's just bugged right now.",
    "PostedDate": "2009-04-06T16:19:29.2-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]