[
  {
    "Id": "176345",
    "ThreadId": "52474",
    "Html": "I would LOVE the ability to select all the items appearing on the right hand side as available for the optimizer. As it is now it's a major pain to manually select each item for all the different types when I'm attempting to run the optimizer with all available items. With the latest addition of multicore support it takes mere seconds to run the optimizer on my machine with all the items so I'm not worried about running it this way from a performance perspective.<br>\r\n<br>\r\n<br>\r\n",
    "PostedDate": "2009-04-06T15:03:42.34-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "176451",
    "ThreadId": "52474",
    "Html": "This has been asked many times, please search before asking. This is not something that you want to do, nor do we want to help people to do it.",
    "PostedDate": "2009-04-06T21:53:56.597-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "176605",
    "ThreadId": "52474",
    "Html": "Why isn't it something I want to do? Optimize from all the available gear seems like a good idea.<br>\r\n",
    "PostedDate": "2009-04-07T06:31:57.573-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "176613",
    "ThreadId": "52474",
    "Html": "<p>http://rawr.codeplex.com/Thread/View.aspx?ThreadId=52369</p>\r\n<p>The philosophy and design viewpoint.</p>\r\n",
    "PostedDate": "2009-04-07T06:51:09.647-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "176699",
    "ThreadId": "52474",
    "Html": "Errr, I think you linked the wrong thread, BrWarner; that's nothing to do with what Alcapwnd is asking.<div><br></div><div>The bottom line is that the more items you have available, the more inaccurate, and slow, the Optimizer will be. Because of that, marking *everything* as available would result in a very inaccurate, very slow optimization process. Instead, you want to just put a couple seconds of effort into marking anything reasonable as available, optimizating, and then using Build Upgrade List to see if there's any other potential upgrades out there. You'll get much better results that way.</div>",
    "PostedDate": "2009-04-07T10:22:26.92-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "176879",
    "ThreadId": "52474",
    "Html": "Another way to look at the problem is like this. The more items you select as available the more combinations of gear there are possible. At a given thoroughness that will put a kind of limit on how many combinations the optimizer looks at. As a result the more items you select the chance of finding the optimum gets lower. To retain the same chance of finding the optimum you would have to increase thoroughness at the same time as adding more items as available.\r\n",
    "PostedDate": "2009-04-07T17:00:12.953-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]