[
  {
    "Id": "176904",
    "ThreadId": "52626",
    "Html": "I use Rawr for a number of guildies to figure out what we can get them for Heroics and eventually 10-mans.&nbsp; I use almost all models and have the same problem, so I don't think it is model specific.&nbsp; Actually I shouldn't call it a problem tho.&nbsp; The guildies I am using the Rawr for are fresh 80s and don't have the best gear.&nbsp; At first I have only crafted marked to look for gear upgrades.&nbsp; I select what I know guildies can make for them.&nbsp; Then I look at dungeons only.&nbsp; Since you can see the itemlevel in the tooltip (or whatever its called) when you mouse over the item in the list there are quite a few that have the itemlevel of 200.&nbsp; Items with that itemlevel that are dropped in dungeons are either from heroics or 10-mans.&nbsp; most say it drops from so &amp; so in Naxx or Heroic this or Heroic that.&nbsp; I don't have heroic selected for gear drops.&nbsp; If I set the filter to show only items with the itemlevel of 187 or lower, those don't show up anymore.&nbsp; BUT, I decided to check Heroic as well and those items aren't listed there.&nbsp; If I change the filter to show itemlevel 200 and under for dungeons they show up.&nbsp; I hope what I was saying made any sense.&nbsp; If needed I can clarify it some more with the specific items to show what I mean.<br>\r\n",
    "PostedDate": "2009-04-07T18:29:17.907-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "176912",
    "ThreadId": "52626",
    "Html": "It seems those ilevel 200 items are treated as dungeon drops, but not heroic drops. Can you give an example item where this happens and what exact source location text it has?\r\n",
    "PostedDate": "2009-04-07T18:48:22.29-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "177248",
    "ThreadId": "52626",
    "Html": "Here are a couple examples while using the mage model.<br>\r\n<br>\r\nEpic bracers - Cuffs of Winged Levitation - found in Cache of Eregos in Oculus<br>\r\nEpic ring - Band of Guile - found in Dark Runed Chect in CoT: Stratholme<br>\r\nRare shoulders - Mantle of the Tribunal - found in Tribunal Chest in Halls of Stone<br>\r\n<br>\r\nBear model.<br>\r\n<br>\r\nRare neck - Pendant of the Nathrezim - found in Dark Runed Chest in CoT: Stratholme<br>\r\nRare cloak - Ancient Dragon Spitir Cape - found in Cache of Eregos in Oculus<br>\r\n<br>\r\nAfter listing the ones that are showing up in the wrong spot, it looks like only the ones that are found in chests from a boss is listed in the normal dungeon drops.&nbsp; I didn't check them all when making this reply so I am not 100% sure if any are not from chests, but I can find out.&nbsp; It may take me a while to check tho.<br>\r\n",
    "PostedDate": "2009-04-08T09:47:38.85-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "177300",
    "ThreadId": "52626",
    "Html": "I have a personal set of filters and an updated itemcache to go along with it. I'll look into posting it (to be put in the next beta) after I send it to a few testers. It does fix the problem with specifying items in chests.<br>\r\n<br>\r\nOn another note, I am thinking about groups for filters, something along the lines of &quot;Dungeons&quot; &quot;Raids: Tier 7&quot; &quot;Crafting&quot; etc... as my current filter list is at least 20 items long.<br>\r\n<br>\r\nI am also wanting to see another parameter in item info: binding (BoP/BoE/BoA) in order to work a filter with that.\r\n",
    "PostedDate": "2009-04-08T11:46:49.587-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]