[
  {
    "Id": "177771",
    "ThreadId": "52841",
    "Html": "I'm Druid healer and changing the value of this ratio greatly affects what gear is better. I have no idea where the slider should be to get the best out of the char. Please advise<br>\r\n",
    "PostedDate": "2009-04-09T13:48:59.567-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "178010",
    "ThreadId": "52841",
    "Html": "This largely depends on what you want to achieve.<br>\r\n<br>\r\nAre you building a gearset for a short intense fight? go for higher burst.<br>\r\nAre you going oom during the fight? go for more sustained<br>\r\nIs the fight bursty on healing? (Quickly bringing the MT back up after a boss ability, like Sarth+3d breath. Or Loatheb aura gaps?) Go with more burst<br>\r\nWhich of the spell rotations are you optimisng for?<br>\r\n<br>\r\nUltimately, if your group takes down the boss, your gear was good\r\nenough for that fight, so don't worry too much. If you wipe or had\r\ndeaths during the fight, you need to try to analise and determine why:\r\nDid someone die because you couldn't output enough healing at that\r\npoint or did you need to save on mana or where they just not saveable?\r\nBased on that knowledge, tweak the slider a bit.<br>\r\n<br>\r\nThe sustained score is calculated as follows:<br>\r\nPriority 1, is keeping HoTs up on the tank (this takes cast time and mana).<br>\r\nThe remaining cast time and mana is used to spend on your primary heal.<br>\r\n<br>\r\nCheck the time until OOM and its tooltip. If that is less than the fight duration, your running OOM from just keeping HoTs up. If the duration matches the fight duration, but it still says your mana remaining is 0, it means your still mana contrained and needed to wait between casts in order to spread your mana over the whole fight. If you have mana remining, it means mana is no concern and you can keep casting the whole fight.&nbsp; (I think I need to change the GUI to be more clear on which scenario it is).<br>\r\n<br>\r\nThe hardcore approach would be to optimise for 2 different settings (full sustained and 50-50 for example). Hopefully most of the gear, gems and enchants will be similar. The items that do differ, are the ones you might want to swap in or out between each fight, depending on what you need for that fight. In the cases where enchants or gems differ on a specific piece of gear, pick the main version you want and then prevent regem/reenchant on that item (ctrl-click and right-click on the diamonds respecticely), then re-run the optimiser to better understand what other gear can be swapped around. <br>\r\n<br>\r\n<br>\r\n",
    "PostedDate": "2009-04-10T11:57:46.013-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]