[
  {
    "Id": "178073",
    "ThreadId": "52947",
    "Html": "Under the prot war (mitigation scale) / tanking dk / prot pally modules, armor seems to be contributing to both Mitigation and Survival.&nbsp; This seems to be a bit misleading and makes armor look better than it actually is.&nbsp; This is most evident when comparing the 225 armor and 22 agi cloak enchants:<br>\r\n<br>\r\nTake a typically naxx10 gear war, with 22,303 armor and 15.67% dodge.&nbsp; The 225 armor takes % armor reduction from 57.28% to 57.52% (a .24% improvement); the 22 agi takes dodge from 15.67% to 15.91% (coincidentally also a .24% dodge increase) and adds a smidgeon of armor.&nbsp; Intuitively one would expect the two enchants to be comparable (without accounting for threat).&nbsp; However, all three of the afforementioned scales weight the armor enchant as being roughly twice as good as the agi one.&nbsp; Is the armor valuation double dipping somewhere?&nbsp; Or am I erring by simplifying the math too much?<br>\r\n<br>\r\nOn a related note, using the &quot;TankPoints&quot; (ProtWarrior only) seems to bring the two enchants closer together.<br>\r\n",
    "PostedDate": "2009-04-10T16:24:01.01-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "178081",
    "ThreadId": "52947",
    "Html": "Armor affects both Mitigation Rating and Survival Rating, because <span style=\"font-style:italic\">armor affects both Mitigation and Survival.</span> Armor really is that good.<div><br></div><div>Also, note that &quot;a 0.24% improvement&quot; is looking at absolute values, which are not useful. Going from 57.28% to 57.52% armor reduces your incoming damage almost twice as much as going from 15.67% to 15.91% dodge. It's also reliable, so counts as Survival too.</div>",
    "PostedDate": "2009-04-10T17:11:48.423-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "178084",
    "ThreadId": "52947",
    "Html": "The difference for most levels of tank gearing really comes down to Threat and Avoidance versus Mitigation and Survival, looking at that singular example.  For progression that pushes the limits of your gear, there really is no choice between the two - the armor, every time (given that the primary/scary damage taken is non-magical, of course!).\r\n",
    "PostedDate": "2009-04-10T17:19:32.707-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "178199",
    "ThreadId": "52947",
    "Html": "I think it would be useful if you explained to the OP <em>why</em> Armor affects both mitigation and survival instead of just saying it does because it does.<br>\r\n<br>\r\nAndante, in terms of your math I'd like to make one observation:<br>\r\n<br>\r\nIf you currently have 57.28% damage reduction due to armor that means you're taking 42.72% of damage.  Now if you shave .24% from that 42.72%, then you're reducing the damage taken by .56%.  (You're taking 42.72, and .24 is .56% of that).<br>\r\n<br>\r\nFor your dodge numbers, if you're dodging 15.67%, then you're not dodging 84.33% of the time.  If you reduce that number by .24%, it's a .28% reduction in undodged attacks.<br>\r\n<br>\r\nSo ignoring the rest of your avoidance stats, a .24% increase in your armor is in fact better than a .24% increase in dodged attacks.<br>\r\n<br>\r\nI'll leave the mitigation and survival explanation to Astylian.<br>\r\n<br>\r\nChar<br>\r\n",
    "PostedDate": "2009-04-11T10:34:54.35-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "178213",
    "ThreadId": "52947",
    "Html": "Just look at the description for Mitigation and Survival (mouseover them). It's already clearly defined.",
    "PostedDate": "2009-04-11T11:37:43.49-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "238887",
    "ThreadId": "52947",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><br></blockquote>\r\n<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>Charinna wrote:</strong><br>If you currently have 57.28% damage reduction due to armor that means you're taking 42.72% of damage.&nbsp; Now if you shave .24% from that 42.72%, then you're reducing the damage taken by .56%.&nbsp; (You're taking 42.72, and .24 is .56% of that).<br></blockquote>\r\n<p>I perfectly agree that a 0.24% increase at 58% damage reduction is worth more than 0.24% improvement at 30% damage reduction. However, by taking into account the diminishing returns for armor, it actually has a decreasing benefit as you stack more of it. I'm fairly certain the formula used below are correct.</p>\r\n<p>&nbsp;</p>\r\n<table border=0>\r\n<thead> \r\n<tr>\r\n<th>Armor</th><th>Damage Reduction</th><th>+1000 armor damage reduction increase</th><th>Effective improvement</th>\r\n</tr>\r\n</thead> \r\n<tbody>\r\n<tr>\r\n<td>21000</td>\r\n<td>0.568</td>\r\n<td>0.012</td>\r\n<td>2.8%</td>\r\n</tr>\r\n<tr>\r\n<td>25000</td>\r\n<td>0.631</td>\r\n<td>0.009</td>\r\n<td>2.4%</td>\r\n</tr>\r\n<tr>\r\n<td>30000</td>\r\n<td>0.663</td>\r\n<td>0.007</td>\r\n<td>2.2%</td>\r\n</tr>\r\n</tbody>\r\n</table>",
    "PostedDate": "2009-09-25T10:32:09.097-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "238921",
    "ThreadId": "52947",
    "Html": "<p>That looks an awful lot like rounding error, if you're only going to 3 decimal places. Regardless, Rawr already handles all this accurately, so there's no issue.</p>",
    "PostedDate": "2009-09-25T11:50:46.283-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "238951",
    "ThreadId": "52947",
    "Html": "<p>There is no rounding error (not of any significance at least). I took my calculations out to 7 decimal places, but the extra accuracy didn't add anything further to my point. I am just suspicious about how much emphasis Rawr is placing on +armor.</p>",
    "PostedDate": "2009-09-25T13:07:22.6-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "238993",
    "ThreadId": "52947",
    "Html": "<p>Armor having decreasing returns is a myth that has been around for about 5 years. It is curved in a way that the survival time increase granted is linear across all armor values. If it did not 'diminish' then the increase in Armor value would be exponential and give severe increasing returns at higher levels of armor.</p>\r\n<p>Armor never becomes less valuable to have until you hit the cap.</p>\r\n<p>It is a valuable stat in Rawr because it is a valuable stat in the game. With base swings approaching 80,000 in TotC-25 (Heroic), Armor is a very effective way to increase your survival time.</p>",
    "PostedDate": "2009-09-25T14:45:58.993-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "239015",
    "ThreadId": "52947",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>EvanM wrote:</strong><br>\r\n<p>Armor never becomes less valuable to have until you hit the cap.</p>\r\n</blockquote>\r\n<p>This.</p>\r\n<p>If you want an external source take a look at the two graphs at http://www.wowwiki.com/Armor . These were done for level 70 but remain true today.</p>\r\n<p>You will note in the first graph, as you say, each point of armor gives less and less of an increase in the raw percentage of damage absorbed.&nbsp; There is a flattening curve.</p>\r\n<p>You will note in the second graph that the effective TTL remains completely linear all the way to armor cap.&nbsp; This is why every single point of armor is just as worthwhile as the prior one.&nbsp; The raw percentage above is not directly relevant to deciding tanking gear choices, the effective TTL is.</p>\r\n<p>In fact, I think each point may be better than the last because that graph doesn't take into account all of the other damage reduction abilities you and others have.&nbsp;&nbsp; Your DR is always a bit &quot;ahead of the curve&quot; as it were from talents and buffs.&nbsp; I'll leave that one to the math majors though; don't quote me on that.</p>",
    "PostedDate": "2009-09-25T15:55:12.293-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "241047",
    "ThreadId": "52947",
    "Html": "<p>Damn it I had a long write up and I lost it hope I capture everything again...</p>\r\n<p>Can someone explain to me why AGI is so great as a tanking stat to plate classes?</p>\r\n<p>I understand that AGI converts to the foloowing:</p>\r\n<p>1 agi= .0109% dodge (hope this is right based on above math)</p>\r\n<p>1 agi = 2 armor</p>\r\n<p>1agi = .019% Crit (for a pally)</p>\r\n<p>I am not positive what the other tanking stats are 1-1 but I can not believe that agi is that much better.</p>\r\n<p>Bigdogcc (blackrock) if you want to load me into rawr.</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-10-01T13:11:08.747-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "241348",
    "ThreadId": "52947",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>bigdogcc wrote:</strong><br>\r\n<p>Damn it I had a long write up and I lost it hope I capture everything again...</p>\r\n<p>Can someone explain to me why AGI is so great as a tanking stat to plate classes?</p>\r\n<p>I understand that AGI converts to the foloowing:</p>\r\n<p>1 agi= .0109% dodge (hope this is right based on above math)</p>\r\n<p>1 agi = 2 armor</p>\r\n<p>1agi = .019% Crit (for a pally)</p>\r\n<p>I am not positive what the other tanking stats are 1-1 but I can not believe that agi is that much better.</p>\r\n<p>Bigdogcc (blackrock) if you want to load me into rawr.</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n</blockquote>\r\n<p>Agility is a good stat because it provides the following:</p>\r\n<p>A) Threat, through increased crit. Also through avoidance/mitigation for some classes (more rune strike procs for DKs)</p>\r\n<p>B) Mitigation, provides dodge for all tanking classes</p>\r\n<p>C) Survivability, provides armor for all tanking classes, usually modified by talents/stances/presences</p>\r\n<p>While 1 point in agility may not be as good as 1 point in dodge rating or stamina, usually items with agility (weapons for DKs/Druids) come with a good deal of agility. Agility definitely isn't something you should socket for unless you're a druid, but it is a nice stat to have.</p>",
    "PostedDate": "2009-10-02T08:56:45.697-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "241410",
    "ThreadId": "52947",
    "Html": "<p>If you feel threat is a non-issue you can reduce the threat component of your gear under Options tab-&gt; Raking -&gt; Threat scale.&nbsp; AGI will decrease in value a bit.</p>\r\n<p>Overall though one should always look at the specific values for mitigation/survival/threat and make decisions based on that...not just the summation/ranking.&nbsp; Many times in the bear model I will see some piece that looks AMAZING for bear tanking, but most of the &quot;bar&quot; is threat and the actual mitigation and survival aspects are lower than my current gear.&nbsp; If I am having threat issues I may take this as an upgrade.&nbsp; If not, I will probably disagree with Rawr's overall ranking and keep what I am wearing.</p>\r\n<p>Similarly the current season's PVP gear is awesome for bear tanking but the threat bar on each of those pieces is minuscule...Every time I equip one I pay very close attention to my threat for a few raids.&nbsp; I am choosing to lose threat for mitigation/survival but there is a lower bound where I will no longer be able to keep mobs away from the DPS.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-10-02T10:52:54.977-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "241471",
    "ThreadId": "52947",
    "Html": "<p>I understand the importance of threat ( i do down rank threat to .7) but what I don't understand is how point for point it rates higher than any other stat in relative stat value for prot pallies.&nbsp; It ranks so high that it recommends that I <strong>socketing AGI over dodge or parry</strong>. So it does seem odd does it not?</p>\r\n<p>Note its really the prot pally module that rates it so high the warrior only ranks it as 4th bests point for point. It ranks behind Def, dodge, parry and only slightly better that Stam.</p>\r\n<p>While I understand that relative stat values are not to be looked at without weighing them I still do not see how you can ignore them when they are making AGI the 1 red gem /combo gem. Maybe I should ignore it but I was hoping someone could point out something that I missed that made agi that good.</p>",
    "PostedDate": "2009-10-02T12:56:51.577-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "241490",
    "ThreadId": "52947",
    "Html": "<p>This is all well and good, but the fact still remains that Rawr over&nbsp;emphasizes&nbsp;armor. I know no end game tank that would even consider the Triumph badge trinket, yet, Rawr ranks it at the top of the list due to the armor afforded by it. That strikes me as slightly off.</p>",
    "PostedDate": "2009-10-02T13:38:32.01-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "241495",
    "ThreadId": "52947",
    "Html": "I too have seen ProtPally value Agi highly, but I'm not familiar enough with prot pally mechanics to know why. Any of the ProtPally devs care to comment?\r\n\r\nAs for overemphasizing Armor... Yeah, I think you may be talking to bad tanks. That trinket is awesome.",
    "PostedDate": "2009-10-02T13:44:12.11-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "241508",
    "ThreadId": "52947",
    "Html": "<p>Loaded you up in rawr and set all raid buffs on you.</p>\r\n<p>The agi conversion to dodge for paladins is ~52.&nbsp; the Dodge rating conversion is 45.25.&nbsp; This is very, very close.&nbsp; Given how high your dodge is you are pretty deep into DR territory which makes other components such as threat and armor a much larger percentage of the overall value of the stat.</p>\r\n<p>Take a look on the relative stats page:</p>\r\n<p>1 armor : 4 surv, 6 mit</p>\r\n<p>1 AGI: 8 surv, ~75.3 mit, ~6.3 threat</p>\r\n<p>1 Dodge: ~74.6 mit</p>\r\n<p>Breaking it out, AGI is  worth 8 surv, 12 mit from the armor component&nbsp; and providing ~63.3 dodge based mit and some threat.&nbsp; That amount of dodge mit doesn't seem out of line at all considering the conversion rates are so close.&nbsp;</p>\r\n<p>I suspect the huge relative value of 2 points of armor is what you are missing.&nbsp; There is a reason Glyph of Indomitability is BiS :).&nbsp; What sucks is how many tanks refuse to wear it since it has no stamina.&nbsp; Sta trinks are great for heavy spelldmg bosses.&nbsp; But ONLY for heavy spelldmg bosses should you swap out Indomitability</p>\r\n<p>&nbsp;</p>\r\n<div id=\"_mcePaste\" style=\"overflow:hidden;left:-10000px;top:0px;width:1px;height:1px\">\r\n<h1>Glyph of Indomitability</h1>\r\n</div>",
    "PostedDate": "2009-10-02T14:12:04.503-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "241523",
    "ThreadId": "52947",
    "Html": "<p>Side note: It would be an interesting add to the bear model to have some sort of % slider to rate how much of incoming damage is spell dmg.&nbsp; Then a user could optimize separately for an all-physical boss (like Rawr does today) and for varying percents of spell dmg (ignoring armor/avoidance, but still valuing sta/talent DR).</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-10-02T15:26:40.78-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "242045",
    "ThreadId": "52947",
    "Html": "<p>If I remember correctly, then Rawr supported damage of magic schools several years ago. I do not know in which module I saw that (perhaps mage? that was my main char ...), and perhaps I have only dreamed about it.</p>\r\n<p>Fact is, that there is nearly no boss fight without magical damage. In Ulduar and ToC, this is only true for XT-002 and General Vezax. Every single other boss deals magical damage to the tank. This varies depending on the group setup, the length of the fight and other things, but I made a table with how much magical damage of which school is dealt to the tank. It can be 50 to 70 % nature damage during Iron Council hard mode, 50 % frost damage during Hodir, 50 to 80 % fire damage during Ignis, 70 % fire damage during Mimiron, 35 % shadow damage during Yogg, and 20 to 70 % nature damage on Anub'Arak. The Koralon off-tank takes 100 % fire damage. I guess this is why armor is overvalued compared to stamina, because armor only deals with physical attacks, but there is nearly no fight where there are only physical attacks.</p>\r\n<p>Taking magical damage into account, it would be interesting to see how magical resistance enchants or gems would affect the resulting damage taken compared to defense or agility.</p>",
    "PostedDate": "2009-10-05T00:15:05.007-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "242050",
    "ThreadId": "52947",
    "Html": "<p>Those #s you listed seem <strong>really</strong>&nbsp;overestimated, BTW.</p>",
    "PostedDate": "2009-10-05T00:51:49.003-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "242053",
    "ThreadId": "52947",
    "Html": "<p>It is taken damage, so after armor, dodge, parry, block, being missed, being shielded (perhaps some holy paladins and discipline priests were present) and after magic resistance aura. And it is only the damage taken by the tank (main tank and off-tank listed seperately). Everything from 10-man.<br><br>XT-002: 164.165 physical<br>General Vezax: 497.216 physical<br>Iron Council hard mode (Molgeim tank): 253.217 physical, 315.522 nature<br>Iron Council hard mode (Steelbreaker tank): 164.041 physical, 542.365 nature<br>Hodir normal (6 min 35 sec): 443.031 physical, 529.595 frost<br>Hodir hard (2 min 57 sec): 176.197 physical, 134.113 frost<br>Ignis (main tank): 315.584 physical, 316.983 fire<br>Ignis (add tank): 74.003 physical, 258.742 fire<br>Mimiron normal: 215.793 physical, 451.810 fire<br>Yogg normal: 382.657 physical, 195.678 shadow<br>Anub'Arak (main tank): 541.881 physical, 57.475 frost, 164.546 nature<br>Anub'Arak (add tank): 13.330 physical, 68.464 frost, 171.524 nature<br>Koralon (main tank): 161.081 physical, 394.043 fire<br>Koralon (off tank): 419.767 fire<br><br>Please take a look at some log file if you do not believe it.<br><br>Want some more numbers?<br><br>Freya +3 (main tank): 1.035.214 physical, 48.395 fire, 26.606 nature<br>Freya +3 (add tank): 389.830 physical, 85.409 fire, 7.232 frost, 69.330 nature<br>Thorim hard (the tank not being in the arena): 467.631 physical, 16.012 fire, 29.335 frost, 11.224 holy, 7.504 nature<br><br>Even Archavon: 93 % physical, 7 % nature damage. Emalon MT: 81 % physical, 19 % nature. Emalon OT: 43 % physical, 57 % nature. Sartharion +3 zerg: 69 % physical, 26 % fire, 5 % shadow. Auriaya deals 10 % shadow damage. Razorscale 16 % fire damage. Of course these are only samples from one single fight and they may vary, but it is simply true that armor is overvalued in fights with magical damage in these sizes.</p>",
    "PostedDate": "2009-10-05T01:07:05.68-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "242067",
    "ThreadId": "52947",
    "Html": "<p>A) % actually taken is very different from what's dealt. That explains a ton of the exaggeration.</p>\r\n<p>B) Even still, comparing to results on my guild, those are extremely skewed toward the magic damage in almost every case. I'm guessing you were looking at the damage that the boss did, not the damage that the boss did <em>to the tank</em>&nbsp;in all cases?</p>",
    "PostedDate": "2009-10-05T01:43:46.883-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "242072",
    "ThreadId": "52947",
    "Html": "<p>A) Yes. But it is false to only look at physical damage.</p>\r\n<p>B) Hmm, example: http://www.worldoflogs.com/reports/Xl0laHldIkaiKnz3/sum/damageTaken/?s=2724&amp;e=3033<br><br>Steelbreaker tank was Cilja, Molgeim tank was Gurdi. You can mouse-over the damage below the graph to display the cut-downs.<br><br>Damage taken by Cilja (as one example):<br>- 239.202 Fusion Punch (nature)<br>- 210.929 Melee (physical)<br>- 135.673 High Voltage (nature)<br>- 23.711 Chain Lightning (nature)<br>- 3.371 Lightning Whirl (nature)<br>[- 5.624 High Voltage (nature) to Cilja's pet]<br><br>That is 618.510 total for Cilja, 66 % nature damage and 34 % physical damage.<br><br>Damage taken total for the group is 2.987.044, while everyone except Cilja and Gurdi only took nature damage.</p>",
    "PostedDate": "2009-10-05T01:58:10.853-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "242078",
    "ThreadId": "52947",
    "Html": "<p>Does Cilja massively outgear Uld10? Did s/he not have nature resistance aura? That's all I can think of to explain the extremely high nature % damage.</p>\r\n<p>Regardless, yeah, magic damage should be included in calculations, I totally agree. I'm just balking at your original numbers of up to 70% magic damage on tanks, which is just silly.</p>",
    "PostedDate": "2009-10-05T02:13:51.777-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "242093",
    "ThreadId": "52947",
    "Html": "<p>Cilja outgears Ulduar 10 to some degree, yes, but not massively. As we do hard modes, it fits. We do not use any kind of nature resistance in that fight.</p>\r\n<p>http://www.wow-heroes.com/index.php?zone=eu&amp;server=Aman%27Thul&amp;name=Cilja</p>\r\n<p>In the most fights, Cilja equips the two stamina trinkets from brewfest except the both listed.</p>\r\n<p>Even if it was only 30 % nature damage, it is enough to be considered when valuating armor vs. stamina.</p>",
    "PostedDate": "2009-10-05T02:55:22.14-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "242096",
    "ThreadId": "52947",
    "Html": "<p>Magic damage is a large portion. Some of it is even feasible to mitigate through Resist.</p>\r\n<p>What he's getting at is that everything you're seeing in those logs is the final value, not the initial value.&nbsp; If you see a hit for 20k, that's not the damage you should make for comparisons stat-wise, it should be the 50k (or whatever) value that is initially dealt.</p>\r\n<p>If 70% of the damage we take as tanks is magical, then there's no reason to do anything but gear for that, unless the physical damage portion was particularly strenuous.&nbsp; There would be no 'schools of thought' about Stam Stacking versus Spreading The Love.&nbsp; There would be no reason to gear for anything BUT stamina and resist.&nbsp; No armor.&nbsp; No avoidance.&nbsp; Nothing but Stamina.</p>\r\n<p>That's not the tanking world we play in.&nbsp; That's why the Brewfest trinks don't hands-down beat everything else - because the other stats have significant value.&nbsp; The only way for them to have significant value (read: keeping you alive, and/or keeping your healers sane) is for our damage to be more than just unavoidable, non-mitigated magical damage.</p>",
    "PostedDate": "2009-10-05T03:09:18.087-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "242100",
    "ThreadId": "52947",
    "Html": "<p>Of course there is no reason to stack stamina (or armor) with loosing all the other thats. Further, you have to think about that you must be healable - stamina does not reduce incoming damage. But what makes it interesting is if frost resistance for Hodir is more powerful than avoidance gear (what is a special case, because you can dodge etc. the frost damage), and what about fire resistance for Mimiron. For Icecrown, there will be craftable nature resistance armor ...</p>",
    "PostedDate": "2009-10-05T03:27:53.32-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "242137",
    "ThreadId": "52947",
    "Html": "<p>Khalthal Thank you for taking the time to look at that. What you said makes sense. I am still not sold on socketing Agi but I will at least look at it.</p>\r\n<p>I will be lazy and ask here what is the point of DR for dodge?</p>\r\n<p>I think what peope fail to understand about armor is that when tanking people only guage your tanking ability by the # of HP you have. As a tank that trys to get into pugs the higher your HP the better chance you have of getting into pugs.&nbsp;</p>\r\n<p>I also belive that some of the new Ony items are undervalued because resistance is never guaged effectively.&nbsp; Considering that almost all fights have some sort of magic component to it any sort of free resist that is packaged with the armor is not a bad thing.</p>",
    "PostedDate": "2009-10-05T05:08:07.79-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "242230",
    "ThreadId": "52947",
    "Html": "<p>Looking at parses will lead you astray every time.</p>\r\n<p>Lets say you look at a parse and it says you took 700,000 physical and 300,000 magical.&nbsp; Wow that's 70% physical right?&nbsp; Wrong.&nbsp; You need to look at BASE damage, not already mitigated damage.&nbsp; The boss doesn't melee for 15k on your tank.&nbsp; It melee's for 60k.&nbsp; Between armor and talents most tanks will take 75% or more off the physical side and around 33% off the magical side --IF-- the damage is resistible.</p>\r\n<p>You're looking at 2.8 mil physical and 450k magic damage incoming.&nbsp; That's about 86.2% physical.&nbsp; Moreover that's how much you took and doesn't include what you miss/dodge/parry.&nbsp; Overall 50% avoidance is not uncommon at all for a ballpark number so we are talking 5.6 mil physical damage incoming and still the same 450k magic damage incoming: 92.6% physical.</p>\r\n<p>Again on top of THAT...not all magic damage is resistible.&nbsp; The magic damage being unresistable actually shifts the numbers BACK toward physical since the incoming magic damage is back to it's flat 300k.&nbsp; We are now resting at 94.9% physical.</p>\r\n<p>So armor sucks?&nbsp; Avoidance stats suck?&nbsp; It's all about stamina because of the huge amount of spell dmg coming in compare to physical?&nbsp; Yeah...no...&nbsp; Remember as well, my values were not very optimal.&nbsp; A tank can easily take more than 75% off of physical incoming damage when properly geared and buffed.&nbsp; They can easily have more than 50% avoidance as well.&nbsp; I actually used a pretty moderately geared tank for my calcs.</p>",
    "PostedDate": "2009-10-05T09:08:24.703-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "242239",
    "ThreadId": "52947",
    "Html": "<p>Using my  poorly geared tank example above, let me adjust your values to BASE values, not already mitigated/avoided values....</p>\r\n<p>Damage taken by Cilja (as one example):<br>- 239.202 Fusion Punch (nature) = 358803<br>- 210.929 Melee (physical) = 1687432<br>- 135.673 High Voltage (nature) = 203509<br>- 23.711 Chain Lightning (nature) = 35566.5<br>- 3.371 Lightning Whirl (nature) = 5055</p>\r\n<p>Total magic: 602933.5</p>\r\n<p>Total phys: 1687432</p>\r\n<p>% magic: ~26.3%</p>\r\n<p>Council Hard mode is one of the heaviest magic damage fights in the game just now.&nbsp; And it's only 26%.&nbsp; This was assuming Cilja is badly geared.&nbsp; If Cilja has really awesome gear the number will be even smaller.&nbsp; Assuming Cilja has 55% avoidance and 80% physical mitigation (probably likely true) it's only 20.5% magical.</p>\r\n<p>Edit: er you said you don't use any nature resist....my numbers assumed you did.&nbsp; Ok.&nbsp; The nature damage percent is EVEN LOWER then.&nbsp; I shouldn't have increased the nature damage by much at all when converting to raw.&nbsp; I suspect the overall number will be about <strong>15%</strong> <strong>nature</strong> but I don't feel like recalculating.&nbsp; That's a lot different than your claim of 66% :).</p>",
    "PostedDate": "2009-10-05T09:32:25.72-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "242241",
    "ThreadId": "52947",
    "Html": "<p>I never said that my numbers were damage dealt, but clearly stated that they were damage taken. :) There is more to consider like priest's shields etc.</p>\r\n<p>Nevertheless this shows that there are fights were magical damage should be taken into account when evaluating if wearing e. g. frost resistance for Hodir is more helpful than wearing besser physical &quot;resistance&quot; gear. One has to check if say 400 frost resistance is better than 3 % avoidance in this case. And I guess it is.</p>",
    "PostedDate": "2009-10-05T09:55:16.85-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "242253",
    "ThreadId": "52947",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>nj0y wrote:</strong><br>\r\n<p>I never said that my numbers were damage dealt, but clearly stated that they were damage taken. :) There is more to consider like priest's shields etc.</p>\r\n<p>Nevertheless this shows that there are fights were magical damage should be taken into account when evaluating if wearing e. g. frost resistance for Hodir is more helpful than wearing besser physical &quot;resistance&quot; gear. One has to check if say 400 frost resistance is better than 3 % avoidance in this case. And I guess it is.</p>\r\n</blockquote>\r\n<p>For Hodir, no, because you can dodge most of the frost damage (it's attached to a weapon swing).&nbsp; But your point in general is sound.&nbsp; Some sort of damage that is only mitigated through resists and talents is good to model and Astrylian agrees.&nbsp; The trouble comes in figuring out how to implement that.&nbsp;</p>\r\n<p>Users will naturally make the mistake of looking at damage taken parses, seeing 30% magical, and putting in 30% magic damage in Rawr.&nbsp; This is so amazingly wrong it's funny and will lead to massive inaccuracy in their gear calculations.</p>\r\n<p>I suspect modeling it like how we have physical swings is probably the best way.&nbsp; X dmg every Y seconds, magical.&nbsp; Perhaps with a check box that says the data is from a parse and thus post-resist/talents.&nbsp; I'm not terribly sure, honestly.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-10-05T10:39:01.24-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "242313",
    "ThreadId": "52947",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>nj0y wrote:</strong><br>\r\n<p>I never said that my numbers were damage dealt, but clearly stated that they were damage taken. :) There is more to consider like priest's shields etc.</p>\r\n<p>Nevertheless this shows that there are fights were magical damage should be taken into account when evaluating if wearing e. g. frost resistance for Hodir is more helpful than wearing besser physical &quot;resistance&quot; gear. One has to check if say 400 frost resistance is better than 3 % avoidance in this case. And I guess it is.</p>\r\n</blockquote>\r\n<p>No, you didn't.&nbsp; But what we're saying is that it's improper to try to compare damage dealt from magic damage and damage taken as physical damage, which is the comparison you're making.</p>\r\n<p>Rawr seems to be modeling physical damage taken correctly.&nbsp; There are plans to implement magical damage taken, resistable damage taken, and burst damage taken.</p>\r\n<p>Yes, bosses deal magical damage.&nbsp; We all agree on that point.&nbsp; But saying 66% when it's closer to 15% is a slightly egregious error.&nbsp; Comparisons must be made with all data being the same &quot;type&quot; of data.&nbsp; Comparing physical damage taken to magical damage dealt is dangerously misleading.</p>",
    "PostedDate": "2009-10-05T14:51:25.603-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "242316",
    "ThreadId": "52947",
    "Html": "<p>That specifically is one of the things I'm trying to do with the BossHandler. Each separate attack that the boss does is added in to an attacks list. Each attack is specified with parameters on the damage value, type, wether it's resistable, reducable, etc. Models would then handle it however they need to per attack. It's a lot more complex than a simple &quot;Incoming Damage&quot; slider with an attack speed on it.</p>",
    "PostedDate": "2009-10-05T15:00:11-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]