[
  {
    "Id": "178082",
    "ThreadId": "52951",
    "Html": "<p>Is there a working model for Feral Cats using FB in their cycle? It seems that even if you choose to have FB in your custom rotation, it will always show the default 5SR/Rake/Rip cycle as the superior. Maybe this is the case, but some people claims that FB in the rotation is higher than a plain rip cycle.</p>\r\n<p>So I'm curious if the current model supports optimal use of FB or not, and if such a model is coming. If not, is there a reason, i e arguments for why Rip cycle is superior?</p>\r\n",
    "PostedDate": "2009-04-10T17:16:23.003-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "178093",
    "ThreadId": "52951",
    "Html": "Yes, FB usage is considered. You can compare the Custom Rotation DPS to Optimal Rotation DPS when you include FB in custom. Typically, it won't change, since there's not enough CP to maintain rip while getting any FBs in. If you do get enough CP to make use of FB, it'll use FB. Rip is far far *far* superior DPS/DPE  to FB, so sacrificing Rip uptime is not worth it. About the only time (typically) that it's worth FBing is during Berserk when you've got a ton of extra CPs, and for Loatheb, where your crit rate nearly guarantees you more CP than you can make use of.",
    "PostedDate": "2009-04-10T18:57:17.99-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "178370",
    "ThreadId": "52951",
    "Html": "<p>However, even with Rip being far superior to FB, sometimes, and with high CPG, it seems like FB is easily more dps than losing just a couple of seconds of Rip. The problem is, in reality, with good gear, there Are situations where you have time to do a FB, without losing any Rip uptime. This doesn't seems to be modeled at all (since you either never use Rip, and you never can get any higher dps than that).</p>\r\n<p>Also, Glyph of Rake for me is worth ~33 dps, which additional supports this theory.</p>\r\n<p>I understand there are different opinions in how the dps rotation should be modeled, but shouldn't at least FB be a part of the optimal rotation, when there's clearly (?) situations where you can add an extra FB without losing Rip uptime?</p>\r\n",
    "PostedDate": "2009-04-12T13:05:03.943-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "178378",
    "ThreadId": "52951",
    "Html": "Yes and no. If it costs you Rip uptime, it's pretty much not worth it. The problem is that unless you do a 5cp bite, it would have been better to just keep Shredding. And 5 extra cp is quite alot to fit into a cycle. There can be times when you get really lucky with crits, right after refreshing SR and Rip, and have TF up, where it would indeed be benefitial to FB+TF. And yes, Rawr does miss those. But those situations are much rarer than some people suggest (we're talking once to three times per a fight, typically). And the damage increase of FB over Shred is really not that much.<div><br></div><div>Bottom line is that since Rawr deals with averages, it doesn't use FB during those occasional extreme lucky streaks. However, it also doesn't account for extreme unlucky streaks either, where you lose DoT uptime just due to getting no crits for 30sec. I normally don't like just hand-waving over things like this, but this one really is an extremely minor issue. </div><div><br></div><div>EDIT: Also, Glyph of Rake? What?</div>",
    "PostedDate": "2009-04-12T13:25:00.487-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "178393",
    "ThreadId": "52951",
    "Html": "It seems like a little rip down time can easily be justified, though.&nbsp; I'd expect a 10k+ FB to be well worth losing a tick or two of rip.&nbsp; Say your FB hits for 10k (which I'm pretty sure is rather low, but I'm usually tank spec), and your rip ticks for 2k.&nbsp; Up until 10 seconds of rip down time, that FB did more damage than the rip would have if it was up.&nbsp; I could see 2T8 changing that, or the window becoming too small to bother with once rip can crit and R&amp;T gets nerfed in 3.1, but I'd be extremely surprised if FB couldn't reliably be used for a DPS increase with current mechanics.<br>\r\n",
    "PostedDate": "2009-04-12T15:31:32.743-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "178397",
    "ThreadId": "52951",
    "Html": "...but you would have Shredded instead of FBing there, giving you 8k damage. If you miss even a single tick of Rip, you shouldn't have FB'd in that case.",
    "PostedDate": "2009-04-12T15:44:09.81-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "178408",
    "ThreadId": "52951",
    "Html": "Ah, you're right, I forgot that you'd otherwise be shredding.&nbsp; Even still, though, I think there's some room for rip down time.&nbsp; After a little more research, it looks like good average raid buffed numbers in current BiS are ~7k for shred, ~13k for FB, and ~2k for rip.&nbsp; That puts the break even point at 6 seconds of rip down time.&nbsp; Assuming you can time a TF somewhere in between your FB and the end of that 6 second window, I think it's pretty reasonable to assume that you could get rip back up in time for it to be a DPS increase.&nbsp; FB isn't something you can count on as part of your standard rotation, but I think it's something you can use a lot more than once or twice a fight.<br>\r\n",
    "PostedDate": "2009-04-12T16:15:18.787-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "178409",
    "ThreadId": "52951",
    "Html": "<p>I meant Glyph of Rip. 4 seconds longer duration should allow the rotation for even more FB.</p>\r\n<p>I'm very happy with the answers, since yes, 5 cp FB do occur, even if they are relative rarely.</p>\r\n<p>But on to an actually problem then. My optimal rotation is 6392 compared to FB rotation with 6296, which is very very close. However, the FB rotation dps is unchanged even with 5/5 points in Feral Aggression. And taking 15% damage from FB in account, it seems quite possible for the FB rotation to be optimal rotation. Or am I missing something here?</p>\r\n",
    "PostedDate": "2009-04-12T16:17:14.593-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "178410",
    "ThreadId": "52951",
    "Html": "kbranch, those sound like 3.0 values, not 3.1, where they should be much closer.<div>Mysticum, I'll look into that, it may be that FeralAggression isn't properly affecting FB damage.</div>",
    "PostedDate": "2009-04-12T16:19:29.423-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "178411",
    "ThreadId": "52951",
    "Html": "Yup, I was talking about 3.0 mechanics, sorry if that wasn't clear.&nbsp; It's more an academic argument at this point given that 3.1 is probably a week or so out.&nbsp; I could easily see FB not being worth using in 3.1 outside of extreme streaks of luck.<br>\r\n",
    "PostedDate": "2009-04-12T16:27:17.15-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "178429",
    "ThreadId": "52951",
    "Html": "<p>kbranch: Seems like we all can agree that FB actually IS a dps increase. Whether it's 0 times during a fight or 10 times during a fight, the option to be able to FB is indeed an increase.</p>\r\n<p>With even further improved gear, situations where you can afford a 5 cp FB without losing Rip uptime, seems to be more and more common. Take the 15% dmg from Feral Aggression in account as well, and yeah, even if it's 5 times during a fight, there clearly are situations where it should be used. Just played around in the PTR and with agility gems replacing strength, the crit chance invites to even better CPG. There were even one insane strike where I could FB 2 times without losing a second to Rip. With Glyph of Rip and Glyph of Shred in addition to the T7-2p bonus, situations like theese will not be that uncommon.</p>\r\n<p>Anyway, I'm still very satisfied with Rawr, and the most important thing is, with FB in the cycle or not, stats value and gear weighting will not change radically. At most, I guess ArmPen would be slightly better than Agility with better gear and more damage coming from FB, but they are marginal now, and one piece of gear can change this fact more than FB/Rip cycle I guess.</p>\r\n<p>Thanks for all conclusions in the discussion.</p>\r\n",
    "PostedDate": "2009-04-12T18:00:17.023-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]