[
  {
    "Id": "178188",
    "ThreadId": "52987",
    "Html": "Does Focus Magic (+3% crit) stack with Elemental Oath (+5% crit) &amp; Moonkin Form (+5% crit)?<br>\r\n",
    "PostedDate": "2009-04-11T09:36:49.913-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "178195",
    "ThreadId": "52987",
    "Html": "Yes.",
    "PostedDate": "2009-04-11T10:13:35.997-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "178202",
    "ThreadId": "52987",
    "Html": "Thanks. Are they simply additive ie: both would give +8% or multiplicative ie: both would give +8.15%?<br>\r\n<br>\r\nFor my second &quot;I'm clueless about mages&quot; question. Is Amplify Magic in 3.1 castable on bosses as the tooltip suggests it isn't. ie: I can't see how you can benefit from extra spellpower if you can't debuff the boss with this ability. The buff is coded as bonus spellpower and thus shows up in Enhance model (we use attackpower &amp; spellpower). In the buffs section it specifically says (on target, not on self) so I'm assuming that means on boss?<br>\r\n<br>\r\nConfused.<br>\r\n",
    "PostedDate": "2009-04-11T10:41:33.46-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "178204",
    "ThreadId": "52987",
    "Html": "Its there for healers since it can easily be cast on who you are healing.<br>\r\n",
    "PostedDate": "2009-04-11T10:45:34.977-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "178217",
    "ThreadId": "52987",
    "Html": "If you can apply Amplify Magic to your target, you can benefit from it.<div><br></div><div>*Typically* that's just for healers since they target friendlies, but not always.</div><div><br></div><div>If we had an easy way to make that only show up for healers, we would. I'd probably add a new stat &quot;SpellPowerAgainstFriendlies&quot;, for that buff, and make all the healing models implement it. If someone wants to do that, and update all of the GetCharacterStats() methods in healing models to add SpellPowerAgainstFriendlies to the statsTotal.SpellPower, that'd be cool.</div>",
    "PostedDate": "2009-04-11T11:50:30.857-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "178233",
    "ThreadId": "52987",
    "Html": "Hmm so really I should be filtering out Apply Magic buff from appearing in buffs list for Enhance model.&nbsp; <br>\r\n",
    "PostedDate": "2009-04-11T12:51:11.983-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "178261",
    "ThreadId": "52987",
    "Html": "There are certain fights where the mechanics of the fight enable a mage to cast Amplify Magic on a DPS target in a specific phase, but those are probably not the type of fights (or phases) that you'd probably end up modeling. For example, my guild has mages cast Amplify Magic on the Understudies in the Instructor Razuvious fight to maximize the healing they get.<br>\r\n",
    "PostedDate": "2009-04-11T16:12:15.747-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]