[
  {
    "Id": "178603",
    "ThreadId": "53111",
    "Html": "Hi, I would like an option in optimizer in Tankadin module to specify that I want to cap only hit rating. Currently, if I specify &quot;Chance to hit &gt;= 90&quot; optimizer tries to mix and match hit and expertise, while I only need to be hit capped to pull boss reliably (most spells base off hit and ignore expertise completely). I would like an option to specify &quot;hit rating &gt;= 263&quot; or &quot;special attack miss chance &lt;= 0&quot; or something among these lines. Also it would be nice if hit was indicated as a separate entity in Basic stats.<br>\r\n",
    "PostedDate": "2009-04-13T10:24:43.493-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "180259",
    "ThreadId": "53111",
    "Html": "Seconded, in case the number of folks who want something matters. =)<br>\r\n<br>\r\nPersonally, I like the &quot;special attack miss chance &lt;= 0&quot; option as it would (presumably) automatically take any +hit buffs from the raid into account.<br>\r\n",
    "PostedDate": "2009-04-16T12:36:26.053-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "180285",
    "ThreadId": "53111",
    "Html": "I don't know all the details of the Tank modules, but from what I understand:<br>\r\nNot being expertise capped, results in parries by the boss. These parries affect the boss' attack speed, which in turn increases his dps and is equavalent to a drop in mitigation.<br>\r\n<br>\r\nThus even if you constrain special attack miss chance (I agree that would be the better constraint to use to include buffs, instead of haste rating) for threat reasons, the optimiser might still try to add expertise for mitigation reasons.<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n",
    "PostedDate": "2009-04-16T13:46:43.393-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "180402",
    "ThreadId": "53111",
    "Html": "<p>Added % Hit Chance and % Spell Hit Chance to optimizable values.</p>\r\n<p>Just be sure you know what hit chance your abilities actually use: (Tanking abilities)</p>\r\n<p><em>Spell Hit:</em></p>\r\n<p>Seal of Vengeance, Holy Vengeance, Exorcism, Holy Wrath, Holy Shield, Retribution Aura, every single tick of Consecration, Hand of Reckoning, Righteous Defense.</p>\r\n<p><em>One-Handed melee Hit:</em></p>\r\n<p>Everything else.</p>\r\n<p><em>Abilities that can be avoided: (Expertise)</em></p>\r\n<p>Hammer of the Righteous and auto attacks.</p>\r\n<p>The mitigation gain from expertise is miniscule but present. Enabling the 'Use Parry Haste' option will make the optimizer choose an item with expertise over an item without, if the mitigation gain is big enough.<br>\r\n</p>\r\n",
    "PostedDate": "2009-04-16T18:56:31.947-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "180406",
    "ThreadId": "53111",
    "Html": "Thanks!&nbsp; And yes, I knew it was mostly spell hit, but thanks for giving us the list so I'm certain. =)<br>\r\n",
    "PostedDate": "2009-04-16T18:59:25.02-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "494098",
    "ThreadId": "53111",
    "Html": "<p>Stupid question here... I'm a pally tank... what value do I need to put in the spell % hit box to make sure it returns a combo of items that make me hit capped (263 hit rating)? Or do I need to input something in a field other than %spell hit? Thanks!</p>",
    "PostedDate": "2010-09-15T14:19:23.65-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "494108",
    "ThreadId": "53111",
    "Html": "<p>And the winner of Necro Poster of the year IS!!!</p>\r\n<p>Answering on other thread</p>",
    "PostedDate": "2010-09-15T14:32:58.897-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "494197",
    "ThreadId": "53111",
    "Html": "<p>One year and 5 months, to the <em>day</em>.&nbsp; Impressive.</p>",
    "PostedDate": "2010-09-15T18:03:08.557-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]