[
  {
    "Id": "178864",
    "ThreadId": "53179",
    "Html": "With 3.1 coming out we have decided to push out a new release. We expect there might be quite a few problems as exact mechanics are figured out on live so expect new versions to be more frequent in the coming weeks. If you notice that something isn't working as expected use the Issue Tracker and as usual include the affected character xml if appropriate. But before you make a new issue report make sure it is actually something we don't know about, search is your friend.\r\n",
    "PostedDate": "2009-04-14T00:55:07.363-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "179029",
    "ThreadId": "53179",
    "Html": "I've been grabbing builds up through late afternoon yesterday.  So I was thrilled to see that 2.2.0.7 showed up in the wee hours of the morning, that is until I went to open my character's xml file.  *WHAM*<br>\r\n<br>\r\nUnable to open previous versions' xml files?  Are you kidding me?  Why did you do this?<br>\r\n<br>\r\nDo you have any idea how many of these xml files I have at this point?  I have them dated to show gear progression.  I have wishlist versions.  I have different optimize options and how they'd look.  I have PvP vs PvE.  And that's just one character.  I have multiple characters both mine and other people I've looked up.  Guildmates, friends, etc.  All of them current and all of them pertinent.<br>\r\n<br>\r\nAnd now all of them useless unless I go back to yesterday's 2.2.0b6 build?  I have to re-import from Armory?  That's <span style=\"text-decoration:underline\">not an option</span> in most of these cases.  What options do we have to upgrade these files to utilize 2.2.0.7?<br>\r\n<br>\r\nSeriously.\r\n",
    "PostedDate": "2009-04-14T07:24:36.52-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "179039",
    "ThreadId": "53179",
    "Html": "moonkin rawr shows wrath eclipse at 10%, it's 30%, not 10%.  pretty big thing to miss considering it may or may not change rotation.\r\n",
    "PostedDate": "2009-04-14T07:40:36.493-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "179097",
    "ThreadId": "53179",
    "Html": "I didn't update the talent descriptions for 3.1, but the math has been changed.&nbsp; Next time, read the code or look through the source control changelog, I try to be verbose with my checkins so you can understand exactly what I changed.<br>\r\n",
    "PostedDate": "2009-04-14T09:22:24.863-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "179168",
    "ThreadId": "53179",
    "Html": "Character xml files should still be compatible with 2.2.0.b6. What was the error you got? Which model? Open new issue?\r\n",
    "PostedDate": "2009-04-14T11:59:50.56-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "179572",
    "ThreadId": "53179",
    "Html": "Character xml files were compatible for all builds of 2.2.0b6 but when you went to open them in 2.2.0.7 you got a hardcoded msg window popping up that the xml file was from a previous version; sorry; you need to re-import from Armory.  It might have been related to the image problems in 2.2.0.7.  I was able to open the xml files today using 2.2.0.8 and am a lot happier.  Thanks.\r\n",
    "PostedDate": "2009-04-15T06:35:41.507-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]