[
  {
    "Id": "179337",
    "ThreadId": "53303",
    "Html": "Hey all,<div> 3.1 came out today, and we released what we have as v2.2.0.7. Unfortunately, it's got some issues. We had been hoping that we had an extra week, so we tried to shove in a few more new features, and didn't end up having enough time to polish everything the way we like. Sorry for that. Additionally, on a personal note, I've been in the middle of moving and switching to a new job (as I write this, I'm sitting in my completely empty house, waiting for movers to figure out what they're doing, and finally deliver my stuff to my new house), so I've been unavailable to lead the team, and keep things in control. So, I apologize for the bugginess of v2.2.0.7. Rest assured, we are working tirelessly to get things cleaned up, and will be releasing new versions *daily* for the rest of the week. Please don't lose hope, keep downloading the updates, and we'll get them out as fast as possible.</div><div><br></div><div> Some major things of note:</div><div><ul id=false>    <li>You will probably run into apparent 'hangs' in v2.2.0.7. Unfortunately, the v2.2.0.7 release didn't include images for many talents and items, and so when you launch Rawr, it has to download them. Combined with the Armory being super slow today, it makes it look like Rawr is hung. We'll be sure to include all the relevant images in v2.2.0.8, so you won't run into this issue. In the mean time, just wait through these pauses, as they'll only happen the first time each image is needed.</li>    <li>Priest models haven't been updated to 3.1, due to our awesome priest dev being without internet access for the past couple weeks. He'll be back shortly, and have everything updated ASAP. Please be patient.</li>    <li>TankDK and Hunter were not included in v2.2.0.7, since they're not updated at all, and had major problems anyway. We have a few people who hope to work on them soon, but we could really use more help on these models, as well as Rogue. If there are any TankDKs, Hunters, or Rogues out there, who also happen to be C# programmers with some spare time, we could really use your help.</li>    <li>Various proc/use effects aren't valued/modeled correctly in some models. We created a new (much better) system for handling these special effects, at the last minute, and haven't had time to finish implementing it in all the models. So we're currently in an odd transition state where it doesn't quite work in some models. We're working on it, and will have them working soon.</li></ul><div>From the whole Rawr Team, thanks for your patience.</div></div>",
    "PostedDate": "2009-04-14T19:43:59.197-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "179384",
    "ThreadId": "53303",
    "Html": "Also, looks like Blizz just updated the armory for 3.1, which broke our armory support. We're working on it.",
    "PostedDate": "2009-04-14T22:51:34.137-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "179482",
    "ThreadId": "53303",
    "Html": "2.2.0.8 has been released, I think we have armory support fully functional again.\r\n",
    "PostedDate": "2009-04-15T02:39:20.38-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "179507",
    "ThreadId": "53303",
    "Html": "I think Kavan, the european armory hasn't received this upgrade yet.&nbsp; the <span>v2.2.0.8 release spits out erros about &quot;being unable to load things&quot; from the armory</span><br>\r\n",
    "PostedDate": "2009-04-15T03:34:47.173-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "179512",
    "ThreadId": "53303",
    "Html": "I'm the Priest developer, and I'm sorry for the Delay, and I hope to have it all working atleast as good as before, before the end of this week.<br>\r\n",
    "PostedDate": "2009-04-15T03:53:51.2-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "179516",
    "ThreadId": "53303",
    "Html": "TNSe - I took the liberty whilst bored at work to do all the Priest Talent tree updates for you. So hopefully that will assist reducing your workload. I had to remove instances of ImprovedHolyConcentration which no longer exists although I left the previous code as a comment. In the vicinity there was also a line that added spell crit from test of faith, I commented that out too as Test of Faith no longer gives bonus crit. I trust this is in order.<br>\r\n<br>\r\nFor the record my main for 2 years prior to levelling an Enh Shammy was a Holy Priest, he's still an active alt so I take an active interest in Holy Priest theorycrafting if you need a hand with any of it.<br>\r\n",
    "PostedDate": "2009-04-15T04:06:41.633-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "179595",
    "ThreadId": "53303",
    "Html": "Mage model:<br>\r\nI'm seeing a discrepency between the numbers I was seeing in 2.2.0b6 (rev33091) and 2.2.0.8.  In 2.2.0b6, I had Automatic Armor enabled, Molten Armor applied and Molten Armor Glyph checked.  My Crit/Hit/Haste were 31.15% Crit/440 Crit Rating; 14.09%/291 Hit Rating; 434 Haste Rating.  That was consistent with what I saw in the game/Armory.  Under 2.2.0.8 (and 2.2.0.7), I'm seeing the same Hit perc/rating and Haste but my Crit is now 32.53%/735.35 Crit Rating.  Same options checked as before.  And it is inconsistent with the game/Armory values.<br>\r\n<br>\r\n",
    "PostedDate": "2009-04-15T07:10:30.583-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "179758",
    "ThreadId": "53303",
    "Html": "Molten armor. If that is not the case please attach the character xml in a new issue.\r\n",
    "PostedDate": "2009-04-15T11:57:26.527-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "179772",
    "ThreadId": "53303",
    "Html": "Awesome you are back TNSe :)<br>\r\n<br>\r\nCan't wait to get an updated holy priest model. I will be watching the source repository the coming days :)<br>\r\n",
    "PostedDate": "2009-04-15T12:27:26.6-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "180302",
    "ThreadId": "53303",
    "Html": "Well, I'm back, and work has started :P\r\n",
    "PostedDate": "2009-04-16T14:12:29.45-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "180396",
    "ThreadId": "53303",
    "Html": "Druid model is loading the pre-3.1 talent tree.<br>\r\n",
    "PostedDate": "2009-04-16T18:27:20.31-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]