[
  {
    "Id": "179643",
    "ThreadId": "53377",
    "Html": "On the whole, I like Rawr a whole bunch, as it is definitely miles ahead of anything else at the calculations it does. However, I find there are still a few problems with it in my personal use.<br>\r\n<br>\r\n1. I think the item cache was a little too seriously weeded out. At the very least I'd like to see quest rewards 70-80 in there, if not including every single item. Maybe I'm missing the function to add a bunch of items, but with the number of lower level items I want to evaluate the simple add function under Tools -&gt; Edit Items doesn't really do the trick.<br>\r\n<br>\r\n2. When I switch models, it's annoying how I have to recheck the buffs menu. IMO, buffs should be part of the core Rawr framework if possible so it can remember all (not just some) buffs across models.<br>\r\n<br>\r\n3. Again, relating to switching models: This may have been improved recently, but previously, if you were granted the use of additional weapons through a talent (The only two that do this, I think, are Titan's Grip in fury and Dual Wield in enhancement) switching builds would then falsely consider your weapon options as if you still had those talents. Not sure where the problem lies on this one, unfortunately, but it tends to curb my use a little.<br>\r\n<br>\r\nI want to see Rawr be the best program it can be, which is the reason why I bring up these concerns of mine.<br>\r\n",
    "PostedDate": "2009-04-15T08:26:11.767-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "180844",
    "ThreadId": "53377",
    "Html": "We too want to see Rawr be the best program it can be. :)<div><br></div><div>1. The more items are in the item cache, the slower Rawr performs for everyone. It's just not worth everyone's time to have 70 quest items in the default item cache. So, the cutoff of level 77+ blues (I think? Might be 78...) was chosen, due to that being what you'd be looking at as minimum for an 80. However, I *believe* you can add a bunch of items, including lower level quest items, quite easily, by just loading your lower level character from the Armory, and using Tools &gt; Load Potential Upgrades from Armory/Wowhead.</div><div><br></div><div>2. I'm not sure I understand. In which circumstances are you commonly switching models for the same character? Cat/Bear is the one situation I know is the most common, and I've seen HPriest/SPriest swaps decently often as well. Regardless, I don't understand the problem. Buffs are indeed a core part of the Rawr framework, and all buffs (not just some) are remembered across models. Can you clarify with an example?</div><div><br></div><div>3. Can you give clear repro steps for this?</div>",
    "PostedDate": "2009-04-18T11:28:53.32-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]