[
  {
    "Id": "180323",
    "ThreadId": "53570",
    "Html": "So, i got character profiler, i did the scan,  logged out of WoW..(not sure if you need to , but usually with addons they dont save unless you do, so did it anyways to be safe)<br>\r\n<br>\r\nI opened Rawr.  I loaded character using character profiler...i ran the optimizer, and i checked the regem and reenchant boxes...as this is supposed to reenchant and regem your items to be more efficient for what you are optimizing it for, i believe.  Optimizer came out...and clearly marked one of helms as the optimized use....when clearly one of the other helms in my bag was better, and the build upgrade list even showed it better then what it optimized me for?<br>\r\n<br>\r\nAnother thing...when char profiler is used to open your character...how come it doesnt mark all iterations of an item...say hood of exodus...it marks only the one specific one i have, but not the other ones that are listed with differnt gemmings and enchants?  For example, I used my  hood of exodus for tanking, but im going kitty for dual spec now, cuz my main role is healing once again....so i dont really need to tank, as the guild has plenty of tanks. So anyways, it wouldnt optimize the hat at all...just showed the only option as the one with the stamina meta, it didnt switch it to the agi and crit meta which would of made it superior for kitty dps then the other helm it offered me? I thought when you checked the regem and reenchant buttons, it ignores current enchants and gem choices, and optimizes the item as if it had the better gemmings and enchants for your spec you are optimizing for?\r\n",
    "PostedDate": "2009-04-16T14:55:27.37-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "180346",
    "ThreadId": "53570",
    "Html": "Did you have enchants/gems marked as available? If you're not sure what is wrong it's best to open a new issue and attach your character xml.\r\n",
    "PostedDate": "2009-04-16T16:17:44.63-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "180400",
    "ThreadId": "53570",
    "Html": "Actually Kavan, he probably doesn't need to open an issue because I think you hit the nail right on the head.  I'm guessing he didn't mark any enchants as available.<br>\r\n<br>\r\nOne thing that is a bit confusing about Rawr is that you can have two items selected with specific enchants and even though one appears higher on the list than the other, the optimizer does not choose it.  This is because the enchant on the item is not taken into consideration when placing items on the list.  It assumes that all items on the list have whatever the current active enchant is.  The optimizer, on the other hand, does take the specific item enchants in mind, so it may choose something that appears lower just because it has a more favorable enchant.<br>\r\n<br>\r\nIn terms of why CharacterProfiler locks items to a specific gemming / enchant is exactly what you explained.  Sometimes you tank, sometimes you dps.  Rawr would be rather frustrating if it told you to regem all your tanking gear for DPS (assuming it's better).  So by default it locks things in their current configuration and you have the option to override the regemming / reenchanting just as you have.<br>\r\n<br>\r\nJust make sure to pick an enchant or two and you should be golden.<br>\r\n<br>\r\nChar<br>\r\n",
    "PostedDate": "2009-04-16T18:51:45.82-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]