[
  {
    "Id": "180661",
    "ThreadId": "53668",
    "Html": "Hey, I'm an experienced C# developer, and a long time fan of Rawr &amp; WoW theorycrafting. I became too attached to rawr and now find myself helpless without it!! I would like to help out with the development / updating of rawr. I have an 80 DK, Priest, and Warrior, so I'd probably be able to help out most with those models. Priest and warrior seem to be coming along fine, but DK is lagging a little :P. <div><br></div><div>I have both general suggestions, or specific changes to code that I would like to recommend. I'm not sure that this discussion board is the best place to do it though. Since all of the models I'm looking at already have developers, it might be easiest for me to just submit my suggested changes to them?</div><div><br></div><div>For example: In Rawr.Base</div><div>Since Lichborne is no longer all that great of a talent for dk tanks, lets change</div><div>&quot;  if (character.DeathKnightTalents.Lichborne &gt; 0) character.CurrentModel = &quot;TankDK&quot;;   &quot;<br></div><div>to </div><div>&quot;  if (character.DeathKnightTalents.Anticipation &gt; 0) character.CurrentModel = &quot;TankDK&quot;;  &quot;</div><div>I haven't seen any DK Tanking talent builds that dont include anticipation.</div><div><br></div><div>In the TankDK module we need to add an additional stat for damage reduction, not just damage reduction by armor. especially with the new blade barrier and frost presence changes.</div><div><br></div><div>Both DK modules are still missing glyph support.</div><div><br></div><div>DPS DK module is missing support for a variety of rotations / builds, particularly dual wield.</div><div><br></div><div>Once the DPS DK module catches up more, it might be better to copy the DPS dk calculations into the TankDK module for use in threat calculations.</div><div><br></div><div>I'd be happy to help with all of these and more, just let me know how / who to get in touch with.</div>",
    "PostedDate": "2009-04-17T12:16:18.477-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "180791",
    "ThreadId": "53668",
    "Html": "Feel free to do any changes to the TankDK Module. Just drop me a line on what you are doing.<br>\r\nAsk Astryl for dev access or send patches to me and i'll merge them.<br>\r\n<br>\r\nIf you want to have a module for yourself, you could take over hunter (or rogue, but i'm not responsible for that one).<br>\r\n",
    "PostedDate": "2009-04-18T03:18:54.233-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "180869",
    "ThreadId": "53668",
    "Html": "Sounds good, I'll try to stick to sending you any changes I want to make, so that you can look over them if you want before they get updated.<div><br></div><div>Also, how can I get access to edit some of the help wiki pages? I was thinking it might be a good idea to outline the way some of the calculations are being done (like finding the % Miss) , perhaps on the DK Tank Model's page.</div>",
    "PostedDate": "2009-04-18T14:21:12.367-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "180894",
    "ThreadId": "53668",
    "Html": "You need dev access to edit the wiki.<br>\r\n",
    "PostedDate": "2009-04-18T16:45:22.483-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "186025",
    "ThreadId": "53668",
    "Html": "Got back to Rawr again after a long absence.&nbsp; I am familiar with C# (and Software QA Engineer by trade) and would like to contribute if you still need the help.&nbsp; <br>\r\nI'm replying to this thread because I see that <a href=\"http://www.codeplex.com/site/users/view/xbobohobox\" id=\"ctl00_ctl00_MasterContent_Content_PostRepeater_ctl04_UserNameLink\">xbobohobox</a> is contributing to TankDK.&nbsp; The launchpage of the app is asking for help in that module.&nbsp; Would you still like contributions in that area?<br>\r\n<br>\r\nAlso are there any guidelines for how the code is to be written/formatted (EG dev best-practices or variable naming conventions) or test code/unit tests to help ensure quality code?<br>\r\n<br>\r\nI currently have an 80 DK that I've been gearing up for Tanking as well as an 80 priest as my 2 mains.<br>\r\n<br>\r\nThank you.<br>\r\n<br>\r\nShazear<br>\r\nAKA<br>\r\nShizukana<br>\r\nUnShiz<br>\r\n&lt;Veterans of the Phoenix&gt;<br>\r\nMalygos-US<br>\r\n",
    "PostedDate": "2009-05-01T15:45:31.707-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "186061",
    "ThreadId": "53668",
    "Html": "Hey. Yeah, send me an IM, and lets chat about it. cnervig@hotmail.com on MSN.",
    "PostedDate": "2009-05-01T19:41:48.963-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]