[
  {
    "Id": "181001",
    "ThreadId": "53769",
    "Html": "Since the Nightsong 2 piece set bonus adds to the Swiftmend affect and Swiftmend is not modelled in Rawr.Tree at this stage, I was wondering about the priority of adding this.<br>\r\n<br>\r\nI don't know what theorycrafting has been done for Swiftmend.<br>\r\n<br>\r\nSo my question to users of the Rawr.Tree model would be:<br>\r\nAre you using Swiftmend to affect your throughput or using it for bursts when needed?<br>\r\n<br>\r\nWithout the set bonus, swiftmend would only increase healing, if:<br>\r\n-it prevents another healer from topping up, instead of the slow HoT healing up. (usually only a consideration in raid healing situations). <br>\r\n-if you reapply the HoT (glyph bypasses this part).<br>\r\n<br>\r\nIf your on raid healing, would the swiftmend go to a raid target in trouble or still be used on the tank?<br>\r\n<br>\r\nAre you using Swiftmend when its needed/off cooldown or smart casting timing it such that a particular HoT gets consumed (refreshing the other just before for example)?<br>\r\n<br>\r\nIdeally I would like to include Swiftmend to some of the entries in the spell rotations list. But not sure if I need to add extra controls for that (as well).<br>\r\n<br>\r\n<br>\r\n",
    "PostedDate": "2009-04-19T09:28:42.747-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "182457",
    "ThreadId": "53769",
    "Html": "Not only Swiftmend, but the whole method of raid healing for Druids has changed in WotLK.&nbsp; Now Resto Druids make for very powerful raid healers.&nbsp; The basic rotation is to spam Rejuv on roughly half the raid with Wild Growth rotated in and Swiftmend used to burst-heal.&nbsp; Nourish and NS+HT are the other burst heals we use primaryil as well.&nbsp; The main glyph choice for this this role and method of healing are Swiftmend, Nourish and Wild Growth.&nbsp; This also requires that the druid have the Idol of Awakening.&nbsp; http://www.wowhead.com/?item=40342<br>\r\n<br>\r\nThere are also some Druids who instead of spamming Rejuv also mix in a fair amount of Regrowth.&nbsp; Both are because the long HoT time covers a huge amount of raid damage that is present in most Ulduar fights, as well as the burst healing required at the same time on a handful of people.<br>\r\n<br>\r\n<br>\r\nAnyway, I hope this helps whichever developer is doing the Tree modeling, because I'd love to be able to see numbers that better reflect my spell usage in Ulduar.<br>\r\n",
    "PostedDate": "2009-04-22T10:52:58.617-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "182964",
    "ThreadId": "53769",
    "Html": "I agree that Druid raid healing, using Rejuv seems to gve impressive numbers in the current model (assumes no overhealing). <br>\r\nThe Idol is also working in the current model.<br>\r\nWild Growth is catered for, but in order to add its healing to the healing numbers, I will need advice on what level of overhealing to include (I'm reluctant to just blankly say all 5 (or 6) targets will get no overhealing).<br>\r\nThe cooldown on NS is 3 minutes and saves you 2 sec of cast time each CD. Is this worthwhile modelling?<br>\r\nFor mixing Nourish and Rejuv raid healing, I will need some guidance on what ratios to use and how frequently the nourish will land on a raid member with a HoT active (current model assumes tanks have HoTs to give nourish bonus, while raid doesn't).<br>\r\n<br>\r\nHopefully the numbers from the current model aren't that way off. (Or the changes to get it accurate will not be difficult.)<br>\r\nSo if you or other tree healers have additional info, to help me get the numbers where you want them, please let me know.<br>\r\n<br>\r\n",
    "PostedDate": "2009-04-23T12:22:25.587-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "183344",
    "ThreadId": "53769",
    "Html": "Druids are powerful as both tank and raid healers, so the actual assignment will depend heavily on a guild's healing roster.&nbsp; In my guild we have three very awesome holy paladins, so they cover tank healing, and we are short on shamans so the druids often are raid healers.&nbsp; <br>\r\n<br>\r\nI have the WG glyph, and with 6 targets, in Ulduar 25man now I am seeing probably 90% of my WG casts do hit all 6 targets.&nbsp; Overhealing is pretty low on the heavy raid damage fights for our guild because we have so few shamans and others cutting off our HoT healing potential.&nbsp;&nbsp; <br>\r\n<br>\r\nI have also tested the Rejuv glyph our first week in Ulduar and found that it provided roughly two to three percent of my overall healing for each boss and the raid in general when I was acting as a rejuv-spam raid healer.<br>\r\n<br>\r\nAs for Nourish, as a raid healer now I am not at all focusing on using Nourish with people with a HoT.&nbsp; For me, in the fast paced Ulduar fights I am worried more about making sure the next guy has a HoT, and if I need to save someone's life I use Swiftmend first, NS+HT second, and maybe Nourish or even Regrowth third.&nbsp; The Regrowth is nice because it leaves another HoT for the next wave of damage incoming.&nbsp;&nbsp; If I have spare GCD's I try to keep Rejuv and Regrowth on the tank(s) to provide a Swiftmend target for myself or my other druids.&nbsp; I should note though that I am trying to get more used to Nourish usage with raid healing, so I might change my mind in the next couple weeks, but right now this is how I am prioritizing my heals.&nbsp;&nbsp; <br>\r\n<br>\r\n<br>\r\nHere are my WWS reports (my Druid's name is Orin), they finally fixed the system to handle Ulduar logs, so feel free to bookmark mine if you want.&nbsp; I will continue to upload further logs as I have them.&nbsp; Hopefully these are helpful for you.<br>\r\nhttp://wowwebstats.com/n625igrajq4iy<br>\r\n<br>\r\n<br>\r\nedit: Here is my Armory so you can see my gear, talents, glyphs, etc. <br>\r\nhttp://www.wowarmory.com/character-sheet.xml?r=Twisting+Nether&amp;n=orin<br>\r\n<br>\r\n",
    "PostedDate": "2009-04-24T11:19:53.517-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "183399",
    "ThreadId": "53769",
    "Html": "Anyone know if WWS reports includes overhealing from HoT ticks that don't have any effective healing? (Last time I checked HoTs didn't show up on the combat log at all, if the target is already at full health, or was that changed recently?).<br>\r\n<br>\r\nOn the assumption that overhealing is properly reported, the Wild Growth over heal of 3%, seems in your case less than your average overhealing from other spells, so I'm taking the chance and just adding the full effect of the Wild Growth heals to the HPS scores. (Patch 33486). If the overhealing isn't being reported properly, this might result in inflated numbers.<br>\r\n<br>\r\nA quick look at Swiftmend on the overall charts, shows about 5% healing coming from there. Based on just this, I'm not sure if it is worthwhile modelling. I can think it might affect your mana usage very slightly (MPS of Swiftmend vs Primary Heal) and add some value to crit (Rejuv alone doesn't crit), but other than Glyph, Set Bonus and Swiftmend Talent value, I don't think it will affect gear choices, if the healing contribution is so low. But I'll try thinking about a way to model this. <br>\r\n<br>\r\nAny further inputs are welcome. <br>\r\n",
    "PostedDate": "2009-04-24T13:47:52.367-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]