[
  {
    "Id": "180974",
    "ThreadId": "53765",
    "Html": "When looking for that &quot;next&quot; best piece of gear, sure would be nice to have a visual identifier in your comparisons list.   You know, is this from a quest, profession, etc.  I do see the categoraization in the filters, but you have to diddle with it <span style=\"text-decoration:underline\">every time</span>...  Now, I could just not be seeing it in the interface, I am relatively new to rawr.  One of my previous preferred gear tools, maxdps, uses an incredibly intuitive categorization on their gear, you can tell at a glance as you look down the items list whether the gear is a drop from H OK or pvp or a quest...\r\n",
    "PostedDate": "2009-04-19T07:35:54.013-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "181018",
    "ThreadId": "53765",
    "Html": "It's in the tooltip of the items, &quot;Drops from Patchwerk, in Heroic Naxxramas&quot; for example.",
    "PostedDate": "2009-04-19T10:34:05.41-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "181105",
    "ThreadId": "53765",
    "Html": "I agree with this one... I wouldn't consider a tool tip &quot;intuitive&quot; :)  It seems a shame to waste all this screen space on the horizontal bars... you could cut that to 50% and still get the point across, and use that additonal space for other info.  Of course you'd have to build a source text parser, which we've talked about before.\r\n",
    "PostedDate": "2009-04-19T20:56:46.257-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "181402",
    "ThreadId": "53765",
    "Html": "Would be really helpful for me if there was a feature that would allow me to select the boss we're fighting and it would automatically run the &quot;Build Upgrade List&quot; function and filter out drops only from that boss.<br>\r\n<br>\r\nAlso, all the 3.1 drops say &quot;Location Unknown.&quot; Any idea when that will be updated?<br>\r\n",
    "PostedDate": "2009-04-20T10:37:44.547-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "181532",
    "ThreadId": "53765",
    "Html": "Like many users of Rawr, my introduction to gear lists was MaxDPS. I really liked how the site made it easy to figure out what you wanted and how to get it. I haven't been back to MaxDPS in a very long time, but I often find myself missing the ability to easily visually distinguish between item sources.<br>\r\n<br>\r\nFor example, I recently realized (to my dismay) that there was a ring that dropped in one of the heroics that given my current gear/etc was ranked higher than the rings that I was wearing. This may have been the case for some time, but if there was a column displayed (or the ability to choose whether or not the column was displayed) that would let me know whether the source of items was world drops, 5, 10, etc (i.e. the classification system used by MaxDPS is worthy of emulation IMHO), that would make it very easy to make quick decisions about what to grind next.<br>\r\n<br>\r\nIdeally this column would not only be a visual indicator, but also be filterable.<br>\r\n<br>\r\nAs long as I am getting dreamy, here is another use case that Rawr could fulfill better: I am going into a raid and want to know what gear upgrades are available to me there and how well they rank up (i.e. there are two rings in Nax-25 that are ranked #3 and  #7 respectively for you that are upgrades). When raids are trying to be very quick and efficient re: loot distribution, you need a list in advance of the gear you want because you don't have time to go to Rawr, select the proper slot, and search whether or not the item is an upgrade or not. I've been doing this by hand, but a report would be *awesome*<br>\r\n<br>\r\n",
    "PostedDate": "2009-04-20T15:34:06.043-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "182142",
    "ThreadId": "53765",
    "Html": "Taking any sort of cue from MaxDPS is typically a terrible idea, but in this case, I agree, we could have some sort of icon, or small text signifying the source, without viewing the tooltip. We'll look into the best way to do this. I really doubt that it would be especially filterable; that data already is filterable.",
    "PostedDate": "2009-04-21T22:35:04.687-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "185941",
    "ThreadId": "53765",
    "Html": "Thank you for your consideration.  And I do agree, MaxDPS is pretty broken- that's why I'm here. :-)  What you suggests sounds right in line with what I'm looking for.\r\n",
    "PostedDate": "2009-05-01T10:20:51.727-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]