[
  {
    "Id": "180999",
    "ThreadId": "53768",
    "Html": "I apologize if this was already talked about, I looked for it but I couldn't find anything similar, also read the readme but didn't find anything there either. I'm probably doing something stupid here but I've been running RAWR for a few months and never saw this until the latest release.<br>\r\n<br>\r\nI am running 2.2.0.9 and the full list of item comparions on the right has gone blank. It only lists what I have equiped. This character is a mage. If I switch to another frame like say Hunter, it lists all the Hunter gear just fine. When I select back to Mage it's all blank. If I start a new character, select Mage, blank, pull a mage from the armory, blank. See where I'm going here? It seems to have lost the ability to show the comparison list of the Mage frame.<br>\r\n<br>\r\nI download it again, reinstalled, (ie rewrote over everything) and still have the same problem. I checked all my filters and they seem ok to me. All the items are actually in the unit database and I have updated to the latest .NET framework. If I load the same character in an older version 2.1.9 it's fine. <br>\r\n<br>\r\nEDIT: Forgot to mention all the previous items I selected for optimization still are used in the optimization process but obviously now I can not select any new items for optimization.\r\n",
    "PostedDate": "2009-04-19T09:20:40.453-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "181020",
    "ThreadId": "53768",
    "Html": "Sounds like you manually disabled all of your Gemming Templates. Delete your GemmingTemplates.xml file to revert to defaults, or just use Tools &gt; Edit Gemming Templates, and reenable whichever are appropriate for you.",
    "PostedDate": "2009-04-19T10:36:13.593-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "181022",
    "ThreadId": "53768",
    "Html": "Ha! Yup that did it! Wow, thanks, man I would have never connected the two.\r\n",
    "PostedDate": "2009-04-19T10:39:49.977-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]