[
  {
    "Id": "181580",
    "ThreadId": "53927",
    "Html": "The update is on-the-go but may be a while beacuse of all the missing features including: <div><ul id=false>    <li>About 15 talents that were not implemented</li>    <li>Glyphs </li>    <li>Pet trees </li>    <li>Each pet family's unique skill.</li></ul></div><div> I will not be releasing it until I am sure it is accurate to within 1% of actual or if there's a huge out-crying for a partial update</div>",
    "PostedDate": "2009-04-20T21:12:02.333-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "183371",
    "ThreadId": "53927",
    "Html": "Update on the update: <div><ul id=false>    <li>There are now two of us working on the update since it is so big.</li>    <li>Pet DPS is out by 100% so massive changes coming.</li>    <li>Hunter DPS is out by about 10%-15% depending on talents and buffs.</li></ul><div>Also since I've had to include icons and backgrounds for the trees as resources (can't be grabbed from Armory since it doesn't support pets) the file size is giong to be about 200k larger</div></div>",
    "PostedDate": "2009-04-24T12:36:17.33-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "187814",
    "ThreadId": "53927",
    "Html": "The update is progressing slowly due to the sheer volume of work to do. Appologies for the wait but it will be well worth it.",
    "PostedDate": "2009-05-07T11:16:49.457-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "188552",
    "ThreadId": "53927",
    "Html": "<p>just a quick question, one of my guildie hunters sent me a pm about windfury totem only giving physical haste and hence not benefitting hunters.</p>\r\n<p>I did add RangedHaste in Stats.cs locally, and looked at those few lines of code in the hunter model where haste is involved. It's not going to break anything for your module, but I figured I wanted to check with you guys before commiting it.</p>\r\n<p>Swift Retribution and other buffs that provide RangedHaste now support that stat. I hope you're cool with that.</p>\r\n<p>Told my guildie there's people working on improvements and he's more than happy to give suggestions if you ever need feedback.</p>",
    "PostedDate": "2009-05-09T18:29:42.283-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "188628",
    "ThreadId": "53927",
    "Html": "\r\n<div>Your guildie is correct. Windfury totem no longer \r\nboosts ranged haste which is obviously bad for us hunters. </div>\r\n<div> </div>\r\n<div>The hunter module's two calculation functions are \r\nundergoing total overhauls right now and will look nothing like they do in the \r\nsource you can currently get from the site. There are currently three of us \r\nworking on the update and I'll check all the changes back in when I'm satisfied \r\nthat everything is as accurate as we can get it. </div>\r\n<div> </div>\r\n<div>Quick questions:</div>\r\n<div>Set bonuses, do I need to check in the module for \r\nthem or are they calculated in Stats.cs?</div>\r\n<div>Trinkets, are they calculated in each module or a \r\ncentral place?</div>\r\n<div>Glyphs, what's the easiest to check which ones \r\nare selected?</div>",
    "PostedDate": "2009-05-10T09:12:39.463-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "193568",
    "ThreadId": "53927",
    "Html": "<p>The update is moving along swiftly now. I am hoping to have a release version ready mid-week!!!</p>\r\n<p>Pet DPS is done except for a couple of families' focus skills. Pet talents are currently implemented as numerical up-down boxes and only the one that directly affect DPS are there. Fully grpahical trees will come in a later release once we figure out how to make the current talent picker code work for pets.&nbsp;</p>\r\n<p>The calculations for the actual hunter are being worked on over the weekend.</p>\r\n<p>Overall this update is going to be amazingly accurate, pet DPS is now well within 1% of actual (less than 3 DPS out for a level 80 ferocity pet.)</p>\r\n<p>I hope everyone is as excited for this update as those of us working on it are.</p>",
    "PostedDate": "2009-05-23T13:12:32.053-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "193701",
    "ThreadId": "53927",
    "Html": "<p>Pet DPS section is under-going final testing now. So far so good</p>",
    "PostedDate": "2009-05-24T10:42:40.927-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "193742",
    "ThreadId": "53927",
    "Html": "<p>Updated pet dps is available as source code</p>",
    "PostedDate": "2009-05-24T16:00:03.553-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "193937",
    "ThreadId": "53927",
    "Html": "<p>question...was BLACK ARROW left out on purpose?&nbsp; curious</p>\r\n<p>&nbsp;</p>\r\n<p>PS like it so far...still working to figure filters out</p>",
    "PostedDate": "2009-05-25T09:36:11.78-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "193938",
    "ThreadId": "53927",
    "Html": "\r\n<div>Only the pet calculations are done. The hunter \r\ncalculations are still under development and should be out \r\nmid-week</div>",
    "PostedDate": "2009-05-25T09:39:24.967-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "193940",
    "ThreadId": "53927",
    "Html": "<p>ty</p>",
    "PostedDate": "2009-05-25T09:42:17.59-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "194560",
    "ThreadId": "53927",
    "Html": "<p>I'm far from a programmer nor a total codes person.&nbsp; I'm new to the RAWR program but after reading a few things im kinda confused is the pet selection suppose to be open for change or is that gonna come out mid-week?&nbsp; also is there an issue with loading info from the wow armory onto the spread sheet I'm having a stat issue and wasnt sure if it was due to the talents section that is being worked on i was doing the math and it didnt seem like it was a talent issue either the numbers were to high or to low.&nbsp;&nbsp; Sorry for asking stupid questions but trying to learn this stuff.</p>",
    "PostedDate": "2009-05-26T16:28:23.227-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "194561",
    "ThreadId": "53927",
    "Html": "<p>razor - I decided to check-in the pet dps section just so people don't feel like this module isn't totally dead. There are a lot of talents, on the order of 15, that aren't currently implemented in the available source-code downloads. Also some of the talents and spells have been redesigned&nbsp;since this module was last update prior to 3.0.1 and those changes aren't included yet either. Anyone can modify the source-code for their own custom build, but for people who can't compile the cource code the pet changes aren't available. As for the armory loading that is handled by a different module called Rawr.Base. As I mentioned in a previous post the hunter calculations are off on the order of 10%. You must also remember that all Rawr values are effective, not actual.</p>",
    "PostedDate": "2009-05-26T16:40:28.22-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "194586",
    "ThreadId": "53927",
    "Html": "<p>thanx law yeah im not good with messing with source codes or any codes for that matter lol but thanx for getting back with me the program is awesome and is actually helping me with picking out which gear to go for and which t avoid.&nbsp; great program thanx to you and all the other devs.</p>",
    "PostedDate": "2009-05-26T17:55:35.697-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "194593",
    "ThreadId": "53927",
    "Html": "<p>Please dont take this as QQ....cause i like the program and the work you all have put into it...</p>\r\n<p>Not sure if intented or not....but second part of trinks not counting or showing in eval of gear...</p>\r\n<p>The issue seems to show up also on rings ( upgrading decissions)</p>\r\n<p><strong><span style=\"text-decoration:underline\">sphere of the dragon's blood</span></strong>&nbsp;&nbsp; equip= 55hit&nbsp;&nbsp;&nbsp;&nbsp; <em>Use= 670ap for 20sec's</em></p>\r\n<p><strong><span style=\"text-decoration:underline\">Pyrite Infuser</span></strong>&nbsp;&nbsp;&nbsp;&nbsp;equip&nbsp;=&nbsp; 95hit&nbsp; <em>chance for 1234ap for 10 sec's</em></p>\r\n<p><em></em></p>\r\n<p>not sure if proc has shown to be so low to not be worth discussing or second tier stats and &quot;on use &quot; parts arnt calculated..</p>\r\n<p>of course i may be out to lunch cause an update is coming...:)...soon and you have seen it already...</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-05-26T18:49:14.35-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "194821",
    "ThreadId": "53927",
    "Html": "\r\n<div>You are correct when you think that trinkets don't \r\neffect gear due to being out of date. All these issues will be \r\ncorrected.</div>",
    "PostedDate": "2009-05-27T08:36:16.81-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "194859",
    "ThreadId": "53927",
    "Html": "<p>TY....looking forward to the next update.....i am enjoying the help this program is giving...</p>",
    "PostedDate": "2009-05-27T10:20:49.707-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "195067",
    "ThreadId": "53927",
    "Html": "<p>Hello</p>\r\n<p>I&nbsp;doesn't found the Trinket 'Fury of the five Flights':</p>\r\n<p><span><span style=\"color:#000000\">Equip: </span><span style=\"color:#000000\">Each time you deal melee or ranged damage to an opponent, you gain 16 attack power for the next 10 sec., stacking up to 20 times.</span></span></p>\r\n<p><span><span style=\"color:#000000\">Maybe you can implement this Trinket too in the next Version.</span></span></p>\r\n<p><span><span style=\"color:#000000\">Thanks</span></span></p>\r\n<p><span><span style=\"color:#000000\">Gris</span></span></p>",
    "PostedDate": "2009-05-28T00:57:55.2-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "195256",
    "ThreadId": "53927",
    "Html": "\r\n<div>All trinkets will be supported in the first release \r\nafter the update is finished.</div>",
    "PostedDate": "2009-05-28T08:37:09.723-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "195992",
    "ThreadId": "53927",
    "Html": "<p>I hate to bother you like this, but do you have a current eta for the update?</p>\r\n<p>Thanks for the hard work,</p>\r\n<p>V.</p>",
    "PostedDate": "2009-05-30T10:10:49.03-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "195997",
    "ThreadId": "53927",
    "Html": "\r\n<div>Not too much longer, few days at most. I think all \r\nthat is left is pulling in trinkets and a few buffs and then some testing to \r\nmake sure everything behaves itself.</div>",
    "PostedDate": "2009-05-30T10:42:09.91-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "196223",
    "ThreadId": "53927",
    "Html": "<p>I just started using RAWR, and I have got to say this is a very impressive program!&nbsp; Much thanks for all the hard work in creating it!</p>\r\n<p>I noticed that my hunter's Basic Stats in RAWR are different from the stats I see in-game.&nbsp; For example, my health in-game is 18744, but RAWR says it's 13748.</p>\r\n<p>My in-game agility is 1643, but RAWR says it's 1577.&nbsp;</p>\r\n<p>My in-game ranged crit chance is 41.00%, but RAWR says it's 37.60%.</p>\r\n<p>Many other stats are also off.</p>\r\n<p>My guess is that you're already working on fixing these discrepancies, but I just wanted to give you a heads-up in case you weren't aware.&nbsp; My friend's stats for his druid show up just fine, he says, so maybe this is just a Hunter-related issue.</p>",
    "PostedDate": "2009-05-31T18:58:27.567-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "196227",
    "ThreadId": "53927",
    "Html": "\r\n<div>Each module is developed and maintained separately. \r\nHunter update is taking a bit longer than hoped.</div>",
    "PostedDate": "2009-05-31T19:39:59.853-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "196414",
    "ThreadId": "53927",
    "Html": "<p>Curious ...not looking for a hard &quot;its done date&quot; just a this week ,maybe first of next week for the update...i feel its a very useful tool to evel gear..and am waiting to see it working...TY for any info on this..</p>",
    "PostedDate": "2009-06-01T07:47:16.1-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "196489",
    "ThreadId": "53927",
    "Html": "<p>We've recently come a across a major mechanic missing from a base class, so this has added a few days so we can get it implemented. There are two us working on the update quite diligently. I know I said this last week but I'm hoping to be done mid to late this week if nothing else major pops up.</p>",
    "PostedDate": "2009-06-01T10:32:59.25-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "196794",
    "ThreadId": "53927",
    "Html": "<p>Understood... gettin it right is what we are hopeing for and if it takes some extra time...well it does..better to be right then have to take all the QQ that this and that are out ta lunch...TY for all your effort...</p>",
    "PostedDate": "2009-06-02T05:38:04.06-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "196959",
    "ThreadId": "53927",
    "Html": "\r\n<div>Thanks but only the pet calculations are done and \r\nwe've done some more fine tuning on those as we've been finishing up the \r\nhunter calculations. If you think those changes are impressive wait until you \r\nsee the hunter overhaul/complete rewrite, it's honestly a thing of beauty if \r\nthere is a such a thing in programming.</div>",
    "PostedDate": "2009-06-02T12:26:29.783-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "197147",
    "ThreadId": "53927",
    "Html": "<p>After all you wrote i am really crazy about a look in the source code!</p>",
    "PostedDate": "2009-06-03T01:08:20.8-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "197263",
    "ThreadId": "53927",
    "Html": "\r\n<div>There will be a release once the bulk of the \r\nhunter stuff is ready. There are a lot of code intensive things that won't be in \r\nthat release but all in all the calculations should be a lot more \r\naccurate.</div>",
    "PostedDate": "2009-06-03T07:09:25.183-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "197534",
    "ThreadId": "53927",
    "Html": "<p>hah sheesh looks like there is a lot of demand! I suppose i'll try to skip a little sleep and finish up what I can ASAP.</p>\r\n<p>I'm not making promises, but I predict there will be a 98% complete and working version up by either late thursday, or sometime friday (june 4th or june 5th). I'd like to get at least a semi-rough version up so that we can get a larger audience of people to error check these calculations (bwah ha ha ha, you'll never find any errors cause there are none!!!!!!). (especially since the current version is pretty much blank aside from pet dps)&nbsp;</p>",
    "PostedDate": "2009-06-03T20:40:32.8-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "197823",
    "ThreadId": "53927",
    "Html": "<p>TY for putting in the extra time getting it right...I for one am looking forward to it working.</p>",
    "PostedDate": "2009-06-04T09:40:21.617-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "198188",
    "ThreadId": "53927",
    "Html": "<p>The new version is acting extremely weird, at least for me.</p>\r\n<p>Hunter dps is not displayed at all, only pet dps, although ne numbers are so low that they cannot be correct. If I make any change in the pet options tab, even simply changing the talent points, the program stops displaying any dps values, and it simply says n. def. next to each item.</p>\r\n<p>Any help would be appreciated.</p>",
    "PostedDate": "2009-06-05T06:12:52.05-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "198287",
    "ThreadId": "53927",
    "Html": "<p>Unfortunately, same results here.&nbsp; Uploaded a hunter friend's toon from Armory.&nbsp; Base stats, gear, talents all appears correctly, but&nbsp;for intermediate stats, only autoshot DPS displays a value (all others at 0), and from complex stats, Hunter total DPS is 0.&nbsp; All comparison charts for gear, enchants, gemming, buffs, and Relative Stat Values show only some minimal values for Pet DPS, but no&nbsp;data for Hunter DPS.</p>",
    "PostedDate": "2009-06-05T08:49:41.347-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "198289",
    "ThreadId": "53927",
    "Html": "<p>seems when you look for upgrades all the&nbsp;overall &nbsp;numbers appear to be same...strange...i think thats why there is no dps increase only pets dps</p>\r\n<p>&nbsp;</p>\r\n<p>on the up side...response time is faster and no errors on closeing the program..</p>",
    "PostedDate": "2009-06-05T09:06:36.967-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "198448",
    "ThreadId": "53927",
    "Html": "<p>As I've said many times <span style=\"font-weight:bold\">only</span> the pet calculations are fully updated. There will be an intermediate release of the hunter calculations shortly. This intermediate release will have about 98% of the needed updates in it. There was a bug found in the calculations for Rabid just after the 2.2.6 build. This error is now corrected and can be obtained if you download and build the latest source code available.</p>",
    "PostedDate": "2009-06-05T16:49:58.123-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "198471",
    "ThreadId": "53927",
    "Html": "<p>HUNTER MODULE IS BROKEN ONLY MY PET DPS IS SHOWING WHAT IS GOING ON OH NO MY TEXT IS BIG AGAIN WHY DOES THIS HAPPEN TO ME PLEASE FIX HUNTER IT IS BROKEN IF YOU DIDNT KNOW</p>",
    "PostedDate": "2009-06-05T19:43:35.51-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "198476",
    "ThreadId": "53927",
    "Html": "<p>Please please please please read this entire discussion before posting. This constant saying the same thing over and over again is taking time away from the update. The name of this discussion alone should tell you we are updating the module.&nbsp;</p>",
    "PostedDate": "2009-06-05T20:35:48.133-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "198482",
    "ThreadId": "53927",
    "Html": "<p>I havent had as much time as I would like to finish up the last peices of the hunter code. I'm going to be out of town for the next couple days too, so I've updated my sourcecode on the site, lawjpbo or someone else can finish it up while im gone if they'd like, otherwise i'll pick it back up when as soon as i get back.&nbsp;</p>\r\n<p>The version I just uploaded is missing a couple features, but I believe the values for stats points (aside from mana regen related stats which arent currently included) are within 95% accuracy. This version doesnt crash or bug out, under even my harshest testing.</p>\r\n<p>&nbsp;</p>\r\n<p>Known Current Missing Features:&nbsp;</p>\r\n<p>&nbsp;- still about 4 - 5 talents that havent been added yet</p>\r\n<p>&nbsp;- Special Effects (trinkets with on proc, on use, etc. special effects)</p>\r\n<p>&nbsp;- Mana usage support (these functions for the calculations are there, but these depend on rotation calculations)</p>\r\n<p>&nbsp;- Explosive shot (just didn't add this yet, should take approximately 30 mins)</p>\r\n<p>&nbsp;- Chimera shot (same as above^^)</p>\r\n<p>&nbsp;- Rotation Support (need to add support for preset rotations as well as custom shot rotations to allow for more complex mana usage, etc calculations)</p>\r\n<p>&nbsp;- Full Shot Information Display (not all of the calculated information is displayed in the tooltips, steady shot and auto shot give display damage per second as the default value with more information in mouseover tooltip, while special shots such as serpent sting, arcane, aimed, multi, display information based on damage per cooldown, aka if you were to use the spell as much as possible (or keep the buff up 100% int he case of serpent sting))</p>\r\n<p>- - - - Some Things to Note - - - -</p>\r\n<p>Item Values are currently calculated on damage per cooldown for all shots that you would possibly use in your rotation. since rotation support isnt added, it assumes youre using serpent sting, arcane shot, multishot, aimed shot, etc. if spells are on a shared cooldown (aimed &amp; multi) &nbsp;(explosive &amp; arcane) it chooses the spell you talented into.</p>\r\n<p>I believe the calculations for Hit, Crit, Miss, Ranged Attack Power, Armor Pen, Damage Reduction Multipliers, Damage Increase Multipliers, Bonus Crit Chance, Bonus Crit Chance Multipliers, etc. are all 99 - 100% complete and accurate, thus the values you get for relative stat values should be extremely accurate, even though its missing some of the calculations for special shots, should still be extremely accurate. Though I wouldnt trust the values for talents, glyphs, yet. since theyre not all there Also as mentioned the mana usage calculations are not functional so no value is given to stats / talents / glyphs that affect mana consumption.</p>\r\n<p>All cooldowns are assumed to be used as much as possible and are calculated using the fight duration. ** Note that for example the default fight duration of 6 minutes means that whether the cooldown of rapid fire is 5 minutes, 4 minutes or 3 minutes, at most you will only be able to use it twice, so the talent that reduces the cooldown of rapid fire is given no value... modify the fight duration to shorter or longer and you will see the value of &quot;Rapid Killing&quot; go up or down accordingly.</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-06-05T22:23:50.063-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "198784",
    "ThreadId": "53927",
    "Html": "<p>Still To Do:&nbsp;a couple of talents, special effects (trinkets with on proc, on use, etc. special effects)</p>\r\n<p style=\"margin-top:1em;margin-bottom:1em\">Everything else is <span style=\"font-style:italic\">finally</span> done and looks good when compared to my own hunter in-game. Thanks to all those who put in so much time getting this update done. At some point we will implement full graphical pet talent trees, but that will be down the road since the Silverlight move is more pressing.</p>\r\n<p style=\"margin-top:1em;margin-bottom:1em\">The rest of the update will come once I finish moving this module over to Silverlight for Rawr 3.</p>\r\n<p style=\"margin-top:1em;margin-bottom:1em\">Enjoy the updates and we hope they help you out!!</p>\r\n<p style=\"margin-top:1em;margin-bottom:1em\">&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-06-07T12:38:58.603-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "199274",
    "ThreadId": "53927",
    "Html": "\r\n<div>Please please please read this entire discussion \r\nbefore saying hunter calculations don't work. WE KNOW THIS AND ARE WORKING AS \r\nFAST AS WE CAN TO FIX IT.</div>",
    "PostedDate": "2009-06-08T15:21:29.913-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "200268",
    "ThreadId": "53927",
    "Html": "<p>Hey guys.&nbsp; I know you are working hard to get this going and I understand it isn't your full time job (or maybe it is!!!!).&nbsp; But have you got an estimate on when it might be ready for an updated version???</p>",
    "PostedDate": "2009-06-10T21:13:22.893-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "200362",
    "ThreadId": "53927",
    "Html": "<p>Dezziedc beat me to the question...dont take it as rushing ya please...just that we are excited about getting a good working verison..and want to be ready to download it before the server harddrive can stop spinin...:)</p>\r\n<p>&nbsp;</p>\r\n<p>TY for all the work to get it clean and working...</p>",
    "PostedDate": "2009-06-11T04:33:02.327-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "200403",
    "ThreadId": "53927",
    "Html": "\r\n<div>A 98% complete version is available as source and \r\nwill be in the next build.</div>",
    "PostedDate": "2009-06-11T06:41:39.667-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "200414",
    "ThreadId": "53927",
    "Html": "<p>Using Rawr build 34531, the hit percent displayed on the character stats page is 1% less than what Shandara's Excel based spreadsheet shows.</p>\r\n<p>I noticed in the code for the Rawr modeule that a base 4% hit is removed based on attacking a level 83 NPC, however the excel based spreadsheet is only removing 3% for the Hit Adjustment.&nbsp;</p>\r\n<p>It seems the hit adjustment in Rawr for attacking other higher level mobs is also slightly off.&nbsp; For example a level 82 mob in rawr shows a 1% miss penalty rather than the expected 2%, a level 81 mob shows 0.5% hit reduction rather than 1% and level 80 seems to be working with a 0% extra miss change.</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-06-11T07:07:19.97-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "200416",
    "ThreadId": "53927",
    "Html": "\r\n<div>While working on the update we've found a couple \r\nof places where Shandara is wrong.  Hit being one of them. \r\nHit depression is not a flat % based on level but is actually based on the \r\ndifference in the player's level and the target's \r\nlevel.</div>",
    "PostedDate": "2009-06-11T07:15:49.687-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "200471",
    "ThreadId": "53927",
    "Html": "<p>So you are saying that Hunters require 9% to hit to cap and not 8%?</p>\r\n<p>Running with 8% I never miss any shots.&nbsp; What new information have you guys found that shows hunters need an extra 1% hit over what has been talked about in theory crafting circles since the last expansion?</p>\r\n<p>The current Rawr module is showing that hunters require 9% hit to cap or +4% hit vs lvl 83 mobs.</p>",
    "PostedDate": "2009-06-11T09:37:03.177-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "200484",
    "ThreadId": "53927",
    "Html": "\r\n<div>From what we can determine the hit cap is \r\nsomewhere between 8% and 9% and is closer to 9%. By making our hit cap as 9% you \r\ncan be 100% of never missing. At 8% misses are rare enough you may not see any \r\nfor quite a while.</div>",
    "PostedDate": "2009-06-11T10:15:49.683-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "200569",
    "ThreadId": "53927",
    "Html": "<p>Is there any way to publish your testing to show that 9% hit or some percentage between 8 and 9% hit is the correct target we should be gearing for?</p>\r\n<p>For hunters hit has been thought to be capped at 8% hit for both the hunter and his/her pet for a long time.&nbsp; Speaking only for myself. at 8% hit I do not think I have missed a shot ever over thousands and thousands of shots.&nbsp; Having to gear for 1% more hit seems like a huge deal.</p>\r\n<p>I have not had the time to look at the code for pets yet, however the accepted thinking on pets is that pets only benefit from the next full hit percentage, so if you have 7.99% hit the pet counts as having only 7% hit.&nbsp; Is this how you guys are looking at pet hit?&nbsp; Or are there some new calculations for pet hit as well?</p>\r\n<p>&nbsp;</p>\r\n<p>This change from 8% hit to 9% hit is such a huge change in theory crafting actually seeing how it was arrived at would be very nice.</p>",
    "PostedDate": "2009-06-11T13:50:02.557-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "200584",
    "ThreadId": "53927",
    "Html": "\r\n<div>My apologies, after some more research we found \r\nthat he formula we had for hit rating was based on when the 1% hit on boss type \r\nmobs was still in place. We will move the hit cap to 8% for the next \r\nrelease.</div>",
    "PostedDate": "2009-06-11T14:32:49.7-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "210422",
    "ThreadId": "53927",
    "Html": "<p>I have noticed that in that past few releases the hit cap still seems to be 295 or 9%. Do we have an eta for what version will have the 8% 263 correction?</p>",
    "PostedDate": "2009-07-09T07:05:44.44-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "212620",
    "ThreadId": "53927",
    "Html": "\r\n<div>For the next couple of months I will be unable to \r\nwork on Rawr due to work and family commitments. If anyone would like to take \r\nover contact me and I will let you know what needs to be worked \r\non.</div>",
    "PostedDate": "2009-07-16T07:34:54.81-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "216110",
    "ThreadId": "53927",
    "Html": "<p>i have submitted a patch that fixes this issue</p>",
    "PostedDate": "2009-07-26T00:16:26.783-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "216971",
    "ThreadId": "53927",
    "Html": "<p>I sent you an email through the codeplex contact form - not sure if you got it. I'm interested in working on the hunter module</p>",
    "PostedDate": "2009-07-28T15:02:18.27-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "216974",
    "ThreadId": "53927",
    "Html": "\r\n<div>Feel free to work on it as you wish. I have had to \r\nback out due to work commitments. Things to do: graphical pet talents, a few \r\ntalents, on proc/use trinket effects, and a more accurate rotation \r\nsystem.</div>",
    "PostedDate": "2009-07-28T15:09:52.603-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "218920",
    "ThreadId": "53927",
    "Html": "<p>Awesome. Is submitting individual patches here the right thing to do?</p>\r\n<p>http://rawr.codeplex.com/SourceControl/PatchList.aspx</p>",
    "PostedDate": "2009-08-03T12:18:23.837-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "218929",
    "ThreadId": "53927",
    "Html": "<p>If you just wanna do little fixes here and there anyone is welcome to submit patches.</p>\r\n<p>If you want to become a serious dev and actually make fundamental changes to the Hunter module, talk to Astrylian about how to get connected into the versioning as a dev. We'd be happy to have you.</p>",
    "PostedDate": "2009-08-03T12:47:57.353-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "220720",
    "ThreadId": "53927",
    "Html": "<p>according to the commitlog</p>\r\n<p>&nbsp;</p>\r\n<p>35908 by iamcal &nbsp;&nbsp; &nbsp;Thu at 9:26 AM &nbsp;&nbsp; &nbsp;6 &nbsp;&nbsp; &nbsp;Rawr.Hunter - allow setting of every pet talent</p>\r\n<p>i just wanted to remember you of the fact that you can import them from the armory as well.</p>\r\n<p>&nbsp;</p>\r\n<p>http://eu.wowarmory.com/character-talents.xml?r=Thrall&amp;n=Dweezil&amp;group=1 on the lower right of the page you can select your pets .</p>\r\n<table border=0 cellspacing=0 cellpadding=4>\r\n<tbody>\r\n<tr>\r\n<td></td>\r\n<td></td>\r\n<td></td>\r\n<td></td>\r\n</tr>\r\n</tbody>\r\n</table>",
    "PostedDate": "2009-08-07T03:25:47.76-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "220834",
    "ThreadId": "53927",
    "Html": "<p>i'm planning on adding import at some point, but the first step was to actually allow you to set them :D</p>",
    "PostedDate": "2009-08-07T09:18:08.477-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "221214",
    "ThreadId": "53927",
    "Html": "<p>Something seems seriously wrong about the hunter module. Every theorycraft says hit cap is the first priority, if I run the optimizer, it removes all my hit gems and swap my gear apparently for more armor penetration, but putting me like at 188 hit rating, which is far from enough. And by doing that, it shows the optimizer with a score lower than my current setup score.</p>\r\n<p>I used the Ret paladin module for a while now and I've never seen it behave like that.</p>",
    "PostedDate": "2009-08-09T01:14:01.38-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "221298",
    "ThreadId": "53927",
    "Html": "<p>the hunter modules is basically unusable at the moment (at least in the latest released version)</p>\r\n<p>i'm rewriting it from the ground up to match calculations in the spreadsheet. the version currently in source code is significantly more accurate, but i still would not advise using it.</p>",
    "PostedDate": "2009-08-09T11:56:36.63-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "221667",
    "ThreadId": "53927",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>iamcal wrote:</strong><br>\r\n<p>the hunter modules is basically unusable at the moment (at least in the latest released version)</p>\r\n<p>i'm rewriting it from the ground up to match calculations in the spreadsheet. the version currently in source code is significantly more accurate, but i still would not advise using it.</p>\r\n</blockquote>\r\n<p>&nbsp;</p>\r\n<p>Thanks for the update. One thing that I find really annoying is when it's trying to dual wield a weapon I only have once, I don't know if that's fixable, or even doable to assume I only have it once... might happen you can equip 2 times the same weapon, I understand that.</p>\r\n<p>But it should be an option imho.</p>\r\n<p>I also noticed it always replaced my bullets by some lower arrows, not that it's a big deal, but I thought I'd tell. And I do use a gun, and have Mammoth Clutters on.</p>\r\n<p>Continue the great work, I'll do some tests with the code see what it gives.</p>",
    "PostedDate": "2009-08-10T12:10:46.347-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "221675",
    "ThreadId": "53927",
    "Html": "<p>Edit the item to make it &quot;unique&quot;.&nbsp; The program sees that you're able to wield two of the weapon, and you're making it avilable to do so.&nbsp; Just edit the item to make it unique, and you're good to go.</p>",
    "PostedDate": "2009-08-10T12:41:48.147-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "221749",
    "ThreadId": "53927",
    "Html": "<p>i'm not quite sure what you mean...</p>\r\n<p>are you saying that when you put a one-hander into the main-hand slot it treats it as if you have the same one hander also in the off-hand slot?</p>",
    "PostedDate": "2009-08-10T15:43:03.983-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "221922",
    "ThreadId": "53927",
    "Html": "<p>Yah, I've had this happen with rings, trinkets, and weapons all... and not on hunters. It's in Rawr, not the specific module. If you mark an item available, since you can't specify how many you have, Rawr assumes you have as many as you can use, it seems. I've used BrWarner's workaround to fix it.</p>\r\n<p>Would it be possible to tell Rawr to default to &quot;unique&quot; on quest rewards? I can't think of any armor/weapon quest rewards that you can get more than one of. If this could just be done for the four types affected (rings, trinkets, one-hand, two-hand for TG) it would help.</p>",
    "PostedDate": "2009-08-11T01:53:27.67-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "221948",
    "ThreadId": "53927",
    "Html": "<p>No, he's talking about the Optimizer. If you mark a non-unique onehand weapon available, the optimizer will consider it valid to equip two of that weapon. If you only have one of that item, just edit it and mark it unique, to prevent the Optimizer from equipping two of it. Quest rewards can indeed be gotten more than once in several circumstances.</p>",
    "PostedDate": "2009-08-11T03:06:14.013-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "222019",
    "ThreadId": "53927",
    "Html": "<p>Has anyone else seen some craziness with 2.2.12?&nbsp; RAWR now shows my dps should be in the mid 5000 range, where 2.2.11 and every version before shows it to be around 1700, which is correct.&nbsp; Two of the other hunter in my guild that I checked had their dps listed as 600-800, where it should be closer to 2000-2400.&nbsp; Each time I'm loading my character from WOW Armory.&nbsp; I guess it's ok to use 2.2.11 ?&nbsp; Thanks in advance for any help.&nbsp; Can't live without my RAWR...</p>",
    "PostedDate": "2009-08-11T07:00:36.633-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "222069",
    "ThreadId": "53927",
    "Html": "<p>Yes, as mentioned elsewhere, v2.2.12 included a bug that massively boosted hunter DPS. Things are much improved for v2.2.13, which I hope to release tonight.</p>",
    "PostedDate": "2009-08-11T08:59:24.727-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "222103",
    "ThreadId": "53927",
    "Html": "<p>Thanks for the quick reply.</p>",
    "PostedDate": "2009-08-11T10:35:46.257-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "222149",
    "ThreadId": "53927",
    "Html": "<p style=\"font-size:200%\">the current status of the hunter module can be found here:</p>\r\n<p style=\"font-size:200%\"><a href=\"http://rawr.codeplex.com/Wiki/View.aspx?title=Rawr.Hunter&referringTitle=Home\">Hunter Model Page</a></p>\r\n<p>:)</p>",
    "PostedDate": "2009-08-11T11:53:59.59-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "234599",
    "ThreadId": "53927",
    "Html": "<p>*knocks on Jamcal's computer screen*</p>\r\n<p>Anyone home?</p>\r\n<p>Just curious at the lack of updates to the Hunter model. My guild wsa going through an application for a hunter and RAWR was giving a fairly low score for his dps and I was wondering if there was a discrepancy  in the Hunter Model. I even tried using the Hunter Excel spreadsheet and it was giving a 1k dps increase over what was given in RAWR (buffs in both were the same).</p>\r\n<p>Default gemming templates need to be updated to epic, as well as possibly default buffs (such as the ones post in the comparison with the spreadsheet in the faq).</p>\r\n<p>Also default talents would be nice as well. Even if you just use Shandara's default talents in her spreadsheet. I have been using <a href=\"http://elitistjerks.com/f74/t42519-best_possible_dps_shandaras_wotlk_spreadsheet/\">midnight's list </a>as a basis for comparisons for BiS to see any differences. So far I'm seeing about an 800 dps difference between the spreadsheet and RAWR. Hunter dps is lower while pet dps is a bit higher than projected.</p>",
    "PostedDate": "2009-09-14T23:22:32.223-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "234877",
    "ThreadId": "53927",
    "Html": "<p>as an update, I did post possible updates. I've added default specs taken from Shandara's spreadsheet as well as updating default gemming to Epic Gems</p>",
    "PostedDate": "2009-09-15T12:59:05.64-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "234894",
    "ThreadId": "53927",
    "Html": "<p>The Talent Piercing Shots (marks) is not modeled in the current version of Rawr.&nbsp;</p>\r\n<p>Adding or removing points in the talent does nothing to change dps, even though this is one of the &quot;signature&quot; talents in the marks tree.</p>",
    "PostedDate": "2009-09-15T13:36:15.89-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]