[
  {
    "Id": "181592",
    "ThreadId": "53928",
    "Html": "I wasn't sure if I saw if this was modeled into RAWR yet. Trying to see if I should get this for my Feral Tanking.<br>\r\n<br>\r\nhttp://www.wowhead.com/?spell=64579#comments<br>\r\n<br>\r\nThe reason is that our guild had this drop in Ulduar tonight and I'm tempted to get it but wanted a confirmation<br>\r\n",
    "PostedDate": "2009-04-20T22:42:28.37-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "181596",
    "ThreadId": "53928",
    "Html": "I know you are asking for this regarding Bears, but I can tell you that ProtPaladin and ProtWarr do not currently model incoming heals, which is what Blood Draining feels like it applies to.<br>\r\n<br>\r\nI suppose there's a method of it adding just plain ol EH based on the proc rate.<br>\r\n<br>\r\nWhat does everyone think?<br>\r\n<br>\r\nSort of as a blind recommendation, there's nothing stopping you from being the one to test it out and report your findings :)<br>\r\n",
    "PostedDate": "2009-04-20T22:57:15.02-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "181607",
    "ThreadId": "53928",
    "Html": "I probably should. I can always head to Icecrown and tank a few of the 60k Elites there to test it out. I used to tank them while herbing so they aren't that big of an issue to solo.<br>\r\n",
    "PostedDate": "2009-04-20T23:23:28.48-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "182145",
    "ThreadId": "53928",
    "Html": "I'd love to see some proc rate data for this. My hope is that the proc rate is high enough that it's 'reliable', and can be treated as either health, or block.",
    "PostedDate": "2009-04-21T22:38:28.04-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "182434",
    "ThreadId": "53928",
    "Html": "If <a href=\"http://www.wowhead.com/?spell=64571\">this spell data</a> is correct, then it's a 50% chance to proc.&nbsp; Not bad!<br>\r\n<br>\r\nOf course, this would have to be verified via testing, but it does make sense from a design standpoint.&nbsp; This looks to be a very nice enchant for tanks of all types.<br>\r\n<br>\r\nAnother enchant to look at is <a href=\"http://www.wowhead.com/?spell=64441\">Blade Turning</a>.<br>\r\n<br>\r\nI will go on record as saying I very much do <em>not</em> like the idea of turning it (<a href=\"http://www.wowhead.com/?spell=64579\">Blood Draining</a>) into raw EH in all cases.&nbsp; This enchant would be directly affected by boss damage range/attack speed, your own weapon speed, Modeling it for Tankpoints is one thing, but for most other uses, I'm not really a fan.&nbsp; The issue is that it's situational - if you're fighting Loatheb, for instance, you will never get below 35% health, and so will see 0 effect from it.&nbsp; Also, effective health is fundamentally different from healing, as EH is inherently <em>pro</em>active (allows you to take the hit), and healing is by the same token <em>re</em>active (in other words, recovery - allows one to survive the following hit).<br>\r\n",
    "PostedDate": "2009-04-22T09:59:24.657-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]