[
  {
    "Id": "182686",
    "ThreadId": "54222",
    "Html": "Our guild is a small one, that only do 10 man raids. Sure, we did some 25 man Naxx runs with other guilds, but our main focus is on the small guilds.<br>\r\n<br>\r\nNow, i would love to know if it is possible to configure Rawr to only show items gained from 10 man raids, or if it is possible to add in a future release. It would help greatly to identifity the items, rather than seeing 5 Heroic items first.<br>\r\n",
    "PostedDate": "2009-04-23T01:48:58.793-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "182703",
    "ThreadId": "54222",
    "Html": "I advice you to watch the little movie that was made to explain some of the features of Rawr. There is a very nice filter option to filter out 25-man stuff if you want.<br>\r\n",
    "PostedDate": "2009-04-23T03:04:14.46-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "182719",
    "ThreadId": "54222",
    "Html": "Thank you for this. However, there seems to be some issues with this. It doesn't seem as if it can see the difference between item in a cache on normal and on heroic.<br>\r\n<br>\r\nFor example, leather Shoulders of the Monolith drop from the Cache of Living Stone on heroic, but still shows up. The same goes for Conq tier items, which is essensially &quot;looted&quot; in Dalaran.<br>\r\n<br>\r\nEDIT: <strong>Gloves of the Stonereaper</strong> also only drops from Heroic Ulduar, and is looted straight off the boss. I updated the item from the armory, yet it still shows up, dispite having &quot;heroic raids&quot; turned off.<br>\r\n",
    "PostedDate": "2009-04-23T04:01:45.74-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "182728",
    "ThreadId": "54222",
    "Html": "There have been many improvements regarding this for next release, including normal/heroic distinction for items in containers.\r\n",
    "PostedDate": "2009-04-23T04:23:03.553-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]