[
  {
    "Id": "183210",
    "ThreadId": "54357",
    "Html": "Hey everyone,<br>\r\n<br>\r\n<strong>The Gem Questions:</strong><br>\r\nAfter importing my toon from the Armory, I go to Optimizer and it pops up with a message it wants to change my metagem from Chaotic Skyflare Diamond to Relentless Earthsiege Diamond.<br>\r\n<br>\r\nAll fair, but when I choose Slot: Gems/Meta, it lists the Chaotic higher than Relentless. IMO this is correct and the Optimizer is wrong.<br>\r\n<br>\r\nAnother thing, my metagem is not activated. I don't understand how Rawr can change my Total DPS after changing Chaotic to Relentless, as the metagem requirements are not met.<br>\r\n<br>\r\nSo I want to activate my metagem. How do I know if swapping 2 bold scarlets for a blue/purple and a yellow/orange to activate it is worth it? Or will I loose more DPS from dropping the 32 strength than I gain from 21 agility and 3% crit?<br>\r\n<br>\r\n<strong>About the Optimizer</strong><br>\r\nI've searched help and forums for this but what is the difference in Overal Rating and DPS Rating? When I swap between the 2 nothing seem to change? I am inclined to use the DPS Rating because as a Retri Pala I want the highest DPS output but is that how it works? Choosing the single highest dps items might not result in a gearset with the highest DPS output because of a lack of other stats (whats all that potential damage output if your hitrating is too low and you miss half your swings??). Which option is the best to choose?<br>\r\n<br>\r\nAlso, the Optimizer always want to swap the position of my rings and trinkets. Why is that? I accept so it will shut up but its utter nonsense, my dps will not improve if I swap ring slot 1 with ring slot 2, will it?<br>\r\n<br>\r\n<strong>The Talent Question</strong><br>\r\nMy retri tree is the same as the built-in template. The only difference between my spec and the template is in the protection tree. Tiers 1 &amp; 2 are the same, in tier 3 I chose 5/5 Toughness and in tier 4 I chose 2/2 Improved Hammer of Justice. The Template picks 1/1 Divine Sacrifice and 2/2 Divine Guardian. How is this gonna improve my DPS? Yet Rawr says that the build-in template will improve my DPS from 4626 to 4702. How is that possible?<br>\r\n<br>\r\nThx for your time,<br>\r\nDwaladin.<br>\r\n",
    "PostedDate": "2009-04-24T05:20:06.33-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "183298",
    "ThreadId": "54357",
    "Html": "Metagem stuff: Check the 'Enforce Gem Requirements' box on the main screen to make it enforce the metagem's requirements. Optimize (with a high thoroughness), and it will find the best gemming placement. When comparing Chaotic vs Relentless, one may appear better, individually (ie, in the Metagems list), but that doesn't take into account that you may have to lose more in other gems to meet the requirements. I recall for a couple classes that the weaker of the two is actually better, for that reason.<div><br></div><div>Optimizer stuff: Overall Rating includes all sub ratings. Most models have 2+. DPS models typically have a very small Survivability Rating as well (So that it can value 100 sta as more valuable than 1AP, for example), though I'm not sure if Rawr.Ret does, offhand. If Rawr.Ret only has DPS Rating, then DPS Rating and Overall Rating are identical. Missing, etc, is already included in DPS Rating. The Optimizer does have randomness to it; it swaps gear/gems/enchants around to try to find upgrades, so if it finds any upgrade anywhere else, it's essentially random of which slot the rings/trinkets will have ended up in, even if they didn't change. I plan to add some logic to check the results for ring/trinket swaps, and swap them back if they're identical. I'd like to do similar with gems at some point, since the same thing can happen with gems, but that's a much more complex situation.</div><div><br></div><div>Talent stuff: Glyphs, possibly? Talent specs include glyphs now. If that's not it, I'd look at the Talents chart, and see if there's anything you're not taking that's a DPS increase, that you may have overlooked.</div>",
    "PostedDate": "2009-04-24T08:50:32.237-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "183589",
    "ThreadId": "54357",
    "Html": "Thanks for the clear answers.<br>\r\n<br>\r\n<br>\r\nAbout the talent stuff, thats not the case. The only change is what I listed in op OP. Glyphs don't change when I switch between the talents.<br>\r\n<br>\r\nOne more question. I just started tanking. When I import my toon its picked up as ProtPaladin under stats. Why doesnt it pick it up as a Tankadin and whats the difference to Rawr?<br>\r\n<br>\r\nThx,<br>\r\nDwaladin<br>\r\n",
    "PostedDate": "2009-04-25T09:47:22.77-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "183605",
    "ThreadId": "54357",
    "Html": "Ugh, Tankadin vs ProtPaladin is a bug. ProtPaladin is the right one.",
    "PostedDate": "2009-04-25T11:18:16.56-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "183609",
    "ThreadId": "54357",
    "Html": "Cool.<br>\r\n<br>\r\nTx :) \r\n",
    "PostedDate": "2009-04-25T11:22:20.603-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "184033",
    "ThreadId": "54357",
    "Html": "[Quote]I plan to add some logic to check the results for ring/trinket swaps, and swap them back if they're identical. I'd like to do similar with gems at some point, since the same thing can happen with gems, but that's a much more complex situation.[/Quote]<br>\r\n<br>\r\nGets my vote :) that would definately be well worth the effort to code.\r\n",
    "PostedDate": "2009-04-27T04:46:00.313-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "184174",
    "ThreadId": "54357",
    "Html": "While it is nice for it to recognize that the rings are the same after the optimize so don't swap positions along with the trinkets, I'd appreciate the logic to recognize the gem profile between old and new more.  There are many times where I have to sit with the old profile and the new profile and swap around the gems so that I have the minimum re-gemming needed for an optimized spec.  It's not hard but that would definitely be my pick out of this.\r\n",
    "PostedDate": "2009-04-27T11:23:11.507-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "184794",
    "ThreadId": "54357",
    "Html": "That's a much more complex issue, but one that can probably be solved as well, eventually.",
    "PostedDate": "2009-04-28T19:49:23.713-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]