[
  {
    "Id": "183553",
    "ThreadId": "54457",
    "Html": "Why does Rawr's optimisation think that swapping rings from one finger to another or trinkets from one slot to the other is going to make any difference?\r\n",
    "PostedDate": "2009-04-25T05:26:15.71-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "183572",
    "ThreadId": "54457",
    "Html": "The optimizer just likes doing things I guess? :D\r\n",
    "PostedDate": "2009-04-25T07:21:08.807-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "183585",
    "ThreadId": "54457",
    "Html": "It doesn't. It swaps gear around between your available gear, looking for upgrades. When it does find an upgrade, it's quite possible that it has swapped rings/trinkets in the process. In a future version, I'll try to detect those swaps in the results, and ignore them. In the mean time, it's finding the upgrade in whatever *else* it's changing.",
    "PostedDate": "2009-04-25T09:05:39.393-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "183596",
    "ThreadId": "54457",
    "Html": "Thank you for the swift reply. <br>\r\n<br>\r\nJust to be sure there is no confusion though, I'm not saying the ring moves from one finger to the other because Rawr is bringing in a different ring to one finger, I'm noticing that Rawr is just swapping the two existing rings (or trinkets) with each other for no net difference. \r\n",
    "PostedDate": "2009-04-25T10:20:26.797-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "183608",
    "ThreadId": "54457",
    "Html": "Right, reread what I said. Something else is an upgrade, and rings happened to be swapped in the process.",
    "PostedDate": "2009-04-25T11:20:47.72-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "183638",
    "ThreadId": "54457",
    "Html": "Or it really just swapped the rings and gives the same result, it does that sometimes. The reason is that while it is optimizing it does not look at your character and just creates a new character from scratch based on available items. As a result it usually ends up with rings and trinkets in a different slot.\r\n",
    "PostedDate": "2009-04-25T13:26:45.293-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]