[
  {
    "Id": "183804",
    "ThreadId": "54523",
    "Html": "I'm wondering if we can expect an update to the spell rotations any time in the near future?  Perhaps throw in an algorithm that will develop two healing rotations based upon burst and sustained HPS similar to what happens in the mage module instead of using a set rotation that doesn't account for haste? <br>\r\n<br>\r\nI appreciate the work that is going into this module right now, but I think the focus should be on rotations instead of gear and trinket modeling, since the modeling is moot with inaccurate spell selection.<br>\r\n<br>\r\n",
    "PostedDate": "2009-04-26T12:00:29.23-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "183807",
    "ThreadId": "54523",
    "Html": "Err... What? Are you using the latest version? o.O<div><br></div><div>Take care when throwing around 'inaccurate at best, completely wrong at worst' lines. The current version of Rawr.HolyPriest includes extremely customizable rotations, such that you can design it however you see fit.</div>",
    "PostedDate": "2009-04-26T12:09:16.883-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "183814",
    "ThreadId": "54523",
    "Html": "The custom feature doesn't allow rotation design.  What it allows is number and type of spells cast during a specific portion of time.  So, you can go back and look at your WWS and see how many of which spells you cast, toss them into the custom rotation, then see what the best gear set would have been for that fight.  I don't think it's optimal to base my gear around the spells I actually used.  I'm looking to design my optimal gear around the optimal spells.<br>\r\n<br>\r\nRight now, if I select the auto-raid rotation using my holy spec, it's using the same rotation that was used pre-3.1.  PoM =&gt; CoH =&gt; FH =&gt; FH.  It doesn't take into account the benefits from Serendipity that have made PoH such a powerful tool to holy priests now.<br>\r\n<br>\r\nI'm using the latest version.  I've been a huge fan of RAWR since I found the program a year ago and most of my guild is now using it at my recommendation.  Unfortunately, you guys have done such an amazing job up to this point that I've been spoiled.  Not having to spend hours designing spreadsheets and running numbers has been wonderful.  But at this point, RAWR holy priest is unusable for me since the rotations are still based upon pre-3.1 rotations.<br>\r\n<br>\r\nI appologize for my wording in the original post; however, I do believe that the priest module is inaccurate at this time.<br>\r\n<br>\r\n",
    "PostedDate": "2009-04-26T13:01:38.2-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "183818",
    "ThreadId": "54523",
    "Html": "So... What your'e saying is... You can make whatever rotation you want, but you want better presets. That's a far cry from 'inaccurate, and completely wrong'.",
    "PostedDate": "2009-04-26T13:24:57.68-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "183819",
    "ThreadId": "54523",
    "Html": "<p>I'll try to update auto-raid rotations, I kinda forgot about them heh.</p>\r\n<p></p>\r\n<p>Although you can quickly simulate a PoM-CoH-FH-FH-PoH rotation by putting in 1 PoM cast (hits 4 targets), 1 CoH cast, 2x Flash Heal, 1x PoH over a fight length of about 8 seconds. This will not correctly calculate mana needs for a longer fight. (Although you can extrapolate a 8 minute fight by multiplying all above values by (8*60/8 = 60). So 60 PoM hitting 240 targets, 60 CoH, 120 FH, 60 PoH over a fight of 480 seconds.) This may be more work for you, but the thing is, during this fight you will probably cast Divine Hymn once atleast, maybe a greater heal, maybe you will cast some renews and other spells, so the WWS/WMO reports will help you get a more accurate picture.</p>\r\n<p></p>\r\n<p>Its still not as hard as spreadsheet work, but I will admit it creates a bit extra work, so I will update the built in simple rotations for 3.1.</p>\r\n",
    "PostedDate": "2009-04-26T13:26:41.15-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "183826",
    "ThreadId": "54523",
    "Html": "@ Astrylian<br>\r\n    Please correct me if I'm wrong, but from my experiments with the custom feature, it doesn't develop any sort of rotation.  For example, I was working on my disc spec and rotation for tank healing, and based on my haste values and gear I was able to find my own rotation that was able to repeat approximately every 31 seconds.  So, like TNSe suggested, I took and extrapolated that out to a 5 minute fight.  However, the problem with this is that it doesn't take into account any single cast spell uses (Inner Focus, Power Infusion, etc).  Additionally, when RAWR optimizes my gear set, my haste values are going to change, which may cause my rotation to change.<br>\r\n    You are correct that what I'm really looking for is better presets.  Ideally, something similar to what RAWR.Mage does, but at least something better than what is currently there.  I will edit my original post appropriately.  It would be more accurate to say that &quot;Using the current presets, RAWR.HolyPriest is inaccurate.&quot;<br>\r\n<br>\r\n@TNSe<br>\r\n    Thank you very much for getting back to me TNSe.  That would be a huge step in the right direction and remove the &quot;inaccuracy&quot; I referred to in my original post.<br>\r\n    Consider this, then, a feature request.  Would it be possible to generate a burst/sustained HPS rotation similar to what RAWR.Mage does for DPS?  Obviously, healing is much more subjective than DPS, however, it would be nice to know things like &quot;is CoH worth keeping in my rotation (other than an instant cast to use while moving)?&quot;, or &quot;How stacks of serendipity should I get before PoH is worth it?&quot;<br>\r\n    Blame Kavan for this feature request.  If he hadn't done such a great job with the mage module, I wouldn't have known what was possible =D.<br>\r\n    \r\n",
    "PostedDate": "2009-04-26T14:03:44.177-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "183829",
    "ThreadId": "54523",
    "Html": "<p>This is the problem with healing, unlike DPS you cannot really come up with an optimal healing rotation. How you heal changes from fight to fight, from what other healers you got with you, what raidbuffs you got, what tank you got. However, in general I've found that as long as you try to gear for the most challenging fight you've encountered and completed, this gear will be appropriate for mostly everything. (Currently I'm geared for pre-nerf 25 man Ignis).</p>\r\n<p></p>\r\n<p>Generating an optimal rotation is not going to be a high priority, and the way healing works, its either throughput or heal per mana. There's just no simple black and white for healing like it can be for DPS.</p>\r\n",
    "PostedDate": "2009-04-26T14:13:35.783-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "183836",
    "ThreadId": "54523",
    "Html": "Isn't it simply a matter of generating the most HPS that can be sustained for the duration of the fight, taking into account the buffs and options set within RAWR?  True, it's unlikely you're going to need that kind of HPS, but isn't it just as important for a healer to know how to optimize his/her spell rotation as it is for a DPSer?\r\n",
    "PostedDate": "2009-04-26T14:38:54.507-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "183843",
    "ThreadId": "54523",
    "Html": "The only way you can have an optimal heal rotation is if your raid members agree to take damage in a predictable pattern.  Maybe for an overgeared raid this is possible, but normally I'm finding periods of time when I'm doing nothing at all (i.e., dps'ing) and then times when I'm dumping out as much healing out as possible.  When those times occur are dependant on multiple factors including boss abilities, lag, and raid member stupidity or lack thereof.<div><br></div><div>It sounds like you're asking for a healing rotation that you can use with your eyes closed, irrespective of the current situation.  Every heal I cast is dependant on the target to be healed -- it doesn't make any sense to throw a GHeal out on a mage, even if it's &quot;up in the rotation.&quot;  I'd use a FH and save the mana used on the GH for the next big tank spike.</div>",
    "PostedDate": "2009-04-26T15:12:23.187-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "183846",
    "ThreadId": "54523",
    "Html": "That's not at all what I'm looking for.<br>\r\n<br>\r\nHere are a couple examples.  <br>\r\n<br>\r\nI'm disc in a 10 man raid and healing a tank who's taking massive amounts of damage.  My one and only job is to heal the tank.  The only way I can keep him up is my absolutely maximizing my HPS.  What spells should I be using?  Based upon my knowledge, I should never cast renew as disc.  Is that correct?  We saw this situation fighting Ignis-10 last night.  We decided to just OT all the adds and DPS the boss.  Had a holy priest, disc priest, and resto shaman.  We took him down that way, but he died right after the OT died and the wipe was beginning.  If the disc priest had been optimizing his heals, maybe the resto shaman wouldn't have had to bounce a heal off the MT and the OT wouldn't have died.<br>\r\n<br>\r\nWhat if I don't dual spec into disc and have to single target heal?  Should I cast two flash heals on the tank before my greater?  Three?  None at all?<br>\r\n<br>\r\nGoing back to Ignis-10 pre-nerf, the damage output was rediculous and raid wide.  I was on raid heals, which meant some combination of FH, CoH, PoM, and PoH.  Obviously keep PoM bouncing around, use binding heal on someone in party with me if needed, CoH when it's up, FH on my party members to stack serendipity, and PoH on the other party.  Then you have to ask though, is CoH worth it since it won't stack serendipity and my haste puts my flash heal down to almost a GCD anyways?  Though, with CoH you have more chance of a surge of light proc.  Is that proc worth it since your next FH won't have a chance to trigger Holy Concentration?<br>\r\n<br>\r\nMaybe I'm too much of an optimizer, but that's what this program's all about, right?  Optimizing your character?\r\n",
    "PostedDate": "2009-04-26T15:30:51.133-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "183848",
    "ThreadId": "54523",
    "Html": "But that damage isn't steady. If you calculated the 'optimal rotation', that used exactly how much mana you have, and provided the most HPS from that, you'd be gimping yourself. Sure, you have a decently high, constant stream of healing, but that doesn't match the damage intake of the tank. There are spikes, there are lulls. You can tweak your rotation on the fly, to increase your HPS in response to the spikes, and save mana during the lulls.<div><br></div><div>That's why the custom 'rotation' setting is useful. Heal as you need to in a hard fight, and optimize your gear to match that. If you think you use too many of spell X, reduce the number for it, and see how that changes your HPS/HPM. One point you mentioned that I think is interesting though, is the relation between those custom choices of spells, and fight duration. TNSe, how is that handled? If the optimal thing to do is to increase your haste, and fit in more filler spells, for example, is that handled?</div>",
    "PostedDate": "2009-04-26T15:42:46.957-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "183852",
    "ThreadId": "54523",
    "Html": "One of the options available in the HolyPriest module is the percent of time spent in the five second rule (FSR).  That's what we set to indicate the amount of time you spend in those lulls, not casting.<br>\r\n<br>\r\nAs for reducing the number of spell X, it would automatically reduce the healing numbers since the custom setting is based upon casting spells x, y, and z  a, b, and c times respectively in the given time interval.  If you reduce the number of times you cast a spell, you reduce the amount of healing you did during that time period.\r\n",
    "PostedDate": "2009-04-26T16:07:52.39-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "183862",
    "ThreadId": "54523",
    "Html": "<p>The problem with healing is that there is no direct optimal way to do the healing. You can argue you did it right if noone died during a boss kill. Thus I feel it would be wrong if Rawr started going around telling people how to heal optimally. Its really down to the individual person to figure out what heals they need to use in certain situations.</p>\r\n<p></p>\r\n<p>Like with Renew. Is it worth keeping up? In HPS? Yes. It is pretty awesome healing per time used casting it. Is it effective? Not really. So when do you cast renew? When tank is topped off and you got a free global cooldown. Atleast, thats from my point of view as Discipline. This varies a lot from fight to fight, and depends on your other healers as well.</p>\r\n<p></p>\r\n<p>If you have a strict rotation of CoH-ProM-FH-FH-PoH, and you see a mage with very low hp, and you got a Surge of Light proc from the PoH, do you CoH on him or do you use the Flash Heal? You may argue that obviously, CoH and then use SoL is the obvious answer, but it also depends on the fight, heck, maybe even PW: Shield is the better answer.</p>\r\n<p></p>\r\n<p>This is why I added the custom rotation option. Every person heals differently, and usually its not directly wrong. If you go out of mana, you can't ask Rawr why you go out of mana, but Rawr can help you try to not go out of mana by changing gear, enchants and maybe even spec.</p>\r\n<p></p>\r\n<p>And if you really need to gear, gem and spec for throughput, you can always try to optimize by selecting throughput instead of overall.</p>\r\n",
    "PostedDate": "2009-04-26T17:06:46.487-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "183914",
    "ThreadId": "54523",
    "Html": "I disagree, but you're the one who's doing the programming, so it's ultimately up to your discretion.  Hopefully I'll have some time in the near future to get some experience with C#.<br>\r\n<br>\r\nI'll go back to my speadsheeting for rotation development for now then.  Thanks.\r\n",
    "PostedDate": "2009-04-26T21:21:32.663-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "183995",
    "ThreadId": "54523",
    "Html": "It would be helpful if you were a bit more specific about which parts you disagree with. I know what you disagree with in general, but I'd like to know a bit more specific.\r\n",
    "PostedDate": "2009-04-27T02:16:25.9-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "184045",
    "ThreadId": "54523",
    "Html": "Okay.  I figured I'd just become a bother by this point, and I didn't want to do that.  I'll sit down tonight when I get a chance and be more specific.\r\n",
    "PostedDate": "2009-04-27T05:18:23.283-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "184056",
    "ThreadId": "54523",
    "Html": "I'd appreciate that, maybe I can figure out something beyond what I expected people to have need for.\r\n",
    "PostedDate": "2009-04-27T05:56:27.247-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "184131",
    "ThreadId": "54523",
    "Html": "I don't want to speak for seitaer, but now I think I see what he's getting at.<div><br></div><div>While you don't want the program to tell you how to heal, it would be nice to know, &quot;what's the most hps I can put out *right now*&quot;.  Gear that would help increase this corresponds to the HPS-Burst value.  Then, it would be nice to know, &quot;what's the most hps I can put out over X seconds&quot; (where X is typically the fight length, but not necessarily).  This is HPS-Sustained.</div><div><br></div><div>So, we get the value of gear to achieve those goals, but we don't see what the rotation is used to achieve that.  If I understand the current model correctly, you're using a single set of spells (I want to avoid the term &quot;rotation,&quot; since that gets us back into the &quot;don't tell me how to heal&quot; discussion.  However, I know that if I want to dump out a ton of healing with disc, hitting PW:S-&gt;Penance-&gt;Gheal is probably the best.  That doesn't mean I'll use it all the time, but it's nice to know.</div><div><br></div><div>When you figure mana in, it gets tricky (i.e., when do I sacrifice a GCD to pop squid?). </div><div><br></div><div><br></div>",
    "PostedDate": "2009-04-27T09:40:24.013-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "184144",
    "ThreadId": "54523",
    "Html": "All spells are listed with their HPS/HPSC and HPM values below the rotation, and if you mouseover the rotation you can see what Rawr did...\r\n",
    "PostedDate": "2009-04-27T10:05:23.443-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "184992",
    "ThreadId": "54523",
    "Html": "Updated Holy/Disc raid rotation + recent changes. I'll see what I can do about the rest.\r\n",
    "PostedDate": "2009-04-29T07:24:31.777-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "185610",
    "ThreadId": "54523",
    "Html": "Is there a beta available with the updated rotations?",
    "PostedDate": "2009-04-30T09:48:17.083-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "185622",
    "ThreadId": "54523",
    "Html": "<p>I think things have changed in the core of Rawr since last beta so I cannot easily make one without giving out an entire Rawr. But I did update quite a lot in the ShadowPriest model, so hopefully Astry will be making a new release sometime soon.</p>\r\n<p>The new holy rotation for Raid healing looks like:</p>\r\n<p>ProM(4 targets) - CoH - FHx2 - ProH - CoH - FHx2 - ProH (repeat)</p>\r\n<p>This matches somewhat to the logs I went through from Holy Priests on AoE healing intensive fights.</p>\r\n",
    "PostedDate": "2009-04-30T10:06:12.733-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "186394",
    "ThreadId": "54523",
    "Html": "Sorry it's taking me so long to get back to you.  I'll try to get you some equations soon.  It's just finals time.\r\n",
    "PostedDate": "2009-05-03T21:18:04.437-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "233467",
    "ThreadId": "54523",
    "Html": "<p>Good morning,</p>\r\n<p>I'm playing as holy priest and I don't get how rawr optimizes the gemming. Now the role of a holy priest is to react quick at the raid damage, and, in my opinion,&nbsp;you react quickly when you have tons of haste helping you out. I don't have a rotation, there's no rotation for a holy priest and for healing in general, it's all about reflexes and predicting the damage when predictable, a rotation might come out for Anub fight but usually i keep up ProM when it's not on CD, CoH is used for burst healing and&nbsp;i cast Flash Heal to haste the ProH. So my gear is balanced around haste and rawr judges that awful for HPS burst (sockets everywhere 23sp, too bad every holy priest spell has bad coefficiens for SP) or HPS sustained (sockets int everywhere).</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-09-11T01:36:28.86-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "233503",
    "ThreadId": "54523",
    "Html": "<p>It would help me a lot if you could post this as a new Issue, and attach your character.xml file, along perhaps with a WMO/WOL URL (parsed log). Also Holy Priest has rather good Coefficients for Flash Heal and Prayer of Mending.</p>",
    "PostedDate": "2009-09-11T03:49:48.97-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]