[
  {
    "Id": "184436",
    "ThreadId": "54702",
    "Html": "I play a Tankadin and have the Reticulated Armor Webbing (+800 armor) on my Gauntlets of the Disobedient.&nbsp; This is an Engineering tinker enchant for gloves that was added in 3.1 for those with 400+ skill.&nbsp; Will this be added into the next build?&nbsp; Also how can I model +800 armor on my gloves as a custom enchant in the meantime?<br>\r\n<br>\r\nhttp://www.wowhead.com/?spell=63770<br>\r\n",
    "PostedDate": "2009-04-28T03:53:41.1-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "184611",
    "ThreadId": "54702",
    "Html": "<p>Hey,</p>\r\n<p>until the enchant is supported you can edit an item  (Right click-&gt;Edit) and add the value 800 to 'Bonus Amor' (not 'Armor') in the 'Basic Stats' part of the scroll list.</p>\r\n<p>To get an idea of what the armor of the enchant is worth in terms of points, I guess you can compare it to the rating of that 850 armor trinket (Defenders Code).</p>\r\n",
    "PostedDate": "2009-04-28T10:24:51.98-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "184614",
    "ThreadId": "54702",
    "Html": "I have the same problem; I'm trying to model the +15 Agility my Flexweave Underlay now gives my parachute-modded Aged Winter Cloak on my feral druid. Custom enchants would really help the model in cases where a new enchant isn't yet in the database; there's no current way to add one from Wowhead either like you can for items.<br>\r\n",
    "PostedDate": "2009-04-28T10:29:31.357-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "184619",
    "ThreadId": "54702",
    "Html": "Didn't see that response (alt-tabbing means I took five minutes to post?), but anyway, editing the item works for modeling the enchant to gear other slots, but then every other possible cloak upgrade will be assumed not to have that enchant (since I'd have edited it in to my current one) so there's no way to see what it'd be like if I get the same enchant unless I do the same for all of them. (then again, if it's a marginal enough upgrade that the enchant makes all the difference on whether or not it's better, I probably shouldn't bother and just look at Ulduar loot instead...)<br>\r\n<br>\r\nI've actually used that very technique to model lower-level agility enchants that I put on my leveling gear because I had spare scrolls sent over from my auction/bank mule/green melter, who's currently trying to eke out the last 10 points to 350 enchanting so as to melt greens that won't sell, that I get out of &lt;strike&gt;Karazhan&lt;/strike&gt;Naxxramas. And now I use my engineering tinkers to get cheap back/glove enchants.<br>\r\n",
    "PostedDate": "2009-04-28T10:36:27.94-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "184717",
    "ThreadId": "54702",
    "Html": "Thank you very much.&nbsp; I will play with that when I get home from work in 13 hours or so.&nbsp; I will also try using it to model the AGL and Spell Damage cloak parachutes to see how that affects my avoidance and AOE threat since I am over the DEF cap.<br>\r\n<br>\r\nAlfie, isn't engineering a blast?&nbsp; Moll-E, Scrapbot, and You!<br>\r\n",
    "PostedDate": "2009-04-28T14:24:36.037-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "184742",
    "ThreadId": "54702",
    "Html": "Indeed it is! ...However, it would be more of a literal blast had I picked Goblin Engineering over Gnomish. ;) Ah well, I don't use bombs all that much anyways, since it pops me back into humanoid form.<br>\r\n",
    "PostedDate": "2009-04-28T15:19:15.423-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "184755",
    "ThreadId": "54702",
    "Html": "<p>I did add the enchant to the enchants.cs, should be included when the next realease comes out.</p>\r\n<p>Any other engineering enchants missing ?</p>\r\n",
    "PostedDate": "2009-04-28T15:46:43.223-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "184759",
    "ThreadId": "54702",
    "Html": "Here are the engineering enchants that affect a rating or damage:<br>\r\n<br>\r\nhttp://www.wowhead.com/?spell=55016 Nitro Boosts, +16 crit rating (and a 2 second run speed increase every 3 minutes)<br>\r\nhttp://www.wowhead.com/?spell=54998 Hand-Mounted Pyro Rocket, 1440-1760 fire damage every 60 seconds, information is limited on how it is affected by spell crit chance but it can crit. They apparently were buffed in 3.1.<br>\r\nhttp://www.wowhead.com/?spell=54999 Hyperspeed Accelerators, +340 haste rating for 10 seconds every 60 seconds. I know these are already modeled because they're listed as the best in slot glove enchant for cats. :3<br>\r\nhttp://www.wowhead.com/?spell=63770 Reticulated Armor Webbing, +800 bonus armor. Contrary to the description, it seems that it works on leather gloves as well (though I haven't verified that for myself yet, since my tanking gloves are also my cat gloves, so they share the same Hyperspeed Accelerators. :( )<br>\r\nhttp://www.wowhead.com/?spell=55002 Flexweave Underlay, +15 Agility (and a parachute). I've currently got this approximated in my Rawr modeling with a +16 Agility enchant.<br>\r\nhttp://www.wowhead.com/?spell=63765 Springy Arachnoweave, +18 spell power (and a parachute).<br>\r\n",
    "PostedDate": "2009-04-28T16:08:47.69-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "184895",
    "ThreadId": "54702",
    "Html": "That looks like a comprehensive compilation of our mostly new &quot;enchants&quot; from tinkering.&nbsp; I have the haste enchant on my Ret set and might put it on my Holy set (save for talented instants, our heals take 1.5s and 2.5s to cast).&nbsp; Since I am now DEF capped, I am debating on adding back in the Flexweave Underlay for the next time I accidentally hit the &quot;,&quot; key while flying and start falling because I cast Kings on myself.&nbsp; Beats wasting a bubble, especially if I do it again soon after when checking the map.&nbsp; +15 AGL would be good for my avoidance.<br>\r\n<br>\r\nThank you for your help and hard work, Negarine.&nbsp; I look forward to the next build.&nbsp; This program y'all created is wonderfully awesome!&nbsp; The Reticulated Armor Webbing can be added to all armor types (even cloth), so clothies rejoice.&nbsp; :)<br>\r\n<br>\r\nAlfie, I went Goblin back when pally pulling meant edging toward mobs.&nbsp; Kind of regretted missing out on toys, but having siege bombs rocks now in PVP.&nbsp; Also good for if low on mana (ie not tanking enough mobs) and I can't afford to Consecrate.&nbsp; Are you my same furry friend from Jenny's board?&nbsp; If so, feral certainly suits you.<br>\r\n",
    "PostedDate": "2009-04-29T03:08:23.113-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "185262",
    "ThreadId": "54702",
    "Html": "Indeed I am! And the flexweave is good for when I try to hit flight form to arrest a fall only to remember that I'm in southern Azeroth/Dalaran/Wintergrasp...<br>\r\n",
    "PostedDate": "2009-04-29T17:16:27.403-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "232547",
    "ThreadId": "54702",
    "Html": "<p>Hi,</p>\r\n<p>I'm a new user of RAWR and was just wondering if it is still planned to add the updated tinkering enhancements that currently are not included such as the Hand-Mounted Pyro Rocket. Given this item in particular no longer consumes a GCD when used and the hits are critable it now seems to offer higher DPS than the Hyperspeed Accelerators up to certain gearing lvls. My own basic testing leads me to believe that crit chance  is based on the users stats however atm I am am not sure if crit dmg modifiers from talents or other sources apply to the dmg. I suspect it does as I have observed hits in excess of 3030.</p>",
    "PostedDate": "2009-09-08T23:25:32.133-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "232556",
    "ThreadId": "54702",
    "Html": "<p>What model are you talking about? Special effects like that are very model-specific.</p>",
    "PostedDate": "2009-09-09T00:04:17.58-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "232962",
    "ThreadId": "54702",
    "Html": "<p>Without more context I cannot understand what you mean by the terms Model and special effect, please elaborate.</p>",
    "PostedDate": "2009-09-09T23:44:07.073-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "232970",
    "ThreadId": "54702",
    "Html": "<p>Models... Cat, Bear, Healadin, ShadowPriest, DPSDK, Rogue, etc.</p>\r\n<p>Special effect... Anything that's really a 'special' effect. This should be obvious. Typically temporary stat bonuses, procs, things with significant cooldowns, on use effects, etc.</p>",
    "PostedDate": "2009-09-10T00:01:58.367-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "233225",
    "ThreadId": "54702",
    "Html": "<p>Ah Ok, I guessed that's what you meant by special effect but wanted to be sure.</p>\r\n<p>The testing was done on a Mage with 2/2 in Spell Power and a CSD Meta, those are the only 2 crit dmg modifiers. It terms of Crit chance I was testing with 22% and 35% Crit by buffing molten armour or not. As I said my own testing leads me to believe that characters crit chance and crit dmg impacts the rockets but I don't have a large enough sample of hits yet for a statistically valid conclusion. The information about the gcd trigger removal and cooldown reduction was in patch 3.1 notes (aswell as an increase in dmg) and they were given a further dmg increase in patch 3.2.</p>",
    "PostedDate": "2009-09-10T10:49:41.573-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "233234",
    "ThreadId": "54702",
    "Html": "<p>&gt; characters crit chance and crit dmg impacts the rockets</p>\r\n<p>If true, would a Death Knight's &quot;spells do double damage on criticals&quot; affect this? I can't test this currently because my only engineer is a druid, and my only DK is Inscription/Skinning. (For RP purposes, I say he makes his own parchment. ;)</p>",
    "PostedDate": "2009-09-10T11:04:46.22-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "235011",
    "ThreadId": "54702",
    "Html": "<p>With a larger sample size repeatedly what I found was that the crit chance conveged with my spell crit + crit buffs. The rockets even seem to benefit but&nbsp; not use up arcane potency.</p>\r\n<p>&nbsp;</p>\r\n<p>I still don't know what if any crit dmg modifiers impact the dmg, Highest normal hits were 2077 and crits of 3418 in 3 testing periods with over 100 shots fired. Given there were a small number of max 2077 hits it is likely that no max crit hits were recorded, the avg normal hit was in the region of 1953 and avg crit was in the region of 2980 which indicates that crit dmg is in excess of 150% but I'll get back to u later with more testing results on this,</p>\r\n<p>&nbsp;</p>\r\n<p>More testing with other models and special effects is needed. Unfortunately the only engineer I have atm is the mage.</p>",
    "PostedDate": "2009-09-15T23:34:23.483-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]