[
  {
    "Id": "184612",
    "ThreadId": "54747",
    "Html": "Either I have not set something up right or I simply don't understand the gemming templates.&nbsp; If I use the regular templates it keeps telling me to re-gem red sockets to blue gems, it does not seem to understand that I cannot put a &quot;solid&quot; stam gem in a red or yellow socket.&nbsp; Is ther something I am missing?<br>\r\n",
    "PostedDate": "2009-04-28T10:27:16.07-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "184635",
    "ThreadId": "54747",
    "Html": "<p>Yes, you are missing the fact that color of a socket only needs to be matched in order to gain the bonus of the sockets.</p>\r\n<p></p>\r\n<p>Or: You can put any color gem into any socket.</p>\r\n",
    "PostedDate": "2009-04-28T11:22:26.86-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "185012",
    "ThreadId": "54747",
    "Html": "LMAO, wow do I feel like a noob, I have never even tried to put a gem of the wrong color in a slot.&nbsp; Oh Well Thanks for the information!<br>\r\n",
    "PostedDate": "2009-04-29T08:04:58.83-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "185061",
    "ThreadId": "54747",
    "Html": "On this note, I was having difficulty limiting the gems that would be available for the optimizer.&nbsp; I wanted to test the gearing with only using spell power gems, so under the gems I checked the runed dragon's eye and the runed scarlet ruby.&nbsp; When I ran the optimizer it instead chose to throw in a few +9sp +8hit gems along with my original options.&nbsp; Is there something else I need to configure to limit this?<br>\r\n",
    "PostedDate": "2009-04-29T09:37:22.377-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "185095",
    "ThreadId": "54747",
    "Html": "There's an option (Tools &gt; Options) to count any gems in enabled gemming templates as available to the optimizer, which is on by default. You'll want to turn that off, for that test.",
    "PostedDate": "2009-04-29T10:27:43.637-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "185569",
    "ThreadId": "54747",
    "Html": "I am curious to whether the optimizer takes into account meta gem requirements.&nbsp; I set the optimizer to max, and the gems socketed do not fill the requirement.&nbsp; Is this because I actually do get more dps by using other gems and not getting the meta benefit, or does the optimizer not track that far?<br>\r\n<br>\r\nEdit: Scratch this.&nbsp; Found the answer in another thread.&nbsp; I thought Enforce Gem Requirements made all gems the color of the socket.&nbsp; Thanks for the program guys.<br>\r\n",
    "PostedDate": "2009-04-30T08:09:28.943-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "185892",
    "ThreadId": "54747",
    "Html": "I am missing something with setting custom gemming templates? I am a jewel crafter and want to create a custom template with gems that I actually have access too. All the Jeweler templates currently only include epic gems and I don't have access to those. Is there a way to actually create a custom template with jeweler gems? I can see how this may be problematic for some that aren't jewelcrafters. But the gems specify right on them that they require jewelcrafting. If there isn't a way then I'll still to the base templates and just sub the jewelers gems in somewhere.\r\n",
    "PostedDate": "2009-05-01T07:51:40.587-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "185928",
    "ThreadId": "54747",
    "Html": "Err, yes, there is. What you're doing should be there. The Jeweler's default gemming templates use Dragon Eye's and blue quality gems, not any of the unavailable epic gems. So you probably should be using those. You also can create your own by hitting Add on that screen. Also, make sure you have Jewelcrafting items not filtered out (See filters, top right).",
    "PostedDate": "2009-05-01T09:23:26.357-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]