[
  {
    "Id": "186162",
    "ThreadId": "55148",
    "Html": "I recently started using rawr.mage to optimize my gearset. After a few recent upgrades I plugged in the new items and rawr gave me a combined value of 6036 with 3 runed rubys, 4 veiled topaz and 3 runed dragon's eyes. If i replace the rawr suggested veiled in my T8 helm with a dragons eye and the rawr suggested dragons eye in my T7 robe with a veiled, I lose 140dps according to rawr. My stats dont change one bit in terms of damage, hast, hit, crit, int, etc. I swapped because I plan to keep the helm a bit longer than the robes and it just made sense given that I thought they were the same. Is this a bug in the way rawr calculates gem worth in a particular item slot? Identical stats should yield the same amount of dps and value regardless of gem placement. Perhaps I am just doing something wrong or missing something in my calculations. Any help or insight would be greatly appreciated.<br>\r\n<br>\r\n<br>\r\nEdit: If I manually equip custom gemming (choosing the same gem) to my robe and hit OK the score changes to 6036 but loading from armory still shows me 140dps lower until i manually re-add same gems. <br>\r\n",
    "PostedDate": "2009-05-02T13:34:20.183-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "186176",
    "ThreadId": "55148",
    "Html": "Sounds like you're affecting some other change. If you want us to actually tell you what's going on, you'll have to actually post your character.",
    "PostedDate": "2009-05-02T15:03:41.087-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "186182",
    "ThreadId": "55148",
    "Html": "Sorry i left that out, character name is Aizlynn on Burning Legion. As i said, if i load from armory i have a score of 5898.60 dps 5896.69. If i then go to my chestpiece, select one of my veiled NT go to equip custom gem and select veiled NT again (same gem thats in there) and hit OK, the score changes to 6036.45 dps 6034.54. This is all being done on a freshly extracted 2.2.1 version of the software.<br>\r\n",
    "PostedDate": "2009-05-02T15:13:14.647-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "186194",
    "ThreadId": "55148",
    "Html": "There is a bug in 2.2.1. When you load from armory the set bonuses won't be calculated until you make some change. Best workaround is to save character to file once you open it from armory and then open the file.\r\n",
    "PostedDate": "2009-05-02T17:00:31.563-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]