[
  {
    "Id": "186257",
    "ThreadId": "55176",
    "Html": "Now that we can Dual Spec, I have made the move to Prot/Holy and have been gathering a Holy set.<br>\r\n<br>\r\nMy question is this:  Can the Healadin Model be set up to allow for int/crit &gt; Haste &gt; SP build ?<br>\r\n<br>\r\nAs from what I have been reading this should be a solid path  I tweaked the setting as much as I could, and using the Burst model as a base I still can't get Haste down.<br>\r\n<br>\r\nWhat that turns out is that if I run the optimizer, I end up with almost 800 HR for the gear I have &quot;avaliable&quot; to me.<br>\r\n<br>\r\nI really would like to cap that at 540 ish, kinda like can be done with the Prot Pally optimizer.  Or am I missing something compleately and there is already a way to do this?  The Fight build does not work for me, as with all the reading and practice I have done MP5 is very overvalued.  So I end up with a set with so much MP5 that I will never run out of mana, but I can't heal for much or I have so much haste I can go go OOM faster then a mage.<br>\r\n<br>\r\nThere should be a way to set limits to avoid this.<br>\r\n<br>\r\nThanks for reading my rant.<br>\r\n <br>\r\nDave<br>\r\n<br>\r\nEdited because Firefox fails at formatting BB type posts.\r\n",
    "PostedDate": "2009-05-03T05:57:31.53-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "186264",
    "ThreadId": "55176",
    "Html": "It's hard to tell from your description, but you are trying to optimize for either fight or burst healing in the optimizer and you don't like the results? Try optimizing for overall rating and change the burst scale in options depending on how much you want to favor burst. ",
    "PostedDate": "2009-05-03T07:04:52.207-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "186265",
    "ThreadId": "55176",
    "Html": "I was trying to optimize for Busrt, but I will try that and see waht happens.<br>\r\n<br>\r\nThanks for the quick response.<br>\r\n<br>\r\nDave\r\n",
    "PostedDate": "2009-05-03T07:09:30.903-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "186279",
    "ThreadId": "55176",
    "Html": "Oh well, still no luck.  It seems that no matter waht I set teh sliders at or change the drop downs to, I end up with either may too much Haste (700+) or I am drowning in MP5.<br>\r\n<br>\r\nGuess it is back to Wowhead and trying to tweek those boxes again.<br>\r\n<br>\r\nDave\r\n",
    "PostedDate": "2009-05-03T08:34:47.15-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "186301",
    "ThreadId": "55176",
    "Html": "I don't get the issue you are having. If you want more burst healing then haste is the best for you. While mp5 isn't the best stat per item point, it isn't that much worse then crit. I think the problem you are having is that you have an incorrect preconceived notion on how much stats are worth, an you expect Rawr to follow that. ",
    "PostedDate": "2009-05-03T10:34:59.227-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "186307",
    "ThreadId": "55176",
    "Html": "I guess that must be it then.  I mean, yes I understand I need MP5, but not at the expense of Int/Crit.  I know I need Haste, but anything more then 500-540 is pretty much overkill.<br>\r\n<br>\r\nI do value Haste pretty high, but only up to 500ish.  At that point with raid buff, my FoL is pretty close to 1sec and HL are fast enough to spam.  At that point I am gonna be chain casting anyways, so I will never hit the FSR (which if memory serves me got nurfed hard this last patch), with Pally talents Crit becomes king for mana regen, therefore more value up to a point.  Int is just plain stelar alaround, but if you are stacking Haste and crit you should get plenty of Int, which with all the new mana regen mechanics is a fantsic replacement for MP5.<br>\r\n<br>\r\nI guess mainly waht I am asking for is a way to setup the Optimizer to allow for a limit.  Yeap, set it to burst healing, but cap at X haste as more is not going to help, yeap set it to fight, but cap MP5 at X, becuase sure you can regen a ton of mana now, but you do not have any SP for your heals are not effective.<br>\r\n<br>\r\nThe hardest part about healing and determining an upgrade is the balance of gear and playstyle, at some point we all hit the baseline of what we need for the content we are in, but to properly improve on that we have to balance the gains vs the losses to make sure we are still capable of doing the same content.<br>\r\n<br>\r\nTell you what.  I will stop responding to this thread for the day as I am stuck at work for the time being.  I will get home and gather my numbers and try to do a better job of explaining what I am looking for.  As I do not waht everyone to feel like this is going in circles.<br>\r\n<br>\r\nDave\r\n",
    "PostedDate": "2009-05-03T10:49:11.217-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "186328",
    "ThreadId": "55176",
    "Html": "Slow days at work I think can get me in trouble if I am not careful.<br>\r\n<br>\r\nPlaying around with the optimizer, setting it to optimize for Overall rating with the additional requirement of Burst rating being less than or equal to 6,251, I was able to get the Spell Haste to stay close enough to 35% to make he happy that I was not overdoing haste.  Took about 15-20 runs of the optimizer to get this fine tuned to that point, and it was pretty amazing to watch the gear swap in and out and back again.  So I believe what I was looking for will be possible, just need to play around alot more then I expected.<br>\r\n<br>\r\nWould still be easier if there was something in the additional requirements that would let you cap it at certain points, and just let it run an overall.<br>\r\n<br>\r\nOh well.<br>\r\n<br>\r\nThat being said.  Thank you for the fine coding work.  I know dealing with endusers like myself that know enough to know I dont know enough drives people crazy.<br>\r\n<br>\r\nKeep up the good work.<br>\r\n<br>\r\nDave\r\n",
    "PostedDate": "2009-05-03T13:45:06.8-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "186334",
    "ThreadId": "55176",
    "Html": "I think you're thinking than more haste rating, past 500, isn't worth more, when actually it is. The Optimizer is pushing more haste, because that really is optimal. &quot;<span style=\"color:rgb(48, 51, 45);font-family:'segoe ui';font-size:13px\">At that point with raid buff, my FoL is pretty close to 1sec and HL are fast enough to spam</span>&quot;, you say, but FoL could still get to 1sec, and haste doesn't change how 'spammable' HL is.",
    "PostedDate": "2009-05-03T15:02:35.62-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]