[
  {
    "Id": "187567",
    "ThreadId": "55542",
    "Html": "Is it possible to set up a separate language file for Rawr interface, so that it can be easily localized by Asian language users?<br>\r\n<br>\r\nAdditional, is it possible to update item cache from the armory in localized language? Current version always update item cache in English even the character data is loaded from an non-English armory.<br>\r\n<br>\r\nThx for the great job from Rawr team!<br>\r\n",
    "PostedDate": "2009-05-06T19:42:18.007-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "187573",
    "ThreadId": "55542",
    "Html": "In the Options, you can choose a locale, and data from that locale will be loaded from local Wowhead (though not Armory, I don't think).<div><br></div><div>Currently, Rawr's interface does not support localization, but if anyone wants to assist with that, they're welcome to.</div>",
    "PostedDate": "2009-05-06T20:03:46.69-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "187579",
    "ThreadId": "55542",
    "Html": "In the options, locale does not support TW/CN/KR while &quot;Load from Armory&quot; in the file menu does. <br>\r\n<br>\r\nSince there are both &quot;Update item cache from the armory&quot; and &quot;Update item cache from wowhead&quot; in the tools menu, I believe that item cache is possible to be updated from local armory of TW/CN/KR, it just needs a locale option.<br>\r\n<br>\r\nA separate language file for interface will be very easily localized by anyone whether he/she knows C# or not, could you please consider it in the future version? <br>\r\n<br>\r\n<br>\r\n",
    "PostedDate": "2009-05-06T20:46:38.5-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "187583",
    "ThreadId": "55542",
    "Html": "Ahh, I see. I think there just isn't TW/CN/KR version of Wowhead. Armory should be able to support different locales for item lookups.<div><br></div><div>And yeah, nothing to consider, I'm all for Rawr being localized. There needs to be some development support done before the actual localization files can be created, and if anyone wants to do that, that'd be great.</div>",
    "PostedDate": "2009-05-06T21:15:19.967-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]