[
  {
    "Id": "187650",
    "ThreadId": "55565",
    "Html": "I'm a shadow priest tailor and have recently switched back to using Lightweave Embroidery on my cloak now that it has a proc of 250 spellpower for 15 seconds instead of the &quot;lightweave bolt&quot;, but under cloak enchants there's no option for either this or Darkglow (chance to restore 300 mana when you cast a spell, possible choice for healing tailors).<br>\r\n<br>\r\nI just started using RAWR today and am all sorts of excited about it, by the way, incredible job on this.  I downloaded the application from the download link on the front page; is it possible I don't have the most recent version?  I've been reading some of the discussion threads and one mentioned haste being overvalued now that basically all theorycrafting for shadow priests shows that crit is better and that that particular issue was corrected, yet my version of the RAWR application still seems to overvalue haste...\r\n",
    "PostedDate": "2009-05-07T01:38:15.65-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "187661",
    "ThreadId": "55565",
    "Html": "Procs and Uses have to be redone for ShadowPriest &amp; HolyPriest. Haste is not being 'Overvalued'. At some point in gearing haste is more worth than crit, sometimes crit is more worth than haste.\r\n",
    "PostedDate": "2009-05-07T02:03:15.33-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "187666",
    "ThreadId": "55565",
    "Html": "I see.  Then is there a way I can tell the application to prioritize crit over haste?  I'm not a fan of haste (it burned me badly and now I really dislike it) and am looking to build the best crit-centric set I can.  :)\r\n",
    "PostedDate": "2009-05-07T02:13:48.773-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "187674",
    "ThreadId": "55565",
    "Html": "<p>Can you please tell me your story about how you got burned badly by haste and now dislike it? It could be helpful to know.</p>\r\n<p></p>\r\n<p>If you have all your gear marked in Rawr, you can simply optimize for crit. Lets say you got 400 haste rating, and don't want more. You pick the right raid buffs, make sure all gear and enchants and gems are picked, then Tools-&gt;Optimize and add additional Requirements, put haste rating to what you dont want to exceed, and click optimize. (Haste Rating &lt;= 400 for example).</p>\r\n",
    "PostedDate": "2009-05-07T02:48:09.79-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]