[
  {
    "Id": "187851",
    "ThreadId": "55627",
    "Html": "Some of the modules in Rawr are simply outstanding, most notably the Rawr.Mage one.  Others are less so.<br>\r\nAre there any cross-module reviews or joint development activities going on between the module authors?<br>\r\nDo the module authors file any bugs against the other module owners since they likely to spot any shortcomings?<br>\r\n",
    "PostedDate": "2009-05-07T12:45:10.37-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "187873",
    "ThreadId": "55627",
    "Html": "Basically, no. It ultimately comes down to dedication of the model developer(s). Kavan is extremely dedicated, others are less so. There's not really anything I see that we can do about that; people have varying levels of time commitment, no way around that.",
    "PostedDate": "2009-05-07T13:37:14.343-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "188419",
    "ThreadId": "55627",
    "Html": "<p>However we do have private discussions on the forums here, where we exchange ideas and try to assist one another. So there is a degree of &quot;cross-review&quot; of modules. For myself (Enhance module) I learn how Rawr works by viewing the code from other modules and getting ideas. I'm sure others do likewise.</p>",
    "PostedDate": "2009-05-09T04:16:13.623-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "188429",
    "ThreadId": "55627",
    "Html": "<p>Indeed. Especially the shadow priest model has been a big inspiration when we started working on Rawr.Warlock, but even now we check how other developpers solved certain problems. I can't speak for others, but Fes and me are using Rawr for all our lvl 80 chars, which makes us familiair with the other models as well. In our case it is mainly a time-issue that prevents us from making warlock what we want it to be in the end.</p>",
    "PostedDate": "2009-05-09T05:26:04.263-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]