[
  {
    "Id": "188362",
    "ThreadId": "55774",
    "Html": "<p>I am new to Rawr and I am loving it but I am having a problem.&nbsp; I did an optimize with all my current gear/gems and for some reason it chose to select gear that put me under the hit cap for a shadow priest (289) or 11% and chose haste as a better stat for me.</p>\r\n<p>&nbsp;</p>\r\n<p>Now I am not sure if this is because my haste is lower than the rest of my stats or what?&nbsp; But I do know for a fact that I need to be at or even above 289 hit at all times and I am unsure of how to make it understand this.</p>\r\n<p>&nbsp;</p>\r\n<p>I appreciate any and all response to my questions!</p>",
    "PostedDate": "2009-05-08T19:57:45.74-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "188400",
    "ThreadId": "55774",
    "Html": "<p>What hit rating did it put you at? And for the haste, it probably picked some pieces with haste because they were allround better.</p>",
    "PostedDate": "2009-05-09T02:11:41.927-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "188464",
    "ThreadId": "55774",
    "Html": "<p>It put me down to only 8.96% hit rating.&nbsp; When I mouse over it, it even tells me I am 54 from hit cap... So I don't know what to do.&nbsp; I tried taking out the trinket it was putting in (thinking it would put in my hit trinket instead of my spell dmg with haste proc) but then in put my healing trinket which is just plain spell damage.</p>\r\n<p>&nbsp;</p>\r\n<p>Thank you for your response :)</p>",
    "PostedDate": "2009-05-09T09:23:11.683-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "188473",
    "ThreadId": "55774",
    "Html": "<p>Trinkets are currently not entirely correctly handled (read: not updated since 3.0).</p>\r\n<p>&nbsp;</p>\r\n<p>54 below hit cap seems extreme, I'd expect it to regem items to gain that hit. You could post your character.xml on the &nbsp;Issue Tracker and I'll take a closer looksie.</p>",
    "PostedDate": "2009-05-09T10:12:00.403-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "188543",
    "ThreadId": "55774",
    "Html": "<p>Ok I did that, of course today my computer would take today to go bottom up and we had to reset to factory settings so I had to re-run my optomizer from my husbands computer.&nbsp; When I did so, for some unknown reason, it chose some different gems and gave me even less hit *boggle* It now has it as under 64 hit cap lol.</p>\r\n<p>&nbsp;</p>\r\n<p>I just want to say thank you bunches!&nbsp; I absolutely love the mod, it helps me determine upgrades and not go in on minor upgrades for loot and such.&nbsp; I just want to know if I'm doing something wrong or something!</p>\r\n<p>&nbsp;</p>\r\n<p>:)</p>",
    "PostedDate": "2009-05-09T17:21:03.507-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "188609",
    "ThreadId": "55774",
    "Html": "<p>Warlock is giving me a similar problem. My lock alt is currently 26 pt over Hit Rating, and I'd like to know best gear/gem changes to reduce the excess hit. (I'm not depending on a given raid comp, so hit from buffs is 0% throughout.) Running the optimizer with only Overall Rating chosen gives a set with 14.06% hit (11.06% from HR, 3% Suppression), 78 HR below cap. Adding a requirement for Miss % &lt;= 0 gives a similar set 14.09% hit (11.09% from HR, 3% Suppression), 77 below cap.</p>\r\n<p>&nbsp;</p>\r\n<p>I decided to remove the Suppression talent, hoping that would give me a 14% set so that adding Suppression back would bring it to 17%. This time, I got a set with 16.85% hit (16.85% from HR, 0% Suppression), 4 HR below cap.</p>\r\n<p>Setting to 1% Suppression gives a set with 16.02% hit (15.02% from HR, 1% Suppression), 26 HR below cap. I'm wondering if the Optimizer is accounting for hit talents twice, somehow.</p>\r\n<p>&nbsp;</p>\r\n<p>Thanks for all your work!</p>",
    "PostedDate": "2009-05-10T06:19:31.77-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "189201",
    "ThreadId": "55774",
    "Html": "<p>Suppression was indeed counted twice for Warlocks, it's fixed in the next version.</p>",
    "PostedDate": "2009-05-12T03:31:17.907-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]