[
  {
    "Id": "188879",
    "ThreadId": "55943",
    "Html": "<p>Because the Prot side of things has been begging for some work, I've decided to bring my incisive wit and challenging... challenges to the Prot side of things.</p>\r\n<p>The ArP formula is all wrong - it is still defaulted to the old (pre-3.1) ArP values, including target armor and using the outdated calculations as far as I am aware.</p>\r\n<p>Defense as a purely defensive stat seems to be a little off - for example, equal amounts of Dodge and Defense are tied, when the amount for Defense should (generally, unless modeling for something specific) pull ahead.</p>\r\n<p>A large number of glyphs seem to be unmodeled.&nbsp; In fact, it seems that all but the &quot;special&quot; glyphs that are listed in the Options tab have no effect whatsoever.</p>\r\n<p>Hit may be slightly undervalued.&nbsp; Though I understand it is not a fantastic stat by any means, the raw 1% hit provided by the Draenei aura provides nearly 0 benefit (simply used as a basline measure of +hit benefit in the model), and seems to only be considering the direct DPS benefit, rather than the threat-preserving (especially early) boon that it provides.</p>\r\n<p>I don't think the model favors faster weapons (for Heroic Strike rage dumping frequency) enough, as a gut instinct.&nbsp; I haven't yet put my thumb on what this could be due to, or even if it's incorrect, but I am a little off-put that 2.6 speed Furious weapons are being ranked as nearly best-in-slot for a balanced, generic Ulduar fight.</p>\r\n<p>I don't currently see a method by which I could specify a specific type of damage - say, incoming breath attacks, or otherwise set amounts of expected magical damage.</p>\r\n<p>The 4-piece Siegebreaker (T8) bonus does not appear to be modeled, though it may just be marked as irrelevant due to a lack of magical damage.</p>\r\n<p>I could very much see a huge benefit for this specific module (and, really, all tanking modules) of simulating specific boss fight - that is, having a preset configuration for each boss.&nbsp; The only wrench to be thrown in on this that I see is that there would have to be a selector for the hard mode(s), as well, as most hard modes include increased damage in.</p>\r\n<p>I would also like to see a way to weight avoidance against effective health against block.&nbsp; That is, I see EH as being the sole determining factor of Time-to-Live in the gear rankings.</p>\r\n<p>There's other stuff, but that's all I remember off the top of my head.</p>",
    "PostedDate": "2009-05-11T08:50:06.587-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]