[
  {
    "Id": "189118",
    "ThreadId": "55996",
    "Html": "<p>I just started messing around with RAWR and im trying to wrap my brain around all the different options and functions but i cant find a site or thread anywhere that breaks down what the different settings are so i can properly configure it based on my needs but heres what i have so far from what i can understand and im wondering if i have the right idea and if how im setting it up is good or if im missing something. currently im trying to figure out the best gear possible with the settings ive chose then going backwards to what i have now in order to figure out what peices are actual upgrades because ive found in the case of T7.5 vs T8.5 at max gear T8.5 is the best but when i try to build upgrade list from what gear i have currently T8 doesnt show up at all which has me a bit lost.</p>\r\n<p>Mainly its just the options features that have me a bit lost heres the settings i beleive i have setup right.</p>\r\n<p>Activity 90% - ive found in Ulduar so far that each fight gives me at least 6 seconds a minute where i dont or cant cast so figureing out the numbers 90% was what i came up with on that</p>\r\n<p>Holy Shock 64% - i figure with T8 and the 2 set bonus im going to try to keep casting HS at least every 9 seconds which is where the 64% came from if my math was right</p>\r\n<p>infusion of light always cast with holy light and holy light set to 100% vs FOL at 0% because my end goal is to be able to spam HL during an entire fight</p>\r\n<p>sacred shield 100%</p>\r\n<p>fight Length - 5 minutes as ive come to beleive that the majority of the ulduar fights are about 5 minutes long and the few ive seen that arent (yogg for example) require me to change how i heal so completely that i dont have any OOM worries</p>\r\n<p>GHL Targets 5 as im basing it on 25 man and we always have enough melee around to get it</p>\r\n<p>Divine Plea 1.3 to coordinate with my greatness card</p>\r\n<p>replenishment 89% - i just left it how it started</p>\r\n<p>BOL 100% with 20% effect</p>\r\n<p>Burst is the only option that has me confused i have no idea what its supposed to signify all i can think of is how often you need to spam but i figured activity had that covered i have it set to 50% as thats as high as i can make it until i have to start casting FOL to save mana with the BIS items RAWR suggests</p>\r\n<p>If anyone could give me any help on understanding how some of these things work and maybe let me know if i have the right idea on the rest or if im actually as lost as i feel it would be greatly appreciated so far it looks like a great program at least once i understand what im doing</p>",
    "PostedDate": "2009-05-11T21:30:08.653-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "189124",
    "ThreadId": "55996",
    "Html": "<p>Build Upgrade Lists evaluates how much healing you do with that whole set. T8.5 isn't close to worth it until you get 4T8, so you won't see it on the comparison when you are breaking 4T7. Since it is comparing the lose of 4T7 versus gaining one piece of T8. GHL should not be set at 5 for most fights. While you might get that many procs on some procs, they will be almost all totally overhealing.</p>",
    "PostedDate": "2009-05-11T22:23:11.483-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "189234",
    "ThreadId": "55996",
    "Html": "<p>Ya i figured that about 4T8 and i do realise this program isnt for noob pallys getting into healing but if someone new were to be using it they would assume T8 of any combo 1-5 piece wouldnt be worth it because its never on the list and if someone was using RAWR to help them choose upgrades they would be passing on all T8 gear thinking it was worthless to them and if your in a guild that uses DKP or EPGP you cant afford to waste your points on loot that isnt an upgrade. Which is why i dont use the build upgrade list option on RAWR anymore rather just find out what my BIS items are then go backwards on each list item finding out what it rates as better than what i have then use optimize to figure out if the new peice i have will drop T7 off the list yet which i know wont be for a long while of gearing.</p>\r\n<p>About the GHL your right it would be nice to see an effectiveness on that as well much like the BOL one im guessing a good number to set would probably be 2 then it may hit 5 but more than likely on average 2 may need it since alot of ulduar does have AOE's</p>\r\n<p>thanks for the help on that part but Burst is still my lost point everything on there is generally mechanics and timing which with tweaking over time as i pay more attention to my healing will be set the way i need but Burst has me at a complete loss on what its function is all i know is the higher i set my burst the better T8 gets and lower my burst better T7 gets and i cant figure out why that is if activity is what decide how often your casting</p>",
    "PostedDate": "2009-05-12T05:09:55.88-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "189456",
    "ThreadId": "55996",
    "Html": "<p>I believe the burst scale in the Healadin model is similar to the slider in the tree model, it adjusts the relative weighting of burst healing (throughput, with no mana concerns) versus fight healing (called sustained healing in Rawr.Tree) (making your mana last for the complete fight duration). It doesn't change the fight statistics, but rather reflects your personal value of these 2 stats.</p>\r\n<p>I play with this depending on the type of fight I am considering: If I believe the fight's main challenge is due to outlasting (Sapphiron' constant damage leans towards this), I adjust towards sustained. If I believe it is rather going to be about surviving a short burst of damage, I adjust towards burst (Loatheb might fall more into this case, due to the burstiness/idle periods being enforced or surviving Anub'Rekhan Locust Swarm might be another candidate for this).</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-05-12T12:39:38.063-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "189530",
    "ThreadId": "55996",
    "Html": "<p>See that was my guess as well burst being how often you have to quick spam a target due to a large amount of incomming damage but then whats the use of activity since id assume activity is how much of the fight are you going to be casting so if i go 90% activity id assume that 90% of the fight ill be casting something either applying sacred shield or beacon or judgments or an number of healing spells so if 90% of the fight im casting something how does burst come in? Burst id assume would be me casting a heal only when its needed rather than chain casting the whole fight time but id think activity covers that scenario so in my mind either the burst scale or the activity scale is a contradiction of the other cause if i set my activity to 100% and fight time to 5 minutes that means RAWR should be caluculating my mana and heals based on me casting for 5 minutes straight non-stop so how can i then add a burst of say 100% its not like i can magicaly cast twice as fast during a 5 minute period when im already casting 100% of the time.</p>\r\n<p>Either the difference between the 2 needs to have an added tooltip on what they actually do or they need to be renamed to something that isnt a contradiction because im totally confused on how to set those 2 up so they actually do something other than add or subtract points from gear scores for the heck of it. that or i need a detailed explanation on what they actually cover lol</p>\r\n<p>*edit* just had this come to me after i posted but could burst actually mean how often during your activity are you casting for a power heal rather than an endurance healing meaning if you have actiivty 90% and burst 50% as much as your active for 90% of the fight 50% of the time youd rather have a more powerful heal rather than worry about your mana? so if you have those set RAWR will plan for you to be active 90% of the time but only make sure that 45% of that time you can chain cast HL without casting an FOL and the rest it will setup for big heals so in essence if your going 100% activity and 50% burst it will set it up that 50% of the fight you can spam HL and the other will be a mix of HL and FOL (plus all your other spells you have setup in options) to allow for big heals when needed and FOL top ups.</p>",
    "PostedDate": "2009-05-12T16:28:09.18-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "189554",
    "ThreadId": "55996",
    "Html": "<p>Burst isn't a measure of 'how often'. It's a scale of the importance.</p>\r\n<p>Think of a really basic situation where you have enough mana to spam HL for half the fight, and FoL for the other half.</p>\r\n<p>Your burst rating is based on the HPS of the highest burst healing you can provide (HL spam). Fight healing is based on the HPS over the whole fight (ie, half HL, half FoL). So basically, Burst Healing is your healing with unlimited mana, and Fight Healing is your healing with limited mana.</p>\r\n<p>The scalar in the options for it scales the Burst Healing value, so that you can raise or lower how much you value being able to push out higher burst when needed.</p>",
    "PostedDate": "2009-05-12T19:03:55.523-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "189576",
    "ThreadId": "55996",
    "Html": "<p>im apparently still not understanding all the options then setting up my character with complete BIS burst at 50%, activity to 90% the FOL/HL set to 100% HL and set to a 5 min fight&nbsp;when i goto stats on the gear page it shows my FOL's at about 1 sec total so does that means as long as im not casting for 10% of the fight i cam spam HL the entire fight minus renewing buffs without going OOM as long of course i dont have a bad crit streak? but if i raise my burst up say 25% then i can spam HL again but have to add in some FOL's to cover some of the over mana usage?</p>\r\n<p>now on the same note if i set burst to 0% and keep my activity at 90% switch the gear to the new BIS but it still says i never have to cast FOL to keep my mana up so does that also mean i can spam HL the whole fight?</p>\r\n<p>thats the part that im getting confused over</p>\r\n<p>i guess whats messing me up the most is the rotation info isnt changeing even when i add more burst which means its not having me cast HL more often or FOL less often as should be the case if thats how burst works</p>\r\n<p>Heres some BIS rotation calculations i just did based on what i have my burst set at</p>\r\n<p>25% Burst = 216 sec HL/0.4 sec FOL</p>\r\n<p>50% Burst = 215 sec HL/1.6 sec FOL</p>\r\n<p>75% Burst = 139.5 HL/80.6 sec FOL</p>\r\n<p>all these based on 2 piece T8.5 set and everything else BIS</p>\r\n<p>i know the reason the numbers change is because the BIS items change due to the setup but what stats does it calculate differently with the burst option the only thing i can think of and maybe this is it, the higher your burst is set the more haste is prioritized and with more haste means faster casts which means more mana used so does burst then mean speed casting vs lower burst means less haste, slower casts but more sustainability</p>\r\n<p>im sorry if im being a pest about this buti like to understand how the numbers work so i know how to properly set it up so it can actually help me</p>",
    "PostedDate": "2009-05-12T21:14:12.4-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "189852",
    "ThreadId": "55996",
    "Html": "<p>You totally misundertand what Burst Scale is. It is setting for how important burst hps (Holy Light hps) is compared to overall fight HPS (mana limited HL/FoL mix hps). It is <strong>NOT</strong> an option that impacts how often you are &quot;burst healing&quot;, that aspect is derived purely from calculating how much HL to FoL you can cast throughout the fight with your mana limitations. Burst Scale is used to model when the tank could die during pure Holy Light spam regardless of mana or because you couldn't do enough healing over the entire fight. If you keep losing your tank to Fusion Punch in Iron Council but he is fine otherwise, that is when you should increase Burst Scale.</p>",
    "PostedDate": "2009-05-13T10:12:36.617-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "190037",
    "ThreadId": "55996",
    "Html": "<p>k hopefully i understand it now so heres what i got from your statement.</p>\r\n<p>Burst essentially = a higher value towards power over efficiency so will up your crit and spell power&nbsp;at the cost of&nbsp;&nbsp;your MP/5 and int in order to have bigger heals so will in rotation it will lower your HL time due to a loss of mana efficiency due to value changes in stats point which in turn should raise your FOL to compensate. so if i set my burst to 0% the value of casting large heals will be small but the value of mass casting HL will be as high as possible and the reverse being true if i set it at 100%.</p>\r\n<p>now the % is has still have me what the is percentage based on if i have it set to 50% is it doing the math based on my fight time or my activity so at 10 min fight time and 80% activity is it saying i need burst heals for 50% of 10 min or 50% of the 90% activity</p>\r\n<p>So if i want to spam heal HL and never cast FOL the smartest thing would be to set burst to 0% change my gear to BIS then slowly raise my burst % and altering the BIS it changes to until it starts showing i need FOL into my rotation. but if i want to put some FOL's into it because i know im in a fight that i only need to cast an HL here and there my best bet would be to figure out how often i need to toss a big heal on the tank time it out if i can say 1 HL every 15 seconds the rest of the time HS and FOL will be more than enough to keep the tank up then i alter my burst to be alot higher making sure my rotation allows for at least 1 HL every 15 seconds for the duration?</p>\r\n<p>I know not all bosses are the same and if im smart ill carry around multiple variations of gear which it seems would be a smart idea though that will take a LONG time does anyone have any options sets there using now that they find works in the majority of situations so i can base my changes on that?</p>",
    "PostedDate": "2009-05-13T21:08:57.777-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "190038",
    "ThreadId": "55996",
    "Html": "<p>Its a purely arbitrary percentage scale, that is calculated by the following.</p>\r\n<p>Fight Score = Average Fight HPS * (1 - Burst Scale)<br> Burst Score = Holy Light HPS * Burst Scale</p>",
    "PostedDate": "2009-05-13T21:16:18.207-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "190512",
    "ThreadId": "55996",
    "Html": "<p>yes but what is Burst scale based on even if its arbitrary it has to have some form of calculation for it to produce values.</p>\r\n<p>Heres the big thing i want to do produce a BIS setup that allows me during a 10 minute fight to spam HL the complete fight or close to without going OOM and from there i can adjust RAWR to reduce my HL in favour of higher heals. if a higher burst scale = bigger heals at the cost of mana regen then thats good enough for me, or is burst heal a value of during the % of the fight ill require a bigger heal so sacrifice my mana regen so that when i need those bigger heals im using them.</p>",
    "PostedDate": "2009-05-14T18:50:05.07-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "190679",
    "ThreadId": "55996",
    "Html": "<p>To get a better understanding of how the gear is ranked when adjusting the Burst Scale, have the right hand window open to the Stats Value (relative Weight I think).&nbsp; As you increase your Burst %, you will notice Haste becoming more and more valued.</p>\r\n<p>&nbsp;</p>\r\n<p>Last weekend, I ran a bunch of settings trying to find a balance, but as never able to.&nbsp; Haste was either coming out to high or to low.&nbsp; I am usually a raid healer/OT healer and do not need to be able to spam HL at a 1sec cast time.&nbsp; Ideally for me, getting HL down to 2 sec's works fine.</p>\r\n<p>&nbsp;</p>\r\n<p>Running through Rawr for both Burst adn Fight, it will put together 2 really solid sets of gear if that is the heal style you need, but remember theory crafting should always be tempered with your on common sense.&nbsp; If waht you see does not fit your play style, adjust it.&nbsp; I know I do.</p>\r\n<p>&nbsp;</p>\r\n<p>Rawr has made me look at gear from a different perspective, and I am now passing on fewer upgrades on accident, and grinding the instances or raid zones i need for upgrades with a plan and not randomly wandering about wondering when I will get a new item that is better then what I have.&nbsp; But it takes work.</p>\r\n<p>&nbsp;</p>\r\n<p>Dave</p>",
    "PostedDate": "2009-05-15T05:08:52.327-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "190686",
    "ThreadId": "55996",
    "Html": "<p>Ya im definetly not looking at RAWR being my end all and be all for gearing common sense is definetly required but its nice to have something like a buddy sitting beside you telling you not to take something its crap. I just joined a new guild and for the next 2 weeks i basically get the gear nobody else wants but after that ill get a say on what i get and honestly i dont wana be taking everything i see and wasting good gear that could goto other people which is why i need the buddy sitting beside me giving me advice on whats good and whats bad which is what i wana use RAWR for.</p>\r\n<p>The hardest part im having right now is just setting it up to make sense for not only how i heal but for the boss fights im doing. With this new guild im just now doing 25 man ulduar bosses beyond the first 4 and every boss seems to require something completely different from me but at the same time gearing multiple sets of gear for each boss isnt realistic my guild would probably shoot me so im trying to get a well balanced set first that can handle every boss then i can think about maybe making 2 different sets 1 for the long spam bosses and one for the short more scattered heals bosses (iron council&nbsp;being spam for example and yogg being very sporatic)</p>\r\n<p>I do wish RAWR has a bit more calculations (or maybe im just missing them) like how fast your HOL will the stats/gear/talents you have or even how much your heals should hit for. just as a basis because as you said your goal with burst is a 2 second HL im guessing without talents or procs and just a few buffs or maybe its not but then you could do your final setup see where your spells sit and know exactly what to expect even if it may not be 100% accurate since its still fairly random numbers.</p>\r\n<p>But i think i got the grasp of it all now and thank you all for that and sorry for all the questions but i do have one more in knowing that things like this are probably a pain to program because theres too many random variables are there currently any variables that havnt ben completely set up? for example in my current options setup T7 beats out T8 for BIS by about 250k healing im wondering if for example if the sacred shield bonus is completely calculated now or if divine sacrifice/guardians numbers are calculating perfect plus how SS gets scaled up with spell power because though 250k is alot something closer to 100k difference may make me go T8 anyways due to sacred shield being a damage prevention which is really handy for things like iron council and id probably be ok with doing less overall healing because of it.</p>",
    "PostedDate": "2009-05-15T05:29:22.523-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]