[
  {
    "Id": "189425",
    "ThreadId": "56092",
    "Html": "<p>Im using the current version of rawr and i can't seem to get the optomizer to get me at 0% miss chance im telling it nothing greater than 0 and i equip the gear it gets and i end up w/ 2% miss chance any1 know why?</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-05-12T11:06:47.317-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "189441",
    "ThreadId": "56092",
    "Html": "<p>Since you don't indicate which model your using, it is difficult to nail it down (and everything might not be applicable to you), but here are some quick checks that I can think of:</p>\r\n<p>The 1st obvious case: You might not have enough hit from available choices.</p>\r\n<p>a) Did you specify the 0%miss constraint correctly? Remember the optimiser increases the main stat your optimising, so don't try to optimise miss chance directly, since you will end up missing a lot. Optimise dps, while having misses &lt;= 0. If the optimiser cannot reach the goal, it should report it as such, if it isn't complaining and still giving this result, something might not be specified correctly.</p>\r\n<p>b) Are you using a melee or caster model? 1 handed or dual-wield? The amount of hit differs significantly? Or a tanking model? Expertise requirements etc.&nbsp; Is it possible to reach your model's cap? (Before we can do anything, we need details on your class/spec tree)</p>\r\n<p>c) Have you checked all buffs?</p>\r\n<p>d) Have you selected the +hit type talents you have available?</p>\r\n<p>e) Are hit gems/enchants available for selection?</p>\r\n<p>f) Have you made sufficient gear choices available to the optimiser? Are they selected with only specific gemming options (blue diamonds) or general regemming (green diamonds)?</p>\r\n<p>g) Are you looking at the correct miss chance result output?</p>\r\n<p>&nbsp;</p>\r\n<p>If you have double checked all of these and it still doesn't work, there is the possibility of a bug. But from my own experience, most cases where I have encountered something like this, it turned out to be something I forgot to tick.</p>",
    "PostedDate": "2009-05-12T11:55:39.78-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "189449",
    "ThreadId": "56092",
    "Html": "<p>Im assumign when u say model your talkin abt my class therefore im a warlock and after i load my character I click the diamonds next to the items that i can easily get and then i go to the optomizer and put in the miss chance to b &lt;= 0 and sometimes it will come back w/ a higher miss chance i already had....and idk if this is a good idea but i try and aim for the hit cap w/o buffs from druids and preist since i wont always have them w/ me...and i thoguht that the optomizer will fill in the gem slots w/ like hit rating gem if it help w/ the current stat im aiming for which in this case is +hit</p>",
    "PostedDate": "2009-05-12T12:19:38.347-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "189747",
    "ThreadId": "56092",
    "Html": "<p>I just wanted to add to this as I realized this problem the other night.</p>\r\n<p>It seems that once you reach just over 2% miss (around 2.25% I believe) RAWR shows hit as adding 0 dps. Once you reach this point if you look at the relative stat values, hit is not even on there.</p>\r\n<p>I can't imagine that not being hit capped is the best dps for a warlock. To help offset this I just take a couple points out of suppression. But that shouldn't be the ultimate fix.</p>",
    "PostedDate": "2009-05-13T06:49:00.407-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]