[
  {
    "Id": "190039",
    "ThreadId": "56252",
    "Html": "<p>I noticed that in the latest version Grim Troll has shot *way up* to be the #2 trinket for me (i.e. considerably above Darkmoon Card: Greatness, Fury of the Fight Flights, and the Mirror of Truth).</p>\r\n<p>Give the relative unimportance of +Hit (which used to be the big reason everyone wanted Grim Troll), I have to assume that the rating is coming from the ArP proc.</p>\r\n<p>It's hard to believe that Darkmoon Card Greatness which has a static +90AG and its +300 proc ranks lower.... is the new math to be believed?</p>",
    "PostedDate": "2009-05-13T21:17:06.383-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "190053",
    "ThreadId": "56252",
    "Html": "<p>Yes. ArPen is exceptional for Cats, especially in bursts.</p>",
    "PostedDate": "2009-05-13T22:27:22.13-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "190306",
    "ThreadId": "56252",
    "Html": "<p>So the current proc modelled into Rawr for the Grim-Toll and Mjolnir Runestone is working correctly/accurately? And averaging out the stats leads to a worse ranking of the trinket because ArPen rating isn't linear but exponential(it is, right?)...?</p>",
    "PostedDate": "2009-05-14T09:07:06.023-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "190308",
    "ThreadId": "56252",
    "Html": "<p>Correct and correct, as long as Executioner isn't used. That screws up the ArPen calculations. I'm about to release v2.2.4 to fix that.</p>",
    "PostedDate": "2009-05-14T09:08:19.15-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "190318",
    "ThreadId": "56252",
    "Html": "<p>Thx for the fast answer! nice to know that. I'd always put in the average values for those trinkets until now ;D</p>\r\n<p>Btw I think I found a bug just now (sorry for the offtopic part, I can open a new topic if you like): it seems the Edit Item Templates part where you can select the best x Gemming templates to show doesn't show the best x but the worst x somehow. I had it on 3 templates shown (checked were 2 default + 3 custom templates for cat) -&gt; What I did was select the best items in every slot (cat model) and checked out the direct upgrades list and for some reason there were items in there with gemming templates that didn't show up in the equipment lists where you select the items. When I switched to 6 templates shown it showed me all my templates that I selected (2 default and 3 custom ones) and then it correctly showed the best ones on the equipment list that were also at the same time highest ranked on the &quot;Direct Upgrades&quot; list to the right.</p>",
    "PostedDate": "2009-05-14T09:30:09.187-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "190345",
    "ThreadId": "56252",
    "Html": "<p>Damn! Back to Nax25 for me then... :p</p>\r\n<p>&nbsp;</p>\r\n<p>Thanks for the info :)</p>",
    "PostedDate": "2009-05-14T10:26:05.967-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]