[
  {
    "Id": "190495",
    "ThreadId": "56380",
    "Html": "<p>I tried searching the different sections here but haven't found much information about this.</p>\r\n<p>I've figured out the gem template and have the jewelcrafter bop filter checked, but for some reason, any items socketed with jewelcrafters gems are rated lower than any item with normal gem socketing and the jewelcrafter gem appears greyed out.&nbsp; I was going to make an issue on this, but figured I'd see if there could be anything I'm missing that would fix this issue.</p>\r\n<p>There are no items being generated with jewelcrafter only gems, even if the jewelcrafter template is the only one I select, it still fills the gems slots with regular gems.&nbsp; Is this a current known issue or am I just missing a checkbox somewhere?</p>",
    "PostedDate": "2009-05-14T17:06:58.187-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "190502",
    "ThreadId": "56380",
    "Html": "<p>Hmmm... I'm a JC on my DK tank and I'm not seeing this issue.&nbsp; Which model are you using?&nbsp; (I see stacks of +Sta and +Def Dragon Eyes. ;) )</p>",
    "PostedDate": "2009-05-14T18:05:45.083-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "190837",
    "ThreadId": "56380",
    "Html": "<p>i have the same problem in 2.2.4. Using warlock model.</p>",
    "PostedDate": "2009-05-15T11:39:41.393-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "190838",
    "ThreadId": "56380",
    "Html": "<p>I'm using the DK dps model.&nbsp; I can try the DK tank model to see if it's different in there.&nbsp; It's not that the gems don't appear, it's that they are greyed out upon selection.&nbsp; I can still select them using the templates I have if I edit the custom gemming on a particular item, but copies are not being generated.</p>",
    "PostedDate": "2009-05-15T11:41:54.033-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "190888",
    "ThreadId": "56380",
    "Html": "<p>This is by design. You have Enforce Gem Requirements checked, and those gemmings do not meet requirements, so are worth 0.</p>",
    "PostedDate": "2009-05-15T15:12:46.167-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "191206",
    "ThreadId": "56380",
    "Html": "<p>How do they not meet requirements? the JC BOP gems match all colors.</p>",
    "PostedDate": "2009-05-17T09:23:31.873-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "191240",
    "ThreadId": "56380",
    "Html": "<p>Socket colors are not requirements. You can put any color gem in any color socket, except for metas. Those gems DO have a requirement of being Unique (3).</p>",
    "PostedDate": "2009-05-17T12:36:40.613-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "192578",
    "ThreadId": "56380",
    "Html": "<p>I've got it now.&nbsp; I did not have Enfoce Gem Requirements checked though, so if this is by design, then it is clearly not evaluating that box to determine to enforce them or not.&nbsp; It looks like it is indeed creating the items, it's just ranking them very low because the gem is obviously having an effect of zero when I currently have 3 prismatics equipped.&nbsp; It makes a lot more sense now though, thanks Astrylian.</p>",
    "PostedDate": "2009-05-20T15:39:41.51-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]