[
  {
    "Id": "191124",
    "ThreadId": "56562",
    "Html": "<p>I was stunned today to see Rawr value my old blue Incisor Fragment higher than the Wrathstone I had just spent EPGP on.</p>\r\n<p>This is with Grimm Toll, AP=10463, agility = 1496, str = 417, ArPen rating = 436.</p>\r\n<p>Could this be possible? At this point, I think this is probably not a bug, but more an artefact of my current cat druid gear. I'd like some support for that thought though.</p>\r\n<p>&nbsp;</p>\r\n<p>Incisor fragment: 148 AP, 291 ArPen for 20s with a 2 min CD.</p>\r\n<p>wrathstone: 108 crit, 856 AP for 20s with a 2 min CD.</p>",
    "PostedDate": "2009-05-16T19:22:51.837-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "191127",
    "ThreadId": "56562",
    "Html": "<p>Incisor is quite good, in some very high arpen situations, due to the ability to stack it with other temporary arpen effects.</p>\r\n<p>&nbsp;</p>\r\n<p>Your decision to pick up Wrathstone probably won't end up being in error, if Blizz goes ahead and caps ArPen.</p>",
    "PostedDate": "2009-05-16T20:01:01.407-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "191155",
    "ThreadId": "56562",
    "Html": "<p>Yep, that's my understanding too.</p>\r\n<p>I will probably still equip Wrathstone rather than incisor, despite the rather large (24 dps) difference in favor of incisor.</p>\r\n<p>The reason is to extract that value from incisor, it's necessary to satisfy two conditions:</p>\r\n<p>1- use it whenever it is up from CD</p>\r\n<p>2- use it when Grimm Toll procs</p>\r\n<p>These two conditions have three problems:</p>\r\n<p>1- Grimm Toll is not certain to proc whenever incisor is up.</p>\r\n<p>2- Fight circumstances often require delaying trinket&nbsp;use</p>\r\n<p>3- My personal ability to keep an eye on yet another conditional, and involuntary, buff (Grimm Toll proc) is low. In contrast, Wrathstone is likely to be used at the same time as berserk for the first and third time, which is not conditional.</p>",
    "PostedDate": "2009-05-17T01:39:00.1-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]