[
  {
    "Id": "191238",
    "ThreadId": "56591",
    "Html": "<p>I just noticed that this trinket was ranked fairly high up on the list. I found this somewhat surprising as Rawr doesn't believe that I run OOM. I understand that we get back 15% of spirit as damage, but it's hard for me to believe that 84 (+12.6sp) spirit and the use of 336 spirit (+50sp) should be ranked so high. I just noticed that they are going to be changing DPS contribution from spirit to be 30% which would make that +25 and +100 when procced.</p>\r\n<p>Even so, I'm having a hard time understanding why that would rank higher than Embrace of the spider which has a static +98sp and a haste proc that would at least be useful for starfire...</p>\r\n<p>Relative stat values: SP: 2.15, Crit: 1.19, Haste: 1.10, Spirit: .6</p>",
    "PostedDate": "2009-05-17T12:30:12.237-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "191438",
    "ThreadId": "56591",
    "Html": "<p>First of all, Rawr.Moonkin is up-to-date with 3.1.2 changes, so you have to understand that spirit won't QUITE be as good for you on live yet.&nbsp; That being said, realize that the proc on the Embrace is 505 haste, which is bad if Rawr says you should be using Wrath instead of Starfire.&nbsp; One other thing to note is that Spirit is an attribute, which means the 84 and 336 numbers will not be the actual amounts you get in game; you will get more because of Kings, Imp Mark of the Wild, etc.&nbsp; With all the multipliers from buffs and everything, the trinket should actually be quite decent once the spirit buff goes through.</p>",
    "PostedDate": "2009-05-18T06:18:15.347-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "191566",
    "ThreadId": "56591",
    "Html": "<p>Re: Haste --- I didn't mean to say that. I was agreeing that the haste proc was only going to be useful during starfire.</p>\r\n<p>&nbsp;</p>\r\n<p>My math is probably wrong, but iMOTW = 2% increase and Kings = 2% increase.</p>\r\n<p>Therefore:</p>\r\n<p>base:&nbsp;84 spirit = 84*1.02*1.02*.3= 26sp</p>\r\n<p>proc: 336 spirit = 336*1.02*1.02*.3 = 104sp</p>\r\n<p>I don't know how often the trinket can br procd, but it seems like it would have be very often in order for +26sp (occasionally +130sp) is better than +98sp (once again completely ignoring the value of the haste proc)</p>\r\n<p>Is there additional math I am missing?</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-05-18T11:02:10.87-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "191570",
    "ThreadId": "56591",
    "Html": "<p>Ah, I figured it out.&nbsp; It's a bug having to do with the fact that it's a Spirit clicky, which Rawr doesn't play nice with right now.&nbsp; I'll get this into the next version; it requires a code change.</p>",
    "PostedDate": "2009-05-18T11:11:51.057-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "191571",
    "ThreadId": "56591",
    "Html": "<p>That makes sense.&nbsp; Does that effect the DPS ratings of other use-based trinkets in the moonkin model?</p>",
    "PostedDate": "2009-05-18T11:14:32.62-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "191885",
    "ThreadId": "56591",
    "Html": "<p>Any trinket that does not have an on-use increase Spirit will be fine.&nbsp; It was a mistake I made because I was focusing on Majestic Dragon Figurine and didn't take into account this trinket.</p>",
    "PostedDate": "2009-05-19T05:48:23.41-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]