[
  {
    "Id": "192133",
    "ThreadId": "56838",
    "Html": "<p>Will Someone please help me? I have been at this for 3 hours and i have loaded mono and rawr and the new wow patch and all i have gotten is a big $%^*&amp;ing headache. Are there uptodate instructions your hiding somewhere?</p>",
    "PostedDate": "2009-05-19T17:19:56.083-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "192167",
    "ThreadId": "56838",
    "Html": "<p>The uptodate instructions are in the readme, with the exception of the note in the known issues, that the currently latest version of Mono (2.4) is broken, and to use Mono 2.2.</p>",
    "PostedDate": "2009-05-19T19:42:25.48-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "192176",
    "ThreadId": "56838",
    "Html": "<p>Well theyre a little confusing to me, it says to locate the files with Terminal and ive tried dragging the files to use them but its not working. Could you maybe explain them a little better?</p>",
    "PostedDate": "2009-05-19T20:38:42.847-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "192224",
    "ThreadId": "56838",
    "Html": "<p>You should look into basic guides to the Terminal; it's a command line interface, not a GUI.</p>",
    "PostedDate": "2009-05-20T00:35:10.523-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "192369",
    "ThreadId": "56838",
    "Html": "<p>Yep, which doesn't mean dragging a file to it is useless.</p>\r\n<p>When you drag a file (or directory) to a terminal window, what will happen is that the full path of that file (or directory) will typed out in that window. This is uber useful.</p>\r\n<p><span style=\"color:#000000\">I too being a Mac user, and even though I'm a heavy Terminal user, I ended up opting for a Terminal-less solution, running Rawr not with Mono, but within a virtual machine. The reason is that at the time I tried it out, Mono was a big bag of hurt. It may have improved since.</span></p>\r\n<p><span style=\"color:#000000\">I personally use VMWare Fusion as my Virtual Machine software, but Parallels Desktop works too I'm sure, and probably the free VirtualBox (http://</span><span style=\"color:#008000\"><span style=\"color:#000000\">www.</span><span style=\"color:#000000\">virtual</span><span style=\"color:#000000\">box.org).</span></span></p>\r\n<p><span style=\"color:#000000\">The drawback with the VM approach is that you need a licensed copy of Windows :-(</span></p>\r\n<p><span style=\"color:#000000\">The last possible approach, which I haven't tried either, is to use Wine (http://www.winehq.org/)&nbsp;or a derivative such as the commercial CrossOver (http://www.codeweavers.com/products/cxmac/). This an attractive approach, as it doesn't require a Windows license, though I don't quite know how it can work for .NET apps such as Rawr.</span></p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-05-20T07:19:45.527-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]