[
  {
    "Id": "193325",
    "ThreadId": "57213",
    "Html": "<p>I found RAWR ver 2.2.1, installed and ran models for both a holy and ret paladin.&nbsp; Received a notice that a new version was available.&nbsp; Downloaded 2.2.4 and wanted to start over because I thought I might have made some errors in optimization on the first version.&nbsp; I deleted my 2.2.1 folder, ran the unzip on 2.2.4 and started new models for holy and ret again.&nbsp; When I went to save, it said it couldn't find the path.&nbsp; I saved the models to my 2.2.4 folder.</p>\r\n<p>Now when I open RAWR, it offers me the option to open the old models and the new ones even though I deleted the old ones.&nbsp; If I click on the old models, it says the path no longer exists.&nbsp; When I try to update equipment lists, it says that the path no longer exists.&nbsp; This is all despite I have installed anew from the 2.2.4 folder and all the info is there.</p>\r\n<p>Why is it looking for the old version if I deleted the old and installed completely from the new?&nbsp; Is there a registry key I have to delete to get a clean install?</p>\r\n<p>Just to check, I deleted both versions, downloaded a completely new one, installed it and it's now looking for the files from both previous installs.&nbsp; How do I start over?</p>\r\n<p>&nbsp;</p>\r\n<p>Thanks in advance.</p>",
    "PostedDate": "2009-05-22T11:30:38.353-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "194087",
    "ThreadId": "57213",
    "Html": "<p>Posted this 4 days ago.&nbsp; No answer on how to completely delete this program?&nbsp; Should I feel comfortable using an addon that continues to remain on my computer after I try to delete it?</p>",
    "PostedDate": "2009-05-25T21:18:35.723-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "194088",
    "ThreadId": "57213",
    "Html": "<p>Uhh... I think nobody has responded, because we have no clue what you're talkinga bout. There's nothing to uninstall or clean. It's just a folder. Delete your old folder, download and unzip the new version, nothing more than that.</p>\r\n<p>You have nothing to do with models, models are .dll files, you should not be touching at all. Character files (what you should be saving and opening) are .xml files, which you can save between versions if you like.</p>",
    "PostedDate": "2009-05-25T21:27:51.63-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "194098",
    "ThreadId": "57213",
    "Html": "<p>Perhaps I was less than clear before.&nbsp; That's probably my fault.&nbsp; I'll break it down in steps, not because I think you're less than capable but because I want to make sure I'm clear:</p>\r\n<p>I installed 2.2.1. Liked it and made 2 models named &quot;holy&quot; and &quot;ret&quot;.&nbsp; Found rawr very helpful.</p>\r\n<p>Rawr informs me there's a new version, 2.2.4. I think &quot;should I fix what isn't broken?&quot; but figure maybe there's something missing that I haven't noticed.&nbsp; So, I download it.</p>\r\n<p>*BUT* before I unzip 2.2.4 for use, I delete the folder for 2.2.1.</p>\r\n<p>I unzip 2.2.4 and click on rawr.</p>\r\n<p>Rawr says at the start screen that I have recently opened 2 files. one named &quot;holy&quot; and one named &quot;ret&quot;.</p>\r\n<p>** First question: if deleting the folder gets rid of all trace of previous version of rawr, how does it know the names of my previous models?</p>\r\n<p>I import my ret pally from armory and try to save it.&nbsp; I want to save it under the same name as last time.&nbsp; Rawr says it can't find the path to save &quot;ret&quot; so I save it to the 2.2.4 folder.</p>\r\n<p>Now when I open rawr it asks me if I want to open &quot;ret&quot;, &quot;ret&quot; or &quot;holy&quot;.&nbsp; If I manage to select the right &quot;ret&quot; and try to do some sandbox work, rawr tells me it can't give me items to sub out because the item database doesn't exist, but if I tell it to update from the internet it says &quot;really? cuz the database is complete and up to date with your current version...&quot; or something like that.</p>\r\n<p>** Second question: if I got rid of the old version, why is the new version looking for a database in the old folder?&nbsp; This occurs even if I start a character from scratch.</p>\r\n<p>I have deleted both rawr folders from my computer and downloaded a fresh rawr 2.2.4 since then and when I open&nbsp; the new one it says I have recently opened &quot;ret&quot;, &quot;ret&quot; and &quot;holy&quot; but can find none of them.&nbsp; That past information is what I want to get rid of.&nbsp; I want to start over like rawr has never been on this computer before.</p>",
    "PostedDate": "2009-05-25T22:12:24.113-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "194350",
    "ThreadId": "57213",
    "Html": "<p>Again, you aren't saving or opening models. You're saving and opening characters.</p>\r\n<p>There is a settings file stored in your user's AppData folder, which stores window position, recent files, etc. That shouldn't matter, and you should have no need to delete it.</p>\r\n<p>First question: &nbsp;When you save and open characters, you're just saving and opening a file; you can put it wherever you want, or name it whatever you want, it's just a file.</p>\r\n<p>&quot;<span style=\"color:#30332d\"><span style=\"font-style:italic\">rawr tells me it can't give me items to sub out because the item database doesn't exist, but if I tell it to update from the internet it says &quot;really? cuz the database is complete and up to date with your current version...&quot; or something like that.</span>&quot; &nbsp; &nbsp;...What? I'm guessing you need to take a second look at those error messages, and actually read them. I don't have a clue which error your first part is about, and your second one does mean what it says, you just aren't reading it.</span></p>\r\n<p>Second question: It's not. If it can't find the ItemCache, you didn't unzip it correctly; it's not looking for any databases in the old folder. As I mentioned, there is a settings file (really, just a list of recent characters, window position), which is in the /AppData/Local folder of your computer's user folder (c:\\users\\whatever\\ or c:\\documents and settings\\whatever\\). Delete all Rawr folders, download a fresh <span style=\"font-style:italic\">v2.2.5</span>, fully unzip it, and start from there.&nbsp;</p>",
    "PostedDate": "2009-05-26T09:39:38.597-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]