[
  {
    "Id": "193618",
    "ThreadId": "57301",
    "Html": "<p>Maybe this is just me...&nbsp; Playing around with possible upgrades and, as it always annoys me losing chunks of mitigation and/or survival for threat (it's the principle of the matter really, even when it really is a solid upgrade), I tend to poke my calculator quite often to compare non-threat values.&nbsp; While doing so tonight, it occurred to me that while we can sort by Mitigation/Survival/Threat, we can't sort by combinations of the three.&nbsp; In particular I'm considering Mitigation+Survival, the &quot;I don't wanna die&quot; values rather than the &quot;I don't want that aggrobait of a DPS to die&quot; one.&nbsp; Would it be at all possible to get a M+S sorting option for the bear module (and possibly other tanks? don't know how variable the three stats are for other modules since they're not sporting rogue gear)?&nbsp; :-)</p>",
    "PostedDate": "2009-05-23T22:25:39.43-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "193656",
    "ThreadId": "57301",
    "Html": "<p>You should select in the 'options' tab the preferred threat value.</p>\r\n<ul>\r\n<li>None: Threat has no value at all</li>\r\n<li>MT: Reasonable amount of threat, well balanced</li>\r\n<li>OT: Somehow this requests high amounts of threat, even though an OT has plenty of time to build its threat in my opinion</li>\r\n<li>Crazy about threat: Title says it all</li>\r\n<li>Custom value</li>\r\n</ul>\r\n<p>With threat set to None, and sorting the table for Overall value, you should get the desired result.</p>\r\n<p>Do note that I am using version 2.2.2 since 2.2.4 doesn't work for me. I assume it is the same but have no method to check that.</p>",
    "PostedDate": "2009-05-24T04:23:07.623-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "193707",
    "ThreadId": "57301",
    "Html": "<p>Hm.&nbsp; I'd missed that option (brain too solidly set into the MT role I suspect, saw &quot;MT&quot; and missed the threat line).&nbsp; That works fairly well I s'pose, though still being able to see the threat values would be nice, thanks for pointing it out.&nbsp; :-)</p>",
    "PostedDate": "2009-05-24T11:19:11.667-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]