[
  {
    "Id": "193746",
    "ThreadId": "57334",
    "Html": "<p>I have 4 sets of equipment for one character (Ret PvP/PvE, Holy PvP/PvE). &nbsp;I keep my Rawr profile up-to-date by manually updating upgrades I get as I play.</p>\r\n<p>Frequently, items that I have will not be listed when clicking on that slot. &nbsp;For example, right now my Holy PvE set has Contagion Gloves that I got recently. &nbsp;However, when I click on the hand slot, contagion gloves do not appear in the list, and therefore I cannot make them my current item. &nbsp;This also occurs with Deadly Gladiator's Band of Ascendancy for my finger slot.</p>\r\n<p>I have everything checked under Filters.</p>\r\n<p>Contagion Gloves and Deadly Gladiator's Band of Ascendancy are in the items database, and are clearly upgrades for the slots they would go in, but they are not listed.</p>",
    "PostedDate": "2009-05-24T16:36:15.653-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "193780",
    "ThreadId": "57334",
    "Html": "<p>Contagion gloves are determined to not be relevant since the item has spirit on it, same with hit for the ring. This is intended behavior to keep the number of items in the comparison list down to ones people would actually want to use.</p>",
    "PostedDate": "2009-05-24T22:37:12.71-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "193838",
    "ThreadId": "57334",
    "Html": "<p>Ah, I see. &nbsp;That makes sense - Spirit and Hit Rating are obviously completely worthless stats for a raiding Healadin.</p>\r\n<p>However, I can imagine several situations where this is undesirable.</p>\r\n<p>Frequently, players are presented with partial upgrades that, while not the best item they could possibly get, are better than their current. &nbsp;If nobody else in a raid needs this item, there's no reason for the player not to accept the item, at which point a person will have that item as their current, and want to make it as such.</p>\r\n<p>PvP-wise, the Deadly Gladiator's Band of Ascendancy is arguably the 2nd-best in slot item for Holy paladins, and the best that doesn't require an arena rating, despite its Hit itemization.</p>\r\n<p>Like the Band of Ascendancy, there are certainly other items with spirit and hit that, while not the best, are certainly quite good for holy paladins.</p>\r\n<p>&nbsp;</p>\r\n<p>Basically, this behavior automatically rates any item with spirit or hit as zero total value for the entire item, which is incorrect. &nbsp;The item still has value outside of its hit and spirit statistic.</p>\r\n<p>Mainly, this specific difficulty arises because a user can't even manually equip the item at all. &nbsp;There is no convenient way to force a given item into a slot, if it's not listed on the item list. &nbsp;Even if you want to filter such items for the user's convenience/performance, there is no way for the user to work around. &nbsp;However, rawr does support listing the item, only as long as it's saved to the character's armory page. &nbsp;This behavior is inconsistent.</p>",
    "PostedDate": "2009-05-25T02:12:05.467-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "193927",
    "ThreadId": "57334",
    "Html": "<p>&nbsp;There is a workaround. Remove the Spr/Hit from the item.</p>",
    "PostedDate": "2009-05-25T08:57:35.913-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "193980",
    "ThreadId": "57334",
    "Html": "<p>Ah-haha, that's silly, but it definitely works, thanks.</p>\r\n<p>&nbsp;</p>\r\n<p>In the case of the Band of Ascendancy, I removed the hit, and then added it back on so my character's hit rating was reported accurately.</p>\r\n<p>&nbsp;</p>\r\n<p>I look forward to a more streamlined process for this in future versions of Rawr, instead of the workaround, thanks!</p>",
    "PostedDate": "2009-05-25T11:57:19.327-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]