[
  {
    "Id": "194092",
    "ThreadId": "57428",
    "Html": "<p>I got several upgrades today and equipped them. Then I updated my info in Rawr and ran Optimization. It showed my current (upgraded) equipment on the left and my old equipment on the right, with the gear on the left having a higher score than the--supposedly optimized--gear on the right. Clearly something is not right.</p>",
    "PostedDate": "2009-05-25T21:56:56.49-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "194095",
    "ThreadId": "57428",
    "Html": "<p>The numbers shown on that form may be kinda screwed up at the moment, we're working on that. What were the actual before/after scores? If after scores are ever lower than before scores, that means that not everything you had equipped before is marked available. The &quot;Current Gear/Enchants/Buffs&quot; chart is great for finding what you don't have marked available.</p>",
    "PostedDate": "2009-05-25T22:01:08.183-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "194101",
    "ThreadId": "57428",
    "Html": "<p>I'm having trouble getting 2.2.5 to start up again, but the same basic thing just happened to me in 2.2.4. The results windows says &quot;The Optimizer found a gearset with a score of 6703.529. (Your currently equipped gear has a score of 7623.756) Would you like to equip the optimized gear?&quot; For the shoulders, it suggests switching from Greater Inscription of the Crag to Lesser Inscription of the Crag.</p>\r\n<p>Apparently, when I manually changed gear in various slots to match my new gear, it didn't automatically add that gear as available (which it should IMO). But that doesn't explain why it would downgrade an enchant.</p>",
    "PostedDate": "2009-05-25T22:28:39.987-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "194104",
    "ThreadId": "57428",
    "Html": "<p>No, it shouldn't automatically add that gear as available, and it does explain why it would 'downgrade' an enchant; you don't have the better enchant marked as available, so it doesn't use it.</p>",
    "PostedDate": "2009-05-25T22:46:50.49-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "194319",
    "ThreadId": "57428",
    "Html": "<p>One thing I've noticed that some people miss, is that they don't select the ENCHANTS that are available, this has an impact on what the optimizer will suggest for you. This would probably be the case with your shoulder enchant being downgraded.</p>",
    "PostedDate": "2009-05-26T08:47:11.583-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "194364",
    "ThreadId": "57428",
    "Html": "<p>Yeah, it was, but how did the better enchant get there? I've never chosen enchants before, so it must have been on there from loading existing gear. It seems to me that if I load existing gear that contains an enchant, logic would say that I have access to it.</p>\r\n<p>What I don't understand is why someone would manually change their gear and then optimize without intending to include the current gear? If there is some reason for this, maybe it should be an optimization option (&quot;Exclude current gear&quot;). Otherwise, it seems like the intuitive method would be to assume all current gear is available.</p>",
    "PostedDate": "2009-05-26T10:08:28.19-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "194367",
    "ThreadId": "57428",
    "Html": "<p>Some people might just be equipping gear to play around and see what optimal sets might be in the future, but not neccessarily what gear they have to work with. Just make sure you click the diamond on the gear selection, and problem solved. I will agree that it isn't entirely intiutive, but it isn't really a problem either.</p>",
    "PostedDate": "2009-05-26T10:12:10.743-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]