[
  {
    "Id": "194117",
    "ThreadId": "57434",
    "Html": "<p>Hi there. First of all i just wanna say thanks for all the effort ur putting into a potentially huge tool for any WoW player out there. As a bit of a programmer myself i can only imagine what a project this must be for you guys and how extremely huge job it must be trying to keep up with every single little boost, nerf or mechanic change that happens. If any of the people that can only QQ about this and that not working and tried to do it themselves mayb ull have less rant on the discussions and more positive feedback. I have only one main toon and thats a warlock. I have been following the module for some time and its made some sweet progress and i thought that for *mayb* (=]) a revision of that i could make some suggestions that i think most adept lock players would like to see... (I pulled some ideas from the ret pally module which i think works awesome)</p>\r\n<p><strong>-Spell Priorities : </strong><em>Rotation is the name of the game, and using this option in the lock module can be confusing sometimes if you dont know what you're doing, which could end up changing everything. For example we have to keep the crit debuff from Improved S.bolt up by hitting one Shadowbolt and then dotting, but Shadowbolt is not a bigger priority than Corruption if u understand what i mean :) Mayb something like the FCFS Simulator for Ret Pallies, just instead of using cooldowns, use total time for dots / buffs from casts?</em></p>\r\n<p><strong>-Drain Soul Timer :</strong> <em>One of the big changes is that Drain Soul now ticks for 4x the damage when the mob is under 25% and thus we replace the filler with this when its called for. Possible to include it in the setup? Mayb a &quot;Cast Drain Soul when mob is : ??%&quot; action?</em></p>\r\n<p><strong>-Optimiser Options :</strong> <em>Referring to the Ret Pally module again i found myself the other day wanting to set up the optimal combination for my lock's gear for when im in my raid group and when im pugging. Taking Hit Rating as an example we have a shadowpriest in our group providing 3% at all times, but its not gonna be the case 100% of the time. I was thinking it would be great to have more versatility in the optimiser options regarding specific stats like the ret pally module has? For example optimise for DPS Rating while maintaining a hit rating &gt; 363.</em> <em>Haste, Stam (for Voidy tanking), Resists (Frost!!) etc. =]</em></p>\r\n<p>Thank you for a great app tho and all the best with the rest of the development!!</p>",
    "PostedDate": "2009-05-25T23:35:56.223-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "194212",
    "ThreadId": "57434",
    "Html": "<p>Thank you for thinking with us and for the complements! :)</p>\r\n<p>The drain soul timer has been on our to-do-list for a long time, but as we've mentioned before, we really want to fix some big bugs first. And with all the patches, new things keep popping up at the top of the prio-list.</p>\r\n<p>What you want with the optimiser, isn't that already possible for all modules? Just add Additional Requirements.</p>\r\n<p>We'll have a look at the priority, but we have taken Rotation out on purpose. No lock is using a real rotation anymore, you just juggle to keep everything up and give a priority to what is most important. In cases like the crit debuff you mention, we may need to implement an extra option so the module knows to keep the buff up even if the spell itself does not have priority. It is good that you mention it, because I hardly play these days, so those things get easily past me.</p>",
    "PostedDate": "2009-05-26T04:27:01.477-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "194225",
    "ThreadId": "57434",
    "Html": "<p>I can totally understand u guys are busy - if i think of the changes in play that was made to each lock spec and how players struggle to adapt i can only believe programming a simulator must be worse.</p>\r\n<p><em>About the optimiser - yep there are 4 options currently available for the lock module -&gt; Overall, DPS, Pet DPS and Miss (i.e Hit Rating =]) -&gt; I was thinking more in the line of Haste, Crit, Stam, Intel, etc... stuff that most locks mayb using Destruction and not Affliction would prioritize over or even just if they wanted to tweak their gear for their kind of playstyle (thinkin PvP or the like). </em>If you take a look at the Ret or even Prot Pally module their are roughly 20 optimisation and/or additional focuses on can choose from. Its not a problem or a bug - im thinkin it could just give the lock module ALOT more versatility.&nbsp;</p>\r\n<p><em>If you say most locks dont use rotations and just juggle everything up i have to comment that altho it may be true for some fights where alot of actions and movement are involved, and keeping one going is nearly impossible, for a warlock to achieve the best possible dps he can muster from his gear, each spec has to have the right chants, gems, talents and one perfect and solid rotation.</em> It may differ for some to an extent, but surely some of the best simulations and theorycrafters has shown it to be theoretically superior than just juggling =]. I do understand its easy to miss, especially if one doesnt understand the mechanics to its fullest, but believe me bottom line casting one spell before another in the right order and refreshing when needed can be the difference between 2.5k dps and 4.5k dps :D <em>&lt;-- Lol soz gettin way offtopic here now</em></p>\r\n<p><em>For some further detail regarding this u can feel free to pop me a mail! :P</em></p>\r\n<p>That being said im looking forward to the next version and cant wait to see what u guys do with the module!</p>\r\n<p>All the best!</p>",
    "PostedDate": "2009-05-26T05:02:49.737-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "194258",
    "ThreadId": "57434",
    "Html": "<p>A rotation would be casting (for example) Haunt- coa - ua - sb, rinse and repeat the whole time.</p>\r\n<p>A priority means:</p>\r\n<p>Is haunt up?</p>\r\n<p>no - cast it / yes -&gt; is UA up?</p>\r\n<p>no - cast it / yes -&gt; is COA up?</p>\r\n<p>etc.</p>\r\n<p>That is what Rawr does now and how most players I know do it as well. You can check it on Elitist Jerks.</p>",
    "PostedDate": "2009-05-26T05:59:05.487-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "194265",
    "ThreadId": "57434",
    "Html": "<p>Ah ok sorry - i think i get what ur trying to say, thanks. I had my understanding of the priorities wrong =]</p>\r\n<p>With that being said if the Improved Sb option is ticked in the bufflist, does rawr assume the debuff is</p>\r\n<p>theoretically applied for 100% of the time? If that is the case then one could take Sb out of the priorities list</p>\r\n<p>correct?</p>",
    "PostedDate": "2009-05-26T06:21:00.057-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "194282",
    "ThreadId": "57434",
    "Html": "<p>It does, but it assumes someone is keeping it up, not you. So if you are the only lock in the raid, you can't drop it from your castlist. I don't think we have an option build in yet to keep up ISB but I'll have to check that with Fes. We'll be away for a long weekend though, so it may be a while before we get back on this. (festival season ftw!)</p>",
    "PostedDate": "2009-05-26T07:16:36.533-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "194439",
    "ThreadId": "57434",
    "Html": "<p>I hope i dont seem ungratefull, and I do not want to derail this thread, but i had a couple questions about the Warlock module also.</p>\r\n<p>1) Is there a way to &quot;save&quot; Optimizations and quickly swap between them? Similar to the OP, so that i can have a Raid(Hit-lvl 83 boss) and Heroics(hit=82 boss) set? I currently save out my profile for each of these scenarios, and have to manually update gear across them all as i get new lewt.</p>\r\n<p>2) Do you have a timeframe when trinkets and procs will be finalized, specifically Illustration of the Dragon Soul? In the Druid module it is rightly listed as close to BiS, whereas in the 'Lock module it is rated as 0</p>\r\n<p>&nbsp;</p>\r\n<p>I truly find the program indespensible and realise how hard it must be to have everyone saying that you should do better and do exactly the same as other modules. I hope i did not come off as a whiner.</p>\r\n<p>Thanks,</p>\r\n<p>Zappcatt(Hunter...hopefully this gets updated soon), Zappmage(Hybrid Warlock, Zappcatter(Holy Paly, was Tankadin till Naxx), Steermanure(Resto/Boom-was Tank in BC and the reason i found this great program)</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-05-26T12:02:00.527-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "196297",
    "ThreadId": "57434",
    "Html": "<p>I was wondering if anyone could expand on this a little more.</p>\r\n<p>What are most Affliction Locks using under Spell Priority? I've noticed by changing this it can swing your dps by 1500 or more.</p>\r\n<p>So what are you guys using for Max dps?</p>\r\n<p>What I've bee using also seems to make haste almost worthless. Shadowbolt is still the majority of your dps, so there's no way haste is that worthless.</p>\r\n<p>Any help is much appreciated. Thanks.</p>",
    "PostedDate": "2009-06-01T00:47:57.587-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "196521",
    "ThreadId": "57434",
    "Html": "<p>For affliction warlock try:</p>\r\n<p>&nbsp;</p>\r\n<p>1. Haunt (Rawr i think assume full Shadow Embrace on target anyway)</p>\r\n<p>2. Corruption (since haunt refresh it it will be casted only once I think)</p>\r\n<p>3. Curse of agony (or UA depends which one is better DPS)</p>\r\n<p>4. Unstable affliction (or CoA depends which one is better DPS)</p>\r\n<p>5. Shadow bolt</p>\r\n<p>when target is below 35%</p>\r\n<p>5. Shadow bolt (only to keep Improved Shadow Bolt debuff on target - dont know if its possible to simulate it in Rawr)</p>\r\n<p>6. Drain Soul</p>\r\n<p>&nbsp;</p>\r\n<p>About haste. Shadow bolt is only about 30% your dps. Shadow bolt and corruption and UA can crit so i think crit is as much worth as haste.</p>",
    "PostedDate": "2009-06-01T11:51:46.85-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "197744",
    "ThreadId": "57434",
    "Html": "<p>No use putting Drain Soul in the prioritylist yet, since Rawr isn't modelling the below 35/25% parts yet. But yes, corr is only cast once.</p>\r\n<p>The value of haste will also be highly influenced by the latency you model btw.</p>",
    "PostedDate": "2009-06-04T06:51:06.057-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]