[
  {
    "Id": "194457",
    "ThreadId": "57527",
    "Html": "<p>Is there a way within the comparisons per item to cache on my saved character creating a doctored list of projected items? This list would then be put into another comparisons query option so I could see within (what i like to call &quot;my realm of control&quot; regarding loot) the best/realistic projected upgrades. I could see which of those upgrades that are most easily obtainable per my selection and my current situation, which should be sought after more aggressively (like spending DKP for items that are the largest upgrade or getting easy to obtain items myself via crafting, badges, etc.).</p>\r\n<p>In a nutshell just a way to select upgrades and pit them against my current gear selection and then raid the upgrades as a whole together (like Ratings buster but on a whole character scale like RAWR does beautifully)</p>\r\n<p>I hope this doesn't sound too convoluted... but if you have any questions please let me know and I'll try and convey my idea better :) It would simply help to upgrade quick and with more ease being able to see the &quot;biggest upgrade&quot; per charactor to shoot for, as well as per slot. Thanks!</p>",
    "PostedDate": "2009-05-26T12:33:20.26-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "194502",
    "ThreadId": "57527",
    "Html": "<p>...Hmm. Sorry, I really don't understand what you're asking.</p>\r\n<p>Basically though, it sounds like you might want to look into Filtering (see the Filters dropdown in the top right), and Upgrade Lists (see Tools &gt; Optimizer). Those will allow you to filter the charts and optimizations to just what you could potentially get, for example, and then to build an upgrade list, to show what's the biggest upgrades that you could potentially get.</p>",
    "PostedDate": "2009-05-26T13:41:08.123-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "194530",
    "ThreadId": "57527",
    "Html": "<p>This is close to what I really want, but I think it's still lacking some functionality I'm asking for.</p>\r\n<p>I have the best overall upgrades, filtering per slot as well, but it doesn't allow me to remove items from the query or allow me to select (for instance) 3 items per slot and then filter to show top three BiS upgrades per slot (something like that.)</p>\r\n<p>Granted some items are BiS and of course the list changes daily from hard modes, but realistically... boomkins rarely are BiS for all gear... which is why I need to see what's easier to obtain Spellslinger's Slippers from crafted Runed Orbs over the Lame Flevi hard mode Boots of Fiery Resolution... Does that help more? I am new to this fuctionality, maybe there are just other fields i need to check or somthing lol</p>\r\n<p>&nbsp;</p>\r\n<p>(I had no idea of the Optimizer and upgrade list though... that will help a great deal on it's own xD)</p>",
    "PostedDate": "2009-05-26T14:49:26.093-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "194926",
    "ThreadId": "57527",
    "Html": "<p>how do i modify the xml file output by an Upgrade list so I can remove items that are not applicable and then open the modified list? it seems it willnot let me do it with XML Notepad... is there another program I should use?</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-05-27T13:23:32.707-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "194953",
    "ThreadId": "57527",
    "Html": "<p>fml delete this thread unless you can figure a way for me to remove items from the &quot;Direct Upgrades&quot; query lol beyond that i think i have everything square now</p>",
    "PostedDate": "2009-05-27T14:26:05.363-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "194978",
    "ThreadId": "57527",
    "Html": "<p>...lolwut?</p>\r\n<p>Sorry, I'm having trouble making sense of what you're saying. Do you still have an issue? No, we don't have any functionality to only show the top X items per slot in any charts, and don't intend to... You could indeed modify an upgrade list xml file to include only the top 3 in each slot, however that'd be tedius, and you'd have to redo it every time you changed gear.</p>",
    "PostedDate": "2009-05-27T15:21:34.21-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "194998",
    "ThreadId": "57527",
    "Html": "<p>You could add a comment to the items you wish to keep displayed for each slot&nbsp;then add a filter that checks for that comment.&nbsp; That way, if you tick that filter then it would only show those items.</p>\r\n<p>&nbsp;</p>\r\n<p>I have not really mucked around with the filter settings but I know there is a guide to it somewhere.....</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-05-27T16:43:16.557-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]