[
  {
    "Id": "195616",
    "ThreadId": "57858",
    "Html": "<p>I don't like to post with so little specific info, but here goes: the cat model makes some very surprising choices for my toon.</p>\r\n<p>I have never followed Rawr's recommendations blindly, but thus far, I have always understood the reasons behind its choices. Not any more. Here are three issues:</p>\r\n<p>- The T8 &quot;conqueror&quot; gloves were always rated lower than its &quot;valorous&quot; counterpart (same gems, same enchant) despite better stats. I recreated my toon from scratch and this doesn't happen any more. I guess that was some glitch in the XML file.</p>\r\n<p>- Rawr now breaks my 2T7 bonus, equipping the Treacherous Shoulderpads in place of the T7 25 shoulders. I have no BiS items which might realistically explain that. Is the 2T7 bonus so paltry?</p>\r\n<p>- Rawr thinks Executioner is the best main hand enchant, better than&nbsp;Berserker or Mongoose. While this seems&nbsp;reasonable&nbsp;considering I'm now gemming ArPen, everybody else disagrees, other players and other software alike. This is also strange in light of the fact that Rawr recommends mixed agi and ArPen gemming.</p>\r\n<p>If that's useful, my toon can be downloaded at http://gleamware.com/NCat3.1.xml</p>\r\n<p>Has anybody else seen surprising Rawr recommendations for cats?</p>",
    "PostedDate": "2009-05-29T03:07:14.787-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "196626",
    "ThreadId": "57858",
    "Html": "<p>I get the exact same behaviour. The T8 conqueror with same gems and enchants - even when it has&nbsp;all the same stats (only more, stat by stat)&nbsp;- gets rated lower.</p>\r\n<p>Also, I experience that sometimes items doesn't show and sometimes is the 3rd best item with largely the same gear within the same model.</p>\r\n<p>I simply can't trust rawr at any rate for the time being with these obvious misbehavings, so I hope they get sorted soon :-/</p>\r\n<p>edit: fixed typos</p>",
    "PostedDate": "2009-06-01T18:11:42.677-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "196658",
    "ThreadId": "57858",
    "Html": "<p>Why not? That sounds entirely correct, when set bonuses are in play.</p>",
    "PostedDate": "2009-06-01T20:46:15.973-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "197142",
    "ThreadId": "57858",
    "Html": "<p>Well, if you think it's entirely correct to show a conqueror piece ranked below the corresponding valorous piece, despite the former having all better stats than the latter, then you've got to tell me why, because I can't see it by myself, even taking set bonuses into consideration, since that has no impact that I can see on set bonuses.</p>\r\n<p>I also don't understand how can Rawr recommend Executioner and Agi gemming at the same time.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-06-03T01:01:26.443-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "197318",
    "ThreadId": "57858",
    "Html": "<p>Are you talking Conq Nightsong vs Valorous Dreamwalker or Valorous Nightsong? If both Nightsong, check that they all have their set name correct (&quot;Nightsong Battlegear&quot; or &quot;Dreamwalker Battlegear&quot;).</p>\r\n<p>Executioner and Agi gems make total sense; Executioner probably puts you over or at the cap, significantly reducing the value of more ArPen.</p>",
    "PostedDate": "2009-06-03T09:23:40.703-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "197678",
    "ThreadId": "57858",
    "Html": "<p>Yes I mean &quot;<span style=\"color:#30332d\">Conqueror Nightsong Handgrips&quot; being ranked lower than &quot;Valorous Nightsong&nbsp;Handgrips&quot;. Both have &quot;<span style=\"color:#000000\">Nightsong Battlegear&quot; as their set name<span style=\"color:#30332d\">.</span></span></span></p>\r\n<p><img src=\"http://img.skitch.com/20090604-8ji97rqkt8mtbb27t9h8n5xt71.jpg\" alt=\"TinyXP 09\"></p>\r\n<p>Note on the screen capture above: both instances have the same gemming, namely one 16 ArPen gem.</p>\r\n<p><span style=\"color:#30332d\"><span><span style=\"color:#000000\"><span>Regarding Executioner vs Agi gems, I should have explained better. I agree that reaching the cap at some point might lower the value or ArPen below Agi's. However, I can't see a case where Executioner+Agi gems can be any better than Berserker+ArPen gems.</span></span></span></span></p>",
    "PostedDate": "2009-06-04T04:26:05.01-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "197816",
    "ThreadId": "57858",
    "Html": "<p>Why not? And do those gloves stay that way, or just happen to be in one specific situation?</p>",
    "PostedDate": "2009-06-04T09:06:35.65-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "197969",
    "ThreadId": "57858",
    "Html": "<p>I had the same issue with the gloves in...I want to say 2.2.3, but don't anymore.&nbsp;</p>",
    "PostedDate": "2009-06-04T15:21:33.003-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "198108",
    "ThreadId": "57858",
    "Html": "<p>Me too, then my interest just shifted to other things. I hope this one would turn out right.</p>",
    "PostedDate": "2009-06-05T01:16:37.897-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]