[
  {
    "Id": "195619",
    "ThreadId": "57860",
    "Html": "<p>I was wondering if it would be possible in the optimizer of DPSDK to add &quot;target miss %&quot; and &quot;target dodge %&quot; as Additional Requirements similar to those found in TankDK module. I understand that it might not be the best from a pure theoretical dps perspective (in that case the optimizer would reduce them to zero itself), but in-game i find that being hit capped and being soft capped on expertise usually provide more dps as misses and dodges at a bad time during the rotation can delay it or mess it up during the next time runes are ready.<br> <br> You can always force certain gear in slots to make sure you are hit and expertise capped, but if the optimizer could help do it you would get the best way to use hit/exp gems/enchants etc.</p>",
    "PostedDate": "2009-05-29T03:13:48.33-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "195700",
    "ThreadId": "57860",
    "Html": "<p>Would it make more sense to do these as &quot;Hit Rating&quot; and &quot;Expertise Rating&quot; requirements?</p>",
    "PostedDate": "2009-05-29T07:49:29.377-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "195780",
    "ThreadId": "57860",
    "Html": "<p>No, I realized that this wouldn't necessarily be optimal.&nbsp; The amount of hit or expertise rating needed changes based on buffs and weapon.&nbsp; Rather than forcing a number change for each different scenario, &quot;Target Miss %&quot; and &quot;Target Dodge %&quot; make more sense.</p>",
    "PostedDate": "2009-05-29T11:17:40.847-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "195943",
    "ThreadId": "57860",
    "Html": "<p>Indeed, different rating required depending on faction/buffs etc. Using rating would also require that the user knew the exact amount of rating needed to hit the caps, % as you said just seems like a better idea.</p>",
    "PostedDate": "2009-05-30T04:13:53.217-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]