[
  {
    "Id": "196936",
    "ThreadId": "58249",
    "Html": "<p>Hi,</p>\r\n<p>With Rawr 2.2.5, my optimiser bug at the end of the process. It don't use all the items slot. Many slot are empty.</p>\r\n<p>I use ProtPaladin and i don't understand why the optimiser bug.</p>\r\n<p>&nbsp;</p>\r\n<p>I'm french, if you don't understand my question, i will try to explain you an other time later :p</p>",
    "PostedDate": "2009-06-02T11:26:43.837-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "196943",
    "ThreadId": "58249",
    "Html": "<p>If I am understanding your question, yo are stating that some of the equipment shots show as blank after running the optimizer?</p>\r\n<p>&nbsp;</p>\r\n<p>This is the intended function. Only item slots that change between your current gear and your 'optimized' gear set will appear active.</p>",
    "PostedDate": "2009-06-02T11:42:55.823-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "197148",
    "ThreadId": "58249",
    "Html": "<p>I'm French too! Let me switch to French :-)</p>\r\n<p>Je ne suis pas certain de comprendre ton probl&egrave;me. Apparemment, il s'agit du fait que la fen&ecirc;tre de r&eacute;sultat de l'optimisation (celle qui s'ouvre &agrave; la fin de l'optimisation) montre la plupart du temps des emplacements vides.</p>\r\n<p>Il s'agit du comportement normal. En effet cette fen&ecirc;tre ne montre que la diff&eacute;rence entre les pi&egrave;ces qui sont &eacute;quip&eacute;es sur ton personnage, et les pi&egrave;ces recommand&eacute;es par Rawr.</p>\r\n<p>En fait il existe bien un probl&egrave;me, mais il est diff&eacute;rent: souvent, Rawr recommande deux (ou davantage) changements, mais quand tu regardes attentivement, ces changements ne te font rien gagner. Il s'agit&nbsp;typiquement&nbsp;juste d'un &eacute;change entre des gemmes.</p>\r\n<p>Ce probl&egrave;me survient car il existe souvent en ce qui concerne les gemmes des permutations &eacute;quivalentes. L'optimiseur ne s'en rend pas compte.</p>\r\n<p>C'est un probl&egrave;me mineur connu des d&eacute;veloppeurs.</p>\r\n<p>Si j'ai mal compris ton probl&egrave;me tu peux le reformuler en fran&ccedil;ais si tu veux.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-06-03T01:14:22.01-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "197198",
    "ThreadId": "58249",
    "Html": "<p>Salut :)</p>\r\n<p>En fait mon probl&egrave;me est diff&eacute;rent en effet ! :)</p>\r\n<p>Quand je lance une optimisation, a la fin de celle ci, le score passe de 25000 environ a 73000 environ toujours et que ce soit dans mon &eacute;quipement actuel ou dans celui ayant subit l'optimisation, il y a des emplacements vides et quand je clique sur &quot;Load Optimized Gear Setup&quot; il ne me remet pas toutes les pi&egrave;ces et me laisse donc des emplacements vide.</p>\r\n<p>La je viens de tester, et apr&egrave;s l'optimisation j'ai le plastron, la ceinture et les gants qui restent vident.</p>\r\n<p>Merci d'avance :)</p>",
    "PostedDate": "2009-06-03T04:33:56.02-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]