[
  {
    "Id": "197601",
    "ThreadId": "58417",
    "Html": "<p>It seems that some kind of bug has been introduced into the DKDPS module. Whenever i sort items, even when not changing the type of sorting (ie overall, alphabetical etc), item positions change and some items even receive negative values. I have even seen occassions where T7 items with identical gemming and enchanting and set bonusses feature higher up (have a higher rating) than their T7.5 counterpart, even though the T7.5 counterpart is stat for stat a direct upgrade, which gets corrected when i sort, or edit and save without modifying. I dont encounter this issue in any of the other modules.</p>",
    "PostedDate": "2009-06-04T00:39:40.427-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "197749",
    "ThreadId": "58417",
    "Html": "<p>Yes, DPSDK is horribly useless in 2.2.5. Just use 2.2.4 for now until the bug is fixed in 2.2.6.</p>",
    "PostedDate": "2009-06-04T06:55:07.22-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "197924",
    "ThreadId": "58417",
    "Html": "<p>I have noticed through some usage today, that if you avoid the lists created by the optimizer/upgrade list/suggestion list (the one on the right), and stick purely to clicking on the item on your character sheet, you do appear to get accurate results.</p>\r\n<p>You can thus still use the module effectively, although a lot more work on your part.</p>",
    "PostedDate": "2009-06-04T13:32:12.213-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "198098",
    "ThreadId": "58417",
    "Html": "<p>Still busted as of 2.2.6 and stil no dev DK response...</p>",
    "PostedDate": "2009-06-05T00:36:09.167-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "198115",
    "ThreadId": "58417",
    "Html": "<p>Bloodysorc? It looks like you implemented some sort of instability. Like, randomness, or a threading conflict (ie, using some shared memory; don't do that).</p>",
    "PostedDate": "2009-06-05T01:28:39.343-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "198388",
    "ThreadId": "58417",
    "Html": "<p>I've got some ideas for what may be wrong; I've been busy with my first full-time job the past couple weeks, but I plan on sorting out some of the new messes I made today/this weekend.</p>",
    "PostedDate": "2009-06-05T12:40:47.223-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "198390",
    "ThreadId": "58417",
    "Html": "<p>The module does seem slightly more stable in 2.2.6 than 2.2.5. I am not getting the drastic re-gem suggestions that I was getting in 2.2.5 (although it did suggest I regem to gain a +9 stamina socket bonus.....)</p>\r\n<p>Additionally, when building an upgrade list, it will show an item in my current setting as a DPS upgrade, with the same setup I am currently using. Again, probably related to whatever issues currently exist.</p>",
    "PostedDate": "2009-06-05T12:48:34.41-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "198627",
    "ThreadId": "58417",
    "Html": "<p>Alright, just commited code that should make the model no longer horrendously broken.</p>",
    "PostedDate": "2009-06-06T18:06:39.75-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "200226",
    "ThreadId": "58417",
    "Html": "<p>I'm noticing a problem in 2.2.6 with DPS values changing when you change stamina buffs.&nbsp; Is this related?</p>",
    "PostedDate": "2009-06-10T17:04:42.54-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "200262",
    "ThreadId": "58417",
    "Html": "<p>Yes, a version release is required for the fixes made last weekend. 2.2.6 and 2.2.5 are quite broken.</p>",
    "PostedDate": "2009-06-10T20:39:21.723-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]