[
  {
    "Id": "197660",
    "ThreadId": "58428",
    "Html": "<p>I know Moonkins have a lot of options when it comes to spell rotations... but the one I've seen as the most popular as of late on DPS discussions (and one which I use to great advantage myself) is not currently supported by Rawr (unless of course I'm reading something wrong). It is now also the gold standard on MaxDPS for Moonkin Druids since patch 3.1.2</p>\r\n<p>Imp FF to start (most fights won't call for a re-apply, but can be done again in the Eclipse cooldown time without much pain to DPS) &gt; Wrath to proc Eclipse &gt; Starfire (15s) &gt; IS &amp; MF &gt; Starfire (until just before Eclipse cooldown) &gt; IS &amp; MF (just as Eclipse cooldown finishes) &gt; Finally back to Wrath to proc Eclipse and start again</p>\r\n<p>I agree it'd likely be a tougher one to code for, but it is a DPS heavy hitter that puts Eclipse to full effect. With the T8 4-piece bonus factor'd in... the IS in this rotation gains a lot in importance, as even if it procs during Wrath spam, it'll likely still be active for your first Starfire into the 15 secs (which if you miss the Eclipse proc at all, never feels long enough)</p>\r\n<p>Hopefully this can be put used in future releases of the Moonkin models.</p>",
    "PostedDate": "2009-06-04T03:40:23.467-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "197676",
    "ThreadId": "58428",
    "Html": "<p>I'm sorry, am I missing something?&nbsp; This is exactly how the IS/MF/X rotations work with 100% Moonfire uptime.</p>",
    "PostedDate": "2009-06-04T04:22:52.18-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "198033",
    "ThreadId": "58428",
    "Html": "<p>DopeFish,</p>\r\n<p>I think the potentially difference between what Ashtorathe described and what Rawr may do is what activity is performed during the Eclipse cooldown period (i.e. switch to spamming Starfire during that period instead of Wrath).</p>\r\n<p>I've never really thought about doing this before, but it makes a lot of intuitive sense -- especially if you have a fair amount of haste.</p>\r\n<p>I read on Grey Matter that the previous advice for moonkins (don't refresh IS&amp;MF in the middle of Eclipse) may not be true anymore. I try to avoid having them fall off in the middle of Eclipse, but I read that it may actually make sense to refresh them in the middle. I imagine that how early in Eclipse proc this happens may factor into the decision. I was curious if you have any thoughts on the subject and what rawr models (i.e. refresh whenever they expire or refresh only when not in Eclipse)..</p>\r\n<p>BTW, Ash -- did you mean to imply that your cast order is FF &gt; Wrath to Eclipse &gt; Starfire? I assume you mean:&nbsp; FF &gt; IS &amp; MF &gt; Wrath to Eclipse? I can't imagine why you would want to start your DPS rotation off without having IS &amp; MF up.</p>",
    "PostedDate": "2009-06-04T20:24:12.803-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]