[
  {
    "Id": "198523",
    "ThreadId": "58640",
    "Html": "<p>I'm probably doing it wrong, but every time I optimise my dps dk the optimised score is lower, i.e.: before 2240, after 1569.</p>\r\n<p>I kinda assumed that the score would increase, especially as I'm not the best at theory crafting.</p>\r\n<p>Any suggestions?</p>\r\n<p>Also, he's not a tank but I am a C# developer...</p>",
    "PostedDate": "2009-06-06T05:09:40.777-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "198544",
    "ThreadId": "58640",
    "Html": "<p>Make sure you have the gemming template set up properly if you're a Jeweler using the dragon's eye gems. Also, it would seem your problem is you are not adding items to your list to be optimized. You need to click the diamonds to the right of the items on the Gear list for each socket, to let the optimizer know you have those items.</p>\r\n<p>&nbsp;</p>\r\n<p>http://www.codeplex.com/Rawr/Wiki/View.aspx?title=GearOptimization is a link to the topic's documentation.</p>",
    "PostedDate": "2009-06-06T06:45:57.343-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "198553",
    "ThreadId": "58640",
    "Html": "<p>I am indeed a Jeweler, and I didn't set up any templates to my knowledge - thanks :$</p>\r\n<p>I thought I had checked all items to be optimised, but I'll try it again.</p>\r\n<p>Thanks for the help :)</p>",
    "PostedDate": "2009-06-06T07:55:59.33-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "198558",
    "ThreadId": "58640",
    "Html": "<p>Another minor point...</p>\r\n<p>the optimiser keeps adding sockets, even though I'm not a blacksmith so I don't have the &quot;BS Socket&quot; option checked.</p>",
    "PostedDate": "2009-06-06T08:34:08.01-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "198568",
    "ThreadId": "58640",
    "Html": "<p>Make sure you have gems and enchants marked as being available for the optimiser to use.</p>\r\n<p>If your current gear is enchanted and gemmed, but the optimiser doesn't know it is allowed to use gems and enchants, the best it will be able to do (using unenchanted unsocketed items), will probably be worse than what you have.</p>\r\n<p>If you accept the optimiser selection and have a look at this gear lists again. If you see anything marked as available and higher than the currently equiped item, the difference is probably due to either of these two. That can help to see if you skipped something during the selection process.</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-06-06T10:39:49.887-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "198599",
    "ThreadId": "58640",
    "Html": "<p>Also, keep in mind that DPSDK is currently quite broken.</p>",
    "PostedDate": "2009-06-06T14:10:25.793-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]