[
  {
    "Id": "198638",
    "ThreadId": "58670",
    "Html": "<p>The basics of feral DPS are pretty easy to state:</p>\r\n<p>Keep Savage Roar up.</p>\r\n<p>Keep Faerie Fire up.</p>\r\n<p>Keep Mangle up.</p>\r\n<p>Keep Rake up.</p>\r\n<p>Keep 5cp Rip up.</p>\r\n<p>Shred for combo points.</p>\r\n<p>Use Tiger's Fury whenever you are below 40 energy and it's up.</p>\r\n<p>Use clearcasts for Shred whenever possible.</p>\r\n<p>&nbsp;</p>\r\n<p>The tricky situations that come up, however, aren't always as easy and often require moment to moment decsions and quick reaction times.</p>\r\n<p>When you have 5cp, clearcast is up, you have 50 energy but Roar and Rip both have 6 seconds left what do you do?</p>\r\n<p>If you can get your next Rip off with the Tiger's Fury buff active how long can you delay it's use before you are losing DPS rather than gaining it?</p>\r\n<p>If you have 5cp and a clearcast active, 50 energy and roar will fade in 5 seconds should you waste a combo point on the shred rather than potentially wasting a clearcast or should you refresh roar right away and Shred so you don't have to Ferocious Bite and then probably end up Roar-ing @1cp?</p>\r\n<p>&nbsp;</p>\r\n<p>All these questions beg for an addon that optimizes combat decisions based on your gear, spec, current energy, cooldowns, etc.&nbsp; It would consider your set bonuses, probability of proccing Primal Fury (ie. crit chance), etc.&nbsp; I've seen the Face Mauler addon but it looks very rough and doesn't seem to take very many factors into consideration.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-06-06T19:22:09.317-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "198643",
    "ThreadId": "58670",
    "Html": "<p>Another issue is overlapping 5cp Rips. A major problem in my rotation is what increased my AP on the 5cp Rips. For example, I have 3cp currently with SR up. My Berserking procs while I shed, which crits. I have 5 cp with SR and Berserking up. I use Rip. I shred, rake and mangle to 5cp again, however I cannot cast rip again due to a &quot;more powerful spell is active&quot; until I let the previous Rip falls off.</p>",
    "PostedDate": "2009-06-06T19:48:58.17-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "198645",
    "ThreadId": "58670",
    "Html": "<p>Afaik you should never be overwriting a Rip unless you have a very strong reason to do so.&nbsp; ie. the energy and combos you invest in the new Rip more results in more damage than the energy and combos you could have invested in other abilities while also accounting for the lost combos/energy from the overwritten portion of the original Rip.&nbsp; I don't know how this breaks down, however.</p>",
    "PostedDate": "2009-06-06T19:56:43.927-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "198647",
    "ThreadId": "58670",
    "Html": "<p>I know, I'm just using that as an example. Generally for me, I would have to refresh my SR during that time, Refresh my other dots, and if I still have plenty of time, throw in a FB. But I'm just saying, there are times, when my crit streak is pretty lousy and I only have enough time to refresh my dots and SR and by the time I get 5cp, I have to wait 3-5 seconds before my previous Rip needs to fall off, or overwrite it.</p>",
    "PostedDate": "2009-06-06T20:16:07.897-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "198665",
    "ThreadId": "58670",
    "Html": "<p>...what are you guys talking about? How does any of this have anything to do with Rawr?</p>\r\n<p>BTW, TF doesn't affect Rip.</p>\r\n<p>And FaceMauler is very good, actually, with its only questionable choices being when it FBs. Not perfect, but pretty close.</p>",
    "PostedDate": "2009-06-06T23:12:59.837-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "198756",
    "ThreadId": "58670",
    "Html": "<p>I didnt get any DPS increase using FaceMauler at all...in fact all I got was far less combat awareness staring at a little box that was playing for me instead of me playing my character.</p>\r\n<p>If you use a good buff/debuff/cd mod like Power Auras Classic and confiure it properly you can do just as good or better than Face Mauler and still maintain full combat awareness and actually feel like you are playing your character instead of just following directions and letting a mod play.</p>",
    "PostedDate": "2009-06-07T10:46:26.78-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "198768",
    "ThreadId": "58670",
    "Html": "<p>As I said, FaceMauler is very good. You can do slightly better, if you're really good. The awareness issue is moot; once you get used to either method, it should be the same. You just had issues, since you weren't used to the new one.</p>\r\n<p>Regardless, what does any of this have to do with Rawr?</p>",
    "PostedDate": "2009-06-07T11:26:04.99-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "198779",
    "ThreadId": "58670",
    "Html": "<p>What this has to do with Rawr is this:&nbsp; If nobody has done any computer modeling of real combat (in which moment-to-moment clearcast procs and combo point generation are subject to variation) then the combat assumptions used for Rawr may not be properly calculated.&nbsp; If this hasn't been done then it might be useful to see whether a combat model based on decisions a player will make in actual combat would result in any significant differences to Rawr's DPS calculations.&nbsp; If this kind of modeling has been done, then, obviously, the point is moot.</p>",
    "PostedDate": "2009-06-07T12:05:02.03-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "198782",
    "ThreadId": "58670",
    "Html": "<p>From my reading of the code Rawr assumes a perfect rotation, pretty much, with everything up always.&nbsp; My only qualm about Rawr's model is that the perfect rotation where everything is up 100% of the time&nbsp;is not really obtainable due to almost every fight involving moving.&nbsp; Things will fall off as priorities shift and you have to run from fire or DPS an add, or what-have-you.</p>\r\n<p>Moreover there will be times you overlap time ranges and mangle early, or rip early, or mangle late or rip late or whatever since energy, CP, misses, etc do not happen predictably.&nbsp; You will consume clearcasting inefficiently simply due to the fact that it will proc sometimes while you are just about to do something other than shred.</p>\r\n<p>This all could be modeled somewhat by a &quot;slop factor&quot; slider.&nbsp; This slop factor, possibly one for each of the buffs and debuffs, would simply add to the model the &quot;down time&quot; for each of the various buffs and debuffs.&nbsp; This can be pulled out of wowmeter or wws or whatever and then inputted into Rawr.&nbsp;</p>\r\n<p>Still not perfect.&nbsp; I doubt you can perfectly model it short of an EnhSim sort of modeling tool.&nbsp; Even then the tool will play better than any player could and it would be hard to model having to move into the tool.</p>",
    "PostedDate": "2009-06-07T12:31:18.603-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "198823",
    "ThreadId": "58670",
    "Html": "<p><em>(One note, whenever we say 100%, we really mean 100% minus downtime caused by misses)</em></p>\r\n<p><em><span style=\"font-style:normal\">Yes, Rawr.Cat's calculations assume ideal conditions. It models direct combat only, not a specific fight with movement. Currently, that's up to the user to adapt for. That may change eventually, by adding de/buff variances like you mention, but it's pretty low on my priorities at the moment.</span></em></p>",
    "PostedDate": "2009-06-07T15:44:04.43-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "198877",
    "ThreadId": "58670",
    "Html": "<p>I started using Face Mauler today in 10 man Ulduar.&nbsp; What I found is that it reduced my dps by about 20%.&nbsp; As further evidence, another feral in the guild has been in the past two raids.&nbsp; Last week he consistently did about 80% of my DPS on single-target encounters with no damage increasing buffs.&nbsp; (Igneus, Vezax, etc.)&nbsp; Today I started using Face Mauler and my DPS dropped down to right around his.&nbsp; I was generally about 100 DPS ahead of him, as would be expected from gear differences.&nbsp; After about an hour of mediocre DPS I went back to doing what I thought best and my DPS immediately went back up my normal level.</p>\r\n<p>I noticed that Face Mauler would frequently instruct me to continue Shredding at 5cp if Rip was close to expiring.&nbsp; It would never tell me to Ferocious Bite if I had much more than 35 energy.&nbsp; It would constantly tell me to use a clearcast on abilities other than Shred.&nbsp; (I will use a clearcast on a Rip or FB but only if I already have 5cp.)</p>\r\n<p>&nbsp;</p>\r\n<p>A few conclusions about Face Mauler's algorithm (and Rawr's?):</p>\r\n<p>The value of 100% DoT uptime is overvalued.</p>\r\n<p>Combo points are undervalued.</p>\r\n<p>The use of clearcasts for abilities other than Shred is a loss of DPS.&nbsp; (With the exception of FB or Rip when at 5cp - this is tied to the value of combos. Or if Mangle is down.)</p>\r\n<p>The value of dots are greatly overvalued when the expected duration of combat is less than the dot duration.&nbsp; (Hopefully this is Face Mauler specific and, regardless, is a somewhat minor issue.)</p>\r\n<p>&nbsp;</p>\r\n<p>A few corrections to the prioritizations for combat:</p>\r\n<p>Always use clearcasts for Shred unless you are already at 5cp.&nbsp; If you are at 5cp either FB or Rip.&nbsp; If the wait to apply Rip is less than about 2 seconds then go ahead and wait till Rip expires and refresh it with the clearcast.&nbsp; (But only as long as your energy will not hit 100 and be lost, including the global cooldown from the Rip.)&nbsp; If the wait will be longer than 2 seconds or so FB.&nbsp; (You can wait a bit longer if you don't have 2pc Nightsong, otherwise you run too much risk of losing another clearcast.&nbsp; NEVER waste energy by allowing the bar to hit 100 though.)&nbsp;&nbsp; This situation is greatly simplified when Roar is expiring, simply refresh Roar and then Shred.&nbsp; (Again, don't let your energy fill up and don't wait more than a few seconds.)&nbsp; If you don't have 5cp and mangle is down you will have to mangle, unfortunately.</p>\r\n<p>If your energy bar will fill up before your Rip or Roar will expire and you have 5cp, then FB.&nbsp; Don't worry about having DoT downtime, just get them back up as soon as you can.</p>\r\n<p>If Rake falls off but you have to choose between refreshing Rake right away or Shredding to keep Rip from falling off (Glyph of Shred) then Shred!&nbsp; Refresh Rake right after.&nbsp; Which leads to...</p>\r\n<p>Get all three applications of Glyph of Shred whenever possible.</p>\r\n<p>Overwriting a Roar that has less than approximately 4 seconds remaining isn't a bad thing as long as you are doing so at 5cp, and doing so will prevent you from wasting energy or potentially wasting a clearcast.</p>",
    "PostedDate": "2009-06-07T23:25:07.013-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "198904",
    "ThreadId": "58670",
    "Html": "<p>For the billionth time, this is not the place to discuss FaceMauler, this is the place to discuss Rawr. Yes, we know FaceMauler isn't perfect.</p>",
    "PostedDate": "2009-06-08T01:16:03.177-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "198924",
    "ThreadId": "58670",
    "Html": "<p>Hyperbole notwithstanding, you implied that Face Mauler uses combat assumptions similar to those used by Rawr.&nbsp; Since I'm able to achieve roughly 25% more DPS than suggested by 'perfect' combat as instructed by Face Mauler there is the possibility that Rawr's combat assumptions are similarly sub-optimal.&nbsp; You mention Face Mauler as being &quot;Not perfect, but pretty close.&quot;&nbsp; I'd say that a 25% increase in DPS is a long ways off of perfect.&nbsp; I love the Rawr program and I love DPSing as a druid.&nbsp; I want to help the community by suggesting areas of potential improvements in the Rawr program and by sharing relevant experiences that might result in these improvements.&nbsp; Isn't that what this forum is for?</p>",
    "PostedDate": "2009-06-08T01:55:57.3-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "198949",
    "ThreadId": "58670",
    "Html": "<p>I can not comment on Facemauler at all, but it is extremely unlikely that an &quot;average&quot; try will beat the numbers posted by Rawr by 25% (assuming a &quot;normal&quot; fight with no special effects, that affect your damage).</p>\r\n<p>Rawr's cat model has a couple of issues that skew the results a little compared to the &quot;real&quot; world, but many of the assumptions err on the side of &quot;too much damage&quot;. It is of course possible to have a ton of rng luck and get higher dps numbers on some attempts.</p>\r\n<ul>\r\n<li>The rip + bite combat cycle used by rawr is different from the cycle most people (seem to) use. Rawr keeps up a 5CP Rip and uses the remaining energy/cp for a x CP Bite. It should be more efficient to use a 5CP bite every x cycles. Changing this would probably increase calculated dps by a little bit. For Naxx 25 gear &quot;x&quot; in the Rawr cycle is between 4 and 5, so the difference is going to be very small.</li>\r\n<li>Rawr assumes 100% uptime on Rip and Rake. This is pretty accurate for Rip in a pure Rip cycle, but Rip + Bite cycles will occassionally drop Rip for a few seconds (while still increasing dps over pure Rip). Calculating the average Rip uptime for a perfect player does not appear trivial however, so I am not sure if it's worth using any heuristics on this. A configurable option with a default of 1 or 2s Rip Uptime lost per Bite should work.</li>\r\n<li>For Rake the assumption is pretty far from the truth, since Rake is applied fairly often and does not have top priority. A user adjustable value might work, but it should also be possible to calculate the chance of a collision with a higher priority ability. Avoided attacks reduce uptime for Rip and Rake as well.</li>\r\n<li>Rawr assumes 35 energy for a Bite. While Rawr should simulate a perfect player, I think that's going a bit to far, since it is near impossible to achieve 35 energy Bites. A value of 37 or 38 would probably be the upper bound, with 40 being much more realistic even for very good players (I suspect most players will use quite a bit more energy on average).</li>\r\n<li>Rawr handles Savage Roar by calculating the most efficient Roar duration and applying Roar in even intervals throughout the fight. Typically players will match the application of roar to their cycle length. If they use a Rip Cycle, they will use as many CP on Roar as needed for the duration of a full Rip cycle. There is also significant overlap, especially on Rip+Byte cycles and while that can be reduced with clever energy and CP management, it is still unrealistic to assume no overlap (in my opinion). Calculating the duration of the used cycle and using the &quot;shortest&quot; roar that will cover that cycle might be most realistic (even though perfect players might be able to beat that). Using fractional CP with an estimate for overlap might be closer to &quot;perfect&quot; players and would result in smoother results (no dps jump if the cycle is changed).</li>\r\n<li>There are always small inaccuracies, though they may not be worth fixing. An example is the 4pc T7 bonus which does not affect the +weapon damage aspect of Tigers Fury in Rawr. Tigers Fury is also calculated as x applications during a fight, were x is an integer (again, this does not affect the weapon damage aspect, which is implemented as a constant bonus). I would argue that Rawr (with the possible exception of the mage module) is not (and should not be) used to generate exact data for fights of a certain duration. If used for general gear selection (and not optimizing for a certain encounter), using a fraction for the number of Tigers Fury would give much more realistic results. This would result in a stable value for the 4pc T7 bonus (for a general case).</li>\r\n</ul>",
    "PostedDate": "2009-06-08T03:15:48.843-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "199150",
    "ThreadId": "58670",
    "Html": "<p>I can tell you, for sure, that if you were getting -20% of normal DPS using FaceMauler, you either got really unlucky, you weren't using it right, and/or you had it configured way wrong.</p>\r\n<p>Regardless, Rawr. Lets talk about Rawr, not FaceMauler. Rawr's modeling is far from 'sub-optimal'; it's typically 'too' optimal, such that it's rare to be able to reach the DPS Rawr suggests you should do.</p>\r\n<p>Re: Bites being per rip cycle. A very valid point. I'd be interested in changing this, but would be concerned about it being too idealic. Getting in a 5cp Bite, every other cycle, for example, typically involves losing Rip uptime. While that may be worth it, it's not something we have a way to model in Rawr, at the moment. I'm much more comfortable, as a player, putting in many little bites, so as not to lose Rip uptime.</p>\r\n<p>Re: Rip uptime. I've seen people get 95% Rip uptime, while still getting a few bites in... 100% uptime should still be the target. Losing some uptime per bite would definitely make sense, although I'd prefer if there was some model to how much, instead of being user-configurable.</p>\r\n<p>Re: Rake uptime. Rake should have a decently high priority (only Rip/SR beats it). The only downtime on Rake should be due to collisions with Rip/SR, which should be decently rare. There was talk of Rawr.Cat adjusting uptime down, to account for GCD collisions, a while ago, perhaps we should look into that again. I think Toskk did some modeling of that.</p>\r\n<p>Re: Bite energy cost. Another very good point. I'll adjust Bite damage/cost to be 38. You really shouldn't use Bite at higher than 35+latency.</p>\r\n<p>Re: Roar cycles. This is kind of an odd situation, where Rawr calculates the ideal CP of Roar to use, but that never really matters in practice (as far as I know). You just always Roar with however many CP you have, when it's going to fall off. So I almost want to just drop that set of calculations, and always assume 5cp SRs; you can't pick a lower one that syncs up with your Rip time, because the SR duration will be variable, based on crit rate. However, I do agree that we should account for overlap between SRs, just like we (want to) account for downtime between Rip/Rake.&nbsp;</p>\r\n<p>Re: 4T7. Take another look; it does count the +weapondamage of TF. As for specific fight vs general fight, I think that can be left up to the users. For general fight, just use a very long fight duration.</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>That's the sort of thing we should be talking about here, not FaceMauler. Thanks, Madone. :)</p>",
    "PostedDate": "2009-06-08T10:39:07.383-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "199918",
    "ThreadId": "58670",
    "Html": "<p>@Bites per rip cycle: I agree that this is quite tricky and not a quick fix. It should not have a big impact until more than 1 bite per cycle is used (as most users will see close to 5 CP with the current implementation, keeping the difference small).</p>\r\n<p>@Rip uptie: As with the Bite cycle, this might benefit from some simulation work to get a good grasp on &quot;the best cycle&quot; and how much rip time should be and has to be sacrificed for bites. I think this is slightly more important than the bite cycle, since it affects the value of the rip idol a lot, but not serious enough to make changes without a good idea of how to model rip/bite cycles accurately.</p>\r\n<p>@Rake uptime: Rake will also collide with mangle, which will either add mangle overlap (mangling early to resolve the conflict) or rake downtime. I think this is pretty important for modeling since the energy freed due to less rakes will go into shreds, which will increase the ratio of direct physical damage to bleed damage and increase the value of armor penetration. It will also increase the value of the shred idol by a noticeable amount.</p>\r\n<p>@4pc T7: I think the relevant code for the damage aspect of Tigers Fury is:</p>\r\n<p>statsTotal.WeaponDamage += 16f; //Tiger's Fury</p>\r\n<p>The cooldown recution would increase that by 1.78f.</p>\r\n<p>@Tigers Fury: Increasing the fight duration is certainly a valid approach, but I can still see a few problems. The default fight duration is fairly short and a lot of users won't change that setting. If that setting happens to be a poor choice for 4 T7 they will equip themselves optimally for a fight that last exactly 5 minutes if they keep Tigers Fury on cooldown flawlessly.</p>\r\n<p>I think what most users want to know when they set the fight duration to x minutes, is &quot;What's the best gear for a fight that will last approximately 5 minutes&quot;. In the case of TF there is a tradeoff between simulating an exact fight duration and optimizing the gear for a slightly more genereal szenario. I happen to think, that the latter is more useful to most rawr users.</p>\r\n<p>&nbsp;</p>\r\n<p>Generally I'd like to use a cycle based approach for the cat model. This would calculate the dps and damage per energy for various cycles and select a mix of cycles to maximize dps using all available energy. The current rip&amp;bite mode would split into a rip cycle, a rip + 1 bite and a rip + 2 bites cycle. Depending on available energy a mix of rip &amp; rip + 1 byte or a mix of rip+1 and rip+2 cycles would be used.</p>\r\n<p>I am on vacation for the next 2 weeks though (yes, without access to a computer), so I won't get to it for a while.</p>",
    "PostedDate": "2009-06-10T04:14:08.32-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "199933",
    "ThreadId": "58670",
    "Html": "<p>@Rake uptime: Err, yeah, Mangle too, dunno why I didn't say that.</p>\r\n<p>@4T7: Yes, it does increase that by 1.78f. Are you not seeing that in Rawr?</p>\r\n<p>@&quot;about 5min&quot; vs 5min: Meh, I'd rather preserve accuracy. If we can provide an accurate number instead of an estimate, and it's easy enough to adjust the property, I'd much rather do that.</p>\r\n<p>@cycle based approach: The problem is that things don't even remotely line up into a 'cycle' for Cats, even just counting finishers. Instead, you get a situation like this (the most accurate depiction of a feral dps cycle that I've found):&nbsp;<a title=\"http://i238.photobucket.com/albums/ff55/elienis17/catdps-1.jpg\" href=\"http://i238.photobucket.com/albums/ff55/elienis17/catdps-1.jpg\">http://i238.photobucket.com/albums/ff55/elienis17/catdps-1.jpg</a></p>",
    "PostedDate": "2009-06-10T04:41:23.977-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "199976",
    "ThreadId": "58670",
    "Html": "<p>@4T7: Actually I was just looking at the code but couldn't find anything. It does indeed work in Rawr and after a *lot* of searching I found the relevant line in buffs.cs . Everything fine, my fault.</p>\r\n<p>@cycle: That chart clears things right up. It actually sums up nicely how I feel on some boss fights, but I assume it's just me being chaotic and lacking skill ;)</p>",
    "PostedDate": "2009-06-10T06:17:59.063-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "200157",
    "ThreadId": "58670",
    "Html": "<p>Wait, so Tiger's Fury is on integer useage?&nbsp;</p>\r\n<p>Maybe I misunderstood, but I thought just about everything else in Rawr (feral model anyways) was averaged.&nbsp; Ex, in 100 white swings does a 3.6% miss rate subtract the dps of 3.6 or an integer 4 swings?&nbsp; If everything else is averaged rather than converted to integer values, it seems odd that some things are integers.&nbsp; Or trinket procs.&nbsp; If an internal cd or on use cd is longer than 30s, why is it averaged but TF is not?&nbsp; Are procs avged and on use integer?</p>\r\n<p>Like Madone, I model thinking a fight of &quot;about 5min&quot; not exactly 5minutes.&nbsp; Though I do see where issues come in, such as the tremendous difference in a 3:00 fight vs a 3:15 fight, vs a 3:15 fight with bonsuses rounded due to Berserk.</p>",
    "PostedDate": "2009-06-10T13:30:23.53-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "200254",
    "ThreadId": "58670",
    "Html": "<p>With all buffs, glyphs, gear, enchants, talents, etc selected my Rawr DPS is 5664.&nbsp; I pull just below 7k on Igneus.&nbsp; Something isn't quite right.&nbsp; *shrug*</p>",
    "PostedDate": "2009-06-10T19:49:01.727-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "200255",
    "ThreadId": "58670",
    "Html": "<p>Cath, post your character file; I expect you have something set wrong to be able to do 7k and only have Rawr say 5664. For one thing, there's always RNG, as well. And Ignis's pot can provide even more DPS.</p>",
    "PostedDate": "2009-06-10T20:01:57.077-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "200267",
    "ThreadId": "58670",
    "Html": "<p><a title=Profile href=\"http://www.mediafire.com/?ymkjzmdlntz\">http://www.mediafire.com/?ymkjzmdlntz</a></p>\r\n<p>I consistently have pulled 6.6 up until this week.&nbsp; Then I got Lotrafen and revised my roar and bite timing.&nbsp; I never got the pot buff.</p>",
    "PostedDate": "2009-06-10T21:03:15.9-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "200273",
    "ThreadId": "58670",
    "Html": "<p>Seriously missing Sunder, 10%AP, AND 16/20% Haste? Those are nearly the 3 largest buffs, and I'd be really surprised to see a raid with none of those. You also have an oddly screwed up talent spec in that file. You're missing the 2 obvious points in Imp MotW, and you've got 1 point in Genesis (wtf?). I expect you actually do have all/most of those things in raid. By fixing those things in your file, Rawr puts you at 6802.</p>",
    "PostedDate": "2009-06-10T21:58:58.643-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "200284",
    "ThreadId": "58670",
    "Html": "<p>Yeah, those buffs were an oversight on my part.&nbsp; The Genesis thing is something that Rawr always suggests when I click &quot;optimize talents.&quot;&nbsp; Sometimes I forget to change it back.</p>\r\n<p>I've actually swapped gear around a bit and regmemmed a few slots.</p>\r\n<p><a href=\"http://www.mediafire.com/?ymkjzmdlntz\">http://www.mediafire.com/?ymkjzmdlntz</a></p>",
    "PostedDate": "2009-06-10T23:10:21.627-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "200291",
    "ThreadId": "58670",
    "Html": "<p>Genesis has 0 value, it must not have had anything else that provides any DPS to put it toward (It doesn't understand intangible values like Imp LotP, etc).</p>",
    "PostedDate": "2009-06-10T23:30:55.593-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "212356",
    "ThreadId": "58670",
    "Html": "<p>I'd like to hijack this thread for a minute...</p>\r\n<p>I tried working towards the optimal rotation / priority list&nbsp;that Rawr suggests for me and I can't quite get it...&nbsp; Problem is that Rawr doesn't tell me what my rip uptime is supposed to be so I'm expecting it to be 100% (you know, give or take some noise).</p>\r\n<p>That being said, my priority list includes a 5CP Rip, SR and FB along with the usual suspects.</p>\r\n<p>Every time I do a 5CP FB, I lose either rip or SR uptime.&nbsp; I just don't seem to have enough energy to get 5CPs up and then keep the two going.&nbsp; What should I be experimenting with to get this down right?</p>\r\n<p>One idea that I have may be to do something like 3CP SR, 5CP rip, 3CP SR, 5CP FB, or something to that (maybe 2CPs on the SR).&nbsp; That&nbsp;may work&nbsp;but will introduce one more GCD&nbsp;from the additional SR cast, but I'm not too worried about that.</p>\r\n<p>Now I haven't&nbsp;tried it yet, but my dilemma is that it breaks Rawr's advice to use 5CPs on&nbsp;rip, SR and&nbsp;FB.&nbsp; Is there&nbsp;something I'm missing?&nbsp; Or am I just not lucky enough with my&nbsp;free CP crits?</p>\r\n<p>Char&nbsp;</p>",
    "PostedDate": "2009-07-15T15:40:38.327-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "212365",
    "ThreadId": "58670",
    "Html": "<p>You should always be using 5pt rips and FB's but you shouldn't be aiming for any particular number of combo points for SR.&nbsp;&nbsp; The number of points will be determined by how long you have left on SR and Rip.&nbsp; There is no point in aiming for a 5pt SR if your RIP is about to expire.&nbsp; A 1 or 2 pt roar is pretty standard in a lot of cases here.</p>\r\n<p>FB is difficult to use without affecting your SR, Rip uptimes.&nbsp;&nbsp; At lower gear levels I almost only used it during a beserk.&nbsp; Now that I have geared up more and have 56-57% crit, I can use it a lot more as I can generate a lot more combo points in the same period of time.&nbsp; Even so, it is very easy to have a FB turn in to a DPS loss if you try to use it too much.</p>\r\n<p>Take home message is that there is no optimal rotation you can just follow.&nbsp; Maximising your feral DPS comes down to keeping an eye on your buff &amp; debuff timers and using abilities accordingly.</p>\r\n<p>The rotation section of the EJ Cat DPS guide for Dummies is pretty good a summarising it - <a href=\"http://elitistjerks.com/f73/t63774-cat_dps_guide_dummies/\">http://elitistjerks.com/f73/t63774-cat_dps_guide_dummies/</a></p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-07-15T16:23:21.57-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "212367",
    "ThreadId": "58670",
    "Html": "<p>Thanks for the link.&nbsp; I'm not exactly new to this cat thing, and heck, when raid&nbsp;buffed my crit is a few % over 50 as well.&nbsp; I'm pretty aware of most of the rules there except for maybe the specific number of 8 seconds left on SR &amp; rip for FB.</p>\r\n<p>But bringing the discussion back to Rawr then, I'd like to know how often I can expect to FB.&nbsp; For example, Rawr tells me I should be getting 32% of my damage from rip and 5.6% from bite.&nbsp; That means that Rawr has some idea of how often I should be able to FB successfully relative to the number of rips I have.&nbsp; If I was provided that information I'd have a much easier time trying to gague if I'm &quot;doing it right.&quot;</p>\r\n<p>If it turns out that I'm only supposed to get 1 FB out for every 10 rips, then I'm probably doing it right.&nbsp; Or heck,&nbsp; if I'm only supposed to FB during berserk, then I'm definitely doing it right.</p>\r\n<p>So at the end of the day, maybe I am doing everything right and just figuring out the exact threshold (i.e. 8 seconds) given my additional &quot;internal latency&quot; that's right for me if I'm aiming for the 5CP everything.&nbsp; I think that maybe I could have had my attempts reinforced if I knew that I should be doing only 10% successful out-of-berserk FBs and 2-3 in-berserk FBs.</p>\r\n<p>Makes any sense?</p>\r\n<p>Char</p>",
    "PostedDate": "2009-07-15T16:56:04.743-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "212374",
    "ThreadId": "58670",
    "Html": "<p>I can get close to some of the information I want by dividing the total damage done by an ability by it's corresponding damage-per-swing.&nbsp; This tells me how many times in that fight I used it.&nbsp; The only concern now is that it doesn't tell me about in-berserk FBs versus out-of-berserk FBs.</p>\r\n<p>The numbers for rip and FB in my case come out to 11.5 and 9.75.&nbsp; Not taking into account berserk, that means that almost for each time I rip I should expect to be able to fit in an FB (yes, not exactly).&nbsp; Now if I assume 2 &quot;free&quot; FBs in each of the&nbsp;2 berserks in a 5 minute fight, I am really looking at 11.5 rips vs 5.75 FBs.&nbsp; This would imply that rawr thinks I can sneak in an FB roughly once for every two rips.</p>\r\n<p>That's information that I can use to measure how &quot;well&quot; I'm doing according to Rawr's calculations.</p>\r\n<p>First, is my logic sound?</p>\r\n<p>Second, are my numbers in the realm of reality?&nbsp; (i.e. ~2x the rip cycles compared to FBs?)</p>\r\n<p>Char</p>",
    "PostedDate": "2009-07-15T17:28:39.607-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "212381",
    "ThreadId": "58670",
    "Html": "<p>This is pointing out somethings I'd like to improve with the Cat rotation (loosely used) modeling.&nbsp;It models FBs as not costing Rip uptime. In reality, that's rare; you can estimate how much time you need to generate 5 more cp, and choose to bite when you have more time than that... then half the time, you get no crits and no ooc procs, and lose Rip uptime. I need to better account for that. On the flip side, though, sometimes getting in a Bite when you otherwise wouldn't, and losing some Rip uptime is worth it. That's a pretty small amount of rip uptime lost, but it's something. Basically, I just need to adjust Rip uptime to account for FB usage. Overall, that will probably lower the amount of FBing that Rawr thinks you should do, because it won't be worth it as much, due to the lost Rip uptime.</p>\r\n<p>Also, another thing I'd like to improve is how it handles Berserk; it just counts it as extra energy right now. On a related note, unless I'm missing something, you specifically *don't* want to FB during Berserk, since the extra ('execute') energy that it uses isn't halved by Berserk, and you're high on energy most of the time during berserk, making it use up the full 30 energy most of the time.</p>",
    "PostedDate": "2009-07-15T18:48:03.003-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "212384",
    "ThreadId": "58670",
    "Html": "<p>This is something Ive been wondering about for awhile.&nbsp; FB always seems to use way more energy than it should.&nbsp; So you should *NOT* FB during a Berserk?&nbsp; I assume you will if you are at minimum energy required to FB but othrewise just keep shredding.</p>",
    "PostedDate": "2009-07-15T19:09:52.187-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "212396",
    "ThreadId": "58670",
    "Html": "<p>As far as I know, that's correct.</p>",
    "PostedDate": "2009-07-15T20:20:26.93-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "212441",
    "ThreadId": "58670",
    "Html": "<p>Very true, you need to be careful not to waste energy.&nbsp;&nbsp;&nbsp; Sometimes with OOC procs (particularly during bloodlust) I have trouble not wasting energy by going over 100.&nbsp;&nbsp; Sometimes though, I can get low enough for a FB, or just after the Beserk expires (especially as you often have Tigers Fury up soon after as well to make sure you can get the CP's to rip again afterwards.</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-07-15T23:46:48.607-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "212828",
    "ThreadId": "58670",
    "Html": "<p>Hi Astrylian,</p>\r\n<p>So if I'm to understand you correctly, even if I were able to figure out the number of times Rawr fit an FB in there, I shouldn't expect to be able to do it myself since Rawr over-estimates the number of FBs.</p>\r\n<p>I think one interesting statistic that Rawr can provide that may be hard to get otherwise is the sweet spot between getting an FB in and losing rip uptime.&nbsp; Since Rawr knows what my average damage per tick is, and rawr has an expectation of what my average FB will hit for, it could tell me that in the worst case I will want to lose no more than 1 (or 2) rip ticks for an FB.&nbsp; That, combined with an estimate of how long it would take to generate 5 CPs, Rawr could actually customize the &quot;8 second rule&quot; for FB usage.</p>\r\n<p>Sure, they are all ballpark numbers because they depend on OOC procs and crits, but at least it would give folks a starting point to experiment with.&nbsp; Could be that I find myself sitting at 8 (or 6 or 10) seconds as the danger zone for an FB, I can experiment with one second more and one second less till I'm satisfied.</p>\r\n<p>Char</p>\r\n<p>p.s. My real big wish for Rawr now that I'm scrutinizing my performance is to have it parse Recount data (or some better combat log format?)&nbsp; Maybe I should work on something like that some day when I have free time (yuk yuk yuk...)&nbsp; There's just SOOOOO much it could do.&nbsp; You could ignore models completely and custom rotations and estimate gear's worth based on someone's play.&nbsp; That is a lot of work, but something I'd rather do more realistically and much more simply is have it populate my raid buffs for me.&nbsp; Beats having to remember all 50 icons I saw on my character during&nbsp; a fight.</p>",
    "PostedDate": "2009-07-16T17:40:25.47-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "212853",
    "ThreadId": "58670",
    "Html": "<p>Yeah, that 'sweet spot' is what I was talking about with it adjusting Rip uptime based on FB usage. To be clear, I do think it's overestimating how often you can safely use FB, however not by alot. &nbsp;It's still only a few times per boss fight.</p>\r\n<p>&nbsp;</p>\r\n<p>Rawr.HolyPriest does what you mention about parsing combat logs to rate gear based on how you played in that fight. However, that's kind of a slipperly slope, because I'd rather encourage people to play better, than to perform better while playing badly. But yeah, it's definitely something I'm keeping in mind.</p>",
    "PostedDate": "2009-07-16T19:47:54.423-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "213448",
    "ThreadId": "58670",
    "Html": "<p>Charinna,</p>\r\n<p>&nbsp;</p>\r\n<p>A suggestion on parsing your combat log: World of Logs. Free to use their basic service, lets you upload your combat logs into parsed events. For your purposes you can look up your character and review buffs gained (thus telling you what buffs to use in Rawr) and buffs cast (thus telling you what uptime you've had on your own buffs and mob debuffs such as Rip).</p>",
    "PostedDate": "2009-07-18T15:25:02.24-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "213468",
    "ThreadId": "58670",
    "Html": "<p>The hidden power of World of Logs comes from the little '#' sign next to the De/Buffs listed on the Buffs cast/gained tab of the unit details pages, which graphically show the uptime. Show the uptime of Roar, Rip, Rake, Mangle, Tiger's Fury, and Berserk, to see how well you are maintaining de/buffs.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-07-18T18:08:19.293-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "213515",
    "ThreadId": "58670",
    "Html": "<p>Thanks guys, I'll check it out.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-07-18T23:38:42.083-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]