[
  {
    "Id": "198770",
    "ThreadId": "58706",
    "Html": "<p>Hello,</p>\r\n<p>I use Rawr for both eq optimization and finding out if piece of eq presently dropped is upgrade in any way. So I would love to have ability to disable accounting for various stat caps&nbsp;(hit, expertise, ...), because when I have my current eq loaded in rawr, stats which are capped or near cap are not fully accounted in &quot;item value&quot;, which is not desired if I want to find out actual item value.</p>",
    "PostedDate": "2009-06-07T11:32:01.587-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "198788",
    "ThreadId": "58706",
    "Html": "<p>We don't plan to do that. Build upgrade list already takes caps into account when suggesting upgrades.</p>",
    "PostedDate": "2009-06-07T12:53:46.45-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "198824",
    "ThreadId": "58706",
    "Html": "<p>In other words, you don't really want what you're asking for; you should be using Build Upgrade List for what you're trying to do.</p>",
    "PostedDate": "2009-06-07T15:45:05.207-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "198829",
    "ThreadId": "58706",
    "Html": "<p>I don't think we understand each other :). Let me clarify: I am on raid and item drops. Since there is soo many items I don't create wishlists anymore, I&nbsp;just have running Rawr in background and when I want to know if I may possibly use that item, I just look to Rawr and compare it with what I have... but Rawr is not ideal for it because eg. item with hit rating is much lower in list than it would be if I had not hit already capped, even if I would use that item, because it has eg. +20hit compared to what I have (I would use it and replace 20hit somewhere else with usefull stat).</p>\r\n<p>What I suggested was checkbox &quot;Ignore caps&quot;, when checked no stat would be limited by cap when counting its value, so item with eg. hit rating would show up on the same place in list whether I have reached cap or not.</p>",
    "PostedDate": "2009-06-07T16:03:13.067-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "198833",
    "ThreadId": "58706",
    "Html": "<p>If you just want to know upgrade for just one item you can right click on it and select evaluate upgrade.</p>",
    "PostedDate": "2009-06-07T17:00:00.053-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "198847",
    "ThreadId": "58706",
    "Html": "<p>To do what you want to do, you'd have to click on the item to say you have it available for optimize (and you would ideally have other items that you have in the bank selected, etc), then you would optimize.</p>\r\n<p>There's no real way to &quot;ignore caps&quot; because caps just aren't something you can ignore by the way rawr is designed.</p>",
    "PostedDate": "2009-06-07T20:11:52.243-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "199166",
    "ThreadId": "58706",
    "Html": "<p>Hi Jozef, I use rawr in exactly the same way you do, and I know the same problem youre talking about.</p>\r\n<p>It sounds like you're getting frustrated (like I often do) when you are getting peices of gear that are small upgrades and as your overall stats change (maybe you get more hit rating) an older peice of gear becomes better, or you now need something that you didnt need before.</p>\r\n<p><span style=\"white-space:pre\"> </span>First let me say, this really isnt that bad. If you keep following rawr like that, you will only make net positive changes to your character. even though you might revert to an old peice of gear ( keep your old gear unless its a downgrade in every stat!!!) you are improving your character.</p>\r\n<p><span style=\"white-space:pre\"> </span>Secondly, there is a fairly new feature of rawr that lets you build very detailed and &nbsp;extensive upgrade lists. These are generated by the optimizer which is designed to calculated the best possible combination of gear. &nbsp;The lists generated from this shouldnt change the way your normal item values change.</p>\r\n<p>Here are some more recommendations for comparing loot on the fly:</p>\r\n<p><span style=\"white-space:pre\"> </span>1) optimize your character to find the best possible gear in rawr, and equip it in the modeller. then look at the relative stat values and export the data to a Pawn weight scale to view a tooltip with values for comparison in game, or at one of the loot comparison sites (www.lootrank.com , www.wowhead.com &nbsp;*and create an custom item filter, weight scale) &nbsp;This will tell you how you will be comparing and looking at gear when youre in the best gear in the game, which will make the items optimizer thinks are best, show up as the best items on your weight scale.</p>\r\n<p><span style=\"white-space:pre\"> </span>2) if you dont want to go for such a long term goal of &quot;best gear in the game&quot; (which often takes an incredibly long time) you might try modifying your gear in rawr to account for dfferent things you want to look at. If you want to consider item values after you're hit capped, throw on a hit trinket or something to bring your hit chance above the cap, and then export an item scale. If you do something like this, be sure to go back to rawr and update your scale as your gear changes regularly.</p>\r\n<p>Personally I am a big fan of using the addon Pawn (available from www.curse.com) which displays item values based on custom stat weight scales in game. &nbsp;Running Rawr in the background slows down my fps during boss fights too much, and sometimes if loot is going fast, it takes me too long to find the item in rawr before the loot master has given the item away.</p>\r\n<p>Hope this helps!</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-06-08T11:23:30.893-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "199205",
    "ThreadId": "58706",
    "Html": "<p>No, we strongly recommend that users <strong>DO NOT do that.</strong>&nbsp;Users should be using the tools that Rawr provides, which fully fufill this need: <em>Upgrade Lists, <strong>NOT Pawn/LootRank/etc</strong>. </em>There is solid help for the Optimizer available at&nbsp;http://rawr.codeplex.com/Wiki/View.aspx?title=GearOptimization&amp;referringTitle=Home, and Upgrade Lists are a simple extension of that. If anyone has time and would like to write a help file specifically for Build Upgrade List, that'd be great as well.</p>\r\n<p>Again, please do not recommend the use of inaccurate tools like Pawn/LootRank, when accurate tools are available.</p>",
    "PostedDate": "2009-06-08T12:41:01.707-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "199254",
    "ThreadId": "58706",
    "Html": "<p>The build upgrade list does to some extend bypass the cap, in the sense that it looks for ways to use other gear/gems to not have the hit wasted. (Compare that to the direct item upgrade list or individual slot lists, which would have the hit stat wasted).</p>\r\n<p>In the short term, this is what is needed, but potentially in the longer term, there is the problem xbobohobox is hinting at: the fact that rawr encourages you to hang on to old gear and stock up on potential side-grades, just in case at some point in the future this item might become useful, i.e. with the current gear available to me, the hit on this item will be wasted, so no upgrade atm, but if I replace my XXX sometime in the future, then suddenly I won't be hit capped anymore and this item might actually be an upgrade at that point in time.</p>\r\n<p>Basically what we need is a way to calculate and state that an item will always be a downgrade compared to existing (and future) gear options. In that way you know you can de/sell the bank item or not bother looking at it when it drops. In some cases this is trivial: If all the stats on the item is less or equal another item in the available list, this item can be marked for deletion. When it has mixed higher lower stats, this becomes less obvious and when capped stats are involved it becomes much more difficult.</p>\r\n<p>But to some extent hit rating is easier to evaluate, compared to some other stats: If your capped from other sources, the hit on an item can be totally wasted, so evaluating the item without the hit stat and/or with the character forcably set to be at the cap already can give lower bounds on the items value. I'm assuming hit either stays constant or the value drops off, so it might be possible to estimate an upper bound on its value. Trade-offs between other stats, like crit versus AP, which don't have extreme boundary conditions, probably will be more difficult to place boundaries on.</p>\r\n<p>But if we can figure out a way to do this, it would cut down on the items of interest and free up a bunch of slots in my bank atleast.</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-06-08T14:30:51.677-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "199272",
    "ThreadId": "58706",
    "Html": "<p>It's not just looking at stuff filling up our banks.&nbsp; It's also that realistically we will never have every single item, so while it is more accurate, sometimes it's a pain to watch items bounce up and down in upgrade size.&nbsp; You don't really know if it was a wise DKP investment if just 1 piece later the values reorder.</p>\r\n<p>Personally I do the following:</p>\r\n<p>1. I make a set of optimizer recommended BiS including all items I think I have even a remote shot of seeing.</p>\r\n<p>2. I make a set of what I'm wearing at present.</p>\r\n<p>Then when items drop I go for items in the following priority order:</p>\r\n<p>1. Top of the BiS list&nbsp;and&nbsp;better rated&nbsp;on&nbsp;my current setup.</p>\r\n<p>2. Top of the BiS list&nbsp;and&nbsp;slightly lower&nbsp;rated on my current setup.</p>\r\n<p>--what I'd actively bid for</p>\r\n<p>3. Rated above what I'm wearing currently on both lists.</p>\r\n<p>4. Top of the BiS list but useless in my current setup.</p>\r\n<p>-what I'd gladly take, but would pass</p>\r\n<p>5. Rated above what I'm wearing currently on 1 of the 2 lists.</p>\r\n<p>-what I'd only take if it were to be DEd</p>\r\n<p>The changing current setup list does cause some minor fluctuations, but in general it ensures that I will&nbsp;always wear what I get either in the short term or at a later date.&nbsp; The hardest problem I have is that it requires looking at 2 Rawr models, so it's kind of slow flipping back and forth between the 2.</p>",
    "PostedDate": "2009-06-08T15:18:40.217-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "199686",
    "ThreadId": "58706",
    "Html": "<p>my friend has a moonkin and needs only 4 hit rating to be capped and so its really not a big deal to get it (he missed once in and entire Ulduar run).</p>\r\n<p>rawr shows hit rating as an improvement over other obviously better gear, i'm sorry i dont have any examples he went into math and theory and i forgot what he was showing me</p>\r\n<p>anyways i was just wondering if there was a way to solve this problem</p>",
    "PostedDate": "2009-06-09T13:32:29.32-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "199692",
    "ThreadId": "58706",
    "Html": "<p>You will need to provide the math and/or theory in order to make such a statement and be taken seriously, i.e. there is no problem, until you can prove it.</p>\r\n<p>Your statement sounds like you think Rawr attaches any value to hit rating. It doesn't. Rawr attaches value to dps (if that is the model your using) that comes out of the theorycrafted model. If high dps happens to result from gear that happens to have lots of hit rating, that is what it would recommend. If you have happen to have a legendary item that cause huge amounts of dps, but has no hit, then that is what it would recommend.</p>\r\n<p>The apparent value that hit rating seems to have, will change based on how much of each stat you have. If your friend is 4 hit below it the cap, and rawr still suggests an item with more than 4 hit, it will most probably be due to the spellpower and crit on that item, not the 4 hit rating.</p>\r\n<p>(The original request&nbsp; in this threat was actually started, exactly because it is so easy to get hit capped, resulting in wasted hit rating).</p>",
    "PostedDate": "2009-06-09T13:53:19.003-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "199699",
    "ThreadId": "58706",
    "Html": "<p>hrm, your right. When i get home i'll try and get some claification from him</p>",
    "PostedDate": "2009-06-09T14:16:02.277-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "199700",
    "ThreadId": "58706",
    "Html": "<p>i think what he meant was that he wanted to diable the entire hit rating stat because he didnt need it, from what i gathered</p>\r\n<p>why doesnt Rawr attach a value to hit rating? it improves dps</p>\r\n<p>i dont think i understand how to use this thing correctly :P</p>",
    "PostedDate": "2009-06-09T14:20:02.687-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "199704",
    "ThreadId": "58706",
    "Html": "<p>Let's say there are two items for your boots slot</p>\r\n<p>Boots of the Overly Dumb</p>\r\n<p>+20 Stam<br>+10 STR<br>+10 Hit</p>\r\n<p>Boots of the Not so Overly Dumb</p>\r\n<p>+20 Stam<br>+10 STR<br>+5 Hit</p>\r\n<p>If you were 4 away from the Hit cap, these items would have the same DPS boost number.</p>\r\n<p>If you were 8 away from the Hit cap. The Overly Dumb boots would have a higher DPS boost.</p>\r\n<p>Still at 8 away from hit cap, if the Not So Overly dumb had more/better stats than the Overly Dumb even tho it only had 5 hit it would recommend the Not So Overly Dumb instead as it gave a higher total DPS boost.</p>\r\n<p>Hit only has DPS value to the hit cap, after the hit cap, it stops giving any <em>more</em> DPS value.</p>\r\n<p>To see what each stat is *currently* valued at for the next point (in how much DPS it will add), check the Relative Stat Values selector. You'll notice that under the Hit Cap, Hit will have a relatively high value (aka high dps boost), but once your toon reaches the hit cap by other means, Hit drops to 0 dps value.</p>\r\n<p>Edit: corrected some of my wording</p>",
    "PostedDate": "2009-06-09T14:32:24.16-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "199796",
    "ThreadId": "58706",
    "Html": "<p>The point is that Rawr doesn't assign value to <em>stats</em>, it assigns value to <strong>DPS </strong>(or whatever your current model is based on), which is calculated based on total stats.</p>",
    "PostedDate": "2009-06-09T19:58:49.197-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]