[
  {
    "Id": "1366563",
    "ThreadId": "587885",
    "Html": "Hello - I'm currently using the v2.3.22 for the 3.3.5a Wotlk Patch. Very awesome/easy to use program and congratulations to the people that constructed this. Other than the odd lag/delay on processing certain things, the program runs great! I've downloaded this and used it right away and it seems self explanatory with a few read-throughs of FAQ's and such. (The newest version seems WAY MORE confusing, turned away from it ASAP. This version seems so much more user friendly, ANYWAYS....... \r<br />\n<br />\nI'm trying to test out different gear sets to find an actual bis for an avoidance &amp; armor &amp; Sindragosa tank set. Oddly enough I've encountered a bug (I think)? I can't seem to equip gems anymore. Perhaps 20 minutes into my assembly of gearsets went by smoothly, Then all of a sudden I can't seem to equip gems... \r<br />\n<br />\n<a href=\"http://prntscr.com/6i7xz1\" rel=\"nofollow\">http://prntscr.com/6i7xz1</a>\r<br />\n<br />\nI'd like to equip a nightmare tear into my headsocket to activate the meta (Requires 2 blues &amp; 1 red). When i right click the broken ramskull, select &quot;Equip custom gemming&quot;, and try to change the Solid Majestic for a nightmare, it doesn't list ALL of the gems like it used to, only the solid majestic is within the list.\r<br />\n<br />\nSome assistance? Maybe i clicked an incorrect option? Yes i've tried googling/skimming through your articles on this website.... Figured id rather get a direct answer.\r<br />\n<br />\nThank you for your time/reading.<br />\n",
    "PostedDate": "2015-03-18T01:51:10.087-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1367418",
    "ThreadId": "587885",
    "Html": "<a href=\"http://www.wowhead.com/item=49110/nightmare-tear\" rel=\"nofollow\">http://www.wowhead.com/item=49110/nightmare-tear</a>\r<br />\n<br />\nThat item is unique equipped, do you have one selected in another piece of gear?\r<br />\n<br />\nThe reason the newer versions are confusing is because they get changed with WoW expansion releases, where they totally overhaul how characters work.<br />\n",
    "PostedDate": "2015-03-19T21:00:26.057-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1367427",
    "ThreadId": "587885",
    "Html": "No sir, i do not have another nightmare tear equipped anywhere in my gear set. I may have explained it poorly. Another screenshot has been posted showing what happens... (I had to screenshot two seperate images onto one, thats why it looks like a chopped screencap).\r<br />\n<br />\n<a href=\"http://prntscr.com/6izglm\" rel=\"nofollow\">http://prntscr.com/6izglm</a>\r<br />\n<br />\nOnly the Solid Majestic gem pops up within the list given, although I want to equip/mixmatch other gems into the socket. This happens with ALL my gear thats been setup. Perhaps this screenshot will clarify what I mean. Nothing is typed into the filter, and i haven't touched the 'sort' option.\r<br />\n<br />\nThanks again for the reply Jothay. Hopefully you can assist me! :)<br />\n",
    "PostedDate": "2015-03-19T22:20:35.113-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]