[
  {
    "Id": "199231",
    "ThreadId": "58818",
    "Html": "<p style=\"margin:0in 0in 0pt\"><span style=\"font-size:small;font-family:Calibri\">I&rsquo;ve been using Rawr for a while and understand almost every aspect of the program&hellip;except gemming templates.<span style=\"\">&nbsp; </span>The templates you have limit what &ldquo;version&rdquo; of an item appears on your list for each slot.<span style=\"\">&nbsp; </span>But there is no way I can possibly list every possible combination of gems that might apply to my character.<span style=\"\">&nbsp; </span>So maybe I&rsquo;m misunderstanding something and it&rsquo;s really much easier than I think.<span style=\"\">&nbsp; </span>I&rsquo;m an Elem shaman.<span style=\"\">&nbsp; </span>I would use up to any of 5 different gems in a Red slot, for example, based on current need.<span style=\"\">&nbsp; </span>SP, Hit, Haste, SP/Hit, and SP/Haste.<span style=\"\">&nbsp; </span>Same holds true for a Yellow slot.<span style=\"\">&nbsp; </span>Same for blue, with the caveat that there is either one particular blue, or one particular green gem&hellip;for a total of 7 possibles there.<span style=\"\">&nbsp; </span>All 7 are also available for a prismatic slot.<span style=\"\">&nbsp; </span>Even assuming I use only the Chaotic Skyflare Diamond in my meta slot&hellip;I still have, if my math is correct, 1225 possible combinations of gems.<span style=\"\">&nbsp; </span>And that assumes I wouldn&rsquo;t put a green in a yellow slot which might happen.</span></p>\r\n<p style=\"margin:0in 0in 0pt\"><span style=\"font-size:small;font-family:Calibri\">&nbsp;</span></p>\r\n<p style=\"margin:0in 0in 0pt\"><span style=\"font-size:small;font-family:Calibri\">I tried just 7 templates&hellip;i.e., one template that included one of the 7 possibles in each slot&hellip;but that didn&rsquo;t give me what I wanted since it wouldn&rsquo;t show a red in a red and a yellow in a yellow unless there was a template that included that exact pair.</span></p>\r\n<p style=\"margin:0in 0in 0pt\">&nbsp;</p>\r\n<p style=\"margin:0in 0in 0pt\"><span style=\"font-size:11pt;font-family:'Calibri','sans-serif'\">So what am I missing?<span style=\"\">&nbsp; </span>Nobody else has mentioned this so I&rsquo;m obviously missing something.&nbsp;&nbsp; Thanks.</span></p>",
    "PostedDate": "2009-06-08T13:29:30.113-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "199237",
    "ThreadId": "58818",
    "Html": "<p>The comparison charts and gemming templates are meant to give a quick comparison of the most common gemming paterns. To get a result that considers all possible combinations you'll have to use the optimizer.</p>",
    "PostedDate": "2009-06-08T13:51:09.333-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "199242",
    "ThreadId": "58818",
    "Html": "<p>Besides, I think you're thinking of alot more gemmings than there ever are, realistically. You mention '<span style=\"font-family:Calibri;color:#30332d\">SP, Hit, Haste, SP/Hit, and SP/Haste<span style=\"color:#000000;font-family:'Segoe UI'\">'. That's effectively 1 red stat (SP), 2 yellow stats (Hit/Haste), and one blue stat (sta; would you ever gem mp5/spr? I don't think so, but I'm not familiar with Elem mechanics).</span></span></p>\r\n<p>So the gemming templates are really quite simple. You make one for focusing on each of the stats that you may focus on, and either using or not using socket bonuses. I'd suggest gemmings of (for Red / Yellow / Blue / Prismatic / Meta):</p>\r\n<p>SP focused, no socket bonuses: SP / SP / SP / SP / Chaotic</p>\r\n<p>SP focused, with socket bonuses, hit secondary: SP / SP+Hit / SP+Sta / SP / Chaotic</p>\r\n<p>SP focused, with socket bonuses, haste secondary: SP / SP+Haste / SP+Sta / SP / Chaotic</p>\r\n<p>Hit focused, no socket bonuses: Hit / Hit / Hit / Hit / Chaotic</p>\r\n<p>Hit focused, with socket bonuses: SP+Hit / Hit / Hit+Sta / Hit / Chaotic</p>\r\n<p>Haste focused, no socket bonuses: Haste / Haste / Haste / Haste / Chaotic</p>\r\n<p>Haste focused, with socket bonuses: SP+Haste / Haste / Haste+Sta / Haste / Chaotic</p>\r\n<p>That's 7 templates; that's what I'd expect an Elem to use, and that should cover 99.9% of all ideal gemmings. You would almost never need something like SP+Haste in Red, Hit in Yellow, in the same gemming; and for those rare edge-cases, that's what the optimizer is for.</p>\r\n<p>&nbsp;</p>\r\n<p>EDIT: See&nbsp;<a href=\"http://rawr.codeplex.com/Wiki/View.aspx?title=Gemmings&referringTitle=Home\">http://rawr.codeplex.com/Wiki/View.aspx?title=Gemmings&amp;referringTitle=Home</a>, if you haven't already.</p>",
    "PostedDate": "2009-06-08T14:13:11.583-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "199657",
    "ThreadId": "58818",
    "Html": "<p>I think what they're saying, and it's important to note, is that there's two different ways gear is valued.&nbsp; Way #1 would be by looking at the different gear ratings in the right window when you're selecting a particular slot in the regular program.&nbsp;&nbsp;Way #2&nbsp;would be by selecting the gems in the gem section (highlighting the diamonds) and then using the optimizer.</p>\r\n<p>For what's displayed in the regular screen, you'll see a few different gemming combinations for each socketed item sorted by score.&nbsp; This is where the gemming templates are used, and only the top three scoring combinations are shown by default.&nbsp; Basically you're trying to get a feel for everything in a particular slot with the highest possible gemming combination, without reguard for things like whether or not you're going to fulfull your metagem requirements in those sockets.&nbsp; It's like a very&nbsp;raw and fairly uneducated upgrade list.</p>\r\n<p>Alternatively, (if you intend to find the absolute best combination of what's available) you go to the gem section,&nbsp;flag every gem you could possibly want to use of every color, and then let the optimizer start running permutations where it will try pretty much every possible gemming combination in the universe based on the gems you selected as available.&nbsp; This is NOT limited to the templates... and will automatically take into account&nbsp;all possibilities&nbsp;to get scores for the gear until it comes to the best possible overall score for the gearset it can.&nbsp; This is where the the program will try matched and unmatched sockets, repositioning of metagem requirements, and alternative gemmings to come up with the overall best&nbsp;picture of the toon with the gear and gems you can use.</p>\r\n<p>That right devs?</p>",
    "PostedDate": "2009-06-09T12:25:33.883-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "199682",
    "ThreadId": "58818",
    "Html": "<p>That's right, except that you underestimate the comparison charts a bit. They really do take everything into account (such as including metagem requirements). They just only consider gemmings defined in gemming templates (which really should include the ideal gemming, 99% of the time), and they only are comparing single item swaps. You 100% can make gear selection decisions based on the comparison charts; if they say something is an upgrade, then it's an upgrade.</p>\r\n<p>Upgrade Lists, on the other hand, take time to generate (unlike the near-instant comparison charts), but do consider every possible combination of available gems, and most importantly, they consider swapping multiple items at a time, and optionally regemming other items, in order to provide you with a true 'upgrade value' of having that item available to you. They're especially useful for prioritizing upgrades, and finding upgrades that are only really upgrades when you swap other items/gems around. While they do take time to generate, there's also another option; you can right click on an item and choose Evaluate Upgrade, to effectively build an upgrade list of just that item. That's near-instant, so is especially useful for quickly determining the value of an item, when it drops, mid-raid. Commonly while raiding, when an item drops, I'll alt tab to Rawr, find that item, Evaluate Upgrade, and bid or not bid on it, based on how much of an upgrade it is (or isn't) to me, which only takes a couple seconds. I also frequently build my upgrade list ahead of time, so I'm prepared, but Evaluate Upgrade helps out when I don't have a chance to prepare ahead of time.</p>",
    "PostedDate": "2009-06-09T13:17:48.37-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "200077",
    "ThreadId": "58818",
    "Html": "<p>One of my issues that was creating difficulty was that depending on the piece of gear, the gem setup could completely change.&nbsp; In all cases, priority was given to staying Hit-capped, but then Rawr 2.2.3 through 2.2.5 wanted me to stack haste, but only to a certain point, i.e., until the casting time with buffs fit a preferred rotation (or I assume that's what it was doing), then spellpower, with the added little twist that I wanted to make sure I met the gem requirements for the Chaotic Skyflare, which asks for two blues...not something typically found on Elemental gear.&nbsp; That meant any socket at all...even ignoring the socket bonuses, could be a SP, Hit, 1/2 Hit, Haste, or 1/2 Haste.&nbsp; I knew that I could use the list of shown upgrades pretty confidently...but I wasn't sure if I was going to have to completely switch my gems around on every other piece&nbsp;to make it work every time I spent DKP on an upgrade piece.</p>\r\n<p>With the release of 2.2.6, it's seemingly become much more straightforward.&nbsp; It no longer has me stacking haste at all...just Hit to the cap, then SP while tossing in a couple of blue/green gems to meet the Meta requirement.&nbsp; Of course that begs the obvious, and different question, what the heck happened in 2.2.6??&nbsp; I went from HASTE, HASTE, HASTE, gotta have HASTE...to &quot;Omigod don't put haste on <span style=\"text-decoration:underline\">anything</span> or your DPS goes down.&quot;&nbsp; The &quot;new&quot; method actually more closely matches what I was observing, i.e., Rawr said I should be doing 3.7k in a 10-man with just my own buffs, but I was doing 2.9k (which is what 2.2.6 now says I should be doing wth that setup...but also shows 3.9k achievable in a completely <em>different </em>way).&nbsp; Of course I'm still scratching my head wondering if I should now switch out all the gems I just put in to stack haste...that suddenly make my DPS apparently suck...or is there an issue in 2.2.6?&nbsp; My haste, following the new setup, drops by over 400, yet it has me doing the same rotation.&nbsp; As near as I can tell, it also <em><span style=\"text-decoration:underline\">still</span></em> doesn't account for Glyph of Totem of Wrath.&nbsp; I've experimented with and without Glyph of Lava checked, since it should approximate Glyph of ToW in overall DPS...but aaargh.</p>\r\n<p>Ignorance was bliss...but there's no going back now.&nbsp; lol</p>",
    "PostedDate": "2009-06-10T10:08:38.107-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "200104",
    "ThreadId": "58818",
    "Html": "<p>If I'm not mistaken, the shaman modules of rawr's code have been undergoing a lot of improvements recently. &nbsp;The reason why 2.2.3 to 2.2.5 was not telling you to get hit, and was only telling you to get haste, may have been because the module had improper coding of the haste or hit calculations.</p>\r\n<p>Rawr isnt always perfect (just 99.999% of the time) so if you think you see something seriously off in the item values its definitely a good idea to check outside sources for a second opinion. The class forums at www.worldofwarcraft.com or at www.elitistjerks.com would be good places to start.</p>\r\n<p>Also, if you see rawr isnt accounting properly for a particular glyph, talent, stat, spell, etc let us know about it. Usually one of the best ways is to post on the Issue Tracker for particular missing features like that (just be sure to check that the problem isnt already listed)</p>",
    "PostedDate": "2009-06-10T11:34:30.387-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "200131",
    "ThreadId": "58818",
    "Html": "<p>Having never raided with a guild that engineered their raid makeup and spell lists&nbsp;to maximize DPS, I was looking for reasons why my DPS wasn't topping 4k-5k like similarly geared people.&nbsp; So when RAWR said stack haste, I stacked haste, even though EJ and the WoW forums seemed to indicate otherwise.&nbsp; I now realize that I <em>can </em>reach 4k with current gear IF the right debuffs are out there.&nbsp; Live and learn.</p>\r\n<p>As for the other sites, EJ is hard to really get a feel for what applies to me since they're usually into talking about which trinket is best for hard mode boss X when we're still on the first 3 bosses of Ulduar and are just barely into what I would call farm status on Heroic Naxx (when enough people show up consistently during the week).&nbsp; And those spreadsheets have been out for so long that nobody thinks to post instructions for them anymore. LOL&nbsp; The consensus though, and on the class forums as well if you can weed through all the bellyaching,&nbsp;is that there isn't an ideal haste number and that Elem shamans shouldn't really ever gem for it. &lt;sigh&gt;</p>\r\n<p>As for the Glyph of ToW not calculating...I've mentioned it a couple times on threads here, someone else mentioned on one of the same threads, and somebody else mentioned it in a separate thread.&nbsp; It doesn't have its own thread though...would that help?</p>",
    "PostedDate": "2009-06-10T12:51:34.71-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]