[
  {
    "Id": "199249",
    "ThreadId": "58824",
    "Html": "<p>The Ice Spire Sceptor seems to me to be a legitimate Healadin weapon considering that it's a 1H mace with 461 SP and 38 Haste, but I can't get Rawr to list it or allow it as a gear option.</p>\r\n<p>MaxDps.com lists it as better than the Grieving Spellblade, which is what I'm using now, but I can't tell how Rawr rates it. How do I get it into the list?</p>",
    "PostedDate": "2009-06-08T14:22:22.573-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "199256",
    "ThreadId": "58824",
    "Html": "<p>It seems the Healadin module is strongly opposed to using items that have spirit on them.</p>\r\n<p>Quick workaround: Go Tools-&gt;Edit Items, Search for it using the filter and edit it to set the spirit to 0. Now it should show up in the list.</p>",
    "PostedDate": "2009-06-08T14:43:34.327-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "199260",
    "ThreadId": "58824",
    "Html": "<p>Seems silly that it's left off the list just because it has Spirit on it, but that did indeed work. Thanks.</p>",
    "PostedDate": "2009-06-08T14:49:26.95-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "226894",
    "ThreadId": "58824",
    "Html": "<p>The same logic appears to apply if a weapon has +hit. The Blade of the Keening Banshee has 0 spirit, but was still not being listed as a Healadin main-hand weapon. Editing the item to remove its +29 hit caused it to appear.</p>\r\n<p>Is an update to the Healadin module in the works? It seems odd to discount weapons with irrelevant stats--their other stats may make the weapon a viable choice, especially as Blizzard seems to be heading towards making items more general in terms of their applicability.</p>",
    "PostedDate": "2009-08-23T18:35:03.43-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "228132",
    "ThreadId": "58824",
    "Html": "<p>In the current (as yet unreleased) code base, <a href=\"http://www.codeplex.com/site/users/view/Ermad\">Ermad</a> has added two check boxes to the Healadin &quot;Options&quot; tab: &quot;Ignore Spirit Items&quot; and &quot;Ignore Hit Items&quot;. Having downloaded, built and tested it, I can say that it addresses the issues raised here perfectly (i.e., items with hit and/or spirit will now be listed if the check boxes are unchecked). Thank you!</p>",
    "PostedDate": "2009-08-26T13:44:25.083-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]