[
  {
    "Id": "199344",
    "ThreadId": "58851",
    "Html": "<p>Hello, I'm playing WoW in Korean Server. I've recently met this Rawr stuff and I think it's really cool. I thank to guys who update this thing.</p>\r\n<p>But I'm having a trouble understanding the options and values given. I'm playing a protection paladin and I mainly look into tank items. I noticed there's three values calculated(survival, mitigation, threat), but that's all I know.</p>\r\n<p>I know threat means more threat or more damage, but survival and mitigation seems quiet vague to me. And since I can't understand these values, I also can't understand ranking system. I found that each value's given points vary when I change ranking system, but I can't figure out what that means.</p>\r\n<p>First I thought mitigation means an actual decrease in damage taken and survival means an increase in expected time before death. The reason I thought like this is the fact that health is only converted into survival and dodge/parry is only converted into mitigation. But I found that health is also converted into mitigation in Tankpoints mode and dodge/parry is also converted into survival in Burst Time mode. This made me completely confused.</p>\r\n<p>I don't know this kind of question is appropriate in this forum, but I really need help. Please explain to me what survival, mitigation and each ranking system means. For example, in ProtWarr mode, which side of tanking is more valued and which side is less valued? If I increase the mitigation scale, do I give more value in avoidance or in armor?</p>\r\n<p>Sorry for my flawed English. I'll be waiting for your kind tutoring.</p>",
    "PostedDate": "2009-06-08T22:04:39.17-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "199365",
    "ThreadId": "58851",
    "Html": "<p>Please don't use the TankPoints mode, that's legacy stuff that's just for comparison with old numbers. Survival/Mitigation is indeed what you want to use, and your expectations about what they mean are correct. I believe that if you mouse over their labels, it'll give you a description of what they mean (I know for sure that works in Bear, you can just look there if that isn't hooked up in Tankadin). Short version: More Mitigation = Less Damage taken, on average. Survival = Raw damage that you can take before dying, guaranteed (ie, no chance involved).</p>",
    "PostedDate": "2009-06-08T23:39:51.563-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "199369",
    "ThreadId": "58851",
    "Html": "<p>Thanks for your kind answer! Can I ask&nbsp;a few&nbsp;more questions?</p>\r\n<p>1. In Mitigation Scale mode,&nbsp;dodge/parry is only converted into mitigation, but in Burst Time mode it is&nbsp;converted into survival. I understand that avoidance affects the length of time before dying, but then why avoidance doesn't have survival value in Mitigation Scale mode? Is meaning of 'survival' differs when changing the mode?</p>\r\n<p>2. In Damage Taken mode, mitigation is presented by minus numbers. Is this means that more mitigation means less overall point?</p>\r\n<p>3. Where can I find the codes of this Tankadin programe?</p>\r\n<p>Additional answers will be fully appreciated. Thanks.</p>",
    "PostedDate": "2009-06-09T00:09:18.09-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "199382",
    "ThreadId": "58851",
    "Html": "<p>Mitigation Scale mode is the only one that is actually accurate, and should be used for item selection; the others are just for comparison with other systems.</p>\r\n<p>Survival is not a measure of average time before dying, it's a measure of raw damage you can take before dying, so avoidance does not impact it. Basically, if you die while tanking, it should be obvious whether you need more Mitigation (healers OOM, or unable to keep up with the damage), or Survival (you got bursted down).</p>\r\n<p>The source code for Rawr is available on the Source Code tab of our site here.</p>\r\n<p>&nbsp;</p>\r\n<p>EDIT: By the way, your english is pretty good, actually; you can communicate much better than many of the native-english people we deal with here. :)</p>",
    "PostedDate": "2009-06-09T00:31:40.33-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "199393",
    "ThreadId": "58851",
    "Html": "<p>I really appreciate you. Thanks! :)</p>",
    "PostedDate": "2009-06-09T00:52:05.41-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]