[
  {
    "Id": "200604",
    "ThreadId": "59253",
    "Html": "<p>I was looking over some stuff for a buddy of mine who runs disc and I noticed on the glyphs page that the glyph of penance is given a score of 0.00.&nbsp; I've double checked that the talent is trained, Glyph of Penance is selected&nbsp;and that the Simulation Role is Auto Disc Tank w/Fheal (which uses penance).&nbsp; I think this might be due to the fact that the role doesn't look at glyphs when laying out the sequence for the Role, and therefore, assumes the standard penance cooldown based solely on talents.&nbsp; Perhaps it would be possible to add another role that uses a reduced penance cooldown?</p>\r\n<p>Seeing this, I decided to take a look at the glyph HPS for my holy spec and noticed that the Glyph of PoH is also scoring 0.00.&nbsp; Once again, I've verified that Glyph of PoH is selected, and the role is Auto Holy Raid (which includes casts of PoH).&nbsp; I haven't been able to figure out why this glyph wouldn't have an HPS score since all is does is provide additional HoTs to those people healed by PoH.</p>\r\n<p>I'm probably just missing something somewhere, but in case I'm not, I just wanted to bring it to you attention.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-06-11T15:38:56.087-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "200617",
    "ThreadId": "59253",
    "Html": "<p>Penance doesn't really change anything in the model mostly because I haven't found a reliable way to measure it. ProH glyph is not doing anything right now, on todo list.</p>",
    "PostedDate": "2009-06-11T16:12:43.717-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "200622",
    "ThreadId": "59253",
    "Html": "<p>One more thing I just noticed.</p>\r\n<p>The enchant Greater Spellpower (staff) is still valued at 0 even with a staff equipped.&nbsp; This should be in the issues forums, I know, but I figured I'd just tie into my original post.</p>",
    "PostedDate": "2009-06-11T16:17:43.91-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "200629",
    "ThreadId": "59253",
    "Html": "<p>That was weirder however, will check it out.</p>",
    "PostedDate": "2009-06-11T16:39:26.737-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "200683",
    "ThreadId": "59253",
    "Html": "<p>Sorry to keep bringing things up, but now I'm running numbers for the shadow priest in my raid.&nbsp; On enchants for wrists, Superior Spellpower (30 SP) is 0.00 while Greater Spellpower (23 SP) is 48.71.&nbsp; Hitting the SP cap?&nbsp; hehe</p>\r\n<p>Additionally, on gloves, Major Spellpower (20 SP) is 42.35, but Exceptional Spellpower (28 SP)&nbsp;is 0.00.</p>\r\n<p>Next, on legs, Brilliant Spellthread (50 SP, 20 spi) is 115.40, but Sanctified Spellthread (also 50 SP, 20 spi) is 0.00.</p>\r\n<p>Then, on feet, Surefooted (10 crit, 10 hit) is 32.22, but Icewalker (12 crit, 12 hit) is 0.00.</p>\r\n<p>Same on fingers where Spellpower (12 SP) scores 25.41 compared to Greater Spellpower's (19 SP) score of 0.00.</p>\r\n<p>Am I missing something here?&nbsp; hehe</p>\r\n<p>&nbsp;</p>\r\n<p>EDIT: It looks like every enchant he has on is being scored at 0.00.</p>",
    "PostedDate": "2009-06-11T21:52:59.597-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]