[
  {
    "Id": "202479",
    "ThreadId": "59805",
    "Html": "<p>Hi,</p>\r\n<p>thanks for your great work. I have two feature-requests.</p>\r\n<p>1) Is it possible to have an option for disabling on-use-effects (and proc-effects too). As a tank, they are more the &quot;o-shit&quot;-buttons. But if a boss doesn't have any predictable damage-spikes, on-use-effects are less valuable.</p>\r\n<p>2) As a feral-tank, I have to optimize my best gear for tanking-stats. But often, I want to use the same item for tankingand dpsing. Than I realy want an option to say, take the item as it is and do not change any gemming oder enchanting, when I optimize for cat. Perhaps the tanking-gem is agi and i do not want to regem this item for arp.</p>\r\n<p>It would be nice to see these features in Rawr. Thanks in advance.</p>",
    "PostedDate": "2009-06-17T06:25:25.14-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "202505",
    "ThreadId": "59805",
    "Html": "<p>For Optimization, you can set the item to not allow the gems to change on the item in the optimizer, see <a title=\"this page\" href=\"http://www.codeplex.com/Rawr/Wiki/View.aspx?title=GearOptimization\">this page</a></p>",
    "PostedDate": "2009-06-17T08:09:05.36-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "203832",
    "ThreadId": "59805",
    "Html": "<p>A manual work-around to disable the proc/on-use effect is to edit the item and delete the special effect. If you reload from Armory or Wow-head the special effect should be added again, in case you want to see an averaged value for it again.</p>\r\n<p>One problem with a global setting that I can think of is that some users might be willing to leave certain effects on, while other users might want to disable all of them. You might want to save on-use procs, but a RNG proc based thing, you don't really have control over, so leaving it on might be useful to get an average feel for it. Unless you want to optimise for worse case and assume it hasn't procced.</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-06-21T08:05:45.597-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "204079",
    "ThreadId": "59805",
    "Html": "<p>@<a id=\"ctl00_ctl00_MasterContent_Content_PostRepeater_ctl02_UserNameLink\" href=\"http://www.codeplex.com/site/users/view/Jothay\">Jothay</a>: Thanks, thats not exactly what I want, but very close to it. And it's helpful.</p>\r\n<p>@<a id=\"ctl00_ctl00_MasterContent_Content_PostRepeater_ctl04_UserNameLink\" href=\"http://www.codeplex.com/site/users/view/Wildebees\">Wildebees</a>: I know that work around, but a global setting would be much easier :-) And it could be implemented step by step. First a global &quot;doNotUseProc&quot;-Options and later refine that option. And as a tank, I have to optimize for the worse case. If my gear provide me a very good protection 90% of time an failed the last 10% due lack of proc-luck, the gear is useless. The option is not an urgent need, but perhaps something to consider about for future releases ...</p>",
    "PostedDate": "2009-06-22T07:53:02.247-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]