[
  {
    "Id": "202897",
    "ThreadId": "59937",
    "Html": "<p>Hi, firstly - great job!&nbsp; I use RAWR for all my toons and find it extremely valuable.&nbsp; Thank you.</p>\r\n<p>Secondly, I have searched the discussions looking for an answer to my question, and can't find one; also checked the vid on Youtube, and the RAWR help pages.&nbsp; Apologies if I simply missed it.</p>\r\n<p>OK, here's the deal:</p>\r\n<p>I load my toon (Bear) from armory and the default survival soft cap drop down setting is HC t7.&nbsp; On the stats page my survival points are 145.6k.&nbsp; If I make the SINGLE change of making the soft cap for survival into normal t8 (which is what I'm mostly doing now), my survival points on the stats page are now 151.7k.</p>\r\n<p>So, my question is: how can the identical in every way gear set have a different survival rating dependant on what soft cap I wish to aim for?</p>\r\n<p>It's especially important to me, since the greyed out &quot;target&quot; soft cap rating under the drop down button is 140k for t7 hc and 150k for t8 normal.&nbsp; So at the moment, the way I'm reading the model it's telling me:&nbsp; &quot;ok, if you want to go to hc t7 you're fine for that, but you're slightly under the soft cap for t8 normal, but if you tell me that you now want to go to Uld 10; wait, I'll recalculate...ummm..yep, you're now ok for that too, and you don't need to change a thing.&nbsp; I know that I just told you that you weren't ok just a second ago, but you can really believe me now&quot;</p>\r\n<p>I'm obviously missing something about how that survival soft cap setting works, but I have no clue what!</p>\r\n<p>Any guidance on this issue would be really helpful, since it's stopping me use the optimiser for a particular raid level since I don't know if I can trust the output regarding survival soft cap.</p>",
    "PostedDate": "2009-06-18T05:56:38.113-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "202964",
    "ThreadId": "59937",
    "Html": "<p>The &quot;soft cap&quot; works much like WoW's &quot;diminishing returns&quot; on avoidance.&nbsp; What you are adjusting is the level at which Survival starts to diminish.&nbsp; So if the Soft Cap is set low, Survival is rated lower in order to make Mitigation have a larger effect on your overall score.&nbsp; If the Soft Cap is set high, Survival is not diminished as much (or at all).&nbsp; If you mouse-over the Survival number in the summary, it will tell you your Survival rating before capping.&nbsp; That number shouldn't change as the cap target is adjusted.</p>",
    "PostedDate": "2009-06-18T08:05:26.743-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "203133",
    "ThreadId": "59937",
    "Html": "<p>(One thing to note, first of all: the default built-in survival soft caps and raw attack damages are too low; you'll want to customize them)</p>\r\n<p>&nbsp;</p>\r\n<p>The soft caps works by gradually lowering your effective Survival Rating, as you get past the soft cap. The idea is that survival's value diminishes as you go beyond however much you need to typically survive. ie, &nbsp;if you have 20k health, and are tanking Naxx10, 1k more health is worth alot. If you've got 50k health, then 1k more is nearly useless, since you almost never take enough damage (without being healed) for it to matter.</p>",
    "PostedDate": "2009-06-18T15:32:44.797-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "203142",
    "ThreadId": "59937",
    "Html": "<p>Guys, thanks for replying!&nbsp;</p>\r\n<p>Hankz - yes, you're right - if I mouse over the Survival number in the summary, it doesn't chnage whether I set the soft cap &quot;target&quot; on the options tab to HC T7 or normal T8.</p>\r\n<p>In which case, what is the &quot;non-moused over&quot; number telling me.&nbsp; This number *does* change - in my case by 4%.</p>\r\n<p>Astrylian - I note that they are currently &quot;too low&quot;.&nbsp; Are you planning to change them to a higher (more accurate) number in a future release?&nbsp; Do you have a view as to what number isn't too low that I could play with now?</p>\r\n<p>From my perspective, I've tanked all of Uld 10 except the final two bosses using the gear that I've put into RAWR (i.e. ~150k survival points).&nbsp; I did use my all-out sta set on Mimiron and my frost resist set on Hodir, but otherwise I've been just fine.&nbsp; That's just fyi in helping set a &quot;good&quot; survival soft cap...</p>",
    "PostedDate": "2009-06-18T15:57:15.707-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "203170",
    "ThreadId": "59937",
    "Html": "<p>Right, your effective survival rating should (and will) change, if it's over the soft cap. Normally, effective survial rating is the same as raw survival rating, but once past the cap, it starts converting raw to effective at a lower and lower ratio, since more survival gets less and less useful once you overgear the content.</p>",
    "PostedDate": "2009-06-18T18:01:24.223-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "203215",
    "ThreadId": "59937",
    "Html": "<p>what should the rating values be for heroic ulduar?</p>",
    "PostedDate": "2009-06-18T22:08:25.42-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "203347",
    "ThreadId": "59937",
    "Html": "<p>I'd say about 200k.</p>",
    "PostedDate": "2009-06-19T07:18:08.817-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "203424",
    "ThreadId": "59937",
    "Html": "<p>what about for raw damage per hit. Also, why would you put the wrong values into RAWR?</p>",
    "PostedDate": "2009-06-19T10:01:29.843-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "203450",
    "ThreadId": "59937",
    "Html": "<p>200k for both. I didn't put the 'wrong' values into Rawr, they were added when Ulduar was in beta, as best guesses based on limited data; they just haven't been updated since then.</p>",
    "PostedDate": "2009-06-19T11:12:02.34-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "203588",
    "ThreadId": "59937",
    "Html": "<p>is that for regular heroic or heroic hard modes?</p>\r\n<p>What is the armor value that bosses have now? is it still 13083?</p>",
    "PostedDate": "2009-06-19T20:19:52.533-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "203608",
    "ThreadId": "59937",
    "Html": "<p>Somewhere in the middle. Really, this is what Custom is for. Choose what you want. Yes, all bosses have 13083 armor.</p>",
    "PostedDate": "2009-06-19T23:50:49.3-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "203696",
    "ThreadId": "59937",
    "Html": "<p>Bosses have had 10,643 armor for quite a while now, haven't they?</p>\r\n<p>Also, 200k unmitigated seems rather high to me, that would translate to a 50k auto swing on a pretty decently geared bear.&nbsp; I haven't tanked Ulduar much, but my understanding was that most bosses hit for more on the order of 20-25k, which translates to 80-100k unmitigated.</p>",
    "PostedDate": "2009-06-20T10:52:51.59-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "203716",
    "ThreadId": "59937",
    "Html": "<p>Err, whoops. Here's the config I use:</p>\r\n<p>Survival Soft Cap: 200k</p>\r\n<p>Target Damage (Raw): 80k</p>\r\n<p>Target Attack Speed (Sec): 2.40</p>",
    "PostedDate": "2009-06-20T13:41:13.727-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "227148",
    "ThreadId": "59937",
    "Html": "<p>On a similar note, I'm having a little trouble wrapping my brain around the best way to reach a survival soft cap of any amount.</p>\r\n<p>At the outset i would say the only way to reach a survival soft cap is through stamina or armor(stamina/health/agility/armor/bonus armor). Since those are the only things in &quot;relative stat values&quot; that contribute towards survival. But what i've run into is a vicious cycle of sacrificing mitigation stats like dodge for survival stats like stamina, and having rawr tell me that stamina has now become even more important...hinting that i've essentially gotten further away from the survival soft cap. Even though in Rawr's stated world dodge doens't affect survival, the inner workings seem to suggest otherwise.</p>\r\n<p>Now, yes i've basically equated stamina being the top stat in &quot;relative stat values&quot; to mean that I must be below the survival soft cap. This could be an incredibly wrong way to view it, but it seems to work in my head. Stamina according to rawr does nothing but increase survivability, and it is the &quot;ultimate&quot; stat for doing so. Or at least that's what Rawr clings to, to a fault it seems.</p>\r\n<p>Just as a quick example, it often seems that Rawr would value a stamina trinket very highly under the cap, and yet throwing on a mitigation trinket with dodge seems to lower the value of stamina in comparison to other stats more than the stamina trinket would.&nbsp; What am I(or rawr) missing?</p>\r\n<p><span style=\"text-decoration:underline\">Questions Summary</span>(<em>for those who get lost in my ramblings)</em></p>\r\n<p>What is the best way to reach a survival soft cap? <em>(rawr says stam/armor, i say a balance of stats)</em></p>\r\n<p>Does mitigation affect how much stamina you need to reach a survival soft cap<em>?(rawr is confusing, i say yes)</em></p>\r\n<p>Is there ever a point at which reaching the survival soft cap is less important than mitigating damage(while under the cap)?</p>",
    "PostedDate": "2009-08-24T10:39:26.1-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "227193",
    "ThreadId": "59937",
    "Html": "<p>You're misunderstanding what the survival soft cap is.&nbsp; Your survival rating is how much raw damage (before armor, talents, buffs, etc) you can take without any heals.&nbsp; The survival soft cap is how much damage you need to be able to soak in a worst case scenario (a string of unavoided hits) before your healers are able to top you off.&nbsp; Avoidance decreases the chance of that worst case situation happening, but it in no way affects the amount of damage you need to be able to eat when the RNG screws you over.</p>\r\n<p>Stam and armor are the <strong>only</strong> way to reach the survival soft cap, not just the best.</p>\r\n<p>Mitigation in the form of armor reduces the amount of health you need because it's guaranteed to be active, but avoidance has absolutely no relation to survival.</p>\r\n<p>Mitigation vs. survival below the cap depends, and that's a lot of what Rawr is meant to help with.&nbsp; 500 dodge rating is clearly better than 1 stam.&nbsp; I'd trust Rawr's rankings unless there are special circumstances (weird fight mechanics, bad healers, that kind of thing).</p>",
    "PostedDate": "2009-08-24T12:30:07.16-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "227207",
    "ThreadId": "59937",
    "Html": "<p>Survival rating comes from guaranteed damage reduction, and health. That's almost entirely stam and armor (almost, because there are slight other sources, such as 1 agi giving 2 armor, but that's really&nbsp;negligible).</p>\r\n<p>The Survival Soft Cap means that survival rating starts getting diminishing returns applied to it past this point. So yes, changing it will change your total survivability, if you're over the cap you set. You can mouse over your survival rating on the stats tab to see the pre-soft-cap rating. The idea here is that past a certain amount of health, more stamina becomes less and less valuable. (ie, If I'm tanking Patchwerk 10man, it really doesn't matter much if I've got 50k hp or 100k hp)</p>\r\n<p>Yes, as you trade agi for stam, the value of agi drops (because avoidance scales in value with avoidance). And yes, you'll very likely have stamina be worth more than agi; that's totally typical. Especially with the 3.2 change to Agi-&gt;Dodge conversion, it's extremely rare to find a situation where gemming Agi&gt;Stam, for any remotely difficult content.</p>",
    "PostedDate": "2009-08-24T13:09:42.42-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]