[
  {
    "Id": "203169",
    "ThreadId": "60022",
    "Html": "<p>Just an idea, every time i download a release version i have to remember to make sure my talents.xml file doesnt get overwritten (wherther by making a backup copy or excluding it from the extraction). This can get old, as i want the latest version, but I dont want to have to re-enter my alternate trees. Does Rawr auto-generate the file if it doesnt exist? If so, would it be possible to leave this file out of the release zips and have it generated if needed, or if not, what about creating a &quot;defaults&quot; and a &quot;custom&quot; file. This would allow for a fuller pre-built talents file, with a couple of trees from perhaps wowwiki or something, but still not overwrite your own.</p>\r\n<p>Also, what happened to the talent import (paste the URL) from Armory? Is that coming back, or maybe one from wowhead?</p>",
    "PostedDate": "2009-06-18T17:55:03.923-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "203172",
    "ThreadId": "60022",
    "Html": "<p>It is needed; it won't get auto-generated if it's not found. We could split it into DefaultTalents.xml/CustomTalents.xml, I'll give that some thought.</p>\r\n<p>I don't think we ever had a feature to load talent spec from armory/wowhead URL, but that's a good idea.</p>",
    "PostedDate": "2009-06-18T18:04:53.697-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "203227",
    "ThreadId": "60022",
    "Html": "<p>Part of the reason a new Talents.xml file is included is because sometimes when a version release changes there are also talent updates (new or changed talents) so the string that is saved for it doesn't really line up correctly.</p>",
    "PostedDate": "2009-06-18T23:09:54.147-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "203230",
    "ThreadId": "60022",
    "Html": "<p>This would be useful as I have 4 different specs for my druid set up and every time there is a new version, I have to re-enter them all both at home and at work.</p>\r\n<p>&nbsp;</p>\r\n<p>At the end of the day, I can cope with it, but it would be a nice feature.&nbsp; Perhaps only reset them where there are changes to the talent trees.</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-06-18T23:41:57.09-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]