[
  {
    "Id": "203643",
    "ThreadId": "60149",
    "Html": "<p>Is there anyway to just get an additional requirement put in for resilience when running the optimizer. That's all I need. k thanks</p>",
    "PostedDate": "2009-06-20T04:05:37.12-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "204248",
    "ThreadId": "60149",
    "Html": "<p>What model are you looking to include Resilience?&nbsp; I know for the purposes of Tanking, resilience is sub-optimal compared to Defense, so it's rare to want to stack Resilience over Defense.&nbsp; If you're looking for PVP gear comparisions, I'm not sure if that quite fits the purpose of Rawr which I believe focuses mostly on PVE content gear evaluation.&nbsp; I may be wrong, but I know certainly I've only been looking at PVE content in TankDK.</p>",
    "PostedDate": "2009-06-22T15:18:09.827-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "204319",
    "ThreadId": "60149",
    "Html": "<p>Resilience actually isn't &quot;sub-optimal&quot; compared to defense if you're just looking to be crit-immune (ie, in a resistance set - if it would take a +16def and a +8def/+12sta gem to get crit-immune in your Frost Resist gear, you can probably get there with just a single +16resil). &nbsp;Although I agree that having a &quot;minimum&quot; resilience seems a little weird.</p>\r\n<p>Adding resilience to the optimizer (as a developer) should be trivial and have no negative impace besides potentially bloating the optimizable stats list.</p>\r\n<p>I do think that the optimizer is great as a stand-alone feature of Rawr, and can definitely see its merits for doing PvP gear (&quot;I want at least 800resil, and want to maximize my crit, using the following gear/gem/enchant&quot;). &nbsp;Outside of the scope of Rawr? &nbsp;Maybe, but if it's useful, trivial and without negative impact, I think we should consider it.</p>",
    "PostedDate": "2009-06-22T21:08:21.663-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "204600",
    "ThreadId": "60149",
    "Html": "<p>I forget the exact wording, but in 3.2 isn't Resilience also going to be a damage reduction?&nbsp;</p>\r\n<p>Is this going to make pvp gear top choices for bears again? :S</p>",
    "PostedDate": "2009-06-23T10:45:31.49-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "204615",
    "ThreadId": "60149",
    "Html": "<p>If you had remembered the exact wording, you'd see that it only applied to attacks from players.</p>",
    "PostedDate": "2009-06-23T11:34:22.31-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "204624",
    "ThreadId": "60149",
    "Html": "<p>To my knowledge, though, the crit reduction effect of resilience still works in PvE (and you get more crit reduction from a point of resil than you do from a point of def). &nbsp;Defense will give an equal amount of dodge/parry/block/miss chance, though, whereas resilience will decrease DoT effect damage.</p>",
    "PostedDate": "2009-06-23T12:24:56.85-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "204633",
    "ThreadId": "60149",
    "Html": "<p>Phew, that's good to know.&nbsp; I was trying to think how that would work so tanks wouldn't get more from Res than from other reduction sources.</p>\r\n<p>The crit reduction does work in PVE, it just rarely has a purpose since 3.0.&nbsp; Other tanks get all those other avoidance stats from Def and&nbsp;ferals don't need crit reduction post talents.</p>",
    "PostedDate": "2009-06-23T12:46:37.14-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]