[
  {
    "Id": "204096",
    "ThreadId": "60280",
    "Html": "<p>On some of the modules, DPSWarrior, ProtWarrior, Rogue, etc., it only shows a comparison list on the right for the armor itself.&nbsp; I know the modules I mentioned aren't complete and still need some more work.&nbsp; The other items, neck, rings, trinkets, MH &amp; OH, only show what is equipped.&nbsp; Is there a way to equip a different item in Rawr to see the difference if there is nothing else showing in the list?&nbsp; I use rawr a lot for guildies to find upgrades for the fresh 80s and its kind of hard to do that if I can't compare different items for all the slots.</p>",
    "PostedDate": "2009-06-22T09:07:43.86-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "204163",
    "ThreadId": "60280",
    "Html": "<p>It sounds like your ItemCache is not populated, try running a 'Load possible Upgrades from Armory' and then from Wowhead to see if that populates it for you.</p>",
    "PostedDate": "2009-06-22T11:24:14.093-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "204176",
    "ThreadId": "60280",
    "Html": "<p>I tried what you suggested and it didn't change anything.&nbsp; I am using Rawr 2.2.7 DPSWarrior module.&nbsp; If you want to see the character i am using, the name is Justme and the realm is Draka, on the US servers.&nbsp; The Neck, Back, Rings &amp; Trinkets i only see what is equipped. I also have just the Dungeons &amp; Crafted filters enabled since he isn't ready for heroics.</p>",
    "PostedDate": "2009-06-22T11:56:48.983-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "204182",
    "ThreadId": "60280",
    "Html": "<p>If you have it that limited in filters, try enabling more of them. I'll try your character out myself later today</p>",
    "PostedDate": "2009-06-22T12:07:28.86-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "204196",
    "ThreadId": "60280",
    "Html": "<p>I just tried enabling them all to see what happens and it doesn't show anymore than what is equipped.&nbsp; Is there a way to wipe out the ItemChache and start over?</p>",
    "PostedDate": "2009-06-22T12:31:51.077-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "204213",
    "ThreadId": "60280",
    "Html": "<p>Redownload Rawr</p>",
    "PostedDate": "2009-06-22T13:19:57.473-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "204253",
    "ThreadId": "60280",
    "Html": "<p>To be clear. DELETE the old Rawr folder and install fresh. Its a common mistake for people to install things over the top of old stuff. This rarely produces a good result.</p>",
    "PostedDate": "2009-06-22T15:35:50.937-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "204292",
    "ThreadId": "60280",
    "Html": "<p>What i meant by &quot;wipe out the ItemCache and start over&quot; is have no items in there and just load a character from the armory, download upgrades to populate it that way.</p>",
    "PostedDate": "2009-06-22T18:49:54.94-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "204312",
    "ThreadId": "60280",
    "Html": "<p><em>What i meant by &quot;wipe out the ItemCache and start over&quot; is have no items in there and just load a character from the armory, download upgrades to populate it that way.</em></p>\r\n<p>Do <strong>not</strong>&nbsp;do this. Just re-download Rawr, and start from scratch. Starting with an empty ItemCache is a bad idea.</p>",
    "PostedDate": "2009-06-22T20:21:52.517-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "204350",
    "ThreadId": "60280",
    "Html": "<p>Ok, i re-downloaded Rawr, but am still having the same problems with those modules.&nbsp; It is fine for Protpaladin &amp; Healadin, and both priest modules as well.&nbsp; since the hunter &amp; warlock modues aren't done, neither is rogue, i haven't used those ones yet.&nbsp; i mentioned rogue before because i was checking to see if it did the same thing on a module that is at least partially ready.</p>",
    "PostedDate": "2009-06-22T23:25:29.037-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "204355",
    "ThreadId": "60280",
    "Html": "<p>Can you clarify what your problem is then? If you see only a few/equipped items in the charts, that means either A) your ItemCache is busted; though you say you already re-downloaded, so probably... B) You have a ton of things filtered out. Recheck everything in the top right.</p>",
    "PostedDate": "2009-06-22T23:39:13.193-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "204381",
    "ThreadId": "60280",
    "Html": "<p>I am trying to find upgrades for a warrior in my guild that just hit 80.&nbsp; He is dual spec'd.&nbsp; His primary is Arms and secondary is Protection.&nbsp; I load his profile from the armory into Rawr and run an upgrade search from the armory then from wowhead.&nbsp; First i have everything but Dungeons &amp; Crafted unchecked in the filter, since he isn't ready for heroics yet.&nbsp; The any gear for the neck, back, rings &amp; trinkets only show what he has equipped already and nothing else.&nbsp; I start enabling more filters till eventually everything is checked in the filter list and still it only shows what he has equipped on the right side.&nbsp; When he logs out on his prot spec, i do the same thing as i do with his dps spec and still, it only shows the neck, back, rings &amp; trinkets he has equipped.&nbsp; there is no other gear in the list for those slots to compare with to find upgrades.&nbsp; The warrior i am talking about i mentioned in a previous post.&nbsp; He logged out in his dps spec earlier.</p>",
    "PostedDate": "2009-06-23T00:52:24.513-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "204572",
    "ThreadId": "60280",
    "Html": "<p>Ohh, Tools &gt; Refine Types of Items Listed..., recheck everything you can. You filtered out all Misc items, probably.</p>",
    "PostedDate": "2009-06-23T09:29:34.473-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "204583",
    "ThreadId": "60280",
    "Html": "<p>Ok, i enabled it and now i get a list for thost slots.&nbsp; I always mistaken that for just offhand items.&nbsp; I unchecked it quite a bit since i didn't want a &quot;Held in Off Hand&quot; item for my rogue.&nbsp; Thanks for the help.</p>",
    "PostedDate": "2009-06-23T09:51:45.597-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]