[
  {
    "Id": "204254",
    "ThreadId": "60316",
    "Html": "<p>I have had RAWR installed on my home PC since 2.2.6, I have downloaded and installed the same version on my work computer. I email my character from home to work to tweak at lunchtime (work has anything related to WoW blocked or fire walled, except this site). With 2.2.6 and 2.2.7 when I try to open my emailed file at work I get the &quot;error attempting to open new character, was more than likely saved with a previous beta version...........&quot;.&nbsp; I can load the saved character fine at home. I will bring the character in on a memory stick tomorrow to see if the email is somehow screwing with the formatting. I have opened the .xml file in Front page and it verifies fine. Anyone else having a similar experience ?</p>\r\n<p>There are also numerous error when listing equipment available for my Mage to upgrade too, a lot of stuff that is listed available by vendors is actually an heroic drop, I will be happy to send a full list when I am able to tweak at work, too busy playing when at home :)</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-06-22T15:41:19.843-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "204310",
    "ThreadId": "60316",
    "Html": "<p>First of all, make sure you're using the same version in both places (2.2.7 is latest).</p>\r\n<p>Second, if you are are getting errors trying to open it at work, it means it didn't have all the data required to open it. That typically means items and images. Trasfer your full Rawr folder from home to work, in order to bring along all of your new item/image data as well.</p>",
    "PostedDate": "2009-06-22T20:17:58.127-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "204701",
    "ThreadId": "60316",
    "Html": "<p>Rawr 2.2.7 downloaded from website</p>\r\n<p>Extract to home pc, load character from armory, save character, email to work.</p>\r\n<p>Load character from home pc, works fine</p>\r\n<p>Copy directory to usb drive, load character, works fine.</p>\r\n<p>Load character from usb drive attatched to work pc, works fine</p>\r\n<p>Copy directory to work pc, load character, works fine</p>\r\n<p>Load emailed character from usb drive attatched to work CP, fine.</p>\r\n<p>Load emailed character from home from work pc, FAIL.</p>\r\n<p>No real idea why on my work PC it is not working :( I have a workable solution now so that will suit me fine.</p>\r\n<p>Gareth</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-06-23T15:59:12.223-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "204806",
    "ThreadId": "60316",
    "Html": "<p>Guru, I think you misunderstand. It's not the method of getting the character file to work that matters. It's the fact that the character file references items that your work copy of Rawr doesn't already know about. Send the full Rawr folder to work, and it won't be a problem.</p>",
    "PostedDate": "2009-06-23T22:09:30.933-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "204831",
    "ThreadId": "60316",
    "Html": "<p>Copy directory to usb drive, load character, works fine</p>\r\n<p>I think that line above showed I did that :)</p>",
    "PostedDate": "2009-06-23T23:55:50.483-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "204840",
    "ThreadId": "60316",
    "Html": "<p>The problem may be XML parser related and this happens not only when using a stored character XML it happens also when trying to download from armory.</p>\r\n<p>For example I do wear this item from the noblegarden event:</p>\r\n<p>&nbsp;</p>\r\n<div style=\"color:Black;background-color:White\">\r\n<pre>  <span style=\"color:Blue\">&lt;</span><span style=\"color:#A31515\">Shirt</span><span style=\"color:Blue\">&gt;</span>6833.0.0.0.0<span style=\"color:Blue\">&lt;/</span><span style=\"color:#A31515\">Shirt</span><span style=\"color:Blue\">&gt;</span><br></pre>\r\n</div>\r\n<p>&nbsp;</p>\r\n<p><a title=\"Armory Link\" href=\"http://eu.wowarmory.com/item-info.xml?i=6833\">http://eu.wowarmory.com/item-info.xml?i=6833</a></p>\r\n<p>This item can not be handled with version 2.2.7 but older versions do. If I remove this item from the XML also 2.2.7 can load it. So it seems that the parser can not handle anymore some unknown items or items which can be bought by unknown tokens (in this case the chocolate eggs from the noblegarden event). There might more items which cause the same problem thats not possible to download a character from armory anymore but with this item it is everytime reproducible. So you could try to check the bug against this.</p>",
    "PostedDate": "2009-06-24T00:27:11.127-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "205238",
    "ThreadId": "60316",
    "Html": "<p>Strange the .xml will load off the USB attatched to my work PC, but won't when loaded off my work PC from a directory that is a dirct copy off my USB drive. I think the .xml will be fine, just must be my work PC, thats all. I just plug my USB drive in and tweak my character that way.</p>",
    "PostedDate": "2009-06-24T21:51:09.987-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "444742",
    "ThreadId": "60316",
    "Html": "<p>Still doesn't work, no matter I do Silverlight 3 fails to install :(</p>\r\n<p>&nbsp;</p>\r\n<p>G</p>",
    "PostedDate": "2010-05-19T01:07:36.05-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "444754",
    "ThreadId": "60316",
    "Html": "<p>Why are you posting this here, when this thread has nothing at all to do with Silverlight? If you have an issue, post an issue. But really, it sounds like you're having trouble with installing Silverlight3, which should be quick and painless... Dunno what that could be, unless you have some sort of error message for us.</p>",
    "PostedDate": "2010-05-19T01:46:06.92-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "444774",
    "ThreadId": "60316",
    "Html": "<p>Sorry, had 2 threads open, typed message in wrong one, I shan't post ever again.</p>",
    "PostedDate": "2010-05-19T02:46:05.44-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]