[
  {
    "Id": "205601",
    "ThreadId": "60690",
    "Html": "<p>I've been using rawr for my mage and it has worked quite well when i try to optimize gear for her. But when it comes to my elemental shaman, the optimizer try to equip gear that gives my shaman X mana per 5 second even though the spell power/haste/crit might be less than the equipment one.</p>\r\n<p>for example</p>\r\n<p>Head currently equiped- Val Earthshatter Helm (99 sp, 51 crit, 88 haste)</p>\r\n<p>chosen by optimzer - Headpiece of Fungal Bloom (99sp, 34 crit, 20 Mp5)</p>\r\n<p>Wrist current equiped - Bands of Mutual respect (56sp,43crit,20haste)</p>\r\n<p>choosen by optimizer - Iron rings of endurance (59 sp, 36 crit, 12 Mp5)</p>\r\n<p>Is there any setting that needs to be changed?</p>\r\n<p>Any help is greatly appreciated.</p>\r\n<p>&nbsp;</p>\r\n<p>Thanks,</p>",
    "PostedDate": "2009-06-25T12:03:00.677-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "205672",
    "ThreadId": "60690",
    "Html": "<p>I have also have this issue, the helm of vieled energies from 10man XT is saying that the helmet of inner sanctum is a downgrade of over 60dps. -30 less spell power, about 20 less crit and less haste/int..</p>\r\n<p>also saying that mp5 &gt; haste gear as well. Could it possibly be that the Resto code is in with the elemental code and mixing up?</p>",
    "PostedDate": "2009-06-25T15:11:46.727-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "205768",
    "ThreadId": "60690",
    "Html": "<p>Generally, if haste is a negative value, and MP5 is a positive value, it believes you are running out of mana. &nbsp;If you have set everything to work properly, then there could be an error in the module running you out of mana. &nbsp; I would check in the issue tracker and see if any of the current issues are similart to yours.</p>\r\n<p>Also, due to the nature of the way it's put together, I very much doubt Resto code is in the Elemental code, you can trust me on that one, it's just not put together that way.</p>",
    "PostedDate": "2009-06-25T22:58:33.637-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]