[
  {
    "Id": "205805",
    "ThreadId": "60745",
    "Html": "<p>My wife is a shadow priest and since I'm always raiding w/ her the +hit benefit from faerie fire isn't so important. Plus she tells me that her misery doesn't proc when my improved FF is up that she doesn't get the benefits from misery (i.e. +shadow spell damage).. I know that improved FF also increases my crit, but I noticed a few of the top-performing boomkins on my server didn't have improved FF. I thought I'd play in Rawr a bit to see what other talents might be a potential substitute.</p>\r\n<p>&nbsp;</p>\r\n<p>The first thing that I noticed that was &quot;odd&quot; was that without changing my spec, if I changed the buffs to say &quot;misery&quot; instead of &quot;improved FF&quot; that my DPS went up a decent amount. The only way I could imagine this to matter would be that FF does not to be cast every once in a while, and any cast has a GCD impact on your DPS, but +14 DPS for a 10 minute fight doesn't seem right.</p>\r\n<p>&nbsp;</p>\r\n<p>I pulled improved FF out of my spec and added brambles and saw that the net DPS impact was negative.&nbsp;I should pay mopre attention to how much dmg my treants are doing these days, but I just wanted to sanity check that the treant/brambles calcs were on (i.e. +treant dmg &lt; +crit) and make sure that the &quot;misery&quot; vs&quot; improved ff&quot; buff DPS difference made sense...</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-06-26T01:44:44.513-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "205861",
    "ThreadId": "60745",
    "Html": "<p>The increase in spell power on spells from Misery does function even if Misery is not on target, its 2 different effects on that talent.</p>\r\n<p>&nbsp;</p>\r\n<p>If you got another druid putting out Faerie Fire your treeants will deal that extra damage, you will also get the 3% extra crit whenever any Faerie Fire is on target.</p>",
    "PostedDate": "2009-06-26T04:48:49.123-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "205911",
    "ThreadId": "60745",
    "Html": "<p>Over a 10-minute fight, I believe Rawr calculates that to be either 2 or 3 GCDs &quot;wasted&quot; on Imp FF.&nbsp; 14 DPS sounds about right; it's not like that's a significant percentage of your overall DPS.</p>",
    "PostedDate": "2009-06-26T07:44:08.87-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "206004",
    "ThreadId": "60745",
    "Html": "<p>Thanks for the sanity check on the GCD and clearing up the information about the misery % bonus working whether or not misery is up.&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>Just a last couple sanity checks if you don't mind :) :)</p>\r\n<p>I looked at a recent fight against razorscale. I brought my treants out once and it looks like they did 58K damage. I assume that means that the DPS contribution from treants ~= 58000/360=~322DPS. A 15% buff to this from Brambles would be 58DPS.</p>\r\n<p>My sustained/burst scores are basically the same and are 4544. I removed improved FF from my spec (left misery in the buff section) and this dropped me to 4471 (73 point drop - presumably from the crit loss). I then added 3/3 brambles and it increased me to 4502 (29DPS).</p>\r\n<p>Is my math off on the treants?</p>\r\n<p>&nbsp;</p>\r\n<p>Q1: What is the DPS contribution from treants (assuming that they live the whole time)?</p>\r\n<p>\r\n<p>Q2: Is it safe to assume that the RAWR calculations do not take into consideration the increased DPS due to thorns (i.e. the assumption is that you are not being hit -- so the DPS boost that is gained for this actually goes to your tank(s). I was trying to get a sense as to how much the DPS bonus is (i.e. if it costs me 20 DPS to boost 2-3 other people +10DPS then it is a good spec choice), but I was having a hard time figuring out how much DPS thorns (w/ or w/o brambles) was putting out.</p>\r\n<p>&nbsp;</p>\r\n</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-06-26T11:16:00.4-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]