[
  {
    "Id": "206256",
    "ThreadId": "60858",
    "Html": "<p>Why is it that as a blank character i have 150k+ overall points? Shouldn't that be zero (or near zero)</p>",
    "PostedDate": "2009-06-27T15:21:51.937-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "206286",
    "ThreadId": "60858",
    "Html": "<p>Uhh, no? Why would it? You have alot more than 0 health while naked, alot more than 0 armor, you still have def stance, etc. Naked characters certainly have some tanking value, just like they have some DPS value.</p>",
    "PostedDate": "2009-06-27T21:11:59.21-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "206318",
    "ThreadId": "60858",
    "Html": "<p>While not completely related can we decide on what should be standard for talent spec comparisons. I've changed it a few times to show it as todal dps/other ratings the&nbsp;model generates, but someone keeps changing it to having unspecced be shown as zero.</p>",
    "PostedDate": "2009-06-28T04:03:25.507-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "206349",
    "ThreadId": "60858",
    "Html": "<p>I haven't been changing it, but that does seem more consitent to me; items are valued as [value with item] - [value with slot empty]. Seems right that talent specs would be valued as [value with talent spec] - [value with talents empty]. However, that said, I realize that you're typically trying to compare what your dps would be with different specs. Is there any other reason to go with total value?</p>",
    "PostedDate": "2009-06-28T10:06:22.43-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "206376",
    "ThreadId": "60858",
    "Html": "<p>No other reason, it just doesn't give me much information if it says that a spec is worth 4k dps without knowing how much an unspecced character does.</p>",
    "PostedDate": "2009-06-28T14:20:29.59-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "206477",
    "ThreadId": "60858",
    "Html": "<p>I also believe I copied Kavan's code to allow for default buffs to be set up, so it's quite possible a blank character created for ProtWarr would have full raid buffs as well.</p>\r\n<p>The exact numbers may change or whatever if we standardize down on some other formulas for ratings, but it definitely would not be 0 for a naked character for all thre reasons that Astrylian mentioned. A naked character still has something like 12-13% avoidance and a number of stats which contribute to the formula returning a positive result.</p>",
    "PostedDate": "2009-06-29T00:13:54.16-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]