[
  {
    "Id": "206279",
    "ThreadId": "60865",
    "Html": "<p>i have a shadow priest, and the optimizer keeps insisting that &quot;No enchant&quot; is better than &quot;Greater Spellpower&quot;. i tried:</p>\r\n<ul>\r\n<li>right-click the staff slot</li>\r\n<li>Select Add custom gemming...</li>\r\n<li>Click &quot;No enchant&quot;</li>\r\n<li>Select&nbsp;&quot;Greater Spellpower (Staff)&quot;</li>\r\n<li>Click OK</li>\r\n</ul>\r\n<p>Back on the main screen, i&nbsp;click the &quot;No enchant&quot; button (on the staff itself), and select &quot;Greater Spellpower (Staff)&quot;</p>\r\n<p>A run of the optimizer insists:<br>&nbsp;&nbsp; Score Before Optimization: 5,523.279<br>&nbsp;&nbsp; Score After Optimization: 5,363.085</p>\r\n<p>i <strong>did</strong> find the configuration screen that let's me choose what <strong>gems</strong> i have access to:</p>\r\n<ul>\r\n<li>Tools menu</li>\r\n<li>Select Edit Gemming Templates</li>\r\n<li>Check all the available checkboxes on the dialog</li>\r\n<li>Top gemmings to show: 100</li>\r\n</ul>\r\n<p>But i can't find a similar screen for enchants.</p>\r\n<hr>\r\n<p>While we're on the subject, what is <strong>Override Reenchant?</strong> Based on the english language,&nbsp;it suggests that the normal behavior of the<em> </em>Optimizer is to &quot;<em><strong>Reenchant</strong></em>&quot;, and we have option to &quot;<em><strong>Override</strong></em>&quot; that behaviour.</p>\r\n<p>Therefore&nbsp;&quot;<strong><em>Override Reenchant</em></strong>&quot; means &quot;<em>override reenchanting items so that we don't reenchant them</em>&quot;. Does that mean that it will only not reenchant items that already have an enchant? How does it know that i don't have an item yet, so it is okay to put an enchant on it - since it's not <strong><em>re</em></strong>enchanting it?</p>\r\n<p>Is there a reason it's not called <strong>Optimize Enchants</strong> and <strong>Optimize Gems</strong>?</p>",
    "PostedDate": "2009-06-27T20:19:41.13-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "206283",
    "ThreadId": "60865",
    "Html": "<p>Eek, slow down! I think you took a wrong turn all the way at the beginning. See the charts for enchants. That's where you mark what you have available. As the description above the Override Reenchant/Regem options says, you can mark items as only a specific gemming/enchanting of it is available. Those checkboxes will override that, and regem/renenchant them anyway. Any fully available item will be gemmed/enchanted optimally.</p>\r\n<p>See Help &gt; Gear Optimization for more info on all this.</p>",
    "PostedDate": "2009-06-27T21:03:31.187-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "206284",
    "ThreadId": "60865",
    "Html": "<p>Additionally, Edit Gemming Templates is not where you should choose what gems you want available to the optimizer. Just like with enchants, do that on the Gems charts.</p>",
    "PostedDate": "2009-06-27T21:04:36.433-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "206325",
    "ThreadId": "60865",
    "Html": "<p><em>&gt; See the charts for enchants</em></p>\r\n<p>Where are &quot;<strong>the charts</strong>&quot; that you speak of?</p>\r\n<p>If i go to <strong>Tools</strong>-&gt;<strong>Gear Optimization</strong>, it actually&nbsp;brings me to a page here on CodePlex. (<a href=\"http://www.codeplex.com/Rawr/Wiki/View.aspx?title=GearOptimization)\">http://www.codeplex.com/Rawr/Wiki/View.aspx?title=GearOptimization)</a> With respect to&nbsp;enchants, it says:</p>\r\n<p><em>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;This is done by marking items/enchants/gems as available in the comparison charts.<br>&nbsp;&nbsp;&nbsp; &nbsp;...<br></em><em>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Select gems and enchants that you have access to and then mark the items that you currently have with green diamonds.</em></p>\r\n<p>So the question still remains, where are these <strong><em>comparison charts</em></strong> i hear rumors of?</p>\r\n<p>\r\n<hr>\r\n</p>\r\n<p>So let me just list all the menus in the software, just to be sure i'm not missing something called:</p>\r\n<ul>\r\n<li>the charts</li>\r\n<li>the Gem charts</li>\r\n<li>the comparison charts</li>\r\n</ul>\r\n<p><strong>File</strong></p>\r\n<ul>\r\n<li>New</li>\r\n<li>Open</li>\r\n<li>Load from Armory...</li>\r\n<li>Load from Character Profiler</li>\r\n<li>Open Saved Upgrade List</li>\r\n<li>Save</li>\r\n<li>Save As...</li>\r\n<li>Exit</li>\r\n</ul>\r\n<p>Tools</p>\r\n<ul>\r\n<li>Edit Items...</li>\r\n<li>Edit Gemming Templates...</li>\r\n<li>Refine Types of Items Listed...</li>\r\n<li>Edit Item Filters...</li>\r\n<li>Optimize...</li>\r\n<li>Batch Tools...</li>\r\n<li>Item Set Comparison...</li>\r\n<li>Copy Character Stats to Clipboard...</li>\r\n<li>Reload Current Character from Armory</li>\r\n<li>Reload Current Character from Character Profiler</li>\r\n<li>Load Possible Upgrades from Armory</li>\r\n<li>Load Possible Upgrades from Wowhead</li>\r\n<li>Update Item Cache from the Armory</li>\r\n<li>Update Item Cache from Wowhead</li>\r\n<li>Import from Wowhead Filter...</li>\r\n<li>Options...</li>\r\n</ul>\r\n<p><strong>Help</strong></p>\r\n<ul>\r\n<li>Start Page</li>\r\n<li>Rawr Website</li>\r\n<li>Donate...</li>\r\n<li>Rawr Help Page</li>\r\n<li>Tour of Rawr</li>\r\n<li>Gemmings</li>\r\n<li>Gear Optimization</li>\r\n<li>Batch Tools</li>\r\n<li>Item Filtering</li>\r\n</ul>\r\n<p>Am i blind? Am i missing an item called &quot;charts&quot;, &quot;the Gems charts&quot; or &quot;comparison charts&quot;?</p>\r\n<p>\r\n<hr>\r\n</p>\r\n<p>So, just i'm perfectly clear, if i want the optimizer to optimize my gear, i should <strong>check</strong>:<br>&nbsp;- Override Reenchant<br>&nbsp;- Override Regemming</p>\r\n<p>Is that correct? If i want optimial gear i need to &quot;override&quot; Rawr's default behavior? Rawrs default behaviour is to <em>not</em> give me optimal gear?</p>",
    "PostedDate": "2009-06-28T05:27:08.377-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "206341",
    "ThreadId": "60865",
    "Html": "<p>Rawr's default behavior is you optimize the gear/enchants/gems you say are available to you. If Rawr optimized for every enchant/gem combination possible, the optimizer would take FOREVER to run. With it having you select the enchants/gems you want to consider, it makes the optimizer considerably faster.</p>",
    "PostedDate": "2009-06-28T07:26:25.3-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "206350",
    "ThreadId": "60865",
    "Html": "<p>josejimeniz, again, you took a wrong turn at the start. Look at the right half of the screen. That's called a chart. There are dropdowns above it to choose which of the many charts you're looking at. Try looking at the Enchants chart. Then try looking at the Gems chart.</p>\r\n<p>The default behavior is to respect the availability of items that *you specify* (which is typically available with any gems/enchant). You can also mark an item as available only with a specific gem/enchant. The Override checkboxes in the Optimizer allow you to override that. ie, &quot;I have everything gemmed this way, and I don't really want to change it... But lets see how much difference it would make if I did regem it&quot;. Have you looked at the Tour of Rawr video?</p>",
    "PostedDate": "2009-06-28T10:13:08.573-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "206399",
    "ThreadId": "60865",
    "Html": "<p>Okay, i see the screen you're talking about - and i see now why i was so confused.</p>\r\n<p>Is there no easy way to turn on all the gems and enchants i have available to me? Because every player has access to almost every gem and enchant in the game.</p>\r\n<p>For example, as a tank, i use Enduring Forest Emeralds a lot. i count 52 gems that are &quot;better&quot; than that, and a dozen or so that could also be useful. And for enchants, i have to go to:</p>\r\n<p><em>&nbsp;&nbsp;&nbsp; Slot: Enchants -&gt; Head</em></p>\r\n<p>and check off almost all the enchants as available, then&nbsp;do the same for</p>\r\n<p><em>&nbsp;&nbsp;&nbsp; Slot: Enchants -&gt; Head<br>&nbsp;&nbsp;&nbsp; Slot: Enchants -&gt; Shoulders<br>&nbsp;&nbsp;&nbsp; Slot: Enchants -&gt; Back<br>&nbsp;&nbsp;&nbsp; Slot: Enchants -&gt; Chest<br>&nbsp;&nbsp;&nbsp; Slot: Enchants -&gt; Wrists<br>&nbsp;&nbsp;&nbsp; Slot: Enchants -&gt; Hands<br>&nbsp;&nbsp;&nbsp; Slot: Enchants -&gt; Legs<br>&nbsp;&nbsp;&nbsp; Slot: Enchants -&gt; Feet<br>&nbsp;&nbsp;&nbsp; Slot: Enchants -&gt; Main Hand<br>&nbsp;&nbsp;&nbsp; Slot: Enchants -&gt; Off Hand</em></p>\r\n<p><br>And then it seems that i have to repeat this excercise for every character. Is this the intended behaviour? i turn on all gems and enchants, and it doesn't take <em>forever</em>, it only takes a few minutes on my&nbsp;Core 2 Duo 1.8.</p>\r\n<p>The sad thing is that i thought i had managed to find the best enchant for my sword. i was proud of myself for bypassing better enchants&nbsp;all this time - becuase Rawr was confirming that Potency really was the best enchant for my sword. i turn everything on and i get a much different answer. Then i want to try it with another character, and i have to manually check off a hundred checkboxes. Is there no way to say</p>\r\n<p>&nbsp;- include enchants<br>&nbsp;- include enchanter-only enchants<br>&nbsp;- include gems<br>&nbsp;- include jewelcrafter only gems<br>etc?</p>\r\n<p>Am i missing something? Is this really the intended behaviour?</p>",
    "PostedDate": "2009-06-28T16:38:30.347-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "206401",
    "ThreadId": "60865",
    "Html": "<p>Sigh. You REALLY need to watch the Tour of Rawr video. You are making things out to be WAY more complicated than they actually are. Most of the time you DO NOT need to mark enchants or gems the optimiser will, as you expect, use them all. HOWEVER if you choose to mark only specific ones available it will respect that. This is more commonly done by saying that you want to use X item with specific gems and a specific enchant and that the optimiser shouldn't change that item. Its not normal to go into every menu and select every enchant.</p>\r\n<p>If you actually RTFM which in this case is WTFV (watch the video) the vast majority of the issues you think you are having will disappear.</p>",
    "PostedDate": "2009-06-28T16:45:45.477-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "219802",
    "ThreadId": "60865",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>Levva wrote:</strong><br>\r\n<p>You REALLY need to watch the Tour of Rawr video.</p>\r\n<p>If you actually RTFM which in this case is WTFV (watch the video) the vast majority of the issues you think you are having will disappear.</p>\r\n</blockquote>\r\n<p>&nbsp;i RTFM (help pages), they don't address enchant availability.</p>\r\n<p>i just watched the Rawr into video (<a href=\"http://www.youtube.com/watch?v=OjRM5SUoOoQ\">http://www.youtube.com/watch?v=OjRM5SUoOoQ</a>). The closest she got to mentioning enchants being available was at 4m48:</p>\r\n<p><em>&quot;I also have been condsidering enchanting my boots for&nbsp;stamina. So I'll mark that boot enchant availble by going to the Feet enchants chart and marking it.&quot;</em></p>\r\n<p>What i don't understand is: why was she considering enchanting her boots for stamina? Might there not have been some other optimal enchant? What if there was a seemingly lesser boot enchant, but when combined with other slot enchants and gems, it's actually a better choice. This is made even more confusing, when you see on her Rawr screen that there were two higher boot enchants:</p>\r\n<ul>\r\n<li>Greater Fortitude</li>\r\n<li>Superior Agility</li>\r\n</ul>\r\n<p>Why did she not select those in Rawr instead also? Why did she not select one of those in Rawr instead?</p>\r\n<p>This is the job of Rawr's optimizer. A computer is good at figuring out all these combinations and telling me which one is better.</p>\r\n<p>&nbsp;</p>\r\n<p>If there's&nbsp;a help page, or a video, that explains this - please include a link to it.</p>",
    "PostedDate": "2009-08-05T08:48:29.613-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "219817",
    "ThreadId": "60865",
    "Html": "<p>Oh for crying out LOUD.....</p>\r\n<p>The instructional video is just to show you where this stuff is, not specifically as a Bear wanting to select this enchant over another. YOU are supposed to make the decisions of what is/is not available, because on some slots there may be the top benefitting enchant of somethign like Fur Lining, which you can only get as a Leatherworker. If you are a LW, select it, otherwise select the top ones you would be willing to put on it. Similarly, anyone can get Berserking, but the mats are 1kg+ so you may not be able to afford it. And the other reason we have YOU select multiple of your own is because at varying levels of gear, different enchants may benefit differently. If your overall stats are low on Crit and a point or two shy on Hit, it may value the Icewalker over the AP Boot enchant, and vice versa. Select them both available then let the optimizer work it out.</p>",
    "PostedDate": "2009-08-05T09:08:08.663-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "219900",
    "ThreadId": "60865",
    "Html": "<p>I'm really thinking josejimeniz is just trolling.</p>",
    "PostedDate": "2009-08-05T10:59:29.393-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "219948",
    "ThreadId": "60865",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>Jothay wrote:</strong><br>\r\n<p>The instructional video is just to show you where this stuff is, not specifically as a Bear wanting to select this enchant over another. YOU are supposed to make the decisions of what is/is not available, because on some slots there may be the top benefitting enchant of somethign like Fur Lining, which you can only get as a Leatherworker. If you are a LW, select it, otherwise select the top ones you would be willing to put on it. Similarly, anyone can get Berserking, but the mats are 1kg+ so you may not be able to afford it. And the other reason we have YOU select multiple of your own is because at varying levels of gear, different enchants may benefit differently. If your overall stats are low on Crit and a point or two shy on Hit, it may value the Icewalker over the AP Boot enchant, and vice versa. Select them both available then let the optimizer work it out.</p>\r\n</blockquote>\r\n<p>&nbsp;i'm not troll, Astrylian.&nbsp; While the gemming, available gems, enchating, available enchants, may be obvious to you - it isn't obvious to everyone. A search of the discussion forum shows that. i try to ask simple questions, that start at the beginning, or start from a simple concept - but i get the sense that by asking such questions i'm annoying those who <em>do</em> understand it.</p>\r\n<p>Levva said that i'm making this way more complicated than i have to. He said,</p>\r\n<p>&nbsp;&nbsp;&nbsp; &quot;<em>you DO NOT need to mark enchants or gems</em>&quot;.</p>\r\n<p>Which, if i take at face value, and <em>rtfv</em>, then it will explain how i don't need to mark enchants or gems as available. Then the video itself <em><strong>does</strong></em> mark enchants as availabe.</p>\r\n<p>Jothay todays tells me that, &quot;<em>i'm supposed to make the decision of what is/is not avaiable&quot;. </em>What i don't understand, and please explain it to me, isn't&nbsp;nearly <em>every</em> gem and enchant available? (i realize that some are jewelcrafter and enchanter only, so those are not available to me).&nbsp;But nearly every other enchant in the game <strong>is</strong> available to me. So my natural reaction was to select every enchant that is available to me.</p>\r\n<p>But then selecting every enchant/gem is &quot;wrong&quot;.</p>\r\n<p>i know the concepts are rediciously easy for you -&nbsp;because you understand it. There are those of us browing the scattered bits of information trying to grasp the logical concept. We're not dumb, and we're not trolls. We're just trying to understand. And i can appreciate that answering these tedious questions over and over is frustrating - and i can't really offer an answer to that one.</p>",
    "PostedDate": "2009-08-05T12:21:27.787-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "219955",
    "ThreadId": "60865",
    "Html": "<p>Again, you ARE making it harder on yourself, several gems and enchants there is no need to select, like +22 Agi vs +16 agi, only select the 22 cuz there's no reason to select the lesser one. They are still availalbe tho for people that *do* want to limit themselves to this.</p>\r\n<p>&nbsp;</p>\r\n<p>The point is, stop asking questions you already have the answers to.</p>",
    "PostedDate": "2009-08-05T12:35:39.233-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "219982",
    "ThreadId": "60865",
    "Html": "<p>No, you're not annoying us because you're asking questions (and yeah, this isn't incredibly simple, some level of questions is expected, most of which will be answered by the help topics, thought not all). You're annoying us because <strong>you're asking the same questions that we've already answered.</strong></p>\r\n<p>&nbsp;</p>\r\n<p>You want to mark items as &quot;Available to the Optimizer&quot; when they have a chance of being useful, and you can get them. Marking multiple tiers of the same cut of gem is bad. Marking terrible cuts of gems is bad. You're not retarded enough to think that a stam/def gem would be useful to a spriest, so don't mark it available. You're not retarded enough to think that a agi/mp5 gem would be useful to a mage, so don't mark it available. Etc.</p>",
    "PostedDate": "2009-08-05T13:29:01.157-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "220047",
    "ThreadId": "60865",
    "Html": "<p>Okay okay, his question is, &quot;Why aren't all the gems checked by default&quot;, which is a valid question.</p>\r\n<p>The answer is NOT because of time (although more gems selected can make things take a little longer). &nbsp;The nitty-gritty answer is that Rawr's optimization uses genetic algorithms. &nbsp;It is not an EXHAUSTIVE search of every possible combination. &nbsp;I'm not going to take the time to explain GEs to you here (wikipedia can help you if you really want to know more), but what I will say is that GEs try to be &quot;smart&quot; about finding the best combination without being exhaustive. &nbsp;Exhaustive searches grow exponentially in computation time (and in this case, the typical optimization would take on the order of hours rather than &lt;5mins).</p>\r\n<p>The downside to GEs is that they are NOT exhaustive, so it may not find the best combination during any given iteration. &nbsp;You can easily see this by equipping sub-par gear, making a lot of gems/enchants/items available, and optimizing. &nbsp;Then optimize again, and see that the results are different.</p>\r\n<p>How do you combat this? &nbsp;By intelligently limiting what gems to choose. &nbsp;As a knowledgable DPS warrior, I know that I will never choose 10str/10haste when I could choose 10str/10crit. &nbsp;There isn't a gear set known that values haste over crit. &nbsp;I also know that I need to be at a threshold to make a 20arp gem better than a 20str gem, and I am not at that threshold yet. &nbsp;So, I do not select 20arp or 10str/10haste. &nbsp;As a knowledgable Prot Warrior, I know that I will never choose to gem for str/hit/haste/arp +sta when I could choose 10expertise/15sta, 10hit/15sta, 10dodge/15sta, 10parry/15sta or 10def/15sta.</p>\r\n<p>To summarize: the smaller you can make your pool, the more accurate Optimization will be.</p>",
    "PostedDate": "2009-08-05T15:45:16.9-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "220187",
    "ThreadId": "60865",
    "Html": "<p>Let's examine how this thread went.</p>\r\n<p>OP asked why enchants worked the way they do. He was referred to the enchants chart. He asked where this chart is, and was told where it is. Good so far.</p>\r\n<p>Then he asked why enchants had to be individually marked for every single enchant on every single slot (and every single toon), which I agree has to be one of the most time-consuming parts of setting up a Rawr profile. At that point he began to get WTFV.</p>\r\n<p>I did, actually, bring up the video. It's out of date. It would not have answered a single question he's asked so far, not even where to find the enchants chart.</p>\r\n<p>He asked why something specifically was done in the video; I agree that it wasn't the best question as it seemed obvious to me it was just an example. Now he starts getting yelled at and is accused of being a troll. Wait, what?</p>\r\n<p>The OP then points out he's getting conflicting answers, and asks for clarification. He even quoted all those differing answers. By this point I was just as confused as he was.</p>\r\n<p>He's told to stop asking the same questions over and over. From what I can see (and going back over it in summary), he hasn't been.</p>\r\n<p>ebs2002 posted a truly patient and enlightning reply. Now I understand that, once again, I've been doing something wrong all along - only there's no help files, anywhere, that I've found to tell me how and why to do it differently. And from the answers here it appears not even all the devs know the how and why of it.</p>\r\n<p>I've never even noticed the gem chart before. Everything I've looked up here has to do with the templates. I simply shrugged and trusted to the templates to be the expert-chosen gems to stick with.</p>\r\n<p>It seems like a lot of threads I read here are very much a dog-pile mentality. For all the emphasis put on making Rawr user-friendly, these forums are the single biggest help source; but I for one am half-afraid to post a question because the answers tend to be short, impatient and sometimes insulting. This is not unusual; I've been guilty of it too, and so has my guild-leader husband, when one understands something thoroughly and can't get another person to &quot;get it&quot;. Sometimes, though, it's time to take a step back or get some fresh eyes and instead of jumping all over users, try to see if you could find what they're missing without already knowing it's there.</p>\r\n<p>You guys have a great tool here, and I've spread the word to others. If you can make your site as user-friendly as you want the tool to be, I think it could be even better.</p>",
    "PostedDate": "2009-08-05T23:58:10.397-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "220197",
    "ThreadId": "60865",
    "Html": "<p>SUMMARY:</p>\r\n<p>You need to mark things in the charts - and they are not all automatically marked - because if every item in the game was available for optimization, then optimizing would literally take your computer years to compute every combination of items/enchants/gems to fit your paper doll. This is not obvious to new users, and it should be explained somewhere (I haven't watched the video). Instead, you should do your homework and mark the things that are available to you.</p>\r\n<p>Also, I've always felt that this sentence needs to be changed on the front page: &quot;E<span id=\"ctl00_ctl00_MasterContent_Content_wikiSourceLabel\">xtremely user friendly, graphical, fast, easy to use interface.&quot; It's not &quot;extremely&quot; user friendly nor easy. There are a lot of advanced features, and even some of the simple ones are hard to figure out unless you read these threads.</span></p>\r\n<p>For example, I still cannot for the life of me figure out how to use the <strong>gemming templates</strong> feature, or how it might be helpful to me, and I've been using Rawr for a year now. Can someone explain to me in layman's terms why I should use that instead of manually marking gems in the charts? Or how the templates relate to the charts? Just explain to me WTF the templates do. Thanks!</p>",
    "PostedDate": "2009-08-06T00:31:40.6-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "220221",
    "ThreadId": "60865",
    "Html": "<p>Solitha, I think you missed the parts where the first half of this thread is over a month old, and this guy has been posting these threads several times. Nothing said has been out of date, and every question he's asked (or anyone asks, for that matter) are answered.</p>\r\n<p>Korey, read the help page on it, it answers your question.</p>\r\n<p>&nbsp;</p>\r\n<p>EDIT: We do this stuff for <strong>fun</strong>. We try to help everyone, as much as possible. When people are blatantly just fucking with us, it's not very fun. When other people try to defend those people, it's even less fun.</p>\r\n<p>Don't be afraind to ask questions. Just check the resources that are already provided (help docs, discussion searches, skim a few pages of issues perhaps)&nbsp;before doing so. And if you do still need help, ask your question in a respectful way, and listen to the responses you get. Every hour we spend answering the same questions over and over is an hour we could be working on new features, or fixing bugs. (I dare you to count how many times there's been a question about broken JC gems in the discussions, and issue tracker, in the past 3 days, for example.)</p>",
    "PostedDate": "2009-08-06T01:31:24.983-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "220267",
    "ThreadId": "60865",
    "Html": "<p>Come one guys! this is a free tool coded by wonderful people during their free time while instead they could be going out, playing the game, leveling an alt, etc.</p>\r\n<p>Yes, the interface could be more user friendly, there is always room for improvement in everything, not just Rawr.</p>\r\n<p>Have you ever used a spreadsheet to decide what is your best gear or how something would improve your toon? I do, that's the way I used to do it before Rawr and it was so tedious and time consuming that I only did it from time to time. Then comes Rawr into my life, a very powerful tool, with lots of options, with lots of things and menus that I didn't know what they were for. By playing with it and experimenting and reading these forums I got the handle of it. So the time I used to need to play with a spreadsheet is now spent reading these forums and learning from other users.</p>\r\n<p>Anyway, my point is, just because this tool is trying to make your life easier when it comes to optimizing you toon, it should not be an excuse to stop researching and expect it be as easy as Click here, Click there, Click over there and Bam! you are doing 7000DPS!</p>\r\n<p>It's a HUGE tool, with lots of options, with so many little tweaks that you can't expect it to be simple. And regarding the OP, every person who replied tried to help him/her understand the proper way and s/he kept asking the same questions and simply NOT READING and NOT THINKING the replies s/he was getting. It certainly gives the impression s/he was trolling.</p>\r\n<p>Unless Astrylian makes a lite version of Rawr with just 3 buttons, there will always be someone asking &quot;<em>How do I do X or Y</em>?&quot;, it's expected and it should also be expected that you need to do your research and experiment with it. You don't learn to fly a plane with a 30 mins course.</p>\r\n<p>And for people who think and say: &quot;<em>Rawr is too hard, it's too complicated and tedious and the developers don't hold my hand and guide me through it</em>&quot;, I suggest you to try a spreadsheet and then see how that goes.</p>",
    "PostedDate": "2009-08-06T03:18:53.343-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "220392",
    "ThreadId": "60865",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>ebs2002 wrote:</strong><br>\r\n<p>Okay okay, his question is, &quot;Why aren't all the gems checked by default&quot;, which is a valid question.</p>\r\n<p>By intelligently limiting what gems to choose.</p>\r\n<p>To summarize: the smaller you can make your pool, the more accurate Optimization will be.</p>\r\n</blockquote>\r\n<p>To&nbsp;be perfectly honest, i don't know if&nbsp;+10 haste is better the +10 agility, or&nbsp;Int vs SpellPower - these are not my normal classes, and i've not dug into the theorycraft.&nbsp;This is why i turn to Rawr.</p>\r\n<p>i<strong> do</strong> know that Strength and Block Value won't help my priest. i also know that there's no point in selecting a +12 strength when there's a +16 one available.</p>\r\n<p>&nbsp;</p>\r\n<p>i understand the pain in answering the same questions over and over. But you have to realize that trying to find explanations by&nbsp;searching 200 pages of discussion threads is not an easy talk - and i would offer that it's near futile. i understand that&nbsp;you guys host this on CodePlex, and that CodePlex doesn't provide&nbsp;Wiki style documentation. Without that, i turn to the provided documentation. Which i understand is a pain to write, which is try i try to ask questions.</p>\r\n<p>i, perhaps nievely, thought that&nbsp;by picking through the guts of the concepts in one massive thread,&nbsp;some knowledge could be assembled that would be useful for everyone else struggling with these same concepts. But i've already contradicted myself, since it only turns into &quot;yet another question about gemming and enchants.&quot;&nbsp; i also hoped that by&nbsp;relaying my (faulty) thought process, you can see my confusion, and either a) explain what i should be thinking, or b) refine the software so it's more obvious. This is why i went through the n-th degree of what i did.</p>\r\n<p>After reflecting on the gem/enchant system,&nbsp;reasoning what it must be doing based on the user interface, parts of some answers given to me, and based on some scraps of information, i believe i now know exactly how the gemming, gemming templates and enchanting system works in Rawr. It's not intuitiave. My co-workers&nbsp;misunderstand, and my friends that i've&nbsp;gotten onto Rawr also don't understand.</p>\r\n<p>i also know how i would change some parts of the UI to make it more obvious. i'll see if i can do it in a local build.</p>\r\n<p>A wiki page would be quite helpful, so that it could be explained in a centralized location, for others to expand upon.</p>",
    "PostedDate": "2009-08-06T08:15:42.753-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "220408",
    "ThreadId": "60865",
    "Html": "<p>Wow, if there's any doubt that you're just trolling, still...</p>\r\n<p>There's a search box on the Discussions tab. It's not hard.&nbsp;The whole Home tab, which is where all the help docs are,&nbsp;<strong>is a wiki</strong>. Do you not read it? Do you not see the information we have already provided?</p>",
    "PostedDate": "2009-08-06T08:35:28.04-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "220698",
    "ThreadId": "60865",
    "Html": "<p>Ok, I have seen and heard that JJ there posts across multiple threads, which is indeed kind of bad forum form. The thing is... he's asking questions about stuff I don't get either. And I also don't understand the answers given. I'm definitely not a troll. Am I just that stupid? Maybe, so I turn to my husband, who is a professional programmer, knows his class inside and out, and uses Rawr.</p>\r\n<p>When he tells me he doesn't get it either, and would have to look at the code to finally figure it out... that's a problem. Something is just not being communicated here.</p>\r\n<p>I've tried spreadsheets. There's a reason I use Rawr... even if I'm not using it right, which is very likely, it's head and shoulders above anything else out there. Guys, I'm not trying to piss off devs. What I'm trying to do is point out that the user-friendliness may be quite a bit below what you're aiming for, and since these dicussions are the main help source, when you jump on someone's case for asking questions it becomes problematic. Yes, the first part of this thread is from what, late June, and way back then JJ was told to &quot;WTFV&quot; which, as I pointed out, would not have answered a single question he asked because it's out of date.</p>\r\n<p>I had tried Home-page searches and Discussion searches in the past to little effect. I'd pretty much given up on them some time ago. Perhaps you guys have been working on those pages, because now that I've seen the help page on Gemming, I think I may have a grasp on it. And with ebs2002's explanation about why not to give Rawr every option available, I'm now off to attempt to give it less headaches as it helps me be a better-geared catbear.</p>",
    "PostedDate": "2009-08-07T02:25:18.423-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "220899",
    "ThreadId": "60865",
    "Html": "<p>No comment on the trolling, but I can say that I've used rawr for maybe 6 months now, and I've never understood that there was a way to set the default enchants available for each slot, I've been peeved about it all that time but just figured that it hadn't been done yet.</p>\r\n<p>I saw the dropdown on the right under the word &quot;Comparisons&quot; and saw that you could change the gear slot, but I completely missed that there was another dropdown beside it that let you get at enchants by slot.&nbsp; You might assume that it's obvious but I can assure you that it's not. I read it as saying &quot;Slot: Gear: Head&quot; and completely missed the first dropdown.&nbsp; Personally I'd suggest adding a view menu and making these more explicit.</p>\r\n<p>I've just been used to the optimizer never working correctly unless I explicitly set which enchant to use for each item, this way is much better.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-08-07T12:10:12.63-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "220948",
    "ThreadId": "60865",
    "Html": "<p>If you don't think the official documentation is clear enough about something, let us know. What is unclear, and doesn't explain it? Additionally, what parts of the UI are confusing?</p>\r\n<p>We do want to improve things so that most people can understand most of what Rawr offers, without having to consult the help pages, and that everyone can understand everything with the help of the help pages. That's our goal. Obviously, some people are just goint to refuse to read the help we offer, and there's no much we can do about that. So, please keep it civil and constructive, and help us help you.</p>",
    "PostedDate": "2009-08-07T14:59:53.463-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "221239",
    "ThreadId": "60865",
    "Html": "<p>Astrylian, what would probably be the best &quot;upgrade&quot; (ducks and runs) for Rawr's help would be a set of startup pages.</p>\r\n<p>New to Rawr? This is what most users will want to do first (loading up a toon probably). You want to do it in such a way because of this reason.</p>\r\n<p>Now that you're done with this, you will probably want to do this (link to page with next function, perhaps available enchants?).</p>\r\n<p>Get us through basic setup, explain what results we're seeing, then split up for module help. I tried to help my bro with his mage by running a Rawr profile for him. I've had a bit of a time just puzzling through feral modules (it took me a long, long time to realize that having &quot;mangle&quot; ticked in the buffs meant Rawr assumed I would not be the one using it) and looking at the mage module left me totally clueless (yes, I admit, not a rare feeling).</p>\r\n<p>Rawr is rather imposing to begin with; even watching the video before using it (I did), once you first fire it up and look at it, egads there's a lot of information and options presented. Lots of little handy things get lost along the way. Example: I just read Kavan's post in another thread mentioning that you can right-click an item and individually evaluate it for upgrade. OMG, how many times I could have used that, instead of passing because I've optimized but not had time to run a new upgrade list! But it's not a feature I even considered might be there.</p>\r\n<p>The thing is, I've been running Rawr long enough that I think I have a grasp on it; only I find out in reading here that I was was wrong. I think a path-type guide (ie, one that takes you along in steps) would be an immense help in getting us familiar with what all this powerful tool has to offer.</p>",
    "PostedDate": "2009-08-09T05:04:37.453-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "221339",
    "ThreadId": "60865",
    "Html": "<p>Indeed, a sort of startup wizard has long been requested, and at the top of the list of things to do; it's just not an immediately easy thing to implement. :)</p>",
    "PostedDate": "2009-08-09T16:29:36.297-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "425575",
    "ThreadId": "60865",
    "Html": "<p>I hate to necro an old thread, but this thread really helped me understand rawr's use of enchants and gemming.</p>\r\n<p>Thanks to the folks that contributed!</p>",
    "PostedDate": "2010-03-30T10:04:30.14-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]