[
  {
    "Id": "206458",
    "ThreadId": "60911",
    "Html": "<p>I am using the HolyPriest Module with Rarw 2.2.7.&nbsp; I know what buffs i will have when i am raiding with my friend's guild on my priest, but if i pug some, i don't know what buffs i will get or if they are maxed on the improved ones.&nbsp; Because of that i used the buffs i will get when i raid with my friends guild and i get a nice optimization.&nbsp; i also tried optimizing unbuffed and some of the items on the list show items with am itemlevel of 175 being better than ones that are 200 because of haste over spirit &amp; mp5.&nbsp; i want to get the best set i can whether it is buffed or unbuffed.&nbsp; i don't want to have 1 set for raiding in 25-man, 1 for 10 man, 1 for heroics &amp; 1 for normal instances.&nbsp; as you know, different groups have different buffs or only your class buffs if in a 5 man.&nbsp; is there a way i can have an overall best set, including gems and enchants for any 5, 10 or 25 man i do?</p>",
    "PostedDate": "2009-06-28T22:00:37.783-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "206583",
    "ThreadId": "60911",
    "Html": "<p>In short no.</p>\r\n<p>What you are basically asking for is a Blizzard issue. By design the game dynamics work differently depending on what buffs you have. It is common to many classes to have to gear slightly differently if buffs are missing. The classic example is being hit capped or not (having moonkin or shadow priest buff) which can have a massive dps change. So its just standard game design by blizzard that you might be better off switching gear around for different instances. As such there is nothing Rawr can do to change default in game behaviour, you just need to learn to live with it.</p>\r\n<p>Just feel lucky you aren't an off tanking druid who needs a tanking set, dps set, resistance set, and perhaps with dual specs a healing set.</p>",
    "PostedDate": "2009-06-29T06:43:00.273-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "206670",
    "ThreadId": "60911",
    "Html": "<p>If you build your set for raiding 25-man, chances are good that the same set will perform adequately in 10-man and 5-man.&nbsp; If you don't want three sets, don't build three sets.</p>",
    "PostedDate": "2009-06-29T09:44:24.043-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "207109",
    "ThreadId": "60911",
    "Html": "<p>I think with what I put was worded somewhat wrong.&nbsp; Basically what i wanted to say was, is there a way to optimize a set wheter buffed or unbuffed that would be the best in any situation?</p>",
    "PostedDate": "2009-06-30T09:17:17.927-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "207131",
    "ThreadId": "60911",
    "Html": "<p>@Evandiann: No. &nbsp;That's because that set simply doesn't exist. &nbsp;In a 5man with no buffs, HelmA may be best. &nbsp;In a 10man with some buffs, HelmA and HelmB may be equal. &nbsp;In a 25man with all buffs, HelmB may be best.</p>\r\n<p>That's the way the game works, and has nothing to do with how Rawr lets you optimize.</p>\r\n<p>What it sounds like you're looking for is a way to weight HelmA and HelmB's strength in every possible buff situation, and give you the best average. &nbsp;Aside from taking forever (there's a TON of different buff combinations, and Optimize would have to be run for each of them), that's really useless information. &nbsp;You're better off having both HelmA and HelmB gemmed and enchanted for the situations you're in the most, and switch gear depending on what kind of group you're in. &nbsp;It may be more annoying to do, but as a former tank I have no pity for you :P &nbsp;(Good tanks always have multiple sets on them, and switch between fights)</p>",
    "PostedDate": "2009-06-30T09:46:47.153-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]