[
  {
    "Id": "207168",
    "ThreadId": "61096",
    "Html": "<p>Is there any way to opt out the items i use for my main spec (shadow Priest) and optimize the items for my offspec that i am not using (disc priest)?</p>",
    "PostedDate": "2009-06-30T10:56:42.457-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "207192",
    "ThreadId": "61096",
    "Html": "<p>Huh? You'll have to be more clear about what you're asking. As a place to start, see Help &gt; Gear Optimization.</p>",
    "PostedDate": "2009-06-30T11:54:48.34-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "207194",
    "ThreadId": "61096",
    "Html": "<p>what i mean is that if there is a piece of gear i am using for DPS, when i am optimizing for healing spec i dont want Rawr to factor that piece in the optimization.</p>",
    "PostedDate": "2009-06-30T11:58:24.643-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "207204",
    "ThreadId": "61096",
    "Html": "<p>Make two character files, name one heal, one dps.</p>\r\n<p>- In your healing file dont click it to green for a piece you are using in dps set.&nbsp; If any current DPS items are &quot;green&quot; click it to &quot;un-green&quot; it.</p>\r\n<p>-&nbsp;Right click on the item -&gt;add custom gemming and gem it how it is for your dps set.&nbsp;</p>\r\n<p>- Find the custom gemmed one you just made in the list.&nbsp; Then ctrl-click the little diamond for that one&nbsp;and it will be a blue diamond instead of green, only that one specific gemming is available for optimization</p>\r\n<p>- Then right click the blue diamond, you can hard-set the specific enchant for that specific piece as well.&nbsp; Select whatever you use for your DPS set.</p>\r\n<p>&nbsp;</p>\r\n<p>Now you are set.&nbsp; The optimizer has all your DPS set gear available for healing set but only how you actually have it gemmed/enchanted for DPS.&nbsp; It has green dots for all your spare gear that it will play with the enchants and gems on to optimize.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-06-30T12:33:31.88-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "207215",
    "ThreadId": "61096",
    "Html": "<p>Err, wait, back up. Why?</p>\r\n<p>You have a piece of gear you're using for DPS. Great. If it's the best you have available for healing, why wouldn't you want to use it for healing as well? If you mean that you want to make it *not regem/reenchant* it while optimizing, you can do that. See the help article I mentioned earlier. Ctrl-clicking an empty diamond makes it blue, indicating only that specific gemming is available, and you can right click the diamond to choose a specific enchant that's available, instead of any enchant.</p>",
    "PostedDate": "2009-06-30T13:13:52.473-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "207405",
    "ThreadId": "61096",
    "Html": "<p>Well Astrylian, for the simple fact that healing doesn't require hit rating... so&nbsp;i can substitute those gems for other things that will prove more helpful in healing.&nbsp; Currently even in my healing set i am having 144 hit rating.&nbsp; I am thinking now more along the lines of having 2 files but if a new item drops then that would mean i will need to link it in both files.&nbsp; My main spec is DPS and with that i want to put all my &quot;best-in-class&quot; items, gems and chants in there... the rest i will put for healing because due to the summer breaks.. our guild is having a healing shortage.</p>\r\n<p>&nbsp;</p>\r\n<p>Thank you all for all your replies.</p>",
    "PostedDate": "2009-07-01T00:17:48.667-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "207431",
    "ThreadId": "61096",
    "Html": "<p>Well, yes, you want 2 files, for sure. Optimize everything in the shadow character, then mark whatever items (as they're gemmed/enchanted in shadow) as specifically available in holy, and optimize there. That may well include hit rating, just because it's better than anything else you've got.</p>",
    "PostedDate": "2009-07-01T01:38:50.83-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "207608",
    "ThreadId": "61096",
    "Html": "<p>Ash, I think there's something missing in the communication here. &nbsp;If you have rawr set up properly (using the &quot;not regem/reenchant&quot; features on all your shadow gear), and then optimize for healing, it *is* possible that the best healing gear available to you will have some hit rating on it. &nbsp;Sure, it's a dead stat, but if the difference is between an epic item off of H-Yogg that has hit rating on it, and a dungeon blue item with no hit on it, chances are that the epic item with hit on it is still better for your healing. &nbsp;For a long time, the BIS DPS Warrior helm was Blue Aspect Helm, which had Int on it because it was mail and not plate. &nbsp;Int isn't an ideal stat for fury warriors, but all the other stats (even withOUT the int) was superior to any plate alternatives without int.</p>\r\n<p>As an example: you have two helms to choose from. &nbsp;One is a raid epic with 100SP, 50crit, 50spirit, and 25hit. &nbsp;The other is a heroic epic with 87SP, 47crit, and 45spirit, and 0hit. &nbsp;Which would you choose?</p>\r\n<p>Obviously it's a simplified example, but I think it proves my point: Just because you have hit on your off-set doesn't mean that you've screwed up. &nbsp;Sure, you may be able to find hit-less items to replace those items over time, but if you don't have them available, it just seems silly to wear a worse piece just because it doesn't have any hit.</p>",
    "PostedDate": "2009-07-01T09:36:28.193-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]