[
  {
    "Id": "207824",
    "ThreadId": "61274",
    "Html": "<p>I just loaded up my mage configuration in 2.2.8 and noticed that some of the results changed from 2.2.7.&nbsp; Using the exact same configuration (same file, talents, equipment, etc.) my dps dropped and the Relative Stat Value projections changed.&nbsp; This wouldn't surprise me except that&nbsp; I looked in the 3.2 change notes and I didn't see anything that would explain this.&nbsp; I'm not using 3.2 mode.&nbsp;</p>",
    "PostedDate": "2009-07-01T23:35:16.72-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "207850",
    "ThreadId": "61274",
    "Html": "<p>There were also some improvements to pyroblast dot uptime calculations (lowering fire dps a bit and hot streak value). How big of a shift are you seeing?</p>",
    "PostedDate": "2009-07-02T01:04:23.057-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "208059",
    "ThreadId": "61274",
    "Html": "<p>I too have noticed that with 2.2.8 my projected dps changed from 2.2.7. Also, everytime I update Rawr versions some gear that was considered an improvement in previous versions no longer would be an upgrade, even though mage mechanics were not publicly altered. This has caused me tons of trouble in raids because I'm spending DKP on things that I shouldn't. For example, last week Soulscribe off of Heroic Yogg-saron was better than Runescribed Blade off of Heroic Auriaya; this week the Runescribed Blade is better.</p>",
    "PostedDate": "2009-07-02T10:56:07.407-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "208111",
    "ThreadId": "61274",
    "Html": "<p>If you see changes in values between items in different versions make sure it isn't an issue of wrong item stats such as missing proc information or similar. Also for evaluating individual gear pieces keep in mind that the value depends on all other gear you have, so make sure the changes you're seeing is not due to that.</p>\r\n<p>If you see differences with exactly the same file and item data and there really were no patch changes&nbsp;then the changes are most likely&nbsp;a result of modeling improvements.</p>",
    "PostedDate": "2009-07-02T12:55:10.103-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "208119",
    "ThreadId": "61274",
    "Html": "<p>Try with 2.2.9; the default itemcache in 2.2.8 had a number of procs missing; I fixed that for 2.2.9.</p>\r\n<p>Also, as Kavan hinted at, a better way to choose what to bid, and how much to bid on it, is to use Upgrade Lists. See the Help page about that, for more details.</p>",
    "PostedDate": "2009-07-02T13:21:17.643-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]