[
  {
    "Id": "208158",
    "ThreadId": "61363",
    "Html": "<p>I have been looking for a way to add my own Weight Scale into Rawr. I sofar have it figured out, but the way to actually do it is not very user freindly. Is there plans to allow user inputed wieght scales? The default wieght scales are ok, but not in line with some of the other options from theory crafting from other groups. As a tool Rawr is a great tool, but it limits you to only predefind options and does not let you test other option out very well.</p>",
    "PostedDate": "2009-07-02T17:22:05.38-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "208164",
    "ThreadId": "61363",
    "Html": "<p>See the readme, and the help docs. Rawr <strong>does not</strong>&nbsp;use weight scales, so there's no way for you to add/customize weight scales.</p>",
    "PostedDate": "2009-07-02T18:01:27.513-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "208337",
    "ThreadId": "61363",
    "Html": "<p>This is quite a common misconception based on all the other tools out there. As Astrylian says Rawr does not use weight scales and attempt to work out what gear is best for that. Instead it attempts to work out actual formulae for each ability you have. Thus the only thing inside Rawr is a whole list of rules which model that particular class and spec.</p>\r\n<p>A rule is something like...</p>\r\n<p>For Enhance Shaman if your total expertise is 140 &amp; you have 3 talents in Unleashed Rage your chance of missing with Stormstrike is zero.</p>\r\n<p>There are hundreds of rules like this and what happens is for every item it simply runs through the total stats and produces a set of figures (dps, threat, healing etc). When comparing figures for new items (eg: the graph) it works out what the scores are for that slot empty, then works out what the scores are for each of the possible items you could fill that slot with and gets the score for that. Then it sorts them into order with the best at the top.</p>\r\n<p><br>At no point in this process does it use any weighting values, as they are entirely irrelevant to how best to improve your gear. If you want a program that uses weight scales you should stop using Rawr as it doesn't use them and never ever will. Its methodology is far more advanced than the rather primitive method of weight scales.</p>",
    "PostedDate": "2009-07-03T07:16:49.953-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "208504",
    "ThreadId": "61363",
    "Html": "<p>The interesting thing about this post is that MTRazeR seems to think &quot; I sofar have it figured out, but the way to actually do it is not very user freindly&quot;. Either something is broken or some part of the the user interface is so unfriendly that people think their adding weight scales, instead of adjusting real options models have available...</p>\r\n<p>MTRazeR, you want to explain how you think you can adjust (non-existing) weight scales? For what class?</p>\r\n<p>If you feel you cannot &quot;test other option out very well&quot;. Please explain what other options you want to be able to explore.</p>",
    "PostedDate": "2009-07-04T02:58:20.003-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "228147",
    "ThreadId": "61363",
    "Html": "<p>Wildebees, I would really like a way to enter a weight scale and have it calculated into the item tooltip as well. &nbsp;My reason why is simple actually...Rawr is great at the user interface, the item and armory pulling, etc. &nbsp;However for every single class I have used it for the calculations are just horribly wrong. &nbsp;<br><br>For example DPS DKs have a tool called DK sim that's really great, and is really quite accurate at modeling dps. &nbsp;Rawr's calculations disagree strongly with both DKSim and in game experience. &nbsp;If you want a specific example, check out the trinket valuations in Rawr for a blood dps DK who is well under the hit cap. &nbsp;Pyrite Infuser is a significantly higher dps choice than Darkmoon Card: Death...yet Rawr does not arrive at this conclusion.</p>",
    "PostedDate": "2009-08-26T14:36:55.333-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "228148",
    "ThreadId": "61363",
    "Html": "<p>You can't enter a weight scale into a program that flat out <strong>does not use them</strong>. It takes your actual strength, expertise, etc. and calculates the DPS.</p>\r\n<p>Your specific referencing to DPSDK means that the DPSDK model needs work to be more accurate in it's formulas, which Shazaer is currently doing.</p>",
    "PostedDate": "2009-08-26T14:40:51.187-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]