[
  {
    "Id": "208616",
    "ThreadId": "61492",
    "Html": "<p>Is there any way to update Rawr to a new version without completely losing all its old settings?&nbsp; Every time I install an updated version I have to completely re-select gem settings, available equipment, buffs, fight settings, etc.&nbsp; Is there something I'm completely missing?</p>\r\n<p>&nbsp;</p>\r\n<p>Any help would be greatly appreciated.</p>",
    "PostedDate": "2009-07-04T21:00:35.163-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "208618",
    "ThreadId": "61492",
    "Html": "<p>Many of the models are changed significantly between versions. Settings, talents, glyphs, etc. can be completely different between versions.</p>\r\n<p>A work-around to the issue would be to edit your character's xml file to match what would be it's new file structure. This may not be very easy if you aren't sure what you are doing. Try creating a blank character, throw some items on it with the settings on the options panel and save it. Back up your original character file then try and edit it to match the points until it will load in the new version.</p>",
    "PostedDate": "2009-07-04T21:12:54.263-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "208630",
    "ThreadId": "61492",
    "Html": "<p>Errr, Jothay, I don't know what you were trying talk about, but I don't think that was his question...</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>Malvenue, you can safely use the same character files between Rawr versions, 95% of the time. Only major version changes require new character files (and that's only happened twice in the history of Rawr). That includes all the gem settings, available equipment, buffs, fight settings, etc.</p>",
    "PostedDate": "2009-07-04T23:35:32.587-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "208645",
    "ThreadId": "61492",
    "Html": "<p>I think what he was asking was a different update system, rather than what we have now which is a complete download of the latest rawr version, an updater that simply updates the new bits, a bit like what happens with the blizzard clinet or even windows.</p>",
    "PostedDate": "2009-07-05T01:12:14.663-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "208649",
    "ThreadId": "61492",
    "Html": "<p>As Astrylian mentioned, I think the current system works fine for me.&nbsp; When you start a new version of Rawr for the first time, don't use the &quot;Download from Armory&quot; option.&nbsp; Rather, Go to FILE-&gt;OPEN and select the appropriate file containing your toon from the last version of rawr.&nbsp; Now, I do have 1 tip to share.&nbsp; I believe that Rawr defaults to saving toon files in its own&nbsp;directory (Rawr vx.x.x).&nbsp; So you may find that when you start v2.2.9 for the first time, your most recent saved files will be located in the Rawr v2.2.8 directory.&nbsp; If you happen to be a good house cleaner, then you may have already blown the Rawr 2.2.8 directory away before you downloaded the new version....and with it, all of your settings, etc.&nbsp; (<span style=\"text-decoration:underline\">Here comes the tip</span>) That is why I created a Directory called &quot;Character Profiles&quot;.&nbsp; I Save all my toons (use save-as) in&nbsp;my self-created&nbsp;&quot;Character Profiles&quot; directory and then with each new version of Rawr, I know exactly where they are.&nbsp; If I'm not mistaken, Rawr is even smart enough to know where they are between versions.&nbsp; I still need to use the File-&gt;Open path to get them loaded into the new version, but the default directory for File-&gt;Open seems to always be the &quot;Character Profiles&quot; directory I created.&nbsp; I guess Rawr is smart enough to leave such information in the system registry. :)&nbsp; Anyway, give it a try.&nbsp; Using a persistant storage location (self created &quot;Character Profiles&quot; Dir) for all your toon files is an easy way to preserve settings between version releases.&nbsp; GL!</p>",
    "PostedDate": "2009-07-05T01:29:23.313-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "209535",
    "ThreadId": "61492",
    "Html": "<p>I keep a copy of gemmingtemplates.xml as well.&nbsp; Then when I get a new Rawr I drop this xml file into the data folder.</p>\r\n<p>Honestly though this template file should be part of character file not part of settings in general.&nbsp; There is no reason people should have to manually do this step to keep their gem templates around between versions.&nbsp; At worst the file should live in some central windows location that it can just reuse each time a new version comes.</p>",
    "PostedDate": "2009-07-07T08:36:03.74-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "213457",
    "ThreadId": "61492",
    "Html": "<p>I agree completely.&nbsp; I don't have a problem with using a saved version of my character, but...</p>\r\n<p>When a new version of Rawr is released, it would be great if by installing it the&nbsp;old cache files were actually patched, instead of replaced, I bet that's hell in a handbasket as far as coding goes, but.... if you don't have a saved character profile, reselecting all of the equipment and gems you have available to you becomes a small nightmare.&nbsp; There's a lot of gems to pick out!&nbsp; Just a minor annoyance though.</p>\r\n<p>Otherwise, I love Rawr!</p>",
    "PostedDate": "2009-07-18T16:58:43.827-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "213469",
    "ThreadId": "61492",
    "Html": "<p><em>&quot;if you don't have a saved character profile, reselecting all of the equipment and gems you have available to you becomes a small nightmare&quot;</em></p>\r\n<p>Wtf? Why would you not have a saved character profile? How would switching versions change that, over just relaunching Rawr, if you're not saving the character file.</p>\r\n<p>If you're not saving your character files... Uhh... You should fix that.</p>",
    "PostedDate": "2009-07-18T18:09:51.343-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]