[
  {
    "Id": "208613",
    "ThreadId": "61491",
    "Html": "<p>Sorry if I sound insanely stupid, I've just searched around for the better part of an hour and haven't figured out how to do something. Again, forgive me if this is a very, very simple problem.</p>\r\n<p>&nbsp;</p>\r\n<p>1.For now all I really wanna do is compare various items that I find as I level. For instance, I'd like to compare my current ring, Seal of Argas, with the ring called &quot;Ring of Twilight Shadows&quot;. However, when I look in the upgrade lists I don't find the Shadows ring listed, which is really the only one I'm looking for as I simply want to compare these two items and nothing else. I've tried finding a way to compare what you have now to something in the database, but I don't know how. The only way I could think of would be to constantly change equips, log off (so the armory is updated), and then check the new value. That's not sounding too appealing, though. Can anyone tell me how to compare items on a 1v1 basis, or at least add new items to the comparisons list?</p>\r\n<p>2. I've heard that some versions, such as the elemental one for shamans, are out of date. I'm using the Healadin model; is this one out of date as well?</p>\r\n<p>3. What's a good stat to look at to see if your rating is better or not? Total healed, healed per mana, etc.?</p>",
    "PostedDate": "2009-07-04T20:39:46.377-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "208614",
    "ThreadId": "61491",
    "Html": "<p>Rawr is really intended for characters already at lvl 80 looking to increase their dps, healing, tank survival etc depending on the model. All of the stats are keyed for level 80 characters. For items that are lower level they are probably not in the item cache as someone who is already 80 would have replaced most of them although a lot of items between 70 and 80 are in the cache.</p>\r\n<p>Generally, my opinion is, at level 23 it really doesn't matter what gear you are wearing because in a level or two you are gonna replace it anyways. Rawr is intended for long term end-game purposes, where a decision between two different items affects your DPS in an end-game group or raid instance.</p>\r\n<p>For those that do need to know: You can add items to the database by going to the Item Editor (Tools &gt; Edit Items...) then click the Add button in the bottom left-hand corner. The new dialog can take multiple methods of getting the info but when you click OK, it will attempt to add the item from the Armory or Wowhead databases.</p>\r\n<p>Again, for a low level character, Rawr is not the right tool for you, and honestly you shouldn't worry too much about one piece over another when it's going to be replaced within a couple levels.</p>",
    "PostedDate": "2009-07-04T20:59:52.78-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "208629",
    "ThreadId": "61491",
    "Html": "<p>To mention one thing, Healadin is quite up to date, and very accurate. We're working on a page that explicitly says the status of each model, so that people don't have to wonder which models are accurate.</p>\r\n<p>And as Jothay said, Rawr's accuracy will always be way off for low level characters. You can still use it, but you almost certainly will better spend your time just playing; leveling is super easy.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-07-04T23:29:03.657-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]