[
  {
    "Id": "208705",
    "ThreadId": "61520",
    "Html": "<p>In the latest Tour Rawr video, more than a dozen options are shown that can be optimized.&nbsp; The only options shown for my Boomkin are:&nbsp; Overall Damage Rating, Sustained Damage Rating, and Burst Damage Rating.</p>\r\n<p>I'm running Rawr inside Parallels on an iMac Intel and also on PC with Windows.</p>\r\n<p>Optimizations and suggested gear seem to disregard Hit Rating and gemming.&nbsp; Example:&nbsp; Sets are suggested that are red gem only and yet have helms with metagem buffs active.&nbsp; This alone requires two blue gems and yet none exist.</p>\r\n<p>I'm a new user and hope to learn how I am mis-using this program.</p>\r\n<p>&nbsp;</p>\r\n<p>Eldorann, Antonidas, Amazons guild.</p>",
    "PostedDate": "2009-07-05T12:51:17.833-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "208722",
    "ThreadId": "61520",
    "Html": "<p>Optimizable parameters like that are model specific.</p>\r\n<p>However, they have nothing to do with what you describe. The Optimizer doesn't disregard Hit; quite the contrary. It optimizes your performance, including Hit's affect on it. If it's not gemming hit, either Hit does not provide the most value for you (unlikely, for a moonkin), or you already are hit capped.</p>\r\n<p>As for the metagem, check the box labeled &quot;Enforce Gem Requirements&quot; on the main screen, if you want Rawr to enforce gem requirements.</p>",
    "PostedDate": "2009-07-05T13:56:46.593-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "209084",
    "ThreadId": "61520",
    "Html": "<p>Still, I am curious.&nbsp; If I am hit-capped in my current gear, I assume that Rawr will create any new gear sets to assure hit-capping.&nbsp; Yes?</p>\r\n<p>Many upgrades suggested by the online optimizers would actually lower my HR to below capped.</p>\r\n<p>I am trying to fit into the discussion flow here so I can learn much more about how to improve my game.</p>",
    "PostedDate": "2009-07-06T11:59:17.717-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "209105",
    "ThreadId": "61520",
    "Html": "<p>The optimizer goes for the highest number for what it's optimizing for, regardless of whatever other numbers it may come up with. To remain hit capped, you have to set the option in the optimizer. If the option isn't there, your model isn't set up to do it in the optimizer (either by fault of the modeler, low priority of change, or it's actually not important to the model itself and intentionally left off).</p>",
    "PostedDate": "2009-07-06T12:26:11.03-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "209254",
    "ThreadId": "61520",
    "Html": "<p>If you just care about DPS, then you should just optimize DPS, and never care about being hit capped. Optimizer results/calculations have nothing to do with your current gear. If being hit capped provides the most DPS, then the optimizer results will be hit capped (assuming there are items/gems available to get you to the hit cap, of course).</p>",
    "PostedDate": "2009-07-06T19:27:21.87-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "209550",
    "ThreadId": "61520",
    "Html": "<p>Not to be beating a dead horse, but I wanted to briefly elaborate on using the optimizer.</p>\r\n<p>There's two major fields for optimizing. &nbsp;One is the number you're optimizing (typically for DPS, it's &quot;Overall&quot; which relates to DPS. &nbsp;For Tanking, it could be Overall, Survival, Threat, or Mitigation. &nbsp;For heals, well...I have no idea :P).</p>\r\n<p>The second is a constraint field. &nbsp;This is where you tighten the restrictions on gear sets (like if you want your health over 20k because of heavy raid-wide AOEs, or you want your frost resistance over 300 because of Hodir or Sapph).</p>\r\n<p>So, you need to decide what you want to optimize on. &nbsp;If you only care about your overall DPS, then set Overall. &nbsp;If you care about burst (say you're having trouble with Emalon's adds not dying fast enough), set the optimizing field to Burst. &nbsp;If you care only about sustained (say Hard-Mode General), set it to sustained.</p>\r\n<p>Then, you can decide if you want any restrictions. &nbsp;You *could* say you only want to consider sets that have a hit rating above a certain number. &nbsp;However, Rawr models take into account how often you miss, so by doing this you could find yourself hit-capped but actually doing less overall DPS (for instance, using a 16hit gem when you're only 1hit away from the cap when you could be using a red gem instead). &nbsp;Being hit-capped is NOT the be-all and end-all to maximizing your DPS, sometimes a better option is to make 98% of your hits more powerful and miss 2% of the time. &nbsp;A good example of this would be an Orc fury warrior with one axe and one non-axe (orcs get +5expertise in the hand that has an axe). &nbsp;My off-hand is currently not expertise capped, because it only affects my off-hand whirlwind and white hits; increasing my expertise to the cap is less valuable than increasing my strength.</p>\r\n<p>Sure, some people still prefer to remain hit-capped, because they don't like the risks that come with being below the hit cap. &nbsp;You can have 10 misses/resists in a row if you're only 1 rating below the cap (although this is rare), which could severely hurt your DPS on a given fight. &nbsp;But on the opposite side, you can be 3% below the cap and never miss in an individual fight, making those red gems far more valuable than the hit gems would have been. &nbsp;So yes, if you want to maintain the hit cap for this reason, you would set the constraint in the Optimizer, and Rawr will only show you an optimized gear set with those constraints set.</p>",
    "PostedDate": "2009-07-07T09:03:19-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "209552",
    "ThreadId": "61520",
    "Html": "<p>I've been messing with this for a little less than a week, and have found it to be incredible for setting up my Feral quickly. Is there a way to have the optimizer enforce meta requirements but not individual item gemming bonus'?</p>",
    "PostedDate": "2009-07-07T09:18:13.23-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "209596",
    "ThreadId": "61520",
    "Html": "<p>Check &quot;Enforce Gemming Requirements&quot;, which will require that the meta be activated in order for it to contribute to your DPS. &nbsp;By default, Rawr's Optimizer will only suggest gemming for a socket bonus if gemming for the socket bonus is an increase in DPS (ie, if you get more DPS by putting an orange gem in that yellow slot instead of a red gem).</p>\r\n<p>On the same page, Rawr will suggest NOT fulfilling the meta requirements if you can get more DPS by ignoring it. &nbsp;Although, I don't know of any situation where this will occur :) &nbsp;If you're optimizing your feral for maximum DPS, it will try a lot of combinations of your gear, what gems are in that gear, and thus what socket/meta bonuses you get, until it finds the best combination it can (the number of combinations is set by the Thoroughness scale, in case you were wondering: higher thoroughness, more combinations checked). &nbsp;So long as you have the Enforce Gemming Requirements box checked, rawr will optimize for maximum DPS as you're asking.</p>\r\n<p>If you want Rawr to ONLY consider certain gemming or enchanting (say for example you have already gemmed two +16agi gems in your chest and don't want to regem it), you can set that on a piece-by-piece basis. &nbsp;To do this, ctrl+click on the specific gemming you want to restrict to (for gems), and right-click on the diamond to restrict what enchants are available.</p>",
    "PostedDate": "2009-07-07T11:15:14.553-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]