[
  {
    "Id": "209569",
    "ThreadId": "61747",
    "Html": "<p>When I set up a fire build, Rawr shows me that Lightweave embroidery is giving way more dps than Greater speed (23 haste). This seems to contradict various posts I've been reading. If I compare this tailoring enchant vs the dps of other professions (JC, enchanting, leatherworking ... etc), it would seem that tailoring's Lightweave embroidery is a way better dps increase.</p>\r\n<p>Is Lightweave embroidery really better than Greater speed or there is something in the mechanics of Rawr I do not understand ?</p>",
    "PostedDate": "2009-07-07T10:06:40.037-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "209613",
    "ThreadId": "61747",
    "Html": "<p>I can't speak to the accuracy of the mage model, but just about every cloth DPSer I know loves tailoring for lightweave embroidery. &nbsp;It's up 33% of the time (15sec, 45sec cooldown) and gives 250SP, which amounts to 83.3 passive spellpower in the best conditions. &nbsp;If we assume that it's up every 50secs (2 casts at 2.5sec cast time after it falls on average), that makes it worth 75SP.</p>\r\n<p>75SP is budgeted at 64.2 item budget points, 23haste is 23 item budget points. &nbsp;Net effect of this enchant is ~41 item budget points.</p>\r\n<p>Jewelcrafting gives you an increase of 33.4 item budget points (39 spellpower). &nbsp;So yes, Lightweave Embroidery is a better DPS increase (about 8 spellpowers worth). &nbsp;However, you also consider that the best cloak enchant available is not a spellpower enchant, but a haste enchant (which is typically weaker than spellpower), and lightweave embroidery is worth even more.</p>\r\n<p>So to answer your question: yes, the Tailoring-only benefit is better than JC or Enchanting, and even more so for casters than for non-casters</p>",
    "PostedDate": "2009-07-07T11:57:25.743-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "209634",
    "ThreadId": "61747",
    "Html": "<p>(Anything you read that says Lightweave isn't absolutely amazing is probably outdated, and refering to the old version of it, which was relatively poor, compared to other profession benefits)</p>",
    "PostedDate": "2009-07-07T13:03:00.553-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "209665",
    "ThreadId": "61747",
    "Html": "<p>Basically they changed it to a 250 SP proc in 3.1. Before it was a 1000 Holy or Shadow damage proc (I forget which type off the top of my head). In 3.2 that proc is going to be buffed to 295 SP.</p>",
    "PostedDate": "2009-07-07T14:24:06.98-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]