[
  {
    "Id": "209797",
    "ThreadId": "61816",
    "Html": "<p>Hi,&nbsp;</p>\r\n<p>I may be wrong here as I'm new at tanking, but everything I've read at the moment seems to say that defense caps out at 540. When I run Optimize on my warrior I get advised to change gems etc over to +defense gems when the overall Defense rating is way above 540 (currently 570 on my last model). Aren't those +30 defense waisted and would be better put into Dodge or Stamina?</p>\r\n<p>&nbsp;</p>\r\n<p>I guess this is a long way of saying, shouldn't the defense optimisation stop at 540 and then look to other stats to improve?</p>",
    "PostedDate": "2009-07-08T00:43:20.043-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "209808",
    "ThreadId": "61816",
    "Html": "<p>540 is how much Def you need to become immune to crits.&nbsp; After that, Defense is worth a little less but it still increases your chance to dodge, block, parry and be missed.&nbsp;&nbsp; Still a very good stat.&nbsp;&nbsp; Especially with the just anounced changes to how much Agi &amp; Dodge Rating you need to increase your dodge by 1%</p>\r\n<p>How it ranks for warriors compared to Agi, Stam, Dodge etc. i'm not sure as my warrior is the baby of my 10 toons at just 62 :)</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-07-08T01:14:23.833-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "209937",
    "ThreadId": "61816",
    "Html": "<p>Defense is still a decent stat for Warriors even after 540, as it adds to all avoidance stats. Depending on your available gear, you may end up with quite a bit higher than 540, although this value naturally gets closer to the 'cap' in Ulduar gear as the available Defense Rating on items is actually quite low.</p>\r\n<p>If you set up the optimizer, you should probably always set up the criteria of % Chance to be Crit of &lt;= 0 to make sure the 540 cap is observed, but if you optimize beyond that for Burst Time, Overall Rating, or whatever you like it is quite possible you will be over 540 def in many cases.</p>",
    "PostedDate": "2009-07-08T07:06:38.957-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "209980",
    "ThreadId": "61816",
    "Html": "<p>OK - thanks for that. Very useful :)</p>",
    "PostedDate": "2009-07-08T08:20:32.497-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]