[
  {
    "Id": "210545",
    "ThreadId": "62029",
    "Html": "<p>Much thanks for all the work done on this tool. I am consistently the top dps in many raids and I attribute it &nbsp;to the gear/gem/enchant selection that I get from Rawr. This tool is awesome!</p>\r\n<p>There are a couple of features that would really make Rawr over the top for me, and maybe someone would like to implement these:</p>\r\n<p>First of all, on my mage, my talent spec is not one of the predefined specs, and as I upgrade to each new version of RAWR I have to create it all over again, (to show up in the dropdown) could this be carried over as part of the character? &nbsp;Is there a file I can just copy over? &nbsp;Would there be a point where the file is not compatible with the new version?</p>\r\n<p>Second, I am dual spec'ed arcane and frost, and in order to see which gear I need to equip as each spec, I have to set the talents then go swap around the glyphs, then run the optimizer, then swap everything back. Could you make it easier to track dual-specs so I could switch between the specs and glyphs with a drop down or radio button, and then run the optimizer for that build?</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-07-09T11:59:18.177-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "210557",
    "ThreadId": "62029",
    "Html": "<p>For talents you can just copy over Talents.xml, it should be compatible most of the time unless there are big changes to talent trees (like a completely new talent added or something similar). For two-spec situation I would suggest using two separate xml files for that. You can use the batch tools to help you organize several files, check the help on that.</p>",
    "PostedDate": "2009-07-09T12:20:12.317-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "210575",
    "ThreadId": "62029",
    "Html": "<p>Ah you mean using two seperate character xml files. I didn't think of that. Good call :)</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-07-09T12:51:46.913-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]