[
  {
    "Id": "211263",
    "ThreadId": "62249",
    "Html": "<p>Hi, new to Rawr and finding this an really useful tool.&nbsp; Just wanted to find out more about the mechanics behind the tool.</p>\r\n<p>1.&nbsp; Current character is a Boomkin that is not yet hit-capped (339 hit rating) and have set up buffs to indicate no raid buffs that improve hit.&nbsp; Given that I'm not yet hit-capped, I would have imagined Rawr would prioritize gear with hit than gear without.&nbsp; Can someone please explain why Rawr rates:<br>&nbsp; &nbsp;&nbsp; a. Torque of the Red Dragonflight gemmed with a Rigid Autumn's Glow (61&nbsp;sp, 43 int, 30 crit, 16 hit and 15 mp5) over<br>&nbsp;&nbsp;&nbsp; &nbsp;b. Thunderstorm Amulet (65 sp, 43 int, 38 spi, 28 hit)?<br>The Torque reduces my hit rating by 12, reduces my effective sp by ~10 (incl. the value of sp from the add'l 38 spirit), and gives me 30 crit in return.&nbsp; Is crit that valuable?&nbsp; How does Rawr weight stats for Boomkins?</p>\r\n<p>2.&nbsp; On a related note, what is the meaning of sustained dmg vs. burst dmg?&nbsp; Instinctively, I'd imagine the Torque with the add'l crit has higher burst dmg, but the burst dmg score in Rawr is only 91, while the Thunderstorm has a higher burst dmg score of 103.</p>\r\n<p>Btw, if my answers can be found in a document somewhere, happy if you can just point me there.&nbsp; Thanks very much in advance</p>\r\n<p>p/s: Where/how can I&nbsp;find/enable the Wintergrasp meta-gems?&nbsp; Can't seem to find those when creating a custom gemming template.</p>",
    "PostedDate": "2009-07-12T18:23:35.473-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "211273",
    "ThreadId": "62249",
    "Html": "<p>Rawr doesn't use any stat weights, see the readme for details. It calculates differences in overall performance. You can add whatever items you want, as well; that's also in the readme.</p>\r\n<p>Regarding the specific example in question, I have heard of one issue that dopefish (the moonkin dev) is looking into, where Heroic Presence is always counted as active in Rawr.Moonkin, but I don't know if that's true or not. Dopefish, let us know what you find in that regard.</p>",
    "PostedDate": "2009-07-12T19:34:42.4-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "211299",
    "ThreadId": "62249",
    "Html": "<p>339 hit rating is &quot;not yet capped&quot;?&nbsp; If you have Imp Faerie Fire or Misery enabled, that's way over capped, even without the possibility of a bug with Heroic Presence.&nbsp; That puts it as 10 SP vs 30 crit, which works out to be slightly in favor of the crit.&nbsp; Also, sustained damage is damage with respect to mana constraints; burst damage is the amount of damage you can dish out without caring about mana.&nbsp; The fact that it rates Torque higher than Thunderstorm despite the lower burst damage score tells me Rawr is telling you you're running out of mana, which means the mp5 is very highly valued.</p>",
    "PostedDate": "2009-07-12T22:51:42.29-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "211321",
    "ThreadId": "62249",
    "Html": "<p>Thanks guys - quick responses.</p>\r\n<p>1.&nbsp; Astrylian - thanks for the pointer.&nbsp; Found the Wintergrasp gems and added them.&nbsp; Not sure why I couldn't find them before.&nbsp;</p>\r\n<p>2.&nbsp; Dopefish - thanks for the explanation re: mp5.&nbsp; Probably don't notice the OOM because I'm usually lucky enough to get some form of mana return in my raids.&nbsp; Let me play around with it to see if assuming I either get a Mana Stream or Blessing of Wisdom buff affects gear choice.<br>On spell hit, just to clarify the only buffs I have included is Imp. Moonkin, Imp. MotW.&nbsp; So _no_ Imp. FF nor Misery.&nbsp; Current Hit% is shown as 16.92% (incl. inherent Balance of Power +4%) - so not yet capped.&nbsp; Practically, this is also the case - I don't see many Boomkins that spec Imp FF, nor that many SPriests.&nbsp;</p>\r\n<p>Thanks again for all the help and in advance for any more guidance.</p>",
    "PostedDate": "2009-07-13T00:00:25.803-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "211361",
    "ThreadId": "62249",
    "Html": "<p>Uhh, since Imp FF provides raidwide 3% spell hit and a personal 3% crit buff, there's no reason not to take it.&nbsp; Back to the mp5 discussion, though, if you're absolutely certain you're not running OOM, then sort items by Burst Damage and it will give you an idea of what items will give you the most bang for your buck.&nbsp; I do recommend some caution doing this, as the mana usage calculations are pretty decent these days.</p>",
    "PostedDate": "2009-07-13T07:15:04.94-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]