[
  {
    "Id": "211239",
    "ThreadId": "62241",
    "Html": "<p>I am a new user and am just getting to know rawr so apologies in advance...I am wondering about gear rankings for my priest.&nbsp; I am running rawr as a&nbsp;raid healing Holy Priest and am confused as to some of the recommendations.&nbsp; For instance, I have 4 capes: Shawl of the Caretaker, Drape of the Spellweaver, Disguise of Kumiho, and Cloak of Kea Feathers.&nbsp; In terms of sustained HPS they are ranked in this order: 1) Disguise of K, Cloak of Kea, Drape of the SW, and last is Shawl of the C.&nbsp; I would have thought that the two cloaks with MP5 would come before the two w/o.&nbsp; Can someone explain the logic?&nbsp; I apologize in advance if this is a &quot;noob&quot; or &quot;stupid&quot; question.</p>\r\n<p>I would add that I am a C# programmer who has a Elemental Shaman...saw in the issues you may be looking for help there...</p>\r\n<p>&nbsp;</p>\r\n<p>Kind regards, Firethaurn</p>",
    "PostedDate": "2009-07-12T14:59:25.213-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "211241",
    "ThreadId": "62241",
    "Html": "<p>Its hard to give you an exact answer without knowing your entire Rawr configuration, but the following things may decide it:</p>\r\n<p>- &nbsp;Spirit also gives extra spellpower as holy. This increases your healing / mana, giving more Sustained HPS.</p>\r\n<p>- Depending on how much time you spend outside FSR, Spirit increases in value. At higher gear levels, Spirit is better than MP5 nearly no matter what, atleast until 3.2.</p>\r\n<p>- &nbsp;Intellect increases your Sustained HPS a lot depending on your configuration.</p>",
    "PostedDate": "2009-07-12T15:17:29.35-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "211244",
    "ThreadId": "62241",
    "Html": "<p>Thanks for the quick reply!!!</p>\r\n<p>I have high level gear...mostly 219/226 ilvl&nbsp;with a couple 213's.&nbsp; I have it set to 95% of fight spent inside the FSR, but am tempted to say 100%.&nbsp; Almost all the suggestions regarding regemming were to replace existing gems with +intel so that makes sense.&nbsp; However, as regardless of your mana pool size you will go through it w/o in-FSR-regen I do not fully understand why intel is so important to Sustained HPS.&nbsp; Can you explain that for me or point me to an article that does?</p>",
    "PostedDate": "2009-07-12T15:38:28.207-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "211260",
    "ThreadId": "62241",
    "Html": "<p>Sustained HPS is based on what you can do when you are out of mana, except that your starting mana is converted to a constant source of MP5 based on fight length. So more starting mana and/or different fight length changes Sustained HPS.</p>",
    "PostedDate": "2009-07-12T17:48:03.347-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "211433",
    "ThreadId": "62241",
    "Html": "<p>Also remember that replenishment is based on your mana pool size, thus int gives a tripple effect: larger starting pool, more spirit regen (spi * sqrt(int))&nbsp; and more MP5 from replenishment.</p>\r\n<p>If the holypriest model works like the tree model, there is also the possibility that with a short fight and lots of buffs, you could get into the situation that you cannot go OOM. Tree would then report sustained HPS to be the same as burst HPS. In which case MP5 becomes meaningless and spellpower/crit/haste become the import values for both burst and sustained.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-07-13T11:59:21.193-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]