[
  {
    "Id": "212229",
    "ThreadId": "62527",
    "Html": "<p>The choice of gems by Rawr to create an upgrade set seems an imprecise process.&nbsp; This is probably because I know nothing about it.</p>\r\n<p>I try to match gems to sockets and also to include hit rating to be capped.&nbsp; There is prior discussion that sometimes Hit Capping is not required to have high DPS (which is unbelievable but apparently true) and that it is possible to socket other colors for greater SP.</p>\r\n<p>Activating the meta-gem for extra DPS requires two blue gems to activate the meta-socket.&nbsp; Checking the &quot;Enforce gem requirements&quot; will enforce the two blues for the meta _AND_ also require all gems to match the sockets.</p>\r\n<p>What option exists for enforcing the meta-gem to become active while simultaneously giving highest SP?&nbsp; If I have 5 sockets, how do I enforce only two of them to be blue&nbsp; Only two of them need to be blue while the others need to buff SP (usually red).</p>",
    "PostedDate": "2009-07-15T10:49:24.263-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "212280",
    "ThreadId": "62527",
    "Html": "<p><em>&quot;Checking the &quot;Enforce gem requirements&quot; will enforce the two blues for the meta _AND_ also require all gems to match the sockets.&quot;</em></p>\r\n<p><em><span style=\"font-style:normal\">No it doesn't. Enforce Gem Requirements has nothing to do with matching socket colors. Socket colors are not requirements.<br>&nbsp;</span></em></p>\r\n<p><em><span style=\"font-style:normal\">You should check Enforce Gem Requirements, and then let the optimizer and the gemming templates provide the gemmings that produce the highest performance. Whether or not that is hit capping or not depends on whether hit capping provides the highest DPS for your class/spec. (ie, it doesn't for Cats, it does for Mages, etc). Also remember that 'hit capping' may not always be fully accurate, as you could be 1 under the cap, and it's not worth it to use a full gem for that 1hit,</span></em></p>",
    "PostedDate": "2009-07-15T12:50:05.937-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "215355",
    "ThreadId": "62527",
    "Html": "<p>A few comments:</p>\r\n<p>- I, like the original poster, thought the checkbox was referring to enforcing all socket bonuses, not just the meta gem</p>\r\n<p>- The optimizer seems broken with respect to meta gems unless the checkbox is clicked.</p>\r\n<p>- The DPS ratings calculator doesn't seem to account for the meta gem bonus</p>\r\n<p>On my toon, my gear/gemming/etc is optimal.</p>\r\n<p>If I don't check the box and run the optimizer, my DPS goes up by 3 points (6185 to 6188) by replacing a prismatic enchanted tear with a deadly monarch.&nbsp; Doing this disables my meta bonus.&nbsp;&nbsp; I'm certain that +8agi/+8crit is not worth more than +6str/+6agi and +21 agi, +3% crit damage together.</p>\r\n<p>If I do check the box and run the optimizer, my DPS stays the same (and non-substantitive changes are suggested...i.e. moving the enchanted tear to another piece of equipment by swapping the two gems that has no impact on total gems or socket bonuses)</p>\r\n<p>&nbsp;</p>\r\n<p>My toon is Mendol on Garrosh, a feral druid.</p>",
    "PostedDate": "2009-07-23T09:03:09.4-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "215364",
    "ThreadId": "62527",
    "Html": "<p>That's what the checkbox is for, you're not describing anything that isn't working as intended as far as I can see.&nbsp; If you leave it unchecked, it assumes that the meta is always active, regardless of gems.&nbsp; It might be worded a little vaguely, but the tooltip makes it quite clear exactly what the box does.</p>",
    "PostedDate": "2009-07-23T09:22:58.777-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "215372",
    "ThreadId": "62527",
    "Html": "<p>Out of curiosity, when (and why) would you ever want that not checked, and how many people are following RAWRs &quot;wrong&quot; advice as the option isn't enabled by default?</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-07-23T09:31:46.13-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "215380",
    "ThreadId": "62527",
    "Html": "<p>I generally leave it unchecked unless I'm using the optimizer.&nbsp; It allows you to separate the piece of gear that activates your meta from the meta itself.&nbsp; If a potential upgrade for the slot with your one blue gem has no socket, Rawr would rank the upgrade as being terrible even though it's better if you're just looking at the stats on the two pieces.&nbsp; Once you've figured out the pieces you want to wear, you can then go back and figure out where to put your meta activating gem(s).</p>",
    "PostedDate": "2009-07-23T09:58:00.483-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "215383",
    "ThreadId": "62527",
    "Html": "<p>That's far from &quot;wrong&quot; advice. You want to check/uncheck it typically when seeing if 'odd' looking ratings are due to metagem bonuses, or if you are trying to compare items in a general sense, not specific to your character. We've considered making that the default for a long time, and may make that switch with Rawr3. As is, it was made default inactive, due to the deluge of 'zomg its broken its saying blah blah blah'.</p>",
    "PostedDate": "2009-07-23T10:09:52.13-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "215397",
    "ThreadId": "62527",
    "Html": "<p>A visual indication when an item is rated abnormally high due to it activating the meta (or a set bonus) might help the &quot;zomg its broken&quot; posts.&nbsp; Perhaps there could be a new points category for indirect bonuses that would be displayed at the end of the bar for the points the item itself grants.</p>",
    "PostedDate": "2009-07-23T10:41:31.033-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "215428",
    "ThreadId": "62527",
    "Html": "<p>That information clears up some of my confusion.&nbsp;&nbsp; My personal opinion would be to rename it to 'disregard meta gem bonus/requirement' and have it default unchecked.&nbsp; I also like the 'indirect bonus' idea as a way to convey the information.</p>\r\n<p>Though I still scratch my head why it&nbsp;would be beneficial for <span style=\"text-decoration:underline\">the optimizer</span> to ignore the meta gem bonus/requirement.&nbsp; It's whole purpose in life is to tell you what to do with what you've got to min/max.&nbsp;&nbsp; The meta gem bonus is integral to that answer and ignoring it makes no sense.</p>\r\n<p>&nbsp;</p>\r\n<p>On a semi-related topic, I seemed to have been required to add normal prismatics (enchanted pearl and tear) to the gem templates before the optimizer would consider them.&nbsp;&nbsp; Is that expected?</p>",
    "PostedDate": "2009-07-23T11:29:21.507-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "215493",
    "ThreadId": "62527",
    "Html": "<p>Note that it's not just metagem requirements that that checkbox enforces; that means uniqueness of gems as well. I agree that there's not much point for the Optimizer to not use requirements, but we leave it for consistency. Otherwise users would have it unchecked, optimize, and see different results in the optimizer window, than the main window. I'm leaning more and more toward just defaulting it to checked for Rawr 3.</p>",
    "PostedDate": "2009-07-23T14:57:58.077-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "215516",
    "ThreadId": "62527",
    "Html": "<p>Actually, a visual display on the bar of how much of the items score is due to activating a meta or set bonus would be quite interesting/useful.&nbsp;&nbsp; It would make it easier to determine which set pieces has the highest score and which to use to activate bonuses (optmiser can do this of course, but it means you wouldn't have to mark future upgrades as available to work this out).</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-07-23T16:04:39.553-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "215593",
    "ThreadId": "62527",
    "Html": "<p>I've noticed a bug lately where Rawr is allowing me to have 4+ Dragons Eyes equipped, regardless of the state of the &quot;Enforce Gem Requirements&quot; checkbox.</p>\r\n<p>This isn't affecting Optimizer, but it is affecting what happens as I play with the dropdown gear selection tool.</p>\r\n<p>Is anybody else noticing this?</p>",
    "PostedDate": "2009-07-23T21:53:31.957-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "215604",
    "ThreadId": "62527",
    "Html": "<p>It always 'allows' you to, but it shouldn't give any stats from the 4th+ one. If you can make a character that gets stats from 4+, please post it in a new issue.</p>",
    "PostedDate": "2009-07-23T22:45:40.353-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "215606",
    "ThreadId": "62527",
    "Html": "<p>Yes sorry, let me elaborate. &nbsp;It's calculating the stats from 4 or 5 (and in fact, it is telling me that I get a DPS increase when I replace the 16str gem in my legs with a 27str gem in my legs).</p>\r\n<p>I'll post an issue of it with a saved character this weekend (as I'm no longer on my rawr machine)</p>",
    "PostedDate": "2009-07-23T22:48:43.657-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "238155",
    "ThreadId": "62527",
    "Html": "<p>I have two questions about gemming. First, I thought that checking 'enforce gem requirements' meant it would only select gems that would match the sockets, and give you the best results. Apparently, from what I&quot;ve read above, it doesn't do that.&nbsp; I always match colors to slots, so I can get the socket bonus. It seems silly to me to not take advantage of that bonus.&nbsp; Certainly, with meta gems, this is even more important.&nbsp; So the results I'm getting from RAWR are leading me astray in that respect.</p>\r\n<p>Secondly, I'm a healer (resto druid), so it seems strange to me that RAWR is suggesting I use +spell damage in all of my sockets.&nbsp; It's my understanding that intell and MP5 should be a higher priority than spell power for healers. Am I misunderstanding that premise?</p>\r\n<p>Thanks for any suggestions, or clarifications on this you are willing to make.</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-09-23T23:40:10.517-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "238156",
    "ThreadId": "62527",
    "Html": "<p>Well, to be blunt, yeah, both of your premises are wrong. Matching socket bonuses isn't always worth it. Stacking int and mp5 is only good for healers when they need the mana, and have no trouble with healing burst damage. Spellpower increases your efficiency, giving letting you cast fewer heals (ie, save mana), to do the same healing, as well.</p>",
    "PostedDate": "2009-09-23T23:45:33.557-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "238270",
    "ThreadId": "62527",
    "Html": "<p>Connie, to make a simplistic comparison... Let's say you're gemming for spellpower, and&nbsp;have a healing piece with a blue socket and a +5 spellpower socket bonus. It would make more sense to put in a Runed Cardinal Ruby (23 SP) than satisfying the socket bonus (5 SP) with a Glowing Dreadstone (12 SP, 15 stamina).</p>\r\n<p>&quot;Enforce Gem Requirements&quot; will satisfy your meta gem. Rawr will then get the most it can out of your gems. It will use your sockets when that results in&nbsp;a better score than ignoring it.</p>",
    "PostedDate": "2009-09-24T05:07:50.423-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]