[
  {
    "Id": "212959",
    "ThreadId": "62736",
    "Html": "<p>Hi,</p>\r\n<p>what exactly is the upgrade list telling me? A I understand it the list should equal my best possible gear-combination, right?</p>\r\n<p>I tried it with my feralcat and equipped all the best items from the upgrade list but one. Now shouldn't the &quot;normal&quot; gear window recommend me this missing item as the best item for that slot as well? Because nothing else is different.</p>\r\n<p>I used maximum thoroughness btw.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-07-17T03:23:38.923-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "212983",
    "ThreadId": "62736",
    "Html": "<p>Please check <a href=\"http://rawr.codeplex.com/Wiki/View.aspx?title=GearOptimization\">http://rawr.codeplex.com/Wiki/View.aspx?title=GearOptimization</a>, upgrade list does not give best possible gear-combination, it tells you how much of an overall improvement you could achieve by getting each individual item.</p>",
    "PostedDate": "2009-07-17T04:36:23.197-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "213242",
    "ThreadId": "62736",
    "Html": "<p>Thanks for that question, because Kavan's answer was a help file I needed to find :)</p>\r\n<p>This was a concept I had trouble with long before Rawr... The short answer is that upgrades for what you currently have may not always be upgrades as your gear changes. For a simple example, as a kitty, you may be below hit cap. Your upgrade list would include items with hit. If you equipped all the top-in-slot upgrades on the list, you may be suddenly far above hit cap. On the other hand, if you're at or above hit cap, the opposite would be true - your list of upgrades would have few or no items with hit. &quot;Upgrading&quot; to the best items in each slot would leave you with no hit whatsoever.</p>\r\n<p>The upgrade list is the best possible upgrade to what you are CURRENTLY wearing. If you roll over each option on the list Rawr shows you, near the bottom of the tool-tip. the rest of the set it wants you to wear with that item.</p>\r\n<p>This is how I do it: optimize, run an upgrade list. Go through the upgrade list and mark items I can readily get. Run optimize again, then another upgrade list. The upgrade list will change each time, at least a little bit. Rinse and repeat until there is nothing on the upgrade list easily attainable, then I go in-game and buy/enchant/gem whatever I need to to make that set.</p>\r\n<p>As I get a few upgrades, I mark them as available, then every so often I'll run optimize and upgrades again, and adjust whatever is needed.</p>",
    "PostedDate": "2009-07-17T16:54:22.29-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "213248",
    "ThreadId": "62736",
    "Html": "<p>However, the help file doesn't answer the specific question I still have...</p>\r\n<p>When I'm looking at an item drop in-game, where is the best place to look on Rawr to see if I should roll on that item or not? I was using the upgrade list as my point of reference. Then one night I selected everything, and ran an optimization for my best possible gear-set... and many of those items were not on my current upgrade list, nor are they on the main panel as a direct upgrade.</p>\r\n<p>I would rather hate to pass up a best-set item because I'm not looking at the right list at the time. My husband suggested using the &quot;best possible&quot; as the main reference and to figure upgrades based on the items between the current and best item. The best I can figure is to use the upgrade list, optimize and run new upgrade lists frequently (short-term), and keep the &quot;best set&quot; list handy on the side (long-term).</p>\r\n<p>Is there really any good answer for this? Short of finding Ms Cleo and asking her? :-)</p>",
    "PostedDate": "2009-07-17T17:06:58.503-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "213255",
    "ThreadId": "62736",
    "Html": "<p>Upgrade list will not be able to tell you that getting an item is a good idea if it by itself is not good, but together with another item that you also don't have yet it would give you a set bonus for example.</p>\r\n<p>In terms of deciding whether to roll on something or not I would suggest the following. Find the best set from all items that you might be able to potentially get. This way you know if you were able to get anything you wanted and had perfect luck with drops which items are good to aim for. Most of these will also show on the upgrade list but some might be missing as for example in cases where item by itself is not that good but can activate a strong bonus. In addition to this maintain an updated upgrade list based on your current gear. Make sure to mark all the gear that you currently have as available and not just what you're currently wearing. That way the optimizer has a lot more room to properly evaluate an item by swapping other items around. If you don't have an upgrade list ready you can also right click an item and select evaluate upgrade and it will run upgrade evaluation just for that item. If something is on upgrade list you know getting it will be an improvement currently, but it might not be in the best obtainable set. But then again depending on luck you might never get all items in perfect set so alternatives are good also.</p>",
    "PostedDate": "2009-07-17T17:31:15-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "213260",
    "ThreadId": "62736",
    "Html": "<p>Just to clarify,</p>\r\n<p><em>&quot;The upgrade list is the best possible upgrade to what you are CURRENTLY wearing.&quot;</em></p>\r\n<p>This is wrong. It's the upgrades to what you currently <strong>have available</strong>. So if you're hit capped, it <strong>still will</strong>&nbsp;show items with hit, because they can allow you to swap other items and remain hit capped.</p>",
    "PostedDate": "2009-07-17T17:56:22.93-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "219921",
    "ThreadId": "62736",
    "Html": "<p>Sorry, but I still don't get it. What's the difference then between the Comparison-option &quot;Direct Upgrades&quot; and the Upgrade List? And how can I find the best possible gear combination with Rawr if not with the upgrade List?</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-08-05T11:37:09.357-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "219937",
    "ThreadId": "62736",
    "Html": "<p>&quot;best possible gear combination&quot; use the Optimizer</p>\r\n<p>Upgrade List (from the same screen as the optimizer) is to build an upgrade lsit using everything you have availble</p>\r\n<p>Direct Upgrades is against what you are wearing (keeping hit items in the same slots, etc)</p>\r\n<p>Direct Gear Comparison is what you are wearing this item vs that item</p>",
    "PostedDate": "2009-08-05T11:56:50.97-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "219939",
    "ThreadId": "62736",
    "Html": "<p>Direct Upgrades is just that, direct. As in, &quot;if you equip this item (and make no other changes), it will increase your performance by X.&quot;</p>\r\n<p>Build Upgrade List is much more intelligent. What it's saying is, &quot;if you had this item available, your optimal set of gear would be X higher performance than your current performance.&quot;</p>\r\n<p>&nbsp;</p>\r\n<p>Here's an example: You're exactly at hit cap, and are using a 16 hit rating gem. You have a ring with 10 spell power on. There's also another ring that has 9 spell power and 16 hit rating. Direct Upgrades would not show the new ring as an upgrade, since it's not an upgrade by itself. The Upgrade List would show that it is actually a significant upgrade, because you can equip it, then swap your 16hit gem for a 19sp gem.</p>",
    "PostedDate": "2009-08-05T11:59:54.123-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "221103",
    "ThreadId": "62736",
    "Html": "<p>My understanding is that the upgrade list feature was broken in the last few releases. Is it working again in the latest (Aug. 6) release?</p>\r\n<p>Thanks.</p>",
    "PostedDate": "2009-08-08T08:10:06.36-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "221127",
    "ThreadId": "62736",
    "Html": "<p>Ummm? it was broken?</p>\r\n<p>no....</p>\r\n<p>Some models have experienced crashing issues when a slot is empty or similar things but most of that has been fixed if that's what you mean.</p>",
    "PostedDate": "2009-08-08T11:17:24.167-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "221735",
    "ThreadId": "62736",
    "Html": "<p>The problem I'm running into is that running the optimizer to generate the upgrade list generates a list of every piece of gear that would be an upgrade, regardless of whether I'd marked it as available.&nbsp;</p>\r\n<p>For instance, if I import my character from armory, my equipped items will be marked as available in their respective slots. If I then mark, e.g., 4 bracer items as available upgrades with the green diamond and run the upgrade list, the resulting list includes the 4 items I chose along with all of the items I didn't mark, and all of the items that would be upgrades in slots I haven't even messed with.&nbsp;</p>\r\n<p>I thought I'd read a post on the forum about the same issue, which said this was a known problem but should be fixed in an update.</p>\r\n<p>If it's not broken, I must be using the tool the wrong way, or just don't understand how it works.&nbsp;</p>\r\n<p>Thanks,</p>\r\n<p>Nirgal</p>",
    "PostedDate": "2009-08-10T14:51:25.52-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "221750",
    "ThreadId": "62736",
    "Html": "<p>Yeah, you're using it backwards. See the Help page on gear optimization. The Upgrade List is for finding the upgrade value of what you <strong>don't</strong> have available, from what you <strong>do </strong>have.</p>",
    "PostedDate": "2009-08-10T15:45:06.423-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "221752",
    "ThreadId": "62736",
    "Html": "<p>Running an <em>Optimize</em> routine will do what you're looking for - that is, get the best setup from what you've marked as available.</p>\r\n<p>Running an <em>Upgrade List</em> routine will go through each item that is in the cache, and, along with what gear you have currently marked as available, try and run an Optimize with every single one of them.&nbsp; It then outputs a list, which is what you see.&nbsp; This list indicates how much of a true upgrade each item would be, given the gear you have available to optimize around it.&nbsp; This is a sort of list that you would generate before you walk into a dungeon, to see what gear you would like to shoot for.</p>\r\n<p>The Optimize window contains both tools, but don't confuse the two as the same.&nbsp; The Optimize is on the left, the Build Upgrade List is on the right.</p>\r\n<p>&nbsp;</p>\r\n<p>[edit] Dang it, beat me to it.</p>",
    "PostedDate": "2009-08-10T15:48:19.167-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]