[
  {
    "Id": "216041",
    "ThreadId": "63528",
    "Html": "<p>The 3.2 calculations for frost dual wield dks are kinda wonkie. Off-hand damage isn't calculated correctly (it doesn't look like the 50% OH damage penalty is being applied). Nerves of cold steel is a dps increase with a two handed weapon equipped. Also, just switching over to 3.2 calculations is a dps buff for frost strike, when in the new patch frost strike damage is getting nerfed.</p>\r\n<p>&nbsp;</p>\r\n<p>Anyway, this tool has been valuable for helping me make educated gear choices, and I look forward to it's continued improvement.</p>",
    "PostedDate": "2009-07-25T14:36:37.88-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "216059",
    "ThreadId": "63528",
    "Html": "<p>The 3.2 calculations are far from complete; they're more or less just hacked in for the time being. The interaction between the OH penalty, NoCS, and sigils acts pretty funky in-game, I'm not sure how accurately that's being reflected. Frost strike sigil is also almost certainly counting as two applications of +380 damage rather than +113, which will not change until the item's entry on wowhead/armory changes (ie, 3.2 is released).</p>",
    "PostedDate": "2009-07-25T17:03:51.867-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "231296",
    "ThreadId": "63528",
    "Html": "<p>After opening up an existing dual weilding DK in the new 2.2.14 and without making a single adjustment to the saved file my dps has shot up from ~4400 to 6800!!&nbsp; I know i'm not as tight as i'd like to be in my rotations in game, but I cant be that far from my theroycrafted limits.&nbsp; I would guess i'm 10-15% below optimal dps.&nbsp; Were these kinds of numbers expected with the changes that were made to dual weild dks this release or is something funky going on?</p>",
    "PostedDate": "2009-09-04T15:26:33.647-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "231360",
    "ThreadId": "63528",
    "Html": "<p>2.2.14 currently has a somewhat substantial bug in frost strike damage; the displayed amount may be as much as double the appropriate value. This major (and a couple other minor) bugs are resolved in the code base, and will be fixed in the next release.</p>",
    "PostedDate": "2009-09-04T20:10:43.223-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]