[
  {
    "Id": "217706",
    "ThreadId": "64034",
    "Html": "<p>I've historically used Enhsim and tried Rawr last night as a result of this WoW Shaman thread: <a href=\"http://tinyurl.com/nkxxph\">Sim'ing shows caster weapons best for Enh?</a>. &nbsp;Through the Rawr inteface, with the exception of Wraith Strike, it favors melee weapons. &nbsp;However, if you browse to Relative Stat Values and Export -&gt; View Weighted Upgrades on Wowhead, caster weapons will be ranked above and beyond melee weapons. &nbsp;Loot Rank shows similar data to Wowhead (i.e., favoring caster weapons). &nbsp;This verifies my results with Enhsim.</p>\r\n<p>Where is the system breaking down? &nbsp;I thought I was seeing the same phenomenon from my Pawn reading while in game. &nbsp;This was a week or so ago when and prompted my dive into this whole &quot;caster weapon&quot; vs. &quot;melee weapon&quot; issue.</p>\r\n<p>As an aside, Rawr does not compute MH/OH DPS as a relative stat (like Enhsim). &nbsp;DPS of a weapon is important all else being equal. &nbsp;Regardless, with or without DPS as a factor in computing relative stats / pawn scales / weighted upgrades, sources external to Rawr show caster weapons to reign supreme.</p>\r\n<p>- Code-for-fun</p>",
    "PostedDate": "2009-07-30T11:43:02.053-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "217730",
    "ThreadId": "64034",
    "Html": "<p>You're seeing caster weapons appearing on the results on lootrank/wowhead precisely because MH/OH dps is not a 'stat' that Rawr exports; it's valued on its own, independant of stats. Please read the gigantic warning on the Relative Stat Values chart. Use Rawr, not wowhead/lootrank when you care about accuracy.</p>",
    "PostedDate": "2009-07-30T12:45:00.897-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "217755",
    "ThreadId": "64034",
    "Html": "<p>You may also be seeing a caster weapon because it may be an upgrade. &nbsp;When comparing caster to normal in Rawr, pay special attention to the DPS area of enhance. &nbsp;Look at the numbers before and after, you may find that the increase in damage to LB, ES, and FT are more then the loss to WF, Melee, SS, and LL. &nbsp;This could change in caster weapon favor for 4t8 as well, it all depends on coefficients really.</p>\r\n<p>&nbsp;</p>\r\n<p>Worse come to worse, try it, see how it works.</p>",
    "PostedDate": "2009-07-30T13:52:38.8-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "217758",
    "ThreadId": "64034",
    "Html": "<p>I don't know much about what goes into the modeling. &nbsp;Is it possible for Rawr to provide DPS and speed as relative stat outputs?</p>\r\n<p>FWIW, I did read the gigantic warning, and it does not imply that it's completely unusable for weapons. &nbsp;I can tolerate some inaccuracy. :)</p>\r\n<p>Relating to Enhsim, do you believe Enhsim and Rawr are far enough apart in accuracy that you cannot use Enhsim, either? &nbsp;Enhsim provides weights for MH/OH DPS. &nbsp;All the other values are within 10% of Rawr. &nbsp;With or without MH/OH stats added, caster weapons still come out on top. &nbsp;For example, I use the Export feature from Rawr and manually add DPS as a 5.5 (slightly larger than what Enhsim computes) and caster weapons are still on top. &nbsp;At 10.5 (SWAG), DPS takes the top 5 slots.</p>",
    "PostedDate": "2009-07-30T13:54:31.157-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "217763",
    "ThreadId": "64034",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>antivyris wrote:</strong><br>\r\n<p>You may also be seeing a caster weapon because it may be an upgrade. &nbsp;When comparing caster to normal in Rawr, pay special attention to the DPS area of enhance. &nbsp;Look at the numbers before and after, you may find that the increase in damage to LB, ES, and FT are more then the loss to WF, Melee, SS, and LL. &nbsp;This could change in caster weapon favor for 4t8 as well, it all depends on coefficients really.</p>\r\n<p>&nbsp;</p>\r\n<p>Worse come to worse, try it, see how it works.</p>\r\n</blockquote>\r\n<p>I'll pay more attention to the damage output. &nbsp;I'm only in 4T7. &nbsp;However, I did run it against one of the top shamans on our server and 8 out of 10 top weapons suggested (by Wowhead via Relative Stats with both Enhsim and Rawr) were caster weapons.</p>\r\n<p>I am probably late to the party on this whole caster weapon vs. melee weapon vs. Rawr data used outside of Rawr. &nbsp;I'm not trying to make waves, I'm trying to understand. &nbsp;Thanks.</p>",
    "PostedDate": "2009-07-30T14:00:33.947-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "217780",
    "ThreadId": "64034",
    "Html": "<p>The problem is that, at the risk of sounding like a broken record, Rawr doesn't play the Relative Stat game.&nbsp; The reason being is that all of the stat's values change with the addition of any single point in any stat.&nbsp; The &quot;relative stats&quot; page is very specific to your current gearing/spec.&nbsp; Every time you change a piece of gear, all of your relative stats change.</p>\r\n<p>The way Rawr works is by calculating exactly how the whole system changes - all of your abilities, talents, and stats are thrown into the blender, and Rawr calculates how everything affects your abilities.&nbsp; Once everything is modeled correctly, then this system is FAR more accurate than any &quot;relative stat&quot; &quot;fit-all&quot; system, as this calculates on the fly how each stat affects the whole ystem - on other words, your performance as an Enhancement Shaman, all abilities included.</p>",
    "PostedDate": "2009-07-30T14:51:43.457-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "217786",
    "ThreadId": "64034",
    "Html": "<p>I completely understand that and totally agree re: recalculation. &nbsp;But, perhaps unlike you, I don't get upgrades fast and furious--I wish! &nbsp;And when I do get an upgrade, I re-run the simulation and update my Pawn scales accordingly. &nbsp;If you had vision into my wow/enhsim/ folder, you would see about a dozen 2009MMDD-ep.out files from my gear/enchant recalculations. &nbsp;That onus is on me, not Rawr.</p>\r\n<p>Hopefully you can see that I'm not asking for &quot;relative stat&quot; &quot;fit-all&quot; system. &nbsp;Rawr may not play that game, but it does provide that data and multiple interfaces to that data. &nbsp;I'm asking that it be (more) accurate--that if I click &quot;Take me to Wowhead&quot; right-then-and-there given my gear and stats, that the item lists be &quot;close&quot;. &nbsp;<em>Edit: I understand that a product like this is complex, and if correcting this is beyond outputting additional stat-weights (like speed, dps, or whatever) I too understand that.</em></p>",
    "PostedDate": "2009-07-30T15:08:52.537-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "217856",
    "ThreadId": "64034",
    "Html": "<p>The answer to your question is that, as close as &quot;relative stat values&quot; can get in the way you want to use them, Rawr supports. &nbsp;However, weapons do NOT apply here. &nbsp;It is impossible for them to; speed and DPS are nowhere near linear, ESPECIALLY for enhancement shamans (or at least this used to be the case when your optimal DPS was with the two slowest possible weapons you could get, but keeping them the same speed, or something -- my enh-fu is a little rusty). &nbsp;</p>\r\n<p>At best, most of these websites give scores based on the raw stats, and maybe approximate on the DPS and speed. &nbsp;Rawr isn't really in the business of approximating; if we're showing you a number, we have math to back it up. &nbsp;And a giant disclaimer for all other stats. &nbsp;But at least there's math!</p>\r\n<p>If you insist upon using Pawn, do so freely for all slots except your weapon. &nbsp;For weapons, use Rawr (write down the list if you have to).</p>",
    "PostedDate": "2009-07-30T21:35:19.217-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "217912",
    "ThreadId": "64034",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>coderfun wrote:</strong><br>\r\n<p>Relating to Enhsim, do you believe Enhsim and Rawr are far enough apart in accuracy that you cannot use Enhsim, either? &nbsp;Enhsim provides weights for MH/OH DPS. &nbsp;All the other values are within 10% of Rawr. &nbsp;With or without MH/OH stats added, caster weapons still come out on top. &nbsp;For example, I use the Export feature from Rawr and manually add DPS as a 5.5 (slightly larger than what Enhsim computes) and caster weapons are still on top. &nbsp;At 10.5 (SWAG), DPS takes the top 5 slots.</p>\r\n</blockquote>\r\n<p>You obviously haven't read anything I've posted on the EnhSim thread on EJ forums, or read anything on the new EnhSim website.</p>\r\n<p>I took on doing the Rawr.Enhance model with a specific brief of trying to get its output to match EnhSim as best as possible. I specifically added the Export to EnhSim option so you can use the excellent paper doll features of Rawr along with the optimiser etc to get gear results then if you want to check the accuracy you can export an EnhSim config file and run EnhSimGUI to simulate the data over thousands of hours of combat. Great leaps and bounds have been made with Rawr.Enhance to the point its very usable for most people &quot;out of the box&quot; and for those that worry about the difference between +10 and +15 dps they can double check the details in EnhSim. To me the Export to EnhSim is a <strong>CORE </strong>feature of Rawr.Enhance and I'm working on ways of ensuring that this continues in Rawr3 as without it all development on Rawr3.Enhance will stop.</p>\r\n<p>Now to your Relative Stats Values - Can you actually post what the wowhead URL is so I can check why you are seeing caster weapons high. They most definitely should not be showing as top weapons. It would be useful to see your XML file too (DO NOT cut n paste from Internet Exporer just attach a file).</p>\r\n<p>I think the core problem is you are viewing Relative stats values as some sort of meaningful way of measuring your upgrades they really, really aren't. They are a quick and dirty means of getting an at a glance in game check if something MIGHT be better. Even at EJ we say DO NOT RELY on EP values you MUST sim it to check if its accurate. Far far too many people don't understand or listen to that part.</p>\r\n<p>If you engage with me I can assist helping you work out why wowhead is showing your poor data. I suspect its something basic such as you aren't turning off weapons below 2.5 speed. As anything faster than 2.5 speed is a MASSIVE dps loss for an Enh Shammy. However if you come back to me in this thread I can assist you working out your issue.</p>",
    "PostedDate": "2009-07-31T02:13:39.833-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "217990",
    "ThreadId": "64034",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>ebs2002 wrote:</strong><br>\r\n<p>However, weapons do NOT apply here. &nbsp;It is impossible for them to; speed and DPS are nowhere near linear...</p>\r\n</blockquote>\r\n<p>Yup, I came to that same conclusion last night. &nbsp;I spent some time trying to fiddle with weights for both speed and DPS at Wowhead based on Enhsim runs. &nbsp;I could not find linear values that could be plugged into Wowhead, as you point out.</p>",
    "PostedDate": "2009-07-31T06:25:14.663-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "217999",
    "ThreadId": "64034",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>Levva wrote:</strong>\r\n<p>You obviously haven't read anything I've posted on the EnhSim thread on EJ forums, or read anything on the new EnhSim website.</p>\r\n</blockquote>\r\n<p>I have, but not exhaustively.  For instance, I did not know you maintained both.  The old website (the wikidot one) talks about EP being used to make gear choices.  Is the new website at codeplex?  There are three discussions and three issues, but not much else.</p>\r\n<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>Levva wrote:</strong>\r\n<p>I took on doing the Rawr.Enhance model with a specific brief of trying to get its output to match EnhSim as best as possible. I specifically added the Export to EnhSim option so you can use the excellent paper doll features of Rawr along with the optimiser etc to get gear results then if you want to check the accuracy you can export an EnhSim config file and run EnhSimGUI to simulate the data over thousands of hours of combat...</p>\r\n</blockquote>\r\n<p>As an aside, I don't use Enhsim's GUI.  I use the command line.  Exporting Rawr and saving as <strong>config.txt</strong> and running <strong>Enhsim config.txt output=config.out</strong> fails with many parameters not defined (but I'm sure you know that).</p>\r\n<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>Levva wrote:</strong>\r\n<p>I think the core problem is you are viewing Relative stats values as some sort of meaningful way of measuring your upgrades they really, really aren't. They are a quick and dirty means of getting an at a glance in game check if something MIGHT be better. Even at EJ we say DO NOT RELY on EP values you MUST sim it to check if its accurate. Far far too many people don't understand or listen to that part.</p>\r\n</blockquote>\r\n<p>I do <strong>get</strong> that you must sim to get 100% accurate (assuming no code bugs).  I used EP values exactly as the old Enhsim site suggested--as an <em>approximate</em> guide to gear upgrades.  That's why when stats change, I would resim with Enhsim.  Then I started paying attention to oddities with weapon results, which was counter to the EJ theorycrafting article.</p>\r\n<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>Levva wrote:</strong>\r\n<p>If you engage with me I can assist helping you work out why wowhead is showing your poor data. I suspect its something basic such as you aren't turning off weapons below 2.5 speed. As anything faster than 2.5 speed is a MASSIVE dps loss for an Enh Shammy. However if you come back to me in this thread I can assist you working out your issue.</p>\r\n</blockquote>\r\n<p>Thanks, but I think I'm good now.  Enhsim (or Rawr) doesn't give bad Wowhead data except around weapons, and as I posted above, I couldn't get Wowhead to meaningfully weight speed/DPS.  The best I could do was entirely ignore speeds below 2.4.</p>",
    "PostedDate": "2009-07-31T06:56:51.793-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "218002",
    "ThreadId": "64034",
    "Html": "<p>ebs2002 there is no need at all for Enhancement shamans to match weapon speeds. There was an investigation about possible effects and it was found to be an artifact of how the Enhsim works. It is roughly possible to do what the OP wants by adding a Melee DPS weight of 6.0 this certainly smooths things out a lot.</p>\r\n<p>I've commited a change that adds this to the website URL filter if model is Enhancement Shaman.</p>",
    "PostedDate": "2009-07-31T07:03:50.063-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "218007",
    "ThreadId": "64034",
    "Html": "<p>The new codeplex website hasn't much detail yet most discussion is on EJ forum thread. What you described about how you use export from Rawr is interesting, it sounds like you are using EnhSim config wrongly. What you need to do is to take the default config.txt file supplied with EnhSim v1.8.2 and in a text editor replace the data from Rawr at the end of the file replacing the text where it says replace everything below here with data from Rawr or ShockAndAwe. If you just run Enhsim with a saved file from Rawr some of the most critical values for the sim will be missing, and the results will be completely wrong.</p>\r\n<p>If you are getting missing config parameters then the output is NOT to be trusted as you have done something wrong. A working Enhsim will not complain about missing parameter values. Check you are using the correct config.txt file and not an old one from a previous version that doesn't have the new parameters in it.</p>\r\n<p>I've coded a change for the two exports that is now in the code for the next release of Rawr. This will help with your issue. With weapons you will still need to add a filter to exclude speeds &lt; 2.4 speed however it does now have a melee dps weight that will sort caster weapons out. Unfortunately I can't put in a weapon speed filter in the wowhead URL if I do then it ignores all armour as the weapon speeds on armour are zero :) and if you filter to say weapon speed must be &gt; 2.3 the armour doesn't get included.</p>",
    "PostedDate": "2009-07-31T07:11:20.53-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "218025",
    "ThreadId": "64034",
    "Html": "<p>:) I noticed the same thing with Wowhead RE: weapon speeds. &nbsp;I'm going to contact Wowhead and see if they can handle that better.</p>\r\n<p>RE: the config files, I wasn't precise and confused the issue. &nbsp;I do NOT run Enhsim using output from Rawr. &nbsp;I manually edit the config files based on my paper doll stats from WoW Armory. &nbsp;When I run a Enhsim, I make sure no errors or warnings are present. &nbsp; I've been running Enhsim for about a month in this fashion and only recently (two days ago) discovered Rawr. &nbsp;My point in writing that was to let you know, if you didn't already, that you cannot use the Rawr Enhsim configuration directly--you must paste it into the GUI. &nbsp;(Enhsim won't even run with a Rawr generated config file--too many missing parameters.)</p>\r\n<p>I'll give the &quot;manually paste below&quot; a try. &nbsp;I've always just hand-edited everything from WoW Armory and never used SnA or Rawr as input into Enhsim.</p>\r\n<p>Thanks for the assist.</p>",
    "PostedDate": "2009-07-31T07:57:37.077-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "218118",
    "ThreadId": "64034",
    "Html": "<p><em>&quot;Unfortunately I can't put in a weapon speed filter in the wowhead URL&quot; ~Levva</em></p>\r\n<p>I don't know how the link works but can you add a filter to be 'WpSpd &gt; 2.3 || WpSpd == 0.0' ?</p>",
    "PostedDate": "2009-07-31T11:18:34.963-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "218853",
    "ThreadId": "64034",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>coderfun wrote:</strong><br>\r\n<p>:) I noticed the same thing with Wowhead RE: weapon speeds. &nbsp;I'm going to contact Wowhead and see if they can handle that better.</p>\r\n<p>RE: the config files, I wasn't precise and confused the issue. &nbsp;I do NOT run Enhsim using output from Rawr. &nbsp;I manually edit the config files based on my paper doll stats from WoW Armory. &nbsp;When I run a Enhsim, I make sure no errors or warnings are present. &nbsp; I've been running Enhsim for about a month in this fashion and only recently (two days ago) discovered Rawr. &nbsp;My point in writing that was to let you know, if you didn't already, that you cannot use the Rawr Enhsim configuration directly--you must paste it into the GUI. &nbsp;(Enhsim won't even run with a Rawr generated config file--too many missing parameters.)</p>\r\n<p>I'll give the &quot;manually paste below&quot; a try. &nbsp;I've always just hand-edited everything from WoW Armory and never used SnA or Rawr as input into Enhsim.</p>\r\n<p>Thanks for the assist.</p>\r\n</blockquote>\r\n<p>EnhSim most certainly WILL run with a RAWR generated config file that is what I use day in day out. So you can &quot;use the Rawr Enhsim configuration directly&quot; you just need to follow the instructions and paste it into the config file where it says to paste it in the config file, it is very simple. What Rawr cannot do is produce the EnhSim specific coding details eg: hours to run sim, priorities, ep values, etc. So you MUST simply delete the data in the config below the comments and paste in Rawr data. The rawr data (or ShockAndAwe data) on its own is missing lots of config.</p>\r\n<p>You must also be sure you are running at least v1.8.2 and to use the config.txt file supplied with that version. If you use an older config.txt file it won't always work correctly. This is an issue if you have simply kept your old config.txt file even when you have upgraded your EnhSim.exe. If you attach your current config file here I can tell you if this is the issue.</p>\r\n<p>Having said all that I am delighted that at last someone is actually taking the time to check these little details and post issues for them. Its simple little things like the hourglass over the Average lag bar that is difficult to spot as you get blinded to what you are used to testing and miss the obvious little things like that so its wonderful that you are taking the time to post issues on these things. By my count that's three things you've posted and three things I've fixed for the next version.</p>",
    "PostedDate": "2009-08-03T09:42:30.733-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "218855",
    "ThreadId": "64034",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>Jothay wrote:</strong><br>\r\n<p><em>&quot;Unfortunately I can't put in a weapon speed filter in the wowhead URL&quot; ~Levva</em></p>\r\n<p>I don't know how the link works but can you add a filter to be 'WpSpd &gt; 2.3 || WpSpd == 0.0' ?</p>\r\n</blockquote>\r\n<p>In the URL that would be cr=36:36;crs=1:3;crv=2.4:0;</p>\r\n<p>ie: speed &gt; 2.4 or speed = 0</p>\r\n<p>However armour has speed of NULL not speed of zero :( so the URL with speed = 0 doesn't pickup non weapons. A bug in wowhead really. If you put speed in at all it restricts it to weapons only. Since the aim is to see all upgrades for every slot this doesn't work and there is no option to say speed is null.</p>",
    "PostedDate": "2009-08-03T09:49:37.923-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]