[
  {
    "Id": "218080",
    "ThreadId": "64137",
    "Html": "<p>Hello,</p>\r\n<p>I'm atm using rawr to determinate what gear would be good for me, but I really don't care about the threat values!</p>\r\n<p>Unfortunatly you can only choose ALL sorting values or ONLY ONE.</p>\r\n<p>I want to sort on mitigation AND survivabily but NOT threat!</p>\r\n<p>&nbsp;</p>\r\n<p>I don't thikn this is posible atm right?</p>",
    "PostedDate": "2009-07-31T09:45:04.807-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "218111",
    "ThreadId": "64137",
    "Html": "<p>1) Which model</p>\r\n<p>2) Some models allow you to set teh value of threat to 0 or near zero so it's almost accomplishing what you want</p>\r\n<p>3) Why do you not care about threat? Threat is an essential part of tanking. If you can't push out enough threat to keep up with DPS'rs (especially warlocks and Arms/Fury Warriors) then the gear doesn't do you a whole lot of survivability work cuz the boss will want to hit them instead.</p>",
    "PostedDate": "2009-07-31T11:15:08.23-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "218317",
    "ThreadId": "64137",
    "Html": "<p>Druid Bear model, how do I set the valie of threat to 0 ?</p>\r\n<p>and I do not care about threat cause I have enough.</p>",
    "PostedDate": "2009-08-01T09:51:50.797-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "218332",
    "ThreadId": "64137",
    "Html": "<p>Look at the options screen.</p>\r\n<p>There are a few situations where you don't care about threat (tanking Steelbreaker, tanking Kologarn body in most cases, tanking Freya, etc). Be very careful of how much you think you have &quot;enough&quot; threat. It's easy to gear/gem yourself to completely ignore it, and suddenly find yourself being caught by DPS all of a sudden (aka, all PvP gear, and stam gems might not be the best way to go).</p>",
    "PostedDate": "2009-08-01T11:01:37.97-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]