[
  {
    "Id": "218482",
    "ThreadId": "64226",
    "Html": "<p>As we know, being a heric tank, 540 defence is required. One must meet this stat (except bear? I am not sure).</p>\r\n<p>But when rawr, showing a list of item weights. It does not care about the defence.</p>\r\n<p>For example, I have two pants, and I am not sure which is better. So I look them in rawr, with my char's model. It tells me that A is better than B. BUT, as it turns out, if I use A, my defence is less than 540, which means that I am NOT a tank at all, all the servival, threat, etc are meanless.</p>\r\n<p>So I think rawr should consider this. Not only when I ask which pants is better, also when I ask for an optimized gears list. If the list is a gear set that with defence less than 540, it is also useless.</p>",
    "PostedDate": "2009-08-02T10:07:45.05-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "218486",
    "ThreadId": "64226",
    "Html": "<p>Rawr looks at the raw calculations. What you are describing is a requirement for the optimizer, which you can set. In optimize, add a requirement of 'Chance to be Crit &lt;= 0' this will ensure your character is defense capped (for the class). For the item lists, if one pants is better than another, it's probably better than the other. You should try to make up the difference in defense with Gems or enchants.</p>",
    "PostedDate": "2009-08-02T10:40:22.56-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "218573",
    "ThreadId": "64226",
    "Html": "<p>PS, to be a heroic tank, you need 535defense. &nbsp;540 is only required for raid-level boss tanking (ie, skulls, level 83s, etc).</p>",
    "PostedDate": "2009-08-02T16:57:14.717-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "218608",
    "ThreadId": "64226",
    "Html": "<p>Also, just as a random tag of information, Resilience does count towards reducing crittability in PvE content.</p>\r\n<p>Plus, Defense has significantly more value than just reducing the chance to be crit.</p>",
    "PostedDate": "2009-08-02T21:30:50.267-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]