[
  {
    "Id": "219175",
    "ThreadId": "64400",
    "Html": "<p>I was wondering if anyone has any idea how you can create a usable list from a Rawr XML file.... I do a lot of gear sets for various guild members and it would be very handy if I could create the gearset and then turn it into&nbsp; a list of the gear including gem and enchat choices and such....&nbsp; Is this possible? If anyone has any kind of answer I would appreciate it.....</p>",
    "PostedDate": "2009-08-04T03:24:36.377-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "219313",
    "ThreadId": "64400",
    "Html": "<p>If they don't use Rawr, then I'd suggest exporting the Current Gear/Enchants/Buffs chart to csv.</p>",
    "PostedDate": "2009-08-04T09:48:08.377-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "219423",
    "ThreadId": "64400",
    "Html": "<p>OK well at the risk of being even more of a Noob lol... CSV? and how do I export it? A link to a program page or maybe instructions would be great...TY in advance</p>",
    "PostedDate": "2009-08-04T13:25:56.61-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "219435",
    "ThreadId": "64400",
    "Html": "<p>Top right corner is the Export dropdown. You can export to image, CSV file, or CSV to clipboard. CSV is just a grid of data, typically opens in Excel. Image export doesn't include tooltips, so wouldn't show what gems to use in each item.</p>",
    "PostedDate": "2009-08-04T13:44:33.243-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "219443",
    "ThreadId": "64400",
    "Html": "<p>k sorry for all the aggravation... When i click copy to clip board nothing happens... When i click copy to image the image is just of the gear chart on the right side of the Rawr program window not the actual gear itself chossen.&nbsp; I dont have excel and havnt had any luck finding a program other then xl to download..any suggestions?</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-08-04T14:03:18.437-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "219453",
    "ThreadId": "64400",
    "Html": "<p>Copy to clipboard does just that... copies it to the clipboard. You have to paste it somewhere, notepad works.</p>\r\n<p>If you cannot get Microsoft Office (which any Windows user should have... cuz I mean... come ON) for Excel then you can get OpenOffice as a free alternative (though not as good asactual MS Office, it can work for those in a bind).</p>",
    "PostedDate": "2009-08-04T14:17:17.223-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "219456",
    "ThreadId": "64400",
    "Html": "<p>ok well go the idea of clip board but I am still having the same issue... it is exporting just the list of gear on the right side of Rawr not the actual gear chosen for the set i designed.... What am I doing wrong?</p>",
    "PostedDate": "2009-08-04T14:27:11.623-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "219458",
    "ThreadId": "64400",
    "Html": "<p>KK got it thank you for the help</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-08-04T14:30:16.967-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]