[
  {
    "Id": "219283",
    "ThreadId": "64431",
    "Html": "<p>Since I don't see it mentioned anywhere, I'm curious as to release plans for 3.2 support. Do you know when we can expect a release for the new 3.2 stat changes (especially for druids, but other classes as well)?</p>\r\n<p>Also, what is the best way to get updated item lists? I know it takes awhile for new items to filter out to wowhead and into Rawr. Since you won't likely be doing daily releases, what is the best way to get updates for items and have them move from version to version as Rawr is updated?</p>\r\n<p>Thanks for all of the work and support on this great tool,</p>\r\n<p>-Finandir</p>",
    "PostedDate": "2009-08-04T08:24:48.623-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "219318",
    "ThreadId": "64431",
    "Html": "<p>We're hoping to release a new version late tonight, including with 3.2 data.</p>",
    "PostedDate": "2009-08-04T09:52:47.817-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "219344",
    "ThreadId": "64431",
    "Html": "<p>Will the removal of the Prismatic nature of the Dragon's Eye gems make it into this next release?</p>",
    "PostedDate": "2009-08-04T10:40:17.89-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "219347",
    "ThreadId": "64431",
    "Html": "<p>Yes.</p>",
    "PostedDate": "2009-08-04T10:45:33.923-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "219365",
    "ThreadId": "64431",
    "Html": "<p>Awesome that it's planned so soon!&nbsp; Thanks all of you for your dedication to this project and getting us updates so fast :).</p>",
    "PostedDate": "2009-08-04T11:04:15.01-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "219386",
    "ThreadId": "64431",
    "Html": "<p>Great! Thank you for such quick updates.</p>",
    "PostedDate": "2009-08-04T12:11:46.937-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "219778",
    "ThreadId": "64431",
    "Html": "<p>Downloaded 2.2.11 and I'm still seeing Dragon's Eye gems matching every socket in the tooltip. They also have the old values.</p>",
    "PostedDate": "2009-08-05T08:19:48.727-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "219790",
    "ThreadId": "64431",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>Alcapwnd wrote:</strong><br>\r\n<p>Downloaded 2.2.11 and I'm still seeing Dragon's Eye gems matching every socket in the tooltip.</p>\r\n</blockquote>\r\n<p>&nbsp;And it it just me or are they also not have the new updated values?</p>",
    "PostedDate": "2009-08-05T08:35:51.41-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "219797",
    "ThreadId": "64431",
    "Html": "<p>If you are seeing this then your Itemcache hasn't been updated. As all the new gems were updated with this release. It says that on the download page. I'm guessing you might have just installed the new version over the top of the old one rather than doing a clean install?</p>\r\n<p>Remember user data is completely separate from the Rawr program files especially with the irritating way Vista works. If you are using vista and having this problem make sure you don't install into the program files directory.</p>",
    "PostedDate": "2009-08-05T08:45:17.653-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "219821",
    "ThreadId": "64431",
    "Html": "<p>I installed 2.2.11 in a separate directory. The default itemcache was out of date.</p>\r\n<p>I updated the itemcache from WoWHead and now the JC gems have the correct values, however they still show as prismatic.</p>",
    "PostedDate": "2009-08-05T09:12:56.143-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "219849",
    "ThreadId": "64431",
    "Html": "<p>It doesn't mention the tanking classes being updated with the new dodge/agi/parry rules but it does says &quot;stat conversions&quot; were updated...</p>\r\n<p>I assume then that we are good to go using rawr for tanking stuff?</p>",
    "PostedDate": "2009-08-05T09:55:39.737-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "219884",
    "ThreadId": "64431",
    "Html": "<p>Both Wowhead and the Armory are returning incorrect values for the Dragon's Eye gems when you try to update the item cache.</p>\r\n<p>&nbsp;</p>\r\n<p>Workaround:</p>\r\n<ol>\r\n<li>Update item cache from the Armory to get correct stat values (i.e. 39 spellpower from Runed Dragon's Eye).&nbsp; The gem will still show as prismatic.</li>\r\n<li>On the Comparisons pane on the right, select Slot: Gems &gt; Normal to view gems</li>\r\n<li>Right-click the Dragon's Eye gem and select Edit</li>\r\n<li>In the upper right of the Item Editor, change the slot to the correct color (i.e. Runed Dragon's Eye should be Red)</li>\r\n<li>Click OK</li>\r\n<li>Repeat steps 3-5 for each of the Dragon's Eye gems</li>\r\n</ol>\r\n<p>&nbsp;</p>\r\n<p>This will allow Rawr to correctly optimize using the Dragon's Eye gems, enforcing Meta gem requirements and correctly determining socket bonuses.</p>",
    "PostedDate": "2009-08-05T10:40:38.797-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "219890",
    "ThreadId": "64431",
    "Html": "<p>Yeah, Wowhead's old data stomped my fixed gem data before I released 2.2.11, oops. As Aonghus said, you can just edit them to be whatever color instead of prismatic. Or, once Wowhead is updated, refresh your item cache again.</p>",
    "PostedDate": "2009-08-05T10:50:18.833-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "219906",
    "ThreadId": "64431",
    "Html": "<p>ProtWarrior was still using the old system of values (not using StatConversions) so it has not been updated, I'm currently doing an ugly rewrite to make it use the new values but the ProtWarr dev will still need to sign off on it.</p>",
    "PostedDate": "2009-08-05T11:05:33.183-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]