[
  {
    "Id": "219416",
    "ThreadId": "64463",
    "Html": "<p>New thread started as from an off-topic conversation, per Jothay.&nbsp; Copied relevant discussion and snipped it down a bit.</p>\r\n<p>Comments are slightly trimmed for brevity, for the true text refer to: <a href=\"http://rawr.codeplex.com/Thread/View.aspx?ThreadId=64356\">Link</a></p>\r\n<blockquote style=\"border:0.1em solid #cccccc;margin:0.25em 1em 0pt;padding:0pt 0.25em;font-style:italic\"><strong>Astrylian wrote:</strong><br>\r\n<p>Sure, alot of people will always use things like Pawn, and that's fine; those things have a purpose. But that doesn't mean that we shouldn't do our best to make Rawr as user-friendly as possible. Rawr's whole point is to make the ultra-complex theorycraft easy to understand, and use, for everyone. Alot of it is just improving how simple things appear at first glance, to prevent that sort of shock at all the options that you mentioned. For example, those people you tried to get to use Rawr, what was there problem? How can we address that? Did you show them the tutorial video?</p>\r\n</blockquote>\r\n<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>Astrylian wrote:</strong><br>\r\n<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>khanthal wrote:</strong>\r\n<p>The biggest difficulty I have is actually getting them to install it, half the time.&nbsp; People get weird about anything they install with regard to WoW.&nbsp; If I can get them in the program they usually think it's cool.&nbsp;</p>\r\n</blockquote>\r\n<p>Agreed, just installing it is the biggest hurdle, and we've taken that to heart when designing Rawr. You're going to love just telling people an 11-character URL with Rawr3. :D</p>\r\n<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\">\r\n<p>The first and most difficult hurdle always, ALWAYS, is explaining gemming.&nbsp; The new gemming system has really helped make explaining it easier.&nbsp; People are FAR more amenable to it.&nbsp; I always used to have to say things like &quot;This is the only part that's hard/sucks&quot; and try to talk fast enough to get them past it.&nbsp; The next hurdle is helping them understand that if they change one piece, they need to re-look at all the other gear and see if other things shifted.&nbsp; I never start them with the optimizer; I always get them to &quot;hand optimize&quot; a little first so they understand and see that changing one thing can change everything else.&nbsp; It's a huge change from static lists people are used to.&nbsp; By default they think if Rawr says A is better than B then it will ALWAYS be better...and of course it's often not.</p>\r\n</blockquote>\r\n<p>Yeah, the gemming change was huge. It's still complex, but at least it's abstracted away from the user by default, and for the vast vast majority of users.&nbsp;</p>\r\n<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\">\r\n<p>It's not too hard to get people to this point.&nbsp; They will open Rawr with their given gear set and look at a drop, say it's an upgrade, loot it and equip it in Rawr and go from there.&nbsp; It's very hard to get them to go much, if any, past that to plan out gear upgrades or deal with real optimizations that are not straightforward.&nbsp; An example there is that, unless you happen to have a bunch of ArP or a good ArP trinket, Rawr won't tell you that ArP is awesome...because at that point it isn't.&nbsp; In truth, with the right gear, it can be better than other stats but your basic user will never see it unless they stumble on it through random gear upgrades getting ArP up high enough.&nbsp; Similarly they won't necessarily think about &quot;what if I swap this piece out for my +hit so I can swap that other one in&quot;.&nbsp; True optimization is sort of...advanced Rawr use for people it seems.&nbsp; Explaining that they can go through and click little green diamonds for 15 minutes across all the gear they have and gems/enchants they want to use until they get them all in so the optimizer can work often doesn't go over well.</p>\r\n</blockquote>\r\n<p>Yeah, I don't really have a good answer on how to make this simpler and easier to see. It's just a very complex problem. One thing that will help at least somewhat is a standardized set of charts showing how stat values scale with stats.</p>\r\n<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\">\r\n<p>None of them would even have gotten to the point they are without me hand-holding them there, though.&nbsp; That's the real problem.&nbsp; If I hadn't devoted the time to &quot;shepherding&quot; them they never would have adopted the program at all.&nbsp; A lot of WoW players have been using gear lists or their own personal rules of thumb for a long time and they do good damage/tank well/heal well so...they don't see any need to change to something unfamiliar and, to them, infinitely more complicated.&nbsp;</p>\r\n</blockquote>\r\n<p>Yeah, the hand-holding really helps get someone comfortable with Rawr; that was the idea with the video (check it out!). I still think there's some UI design that we can do to improve things for people who don't view the video, though.</p>\r\n</blockquote>\r\n<blockquote style=\"border:0.1em solid #cccccc;margin:0.25em 1em 0pt;padding:0pt 0.25em;font-style:italic\"><strong>khanthal wrote:</strong><br>\r\n<blockquote style=\"border:0.1em solid #cccccc;margin:0.25em 1em 0pt;padding:0pt 0.25em;font-style:italic\"><strong>Jothay wrote:</strong><br>\r\n<p>I regularly recruit persons on my server, especially warriors and EVERY time the reaction is immediately... WOW! thass AHSUM! and then I need to walk them through setting up their character and then run an optimize to show immediate improvements. It does seem to need some 'shepherding' as he put it to get people really into the mechanics that make a Rawr enhanced character great.</p>\r\n</blockquote>\r\n<p>Concept:&nbsp; The nifty new box that pops up when you start wow...if it finds no saved chars it could have, in 50 foot high letters, &quot;Do you want to do some initial setup?&quot;</p>\r\n<p>Guided setup:</p>\r\n<p>- Asks for char name and server, imports</p>\r\n<p>- Opens the buff tab and points it out, asks if they want full raid buffs by default, or if they want to do it custom later</p>\r\n<p>- Asks them if they want only current content enchants available to the optimizer or to include all, presses the little green dots for them respectively</p>\r\n<p>- Asks them what qualities of gems to include for optimization (the autopicker can be at least sort of smart here, only green dotting gems that actually have two relevant stats...i.e. not selecting anything with any spell power for bears).</p>\r\n<p>- Shows them the gemming templates and asks them to change things if they want</p>\r\n<p>- Tells them about anything else that is relevant to the specific spec (if they need to poke around in some tab)</p>\r\n<p>Bam...they are totally close to being able to use the optimizer effectively.</p>\r\n</blockquote>\r\n<p>Starting a new thread often kills a discussion but it's for the best, that one was far offtrack :).&nbsp;</p>\r\n<p>Hopefully some other people will have insight or comments and jump in, seeing the new thread title.</p>",
    "PostedDate": "2009-08-04T13:01:23.077-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "219420",
    "ThreadId": "64463",
    "Html": "<p>We could work on getting a walk-through/wizard type setup that comes from the splash-screen.&nbsp; That way if someone wants to by-pass it, they could do that as well.&nbsp; Wizard type UIs tend to get mixed reviews, but I know at work there are always pushes to simplify and get the relevant more accessible to the user while still keeping the power-user options just 1 (or at most 2) layers away.</p>",
    "PostedDate": "2009-08-04T13:11:36.89-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "219431",
    "ThreadId": "64463",
    "Html": "<p>Agreed; I'd really like a New User Wizard Sort Of Thing. Just needs to be built. :)</p>\r\n<p>The video serves that same need, just in a not-as-good way, since it's not in users' faces. It was just alot easier to make. :)</p>",
    "PostedDate": "2009-08-04T13:42:59.173-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "219459",
    "ThreadId": "64463",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>Astrylian wrote:</strong><br>\r\n<p>Agreed; I'd really like a New User Wizard Sort Of Thing. Just needs to be built. :)</p>\r\n<p>The video serves that same need, just in a not-as-good way, since it's not in users' faces. It was just alot easier to make. :)</p>\r\n</blockquote>\r\n<p>How about that video being prominent on this site on the download or home page?</p>\r\n<p>Having it right there, embeded youtube or whatever, available for people to click and learn what they are getting seems like a good place for it to be.</p>\r\n<p>I know the screenshots you had in the old Druid wiki were a BIG part of why I tried Rawr the first time.</p>",
    "PostedDate": "2009-08-04T14:31:53.58-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "219468",
    "ThreadId": "64463",
    "Html": "<p>Well today is the first time I ever heard of rawr, so please forgive me if I ask questions, that were&nbsp;already answered . Where do I find the setup movie you have been talking about. I think this program will help me a lot, but Im not real sure on how to use it. I need all the help I can get. I have only been playing&nbsp;WoW for about&nbsp;6 months and I am still trying to learn about a lot of stuff. Thank you for your help.</p>",
    "PostedDate": "2009-08-04T14:42:45.527-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "219485",
    "ThreadId": "64463",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>Sweetnes11 wrote:</strong><br>\r\n<p>Well today is the first time I ever heard of rawr, so please forgive me if I ask questions, that were&nbsp;already answered . Where do I find the setup movie you have been talking about. I think this program will help me a lot, but Im not real sure on how to use it. I need all the help I can get. I have only been playing&nbsp;WoW for about&nbsp;6 months and I am still trying to learn about a lot of stuff. Thank you for your help.</p>\r\n</blockquote>\r\n<p>When you first open Rawr you'll get a smaller &quot;Welcome to Rawr&quot; page that pops up.&nbsp; In the lower left corner there is a Help box that has some links.&nbsp; The Tour of Rawr is teh video, the rest are various tips.</p>",
    "PostedDate": "2009-08-04T15:25:38.383-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "219488",
    "ThreadId": "64463",
    "Html": "<p>Yeah, will try to make it more prominent... http://www.youtube.com/watch?v=OjRM5SUoOoQ for anyone looking for it offhand.</p>",
    "PostedDate": "2009-08-04T15:33:23.857-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "219499",
    "ThreadId": "64463",
    "Html": "<p>I have to say that the most time-consuming thing for me is having to select buffs every single time I load a character in Rawr.&nbsp;&nbsp;&nbsp; (Not when i load a saved toon obviously) &nbsp; Having a &quot;select all buffs&quot; button or being able to save default buffs would be great.</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-08-04T16:28:51.67-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "219518",
    "ThreadId": "64463",
    "Html": "<p>That specifically is coming. :)</p>",
    "PostedDate": "2009-08-04T18:24:11.36-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "224556",
    "ThreadId": "64463",
    "Html": "<p>- Asks them if they want only current content enchants available to the optimizer or to include all, presses the little green dots for them respectively</p>\r\n<p>&nbsp;</p>\r\n<p>One thing that could be made easier for the end-user here is perhaps querying armory for professions and reputations (I know they are visible on armory, actually I don't know if they can be queried programmatically). What happens is for instance that if you are at least a 420 tailor then the cloak embroideries are being made available, if you are revered with Kirin Tor, well then the Kirin Tor head-enchant are available, etc.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-08-17T11:06:44.26-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "224563",
    "ThreadId": "64463",
    "Html": "<p>Auto-marking stuff available based on reps, professions, etc, would cause a great deal of confusion I expect, about why some things are automatically marked available, and others are not. It also adds significant additional clutter to the available items list, which is a bad thing.</p>",
    "PostedDate": "2009-08-17T11:10:40.273-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]