[
  {
    "Id": "220085",
    "ThreadId": "64645",
    "Html": "<p>Just trying to get my head around why this run of the mill blue trinket is rated above a heap of purple items, until recently when I turned on the crafted option filter I didn't even know it was there.</p>\r\n<p>http://www.wowhead.com/?item=42395 is the serpent</p>\r\n<p>I have on http://www.wowhead.com/?item=40682 and http://www.wowhead.com/?item=42988</p>\r\n<p>Serpent is supposedly an upgrade according to RAWR for both of these, just can't figure out why, any thoughts appreciated.</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-08-05T17:30:48.95-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "220092",
    "ThreadId": "64645",
    "Html": "<p>That's totally possible, especially using good gems, and if you need the hit rating. Darkmoon Illusion is relatively poor, I can definitely see Serpent beating it. Additionally, you could be missing your metagem requirements without the serpent.</p>",
    "PostedDate": "2009-08-05T18:31:00.047-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "220096",
    "ThreadId": "64645",
    "Html": "<p>Swapping it for the Sundial my dps goes down 50, swapping it for the Darkmoon it goes up 50. I am missing the metagem bonus since 3.2 since my dragons eyes became a color, I will spend some G on the new gems tonight and see what happens. Still can't get my head around a blue being better than a purple, can't say I have noted that with any other item in the game. Thanks for the input, keep up the work with the great program.</p>\r\n<p>http://www.wowarmory.com/character-sheet.xml?r=Saurfang&amp;n=Gc my character BTW incase there is something strange going on :)</p>",
    "PostedDate": "2009-08-05T18:53:51.753-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "220113",
    "ThreadId": "64645",
    "Html": "<p>High Blues are better than low purples all the time. In this case, the serpent is showing up much better primarily due to it granting your metagem bonus.</p>",
    "PostedDate": "2009-08-05T19:56:47.913-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "220139",
    "ThreadId": "64645",
    "Html": "<p>There's lots of occasions where an ilvl200 blue beats out an ilvl200 epic for a given situation. &nbsp;Tanks know what I mean with that stamina trinket whose name escapes me.</p>\r\n<p>You can also have a well-itemized ilvl213 beating out a poorly itemized ilvl226. &nbsp;Personally, I passed on the 25man normal champions plate bracers (the ones with expertise) because I preferred the armorpen from my Ulduar bracers.</p>\r\n<p>A higher budget means nothing if it's not spent wisely :)</p>",
    "PostedDate": "2009-08-05T22:07:11.767-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "220162",
    "ThreadId": "64645",
    "Html": "<p>Only done 1 Ulduar run, absolutely hate the bit running round in vehicles in the beginning, not sure I can put myself through that torture again :(</p>\r\n<p>I'll investigate the metagem bonus shortly and see how I can spend my money wisely :)</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-08-05T23:07:35.52-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]