[
  {
    "Id": "220142",
    "ThreadId": "64654",
    "Html": "<p>When I open up the optimizer with the moonkin model, the only additional requirements that i can optimize for are burst, sustained, and overrall rating.&nbsp; I cant do anything else like hit or haste or crit. Please help.</p>",
    "PostedDate": "2009-08-05T22:12:51.93-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "220160",
    "ThreadId": "64654",
    "Html": "<p>Well, first, we can add hit, since that <strong><em>occasionally</em><span style=\"font-weight:normal\">&nbsp;would be useful (ie, when you need to reliably CC something). If you want to optimize your DPS, then optimize your DPS, it will correctly value hit/haste/crit.</span></strong></p>",
    "PostedDate": "2009-08-05T23:01:32.72-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "220603",
    "ThreadId": "64654",
    "Html": "<p>i only want 400 haste to meet the soft cap wrath, since now that i can use both eclipses, once i get 400 haste, crit is better, and rawr keeps putting way over the 400 haste cap i want</p>\r\n<p>and currently as posted orginally i cant set any restrictions for haste etc, when im in the moonkin model, i can do it for everyother model except moonkin</p>",
    "PostedDate": "2009-08-06T18:45:47.307-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "220627",
    "ThreadId": "64654",
    "Html": "<p>If Rawr recommends that you have more than 400 haste for the &quot;wrath soft cap&quot;, then the following must be true:</p>\r\n<p>Haste above 400 is still a valuable stat.</p>\r\n<p>There, I said it.&nbsp; There's no reason to artificially cap your haste at 400.&nbsp; Sure, it has less of an effect when Wrath is GCD-locked, but that doesn't mean it's worthless or that you shouldn't go over it.&nbsp; Also, make sure you check your buffs and that you have Wrath of Air and Imp Moonkin selected, as these will change the haste &quot;soft cap&quot;.</p>",
    "PostedDate": "2009-08-06T21:07:56.363-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]