[
  {
    "Id": "220645",
    "ThreadId": "64789",
    "Html": "<p>mostly the newer dungeon and heroic drops, which is understandable, giving the lack of information out there on them. for instance armbands of the wary lookout is listed as item lvl 213 with the following stats: 56 agi, 35 armpenn, 86 ap, 38 hit rating. The actual stats for this item are itm lvl 219, 59 agi, 40 hit, 39 armpenn, 90 ap</p>\r\n<p>&nbsp;</p>\r\n<p>edit</p>\r\n<p>&nbsp;</p>\r\n<p>you can move this to the issue tracker, i actually ment to post it there, duno why it ended up here o.O</p>",
    "PostedDate": "2009-08-06T22:59:32.753-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "220942",
    "ThreadId": "64789",
    "Html": "<p>Rawr uses data from Wowhead and Armory. Make sure you're using the latest Rawr, and refresh the data of any items you see outdated. Beyond that, submit the new data to Wowhead.</p>",
    "PostedDate": "2009-08-07T14:43:47.21-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "220952",
    "ThreadId": "64789",
    "Html": "<p>http://www.wowhead.com/?client is what Astry's referencing when he says &quot;submit new data to Wowhead&quot;.</p>",
    "PostedDate": "2009-08-07T15:19:01.78-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "220984",
    "ThreadId": "64789",
    "Html": "<p>The heroic dungeon items when they came out were ilvl 213, and through a hotfix they were bumped up to 219. So they might have incorrect stats for a few days until Wowhead/Armory can get the correct stats.</p>",
    "PostedDate": "2009-08-07T17:05:47.743-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "221014",
    "ThreadId": "64789",
    "Html": "<p>actually, how i found this information out was, i updated rawr, then logged on, and ran a new dungeon and this item dropped. so the information i submitted to you is completely accurate, and at the time i posted it, it was the most recent version of rawr (and still is). i clicked the button in rawr to view the item on wowhead, and it led me to a page that said invalid item ID. i tried this with a bunch of other tier 9 and item lvl 245 pieces just to check them out, and they all did the same thing. so i dont see how youre getting your information from wowhead, when it didnt even exist at the time on that site.</p>\r\n<p>this is nor here nor there. the bottom line is, some items arnt correct, and unless they update automatically from wowhead, this horribbly trumps rawrs usefulness. these armbands were very close to fluxing energy coils just upon comparing stats by myself in-game, but rawr said they were a downgrade by about 3 or 4 slots. i edited the stats upon realizing they werent right, and the items is infact an upgrade (by one slot, and minor dps, but, still).</p>",
    "PostedDate": "2009-08-07T19:30:58.023-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "221044",
    "ThreadId": "64789",
    "Html": "<p>OK, please try again, to understand what we're trying to help you with. Rawr gets its data from Wowhead and the Armory. The latest version of Rawr includes the latest version of data from Wowhead and Armory, at the time of release. You can use Tools &gt; Refresh Item Cache from Wowhead/Armory, or Right-Click &gt; Refresh Item from Wowhead/Armory, to reload the data for all/that item from Wowhead/Armory. Make sense?</p>",
    "PostedDate": "2009-08-08T01:08:52.25-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "221053",
    "ThreadId": "64789",
    "Html": "<p>Go to the top menu bar of the Rawr window,&nbsp; Tools &gt; Load Possible Upgrades From WowHead, and see if the &quot;Use PTR Data&quot; options is ticked.&nbsp; If it is, unselect it - it's obviously not going to pull data from a page that does not currently exist (as there's not PTR up, Wowhead took down the PTR side of the site).</p>\r\n<p>Sounds like your cache is a little older - no worries!&nbsp; Use the Tools &gt; Refresh Item Cache from Armory (or Wowhead, if you're so inclined), and see if that does it for you.</p>",
    "PostedDate": "2009-08-08T02:04:35.57-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "221170",
    "ThreadId": "64789",
    "Html": "<p>ah, i was under the impression that rawr had it's item stats pulled from those sites, then implemented into the program itself, not stored into an updateble cache. my apologies, i thought i found a mistake o.O</p>",
    "PostedDate": "2009-08-08T15:11:17.467-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "229301",
    "ThreadId": "64789",
    "Html": "<p>Well, this seemed to work for a while, but today I updated the items, both from the armory, and wowhead, and items are still incorrect, and linked to pages that do not exist on wowhead. seeing as it is the most recent version, and the item list is freshly updated, I believe some of the item nubmers are incorrect, and have stats that are outdated from maybe the PTR. Reckoning for example, should be item&nbsp;47737 but is linked to&nbsp;47951. I wont bother listing the stats, but they are about 10 off on each one.</p>",
    "PostedDate": "2009-08-31T05:34:56.443-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "229376",
    "ThreadId": "64789",
    "Html": "<p>Really, this isn't a bug. Wowhead just doesn't know about some of the higher end items. There really are 258 and 245 (or 232 and 245) versions of tons of ToC items.</p>",
    "PostedDate": "2009-08-31T09:13:50.58-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "229400",
    "ThreadId": "64789",
    "Html": "<p>you're right, but, why does this information not update when you update via armory then?</p>",
    "PostedDate": "2009-08-31T09:58:45.423-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "229406",
    "ThreadId": "64789",
    "Html": "<p>Reckoning (232): <a href=\"http://www.wowarmory.com/item-info.xml?i=47737\">http://www.wowarmory.com/item-info.xml?i=47737</a>&nbsp;&amp; <a href=\"http://www.wowhead.com/?item=47737\">http://www.wowhead.com/?item=47737</a></p>\r\n<p>Reckoning (245):&nbsp;<a href=\"http://www.wowarmory.com/item-info.xml?i=47951\">http://www.wowarmory.com/item-info.xml?i=47951</a>&nbsp;&amp; [Wowhead doesn't have the 245 version yet]</p>\r\n<p>Really, this isn't a bug. It *does* update via the armory.</p>",
    "PostedDate": "2009-08-31T10:06:15.79-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "229725",
    "ThreadId": "64789",
    "Html": "<p>yea I guess I phrased that statement wrong, I ment the &quot;open item in wowhead&quot; link doesn't change, the item itself updates, but the link leads to a blank page, which is a little confusing, especially with items with different item lvls, the same, name, and multiple versions because of factions. an &quot;open item in armory&quot; option would be awesome. my entire confusion with these newer items is coming from wowhead not being complete, and then being lead to empty pages.. then searching the item on wowhead and finding different versions of the item. showing the horde and alliance version as one item could help as well, or giving the option to choose your faction so it weeds out double showings of the same exact item.</p>",
    "PostedDate": "2009-09-01T07:46:05.33-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "229737",
    "ThreadId": "64789",
    "Html": "<p>Alas, several of your statements duplicate threads that have already been discussed several times.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-09-01T08:11:23.967-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]