[
  {
    "Id": "220671",
    "ThreadId": "64797",
    "Html": "<p>According to Gray Matter, the new Idol of Lunar Fire is superb. According to Rawr, it ranks behind Idol of the Crying Wind which is pretty much garbage. I've got 2xT8 and 2xT7 bonus. Not sure if that matters. Is Rawr modelling 3.2 boomkin mechanics (twisting rotation) and the idol properly?</p>\r\n<p><a href=\"http://graymatterwow.blogspot.com/2009/08/patch-32-few-reminders.html\">http://graymatterwow.blogspot.com/2009/08/patch-32-few-reminders.html</a></p>\r\n<p><strong>New Idol: <a href=\"http://ptr.wowhead.com/?item=47670\"><span style=\"color:#cc33cc\">[Idol of Lunar Fury]</span></a></strong> - <em>Each time your Moonfire spell deals periodic damage, you have a chance to gain 200 critical strike rating for 12 sec.</em><br><br>There is a lot of new gear in this patch for obvious reason, but this is the only piece you should care about right away. On the PTR this idol cost 25 Emblems of Triumph. Assuming the price stays the same I suggest you get 25 EoT's as quickly as possible and buy this idol.<br><br>It is by far the best idol of all the options available. Early reports from the PTR said that it had a 70% to 90% proc rate with no internal cooldown, and I have not seen any reports to suggest that this has changed. Assuming that this is the case then this idol provides a static 200 increase to Crit Rating since you&rsquo;re virtually assured a 100% up rate as long as you keep Moonfire up.</p>",
    "PostedDate": "2009-08-07T01:14:51.857-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "220944",
    "ThreadId": "64797",
    "Html": "<p>Rawr simply doesn't model the new relics yet.</p>",
    "PostedDate": "2009-08-07T14:45:12.503-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "220955",
    "ThreadId": "64797",
    "Html": "<p>Based on what I read, the expected uptime is around 86%. Haven't tested yet, tho.</p>",
    "PostedDate": "2009-08-07T15:25:35.13-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "220970",
    "ThreadId": "64797",
    "Html": "<p>Astrylian,</p>\r\n<p>Any idea if this is coming up &quot;soon&quot; in a new release? If not, are there any workarounds that can be accomplished through the UI (i.e. some way to use one of the existing proc effects to model 200 crit w/ 86% uptime..)</p>\r\n<p>Thx</p>",
    "PostedDate": "2009-08-07T16:08:18.58-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "220987",
    "ThreadId": "64797",
    "Html": "<p>As a &quot;hackup&quot;, you could give it a proc on cast of 200 crit rating with a 12 second duration, 14 second internal cooldown and 100% chance to apply it.&nbsp; That would probably give it just over that 80% uptime that's being reported.</p>\r\n<p>Or, to simplify it further, you could give it the estimated .85 uptime x 200 crit rating = 170 crit rating passive value</p>\r\n<p>This isn't accurate, obviously, but is a &quot;close enough&quot; to give it a rough value.</p>",
    "PostedDate": "2009-08-07T17:15:53.587-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "221009",
    "ThreadId": "64797",
    "Html": "<p>I couldn't seem to get it to give good numbers for any of the special effects (i.e. 12/14) w/ various triggers. The 170 crit passive rating shows up nice and high but I don't think it is &quot;as accurate&quot; because I believe that there are some form of &quot;diminishing returns&quot; on crit rating? (i.e. 80% uptime of 200 != 170 ...) but it's probably &quot;close enough&quot; for now...</p>",
    "PostedDate": "2009-08-07T18:52:43.26-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "221042",
    "ThreadId": "64797",
    "Html": "<p>Dopefish, any ETA on this? Yeah, for now, the 170 is probably decently accurate.</p>",
    "PostedDate": "2009-08-08T01:05:23.803-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "221144",
    "ThreadId": "64797",
    "Html": "<p>My development environment on my current PC isn't working correctly right now, but I am looking into this.</p>\r\n<p>Edit: I fixed up my development PC, and my sample test case shows Lunar Fury as over twice as good as Crying Wind in 3.2 mode.&nbsp; Could you upload an XML file so that I can take a look at your specific case and determine what's going on?</p>",
    "PostedDate": "2009-08-08T13:03:49.323-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "222693",
    "ThreadId": "64797",
    "Html": "<p>BTW, I picked up the Idol of Lunar Fury last night and spent a handful of minutes whacking on a test dummy. It appears that +/- the seconds it takes to initially proc that it was 100% uptime. &nbsp;I haven't spent much time with it, but it seems that there is even some wiggle room for not refreshing your moonfire in time because of the duration of the proc. I scribbled some notes which I left at home, but my recollection is that this translated to +4.5% crit.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-08-12T13:26:48.597-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "228405",
    "ThreadId": "64797",
    "Html": "<p>Out of curiosity is this idol modeling properly now? It's showing pretty low, about 54 overall compared to idol of the shooting star at 128ish.</p>\r\n<p>I suppose it could be a result of my overall gearing as well. But if it is modeling correctly it certainly doesn't seem to be the awesome idol we thought.</p>",
    "PostedDate": "2009-08-27T07:33:55.66-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "228423",
    "ThreadId": "64797",
    "Html": "<p>No, it still has problems. &nbsp;If you are 1/3 Eclipse, it may even show a negative value. &nbsp;For now, your best bet is probably to edit it as 170 to 200 static crit (obviously only for rotations that include MF).</p>",
    "PostedDate": "2009-08-27T08:08:24.697-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "228553",
    "ThreadId": "64797",
    "Html": "<p>Follow your bliss, but I chose to model it as a static 200 crit. I don't have stats to back this up yet (I haven't spent much time practicing on dummies + during raids I'm only paying peripheral attention to my buffs), but if you keep IS/MF up at all times (which for a single target rotation should be the case), I think you pretty much have 100% uptime.</p>\r\n<p>I strongly suggest you pick up this Idol if you can. I'm now averaging 40% crit on Wrath and 70% crit on Starfire in raids. SF crits + raid mechanic damage buffs (i.e. ToC has a few of them) = 30K+ SF hits :)</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-08-27T16:28:16.777-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]