[
  {
    "Id": "220754",
    "ThreadId": "64825",
    "Html": "<p>According to MMO-Champion the armoury is now updated with all the 3.2 loot http://www.mmo-champion.com/</p>\r\n<p>Perhaps a good time to do a trawl of that into the itemcache and release v2.2.13? Or v2.2.14 if superstitious :)</p>",
    "PostedDate": "2009-08-07T06:23:28.68-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "220932",
    "ThreadId": "64825",
    "Html": "<p>My understanding is that v2.2.12 includes this &quot;new&quot; information, as it (.12) was released early in the morning before the MMOChamp post (I'm guessing the armory updated with this new info roughly around midnight, and Astryl picked up this data during a final Armory trolling).&nbsp; For example, those iLvL 272 backpieces that are specifically mentioned in the MMOChamp post are included with a fresh version of Rawr, if I'm not mistaken.</p>\r\n<p>Plus, I'm guessing we should just go ahead and warn everyone that they should update from the cache from the armory / Wowhead every few days/once a week following a major content patch like this one.</p>\r\n<p>Additionally, I really wouldn't worry too much about a UPDATE THIS RIGHT NOW TO INCLUDE ALL DATA type release of Rawr.&nbsp; It currently has most everything, and the only updates it really needs would be how to correctly classify/sort through the confusing system of loot this patch implemented, specifically the Horde/Alliance stuff, and the multiple tiers of the same items.</p>",
    "PostedDate": "2009-08-07T14:04:55.76-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "220953",
    "ThreadId": "64825",
    "Html": "<p>Yes. v2.2.12's default itemcache included all of that data.</p>",
    "PostedDate": "2009-08-07T15:20:09.467-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "220985",
    "ThreadId": "64825",
    "Html": "<p>Ah of course international time differences. I forgot you are all the way over in PDT, hence your update was indeed after the update soz for confusion. Absolutely no need to do a new version.</p>",
    "PostedDate": "2009-08-07T17:06:54.963-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "220988",
    "ThreadId": "64825",
    "Html": "<p>You're KILLING us here, Lev!</p>",
    "PostedDate": "2009-08-07T17:17:15.223-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "221111",
    "ThreadId": "64825",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>Astrylian wrote:</strong><br>\r\n<p>Yes. v2.2.12's default itemcache included all of that data.</p>\r\n</blockquote>\r\n<p>Most of the drop location data was incorrect though. It would say something dropped from 10-man Larry the Cable Guy when it was really 25-man Jimmy Dean.</p>\r\n<p>I manually updated many items and they corrected to what the armory now has.&nbsp; So a source refresh is probably worth it before 2.2.13 :).</p>",
    "PostedDate": "2009-08-08T08:52:45.26-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "221158",
    "ThreadId": "64825",
    "Html": "<p>Well, you're always getting the most current item cache for any Rawr release.</p>\r\n<p>Can't do anything retroactively about the drop location being incorrect, if the Armory / Wowhead gave the incorrect location info (or none at all).&nbsp; Just refresh the cache.</p>",
    "PostedDate": "2009-08-08T14:17:46.467-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]