[
  {
    "Id": "220817",
    "ThreadId": "64838",
    "Html": "<p>I am using Comodo Firewall. &nbsp;Comodo not only notifies me when programs attempt to make connections to the internet, it also notifies me when they try to do things like access my keyboard, which is apparently a favorite trick of keyloggers.</p>\r\n<p>Whenever I choose to open an existing file, or attempt to load a character from the Armory, I receive this alert from Comodo: &nbsp;&quot;Rawr is trying to access the keyboard directly.&quot; &nbsp;It then gives me the option to allow or block this behavior. &nbsp;I have always chosen to block it.</p>\r\n<p>Despite blocking this behavior, I am still able to open files and load characters from the Armory. &nbsp;Therefore, I conclude that this sudden need to access my keyboard isn't necessary to the operation of the program. &nbsp;I honestly can't figure what on earth Rawr needs to do with my keyboard that isn't served by the dialog box widgets themselves. &nbsp;Any ideas?</p>\r\n<p>Another interesting Comodo alert: &nbsp;Rawr attempts to install a global hook to&nbsp;C:\\Windows\\system32\\explorerframe.dll. &nbsp;Yet another one that I deny, and yet another one that doesn't seem to be necessary to the functioning of the program.</p>\r\n<p>Do we have a malware author hiding somewhere in our open source community? &nbsp;That sounds more sensationalist than I meant it to, sorry. &nbsp;I don't know who gets to touch the source code of Rawr.</p>",
    "PostedDate": "2009-08-07T08:47:07.21-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "220844",
    "ThreadId": "64838",
    "Html": "<p>I'll wait for someone who knows MS Net better, but I would suspect that this is behavior caused by MS Net. But hey, never hurts to doublecheck.</p>",
    "PostedDate": "2009-08-07T09:43:13.02-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "220882",
    "ThreadId": "64838",
    "Html": "<p>I'm guessing it's just cause by .NET using the common controls library.&nbsp; Anything could be hooking when that gets loaded and Rawr has zero control over that.&nbsp; The amount of dlls loaded when you open up a file dialog is amazing and depressing all at the same time.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-08-07T11:31:27.58-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "220929",
    "ThreadId": "64838",
    "Html": "<p>Comodo has really been acting weird for a little while now, as effective a protection as it is.&nbsp; I had to completely unload it from my system for the time being, as I could not even run or install a web-based Java application of any sort, even if I forced it to trust the source, trust the folder it was installed to, whatever.&nbsp; Hell, it totally blocked the splash screen of any Java application, which crippled most programs.&nbsp; And I spent upwards of 20 hours trying to &quot;fix&quot; it, to no avail.</p>",
    "PostedDate": "2009-08-07T13:56:30.467-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "220951",
    "ThreadId": "64838",
    "Html": "<p>I review the code in Rawr to ensure nothing malicious is included. And I always build releases only from what's checked in, so anyone can review the checked in code if they like.</p>\r\n<p>Everything you describe sounds like Comodo (never used it) is just screwing up.</p>",
    "PostedDate": "2009-08-07T15:16:58.793-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "221027",
    "ThreadId": "64838",
    "Html": "<p>Thanks all for the many replies.</p>\r\n<p>I don't think Comodo is screwing up, I think it's reporting the actual actions of Rawr. &nbsp;However, the cause of the action is probably benign (.NET) instead of malicious.</p>\r\n<p>Denying Rawr direct access to my keyboard has not prevented me from using the program, thankfully. &nbsp;I am extra skeptical, you understand, of any executable program targeted at players of WoW. &nbsp;That's why I run a firewall that does more than just prevent incoming connections.</p>\r\n<p>Anyway, you understand why I was concerned. &nbsp;Thanks!</p>",
    "PostedDate": "2009-08-07T21:58:51.177-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "221046",
    "ThreadId": "64838",
    "Html": "<p>As you should be, I wouldn't blame anyone for being skeptical. When I said that Comodo is screwing up, I mean that it's reporting actions when are benign; Rawr doesn't read any keypresses outside of its own window (and you're not typing any secure information into Rawr either). Regardless, I'm glad you're still able to use Rawr.</p>",
    "PostedDate": "2009-08-08T01:12:05.803-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]