[
  {
    "Id": "220902",
    "ThreadId": "64870",
    "Html": "<p>I play as a warlock and the curent Optimizer rules are very nice and seem to work.&nbsp; That being said, there are some other options I would like to have,&nbsp; For example, it would be nice to be able to get a gear spec for Maximum Haste or Maximum crit (or crit &gt;= x%).</p>\r\n<p>&nbsp;</p>\r\n<p>If we could get&nbsp; afew more dynamic options for the rules in the optimizer that would be very nice.</p>",
    "PostedDate": "2009-08-07T12:16:56.06-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "220918",
    "ThreadId": "64870",
    "Html": "<p>Shouldn't you just be concerned with dps? I mean, if it could generate a set with max haste but it cost you 1000dps what would be the point?</p>",
    "PostedDate": "2009-08-07T13:17:27.9-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "220936",
    "ThreadId": "64870",
    "Html": "<p>Well, there could be some sort of sense to this.&nbsp; For example, you could have an option to, for instance, make sure that crit is above a certain level for certain instances.&nbsp; A Fury Warrior, for example, procs Rampage (5% Crit) on their crits, and Rampage's uptime is dependent on the player's critting.&nbsp; So, while forcing a crit chance above, say, 35% may be a slight knock to personal DPS, it may a good option to help maximize Rampage uptime if you are the sole provider of the 5% physical crit buff for the raid.</p>\r\n<p>Likewise, having Haste at a very specific plateau for a certain class/spec may adjust the rotation in a very specific way, so it might be good to add a Haste restriction in there.</p>\r\n<p>However, if we're talking about simply having an arbitrary restriction being made available to the end user, that's probably not a good thing.&nbsp; Unless it's implemented for a very specific purpose or a power-user option, having non-cap-related stats available as an optimizer restriction for DPS classes detracts from the point of using Rawr - maximizing your effectiveness at a specific role (in this case, dealing damage).</p>",
    "PostedDate": "2009-08-07T14:14:38.163-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "238020",
    "ThreadId": "64870",
    "Html": "<p>I think it would be a great idea to implement Haste Rating in the Optimizer as a rule.. Lots of discutions are going on about how much haste you need for warlock and most say around 500-550, and i would like to use that as a criteria for my optimizer.</p>",
    "PostedDate": "2009-09-23T13:43:03.193-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]