[
  {
    "Id": "221034",
    "ThreadId": "64913",
    "Html": "<p>I have searched awhile to see if this has been asked previouy but unable to find answer. I am using lastest version 2.2.12 (although the issue also occured in previous versions). When i equip the Runed Dragon's Eye to a piece of gear it drops the piece to bottom of gear list and the &quot;<span>+39 Spell Power&quot; is grayed out. It's as if Rawr is not calculating the spell power. The other gems , i.e. Runed Cardinal Ruby, do not do this and their description, i.e &nbsp;<span>+23 Spell Power</span>,&nbsp;is in bold black, therefore calculating the spell damage and is at top of list. For example,&nbsp;on my&nbsp;Conqueror's Kirin Tor Hood, Rawr shows Chaotic Skyfire Diamond as Meta and Runed Cardinal Ruby as best choice with a 672.73 DPS rating. When I equip the Runed Dragon's Eye to replace the Ruby it drops the Hood&nbsp;to bottom selection with a 495.14 DPS rating.&nbsp;&nbsp;I have tried altering different settings like in a previous post about unchecking some of the (Rare) gems in the editing template, but nothing seems to work. I do have Jewelcrafting checked in the filtering option. Not sure if maybe has something to do with the dragon's eye gems previously being in the prismatic section of jewelcrafting list. Anyone had similar issue or solution? Thanks</span><br><br></p>",
    "PostedDate": "2009-08-07T23:37:09.807-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "221036",
    "ThreadId": "64913",
    "Html": "<p>Do you have 3 of them (Dragon's eyes of any sort) already equipped?</p>",
    "PostedDate": "2009-08-08T00:01:52.587-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "221038",
    "ThreadId": "64913",
    "Html": "<p>Ahh, how simple. Didn't realize Rawr took that into consideration. Thank you! It was driving me crazy.</p>",
    "PostedDate": "2009-08-08T00:17:11.02-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "221052",
    "ThreadId": "64913",
    "Html": "<p>Wouldn't be too helpful, if it tried to do things disallowed by the game mechanics.&nbsp; :)&nbsp; The easy solutions are always the most fun, though.&nbsp; Because it means less work.&nbsp; xD</p>",
    "PostedDate": "2009-08-08T01:59:02.057-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]