[
  {
    "Id": "221696",
    "ThreadId": "65104",
    "Html": "<p>Can we have a place where all module bugs are written down on the site so everyone knows what's currently not working?</p>",
    "PostedDate": "2009-08-10T13:24:55.31-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "221711",
    "ThreadId": "65104",
    "Html": "<p><a href=\"http://rawr.codeplex.com/Wiki/View.aspx?title=Models\">http://rawr.codeplex.com/Wiki/View.aspx?title=Models</a></p>\r\n<p>or, at least, I think that's where they should be.</p>",
    "PostedDate": "2009-08-10T13:54:56.21-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "221801",
    "ThreadId": "65104",
    "Html": "<p>how did you navigate to that page from the homepage?</p>",
    "PostedDate": "2009-08-10T18:20:55.9-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "221806",
    "ThreadId": "65104",
    "Html": "<p>On the home page, under the Features heading, is &quot;See the&nbsp;<a style=\"text-decoration:underline;color:#3e62a6\" href=\"http://rawr.codeplex.com/Wiki/View.aspx?title=Models\">Models</a>&nbsp;page for a list of models and their status.&quot;</p>",
    "PostedDate": "2009-08-10T18:23:00.687-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "221814",
    "ThreadId": "65104",
    "Html": "<p>and i can't seem to find any of the druid module bugs in those</p>",
    "PostedDate": "2009-08-10T18:37:24.777-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "221821",
    "ThreadId": "65104",
    "Html": "<p>That's the intention, but not all models use it. As far as Cat/Bear, there are no known calculation bugs (unless you count my ideas about how it'd be nice if it could optimize the FB/Rip usage split).</p>",
    "PostedDate": "2009-08-10T19:14:01.107-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "221827",
    "ThreadId": "65104",
    "Html": "<p>what about the bonus armor use effect bug</p>",
    "PostedDate": "2009-08-10T19:39:23.77-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "221829",
    "ThreadId": "65104",
    "Html": "<p>That's not a bug. That's a feature request. There's a difference.</p>",
    "PostedDate": "2009-08-10T19:40:10.487-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "221843",
    "ThreadId": "65104",
    "Html": "<p>something currently implemented is a future request?</p>",
    "PostedDate": "2009-08-10T20:36:06.953-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "221844",
    "ThreadId": "65104",
    "Html": "<p>you should probably take it out then, so people don't think it works</p>",
    "PostedDate": "2009-08-10T20:36:52.513-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "221846",
    "ThreadId": "65104",
    "Html": "<p>What? It's a feature request because it's *not* implemented.</p>",
    "PostedDate": "2009-08-10T20:42:03.707-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "221853",
    "ThreadId": "65104",
    "Html": "<p>the bonus armor for trinket procs, there is a little box that says &quot;bonus armor&quot; you should turn that box off until you implement it</p>",
    "PostedDate": "2009-08-10T21:30:47.333-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "221862",
    "ThreadId": "65104",
    "Html": "<p>I don't think you quite understand what you're talking about...&nbsp;</p>",
    "PostedDate": "2009-08-10T22:09:14.72-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "221875",
    "ThreadId": "65104",
    "Html": "<p>i'm saying it should be more obvious it's not implemented, because it will display an item with a special effect for bonus armor, it will allow you to create one, but unless you pay attention or edit an item, new users would not know that bonus armor does not work, because after all it does display and you can create an item with a bonus armor special effect</p>",
    "PostedDate": "2009-08-10T22:41:33.513-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "221932",
    "ThreadId": "65104",
    "Html": "<p>Out of curiosity... is the problem here that you think Astrylian said &quot;future&quot; instead of &quot;feature&quot;?</p>",
    "PostedDate": "2009-08-11T02:23:49.217-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "221944",
    "ThreadId": "65104",
    "Html": "<p>&nbsp;Sigh. So tired of arguing with assholes who presume to know more about this crap than me, that I'd rather just implement it than argue. All idols implemented as special effects, and support for Health and BonusArmor special effects in Bear, for v2.2.13, but no v2.2.13 release tonight, too late now.</p>",
    "PostedDate": "2009-08-11T03:00:16.1-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "222150",
    "ThreadId": "65104",
    "Html": "<p>i'm not arguing and i don't know more about it than you, i was asking if you would post that it's not working somewhere for everyone else</p>",
    "PostedDate": "2009-08-11T11:54:16.54-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "222224",
    "ThreadId": "65104",
    "Html": "<p>Unfortunately I have to agree with bigblackman, I also considered the fact that the proc on Furnace Stone wasn't working a bug, not a feature request (knowing a bit about what happens under the hood, if a stat/proc passes GetRelevantStats, it gets displayed. the assumption would be that it then gets used for the calculation). I just tested with the latest dev version and it works now.</p>\r\n<p>The fact that The Black Heart now is also supported, I would have considered a feature request. Thanks for that one.</p>\r\n<p>The fact that a normal 5-man drop seems to be better (BiS?) than 25-man heroic raid drops (for my 10-man naxx-geared tank atleast) is interesting... Any one else getting similar results or is something wacky with my character or item cache? (Been busy the last week, so haven't even considered doing Trial of the Champion in normal mode until now).</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-08-11T14:44:43.527-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "222247",
    "ThreadId": "65104",
    "Html": "<p>Yeah, I find the value on the Black Heart to be interesting as well. 7000armor really is a whole lot. At first I thought I may have screwed up, and it was giving base armor, not bonus armor, but it wasn't. The one thing that concerns me is that armor procs violate the rule that survival rating is reliable; an armor proc isn't reliable. Because of that, I kind of want to chop off its survival value somehow. That problem has been around for a long time, in agility procs, due to the armor you get from agi, but that amount is really insignificant.</p>\r\n<p>Any thoughts on how to handle procs that otherwise would add survival?</p>",
    "PostedDate": "2009-08-11T15:41:22.29-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "222683",
    "ThreadId": "65104",
    "Html": "<p>Atleast the armor will still add some mitigation part as well. Battlemaster trinkets that only give a health boost, only have survival value and no mitigation. If you start penalising, they become worthless. But there might be a difference in that an on-use effect could potentially be timed for the big hit (in a cooldown rotation for every big hit, for example emalon's aoe if you suddenly realise the pug's healers are questionable), although if the big hits are too frequent, it will at some point not be available.</p>\r\n<p>Until we find a single &quot;keeps you from dying&quot; rating (which we can probably all agree will vary from 1 boss to the next and probably even with your group setup) there will probably always be some edge cases that doesn't fit the definitions very nicely.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-08-12T12:56:28.693-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "222704",
    "ThreadId": "65104",
    "Html": "<p>I'm thinking of adding a slider in the options screen that would look something like...</p>\r\n<p>&nbsp;</p>\r\n<p>Value of Burst Survivability:</p>\r\n<p>&lt;---------------------|---------------------&gt;</p>\r\n<p>[None] &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;[Average] &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; [Full]</p>\r\n<p>&nbsp;</p>\r\n<p>ie, at [None], burst survivability would have 0 value. At [Average] it would work out to whatever the average over the fight would be, just like it currently is. And at [Full], it would be the full burst value (ie, the 7000whatever armor for the black heart). And it would smoothly average between those as you move the slider. This could allow us to value things like pain supression, SI, SI glyph, Barkskin, etc. And on a fight where you're tanking for limited periods of time, so can really stack your cooldowns during those time (ie, Steelbreaker P3, Thorim P2, etc), you can push it more towards Full. Or where there's constant danger, that you need to be able to survive at all times, you would push it more towards None.</p>\r\n<p>How does that sound?</p>",
    "PostedDate": "2009-08-12T13:54:59.437-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "222711",
    "ThreadId": "65104",
    "Html": "<p>What Astry hinted at sounds like a fantastic idea.&nbsp; It can account for / handle a large number of situations that would come up.</p>\r\n<p>However, we also need a way to separate the type of damage into physical/spell classes.&nbsp; Armor wouldn't really do anything for large magical burst damage, for example.&nbsp; This is really a tangential topic, though, but one that is a serious deficiency, in my eyes.&nbsp; (Speaking from ProtWarr perspective, as I'm not too well versed in the other tanking modules, though I believe them to be similar in this regard.)</p>",
    "PostedDate": "2009-08-12T14:09:37.007-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "222738",
    "ThreadId": "65104",
    "Html": "<p>Yeah, the most obvious situation of Steelbreaker has the big fusion punch as nature damage, that isn't suitably handled as easily/at all.</p>",
    "PostedDate": "2009-08-12T15:23:33.22-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "222807",
    "ThreadId": "65104",
    "Html": "<p>Maly breath when it was progression.&nbsp; Sarth breath when it's amped up.&nbsp;&nbsp; They exist everywhere.</p>",
    "PostedDate": "2009-08-12T21:38:11.42-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]