[
  {
    "Id": "221834",
    "ThreadId": "65139",
    "Html": "<p>A few days after the patch came out, now that I've got some emblems of conquest to spend, I decided to build an upgrade list to determine how&nbsp;my enhancement shaman can&nbsp;best spend them.&nbsp; I found it strange that I wasn't noticing any items bought through emblems of triumph on the list.&nbsp; Later, when I checked the vendor in game, I found at least 2 of the items in game (a belt and a totem) that are not showing up in Rawr.&nbsp; I double checked the filters and the badges filter has a check next to it, as does every item in that subcategory, so they shouldn't be getting filtered out.&nbsp; I currently have version 2.2.12 and I've tried updating the item cache from both wowhead and the armory.&nbsp; Are these items just not programmed in yet?</p>",
    "PostedDate": "2009-08-10T20:03:50.15-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "221842",
    "ThreadId": "65139",
    "Html": "<p>All known 3.2 items are included in v2.2.12. If you're not seeing them, ensure that you don't have them filtered out, and don't have their item types refined out. If you still don't see them, use Edit Items to see if they're in the item cache, but only have stats which aren't modeled yet (applies to new relics). If you still don't see them, add them. If that doesn't work, post the items here.</p>",
    "PostedDate": "2009-08-10T20:35:13.687-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "221861",
    "ThreadId": "65139",
    "Html": "<p>I wonder if part of the problem is from updating the item cache from the armory, which didn't turn up a lot of the items.&nbsp; I tried the Edit Items function to look for a couple of the items.&nbsp; It appears some were there and some were not.</p>\r\n<p>Totem of Quaking Earth: on the list</p>\r\n<p>Pauldrons of the Devourer: absent</p>\r\n<p>Dexterous Brightstone Ring: on the list</p>\r\n<p>Mark of Supremacy: absent</p>\r\n<p>I'll try&nbsp;updating from wowhead again and see if that helps.&nbsp; If they're not shown as being bought with emblems of triumph, they may be getting filtered out.</p>",
    "PostedDate": "2009-08-10T22:06:24.617-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "221882",
    "ThreadId": "65139",
    "Html": "<p>Odd.&nbsp; After updating from wowhead, the items I couldn't find in the editor are there now.&nbsp; But until they update these items in wowhead or the armory, I'm guessing I'll need to keep the unknown box checked to keep these from getting filtered out.</p>",
    "PostedDate": "2009-08-10T23:12:47.233-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]