[
  {
    "Id": "222318",
    "ThreadId": "65279",
    "Html": "<p>Why is Rawr&nbsp;telling me I have 1773 Arcane/Fire/Frost damage&nbsp;but in game I have 1335 spellpower...</p>\r\n<p>Same with Crit... Rawr is telling me I have 32.78%* but in game I have 14.12%.&nbsp;</p>\r\n<p>I assume Rawr is pulling in my spec and adding things with the crit, but where's all the extra spellpower coming from?</p>\r\n<p>Kind of disappointed, I built a gear set in Rawr which led me to believe I'd meet the requirements for frostfire spec, but now it looks like the numbers were wrong and I'm going to fall far short....</p>\r\n<p>If you want to check it out yourself, I'm Grovel of Maelstrom (gear shouldn't chance for a couple days).</p>",
    "PostedDate": "2009-08-11T21:18:55.85-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "222325",
    "ThreadId": "65279",
    "Html": "<p>The numbers are not wrong. Rawr includes talents, gear, buffs, etc. If you're looking at your character screen in-game, unbuffed, you're going to see a massive difference, and that's not wrong.</p>",
    "PostedDate": "2009-08-11T21:48:41.46-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "222489",
    "ThreadId": "65279",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>Astrylian wrote:</strong><br>\r\n<p>The numbers are not wrong. Rawr includes talents, gear, buffs, etc. If you're looking at your character screen in-game, unbuffed, you're going to see a massive difference, and that's not wrong.</p>\r\n</blockquote>\r\n<p>No, you're right, they're not wrong- but Rawr defaulting all my stats to assume I'm completely raid buffed certainly gave me the wrong impression. Well, back to the drawing board.</p>\r\n<p>&nbsp;</p>\r\n<p>Is there a way to turn off buffs by default so they don't automatically load every time I load a new character?</p>",
    "PostedDate": "2009-08-12T06:20:17.1-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "222627",
    "ThreadId": "65279",
    "Html": "<p>No, a decent level of raid buffs is the correct default. However, there is a buff sets feature coming that lets you switch between buff sets, similar to switching between talent specs. Unbuffed be one of the default buff sets.</p>",
    "PostedDate": "2009-08-12T10:40:01.62-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]