[
  {
    "Id": "222561",
    "ThreadId": "65356",
    "Html": "<p>I looked at both the Batch help page, and the EJ Rawr.Mage discussion, and didn't see answers to these.</p>\r\n<p>Is the &quot;Weight&quot; column in &quot;Batch Tools&quot; an absolute weight, or a relative weight?</p>\r\n<p>Example: My Druid's Rawr.Moonkin score is around 8k.&nbsp; His Rawr.Tree score is around 16k.&nbsp; I've got this new helm, and I need to decide if I will gem it for Moonkin or for Tree.&nbsp; Let's say I'd value a 1% increase in Moonkin (score +80) as being equal to a 1% increase Tree (score +160).&nbsp; Should the weights be equal (1% == 1%), or should the Moonkin weight be twice the tree weight (2*80 = 1*160)?</p>\r\n<p>I suspect an absolute weight, since it is easier to formulize (overall optimization is dot product of weights and scores), but it wasn't obvious from the documentation.</p>\r\n<p>Separate question: Am I correct that for all of the various Optimize/Upgrade options under Batch Tools/Tools that it will</p>\r\n<p>1) Use available gear/gemmings/enchants/filter based on the currently loaded character (Rawr main window)?</p>\r\n<p>2) Use talents/fight options/model settings/model based on the character on each line of the Batch Tools grid?</p>\r\n<p>So that if I want Tree to consider using Ember Skyflare Diamond, it needs to be in the main-window gemming template, and it doesn't matter whether or not it is in the ErdTreeRaidHeal.xml (which is not main window, just one of the Batch entries).</p>",
    "PostedDate": "2009-08-12T08:28:45.003-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "222768",
    "ThreadId": "65356",
    "Html": "<p>It is absolute weight.</p>\r\n<p>total score = sum of weight_i * score_i</p>\r\n<p>1) Basic optimize/upgrade will use availability of each character when optimizing that particular character. Batch/progressive version use availability of the first character in the batch list for the whole set.</p>\r\n<p>2) Correct.</p>",
    "PostedDate": "2009-08-12T17:03:10.097-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]