[
  {
    "Id": "222983",
    "ThreadId": "65483",
    "Html": "<p>Hello,</p>\r\n<p>I'm trying to go in to RAWR and creating a new character that I have on Aleajecta Server. (Side note: When I try to grab my user from Aleajecta server &amp; Region CN, it says it doesn't find my character). So when I tried to manually create my character which has all Burning Crusades items, since the server I'm on is only running Burning Crusades, I can't find anything. What do I need to do to get this to work for Burning Crusades and remove the Wraith King items?</p>\r\n<p>&nbsp;Thanks,</p>\r\n<p>Mark</p>\r\n<p>PS... I'm a Silverlight developer as well. I like where you guys are going with this. I find that the Silverlight version is more stable than the 2.2.13 version with what I have used of it, so far. Which is not much as you can see above.</p>",
    "PostedDate": "2009-08-13T08:10:19.453-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "223012",
    "ThreadId": "65483",
    "Html": "<p>I'm suspicious that CN armory loads won't work, since CN doesn't have the latest version of the Armory, I expect. Regardless, you're probably not finding any BC items, because there's a BC filter (see top right) that you need to turn. If there are any items that you don't find, you can add them (see readme/help docs). That said, Rawr's calculations are intended for level 80s, so you're probably going to find some oddness/inaccuracy.</p>",
    "PostedDate": "2009-08-13T09:26:04.773-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "223022",
    "ThreadId": "65483",
    "Html": "<p>Well this is a great idea. But it seems like it will be more work for me than not. I did turn on the BC filter and I'm still not seeing my items.&nbsp;If I&nbsp;can't&nbsp;filter out the WoTK, it will take forever to figure out what item is&nbsp;part of&nbsp;which version.&nbsp;This is very driven&nbsp;to WoTK, which I understand. Looks like this tool started being developed last year which is when WoTK is the latest and greatest thing. I just hope the server gets to WoTK sooner than later, I would really like to try this tool out.</p>\r\n<p>Thanks for your time.</p>\r\n<p>Mark</p>\r\n<p>PS - If you guys need help with Silverlight let me know.</p>",
    "PostedDate": "2009-08-13T09:53:31.423-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "223028",
    "ThreadId": "65483",
    "Html": "<p>Heh, Rawr's been around since classic WoW. :) &nbsp; Yeah, using it for BC theorycrafting right now would be quite difficult, and inaccurate.</p>\r\n<p>We definitely welcome more help, but without being able to play WotLK, I fear your assistance would be pretty limited. :(</p>",
    "PostedDate": "2009-08-13T10:09:35.763-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "223205",
    "ThreadId": "65483",
    "Html": "<p>Aleajecta is a private server - Armory import only supports official WoW servers with the latest armory version</p>",
    "PostedDate": "2009-08-13T19:02:47.15-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]