[
  {
    "Id": "223003",
    "ThreadId": "65488",
    "Html": "<p>Whenever i use optimizer, it advises me put in all +20 str gems and go back to CSF as the meta i should be using.</p>",
    "PostedDate": "2009-08-13T09:04:00.75-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "223015",
    "ThreadId": "65488",
    "Html": "<p>Do you have Enforce Gem Requirements checked? Is this the latest version of Rawr? Post your character file if so.</p>",
    "PostedDate": "2009-08-13T09:27:22.837-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "223025",
    "ThreadId": "65488",
    "Html": "<p>Rawr does seem to still have a habit of playing Dragon's Eye in wrong colored sockets, despite when matching the socket bonus might be better overall with the dragons eye in a proper socket, so it may still consider them prismatic in the optimizer. Rawr itself, at least in the DPS DK and TankDK modules, does not treat Dragons Eye as prismatic in regards to socket bonuses.</p>",
    "PostedDate": "2009-08-13T10:05:01.627-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "223029",
    "ThreadId": "65488",
    "Html": "<p>Can you post a character file illustrating this, Devwar?</p>",
    "PostedDate": "2009-08-13T10:10:39.197-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "223141",
    "ThreadId": "65488",
    "Html": "<p>When i do check Endofrce Gem Requirements, it switches my meta to CSF and uses 2 Sovereign (str+stam) gems to meet the requirement. Pretty much everywhere i've looked, that's said to be lower dps than using the RED meta and just using one Nightmare Tear (which is what i'm currently doing). The two purple gems are used to pick up a +4 str and a +6 str socket bonus and new 'optimized' set is always at least 150dps lower than what i'd have on.</p>\r\n<p>http://www.filefront.com/14277863/Ret.xml</p>\r\n<p>link to the profile</p>",
    "PostedDate": "2009-08-13T15:21:09.043-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "223147",
    "ThreadId": "65488",
    "Html": "<p>Check your gemming templates; sounds like you only have rare gemming templates selected, not epic ones. Additionally, if none of those gemming templates include a Nightmare's Tear, you need to explicitly mark the nightmare's tear as available. Same with the metagem.</p>\r\n<p>This isn't an issue with the Optimizer, this is just an issue with the choices you're giving the optimizer.</p>",
    "PostedDate": "2009-08-13T15:41:47.113-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "223151",
    "ThreadId": "65488",
    "Html": "<p>No, i have the rare gemming templates turned off. I only has the JC and epic templates selected. You are right in that none of them did include a Nightmare's Tear. I created a custom template that did include a tear with no luck. It would recognize the tear but still preffered the CSF as the meta of choice and would use the tear and a purple gem. The only way i could get it to use the correct meta was to disable the JC gemming template (which meant no Dragon's Eyes). There are 2 templates assigned for JC and both of them have the CSF as the meta of choice and i don't seem to be able to edit that.</p>",
    "PostedDate": "2009-08-13T15:53:13.697-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "223156",
    "ThreadId": "65488",
    "Html": "<p>Any gem in any enabled gemming template is considered available to the optimizer (unless you turn that option off in the Options dialog). With those enabled, the tear and RED available, optimize again. What does it tell you to change? If it ever returns a result that <strong>lowers</strong> your DPS, that means that something you have in your current character <em>isn't</em>&nbsp;marked available.</p>",
    "PostedDate": "2009-08-13T16:03:47.5-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "223181",
    "ThreadId": "65488",
    "Html": "<p>Its working now. I think i just had to restart rawr for the the gemming templates to kick in.</p>",
    "PostedDate": "2009-08-13T16:57:05.657-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]