[
  {
    "Id": "224788",
    "ThreadId": "66174",
    "Html": "<p>Hi,<br><br>First, sorry for my english ;)<br><br>There is something I don't understand. When I run the Optimize function, Rawr put a bad gems color into a wrong socket, for exemple a orange into a blue socket. I tried to run this function with and without &quot;Override Regem&quot; check, there is the same. In my gemming template I have only one custom template with gems into the good color socket.<br><br>I tried this with my caracter (Moonkin) and with a friend's caracter (hunt), same problem.<br><br>So, I think I miss something, but I don't know what. Could you explain it to me, please?</p>\r\n<p>Thanks a lot.</p>\r\n<p>Raoul</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-08-18T00:35:41.407-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "224797",
    "ThreadId": "66174",
    "Html": "<p>That sounds fine, what's wrong with that? It'll use an orange in a blue, if that produces more DPS.</p>",
    "PostedDate": "2009-08-18T01:08:58.783-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "224801",
    "ThreadId": "66174",
    "Html": "<p>Edited (wrong comment ;) )</p>\r\n<p>But is there a way to force Rawr to use good gem color with good color?</p>",
    "PostedDate": "2009-08-18T01:19:07.667-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "224812",
    "ThreadId": "66174",
    "Html": "<p>Yes, for comparsion charts only, you could enable only gemming templates that match socket bonuses. However, really question yourself on why you'd want to do that; that's a DPS loss.</p>",
    "PostedDate": "2009-08-18T01:53:36.637-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "225047",
    "ThreadId": "66174",
    "Html": "<p>I've got the same problem than raoul2k9 but with the metagem in the helmet I lost the bonus of the meta because I need a red gem and rawr do not put red gem</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-08-18T10:38:30.08-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "225115",
    "ThreadId": "66174",
    "Html": "<p>There is a simple way to make sure that Rawr puts enough of each color gem to meet whatever requirement a given meta gem might have - on the Stats tab, underneath your Character's name and server info, there is a checkbox called &quot;Enforce Gem requirements.&nbsp; Check it.</p>\r\n<p>Rawr intentionally does not match all sockets to pick up socket bonuses.&nbsp; Think of it this way (ignoring meta requirements): What if a given blue socket granted you +1 Attack Power(AP)?&nbsp; Would you intentionally go out of your way to pick up that socket bonus by putting in a +10AP/+15Stam gem, if you could otherwise just socket in a +20AP gem?&nbsp; From a purely DPS standpoint, that doesn't make sense.</p>\r\n<p>But what if that socket bonus were +2AP?&nbsp; Would it be worth it then?&nbsp; Still, the answer is &quot;No, it's not worth it&quot;.&nbsp; The socket bonus would have to be worth a whopping +10AP to just be on par with ignoring the socket bonus.</p>\r\n<p>The great thing?&nbsp; <strong>Rawr calculates exactly where these breakpoints for matching or not matching socket bonuses lie.</strong>&nbsp; That's the whole point of Rawr - determining the best TOTAL character setup, given the variables input as accurate.&nbsp; So, Rawr calculates if matching the socket bonus gives more DPS than ignoring it for the best gem regardless of color, and makes its decisions accordingly.</p>\r\n<p>There are of course a number of other variables I intentionally left out, but this is really the core concept.</p>\r\n<p>&nbsp;</p>\r\n<p>Now, on the idea of having an option to &quot;force&quot; all sockets to be matched with a gem that would activate its relevant socket bonus, I can see some value in this, for certain situations.&nbsp; Doing a Freya+3 attempt or potentially a Faction Champions encounter, the extra Stam (in this example) might be nice, despite the lack of purely DPS modeling .&nbsp; A better case might be in a tanking model, where matching the socket bonuses generally lends more overall stats in a positive (to the end goal) way.&nbsp; Even given these situations as arguments for the existence of a &quot;match gem sockets with correct component color gems&quot;, though, I can't in my right mind advocate the existence of such an option within Rawr.&nbsp; It already calculates the.&nbsp; If you wish to consciously ignore its recommendations, that's perfectly alright - I do it all the time, for very measured reasons, of course.&nbsp; But telling Rawr to blindly match every socket bonus is a BAD thing in the OVERWHELMING number of cases, and is not in line with the purposes of Rawr as a modeling and optimizing utility.</p>",
    "PostedDate": "2009-08-18T12:55:39.353-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "225292",
    "ThreadId": "66174",
    "Html": "<p>And again, you can just only enable socket-matching gemming templates to get this effect if you <em>reaalllllly</em>&nbsp;want to.</p>",
    "PostedDate": "2009-08-19T00:00:38.183-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "225304",
    "ThreadId": "66174",
    "Html": "<p>I'm OK (I've retest it and it's working) but sometimes Rawr do strange things ...</p>",
    "PostedDate": "2009-08-19T00:28:45.867-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]