[
  {
    "Id": "224974",
    "ThreadId": "66242",
    "Html": "<p>I think I'm missing something when I try to create a filter for the iLvl of an item.</p>\r\n<p>I go to &quot;Tools -&gt; Edit Item Filter...&quot; I make a new filter and call it &quot;iLvl&quot; and set the minimum to 200 and the maximum to 230. Yet I still get items in my list that have an iLvl of 245 such as &quot;Hood of Fiery Aftermath.&quot; I try to refresh from Wowhead and/or armory and neither one gets rid of it. Instead it just switches it's position with the horde version on the list. :)</p>\r\n<p>It says that both of the items mentioned above are &quot;Not found on armory.&quot; Is that why it won't filter them out? Even though Wowhead knows where they come from (at least for these two items) and knows what iLvl they are, I can't get rid of them?</p>",
    "PostedDate": "2009-08-18T08:42:44.647-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "224986",
    "ThreadId": "66242",
    "Html": "<p>Have you at the help page on filtering? How to setup the logic filters can be confusing. I don't recall offhand (see that help page), but I believe for this situation you'd want to create a filter of ilvl 231-258, mark it as an additive filter (might have it backwards, try with additive off if that doesn't work; again, see help page), and uncheck the filter.&nbsp;</p>",
    "PostedDate": "2009-08-18T09:03:01.933-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "225011",
    "ThreadId": "66242",
    "Html": "<p style=\"font-size:150%\"><a href=\"http://www.codeplex.com/Rawr/Wiki/View.aspx?title=ItemFiltering\">Item Filtering Help Page</a></p>",
    "PostedDate": "2009-08-18T09:45:03.307-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "225028",
    "ThreadId": "66242",
    "Html": "<p>I got that. Except it doesn't filter out what I tell it to when I set up the filter according to the &quot;<a href=\"http://www.codeplex.com/Rawr/Wiki/View.aspx?title=ItemFiltering\">Item Filtering Help Page</a>&quot; It still leaves blues with a 187 iLvl. Soooooooo that help page was not so helpful? Sorry, maybe I'm still doing something wrong. I don't put in a pattern and I have to put in a maximum so I put 240. For minimum quality I put Epic and maximum at Heirloom. Do I need &quot;Additive Filter&quot; checked? Any thoughts on what I'm doing wrong?</p>",
    "PostedDate": "2009-08-18T10:09:00.903-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "225030",
    "ThreadId": "66242",
    "Html": "<p>did you make sure that it's the only filter selected?</p>\r\n<p><img src=\"http://hunterloot.com/misc/filters_1.png\" alt=\"\"></p>\r\n<p><img src=\"http://hunterloot.com/misc/filters_2.png\" alt=\"\"></p>",
    "PostedDate": "2009-08-18T10:14:26.55-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "225036",
    "ThreadId": "66242",
    "Html": "<p>Thank you so very much. I didn't realize I couldn't use it in conjunction with the Dungeon/Emblem/etc etc etc filters. Again, thank you very much.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-08-18T10:20:37.987-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]