[
  {
    "Id": "225176",
    "ThreadId": "66295",
    "Html": "<p>I've been using the healidin module to come up with the best setup. I have all the gemming templates checked, for epic and jeweler gems, but the nightmare tear does not get selected. In the gem section where I can manual choose gems, the nightmare tear does not even come up. Can't figure out why it is not coming up as an option to use the nightmare tear.</p>",
    "PostedDate": "2009-08-18T15:52:23.087-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "225222",
    "ThreadId": "66295",
    "Html": "<p>For some reason, you have to deselect the &quot;hide unavailable gems&quot; option in the filters to get the Nightmare Tear to show.</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-08-18T19:06:13.353-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "225226",
    "ThreadId": "66295",
    "Html": "<p>Just tried that and it didnt work. Also tried deleting all the filters, that did not work either.</p>",
    "PostedDate": "2009-08-18T19:21:27.56-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "225228",
    "ThreadId": "66295",
    "Html": "<p>Go to Tools&gt;Edit Items, and in the top left corner, type in &quot;Nightmare Tear&quot;.&nbsp; If it turns up no results, then on the bottom left corner hit &quot;add&quot;, and type in Nightmare Tear.</p>",
    "PostedDate": "2009-08-18T19:51:09.23-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "225242",
    "ThreadId": "66295",
    "Html": "<p>It's already in that menu too</p>",
    "PostedDate": "2009-08-18T21:23:10.23-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "225250",
    "ThreadId": "66295",
    "Html": "<p>Ok, seems like its a bug. It reappears if I choose the ret module, but disappears on the healidin module</p>",
    "PostedDate": "2009-08-18T21:53:53.013-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "225254",
    "ThreadId": "66295",
    "Html": "<p>Remove the spirit from it. Healadin has a silly 'all items with spirit are irrelevant' thing... Can you fix that, Ermad?</p>",
    "PostedDate": "2009-08-18T21:57:15.967-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "225996",
    "ThreadId": "66295",
    "Html": "<p>It's a good point though, why is it not by default in the gemming templates for retribution paladins?</p>\r\n<p>I just added it manually for fun as &quot;custom&quot; with the nightmare tear in the prismatic slot (and nothing else), and surprise.. optimize give me an 11 points increase by swapping an epic strength/stam gem by that and my prismatic gem, for the one with 2 blue gems.</p>\r\n<p>It gives me 10 strength (plus other stats), which is the same amount than my epic blue gem but it also enable the socket +6 strength bonus, so basically, this is an good upgrade.</p>",
    "PostedDate": "2009-08-20T12:33:28.733-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]