[
  {
    "Id": "225557",
    "ThreadId": "66395",
    "Html": "<p>I'm using Rawr for my healadin, and I've searched and looked for about a day but cannot find the answer.</p>\r\n<p>I'm looking to see what the effect of using non-standard items is.&nbsp; For instance I have Firesoul (+hit sword) and I can't seem to get it to select that as my item without updating from armory.&nbsp; Likewise, I want to see how useful Embrace of Madness is - just for grins - but I can't choose that either.&nbsp; How do I get it to show those items?&nbsp; I can't find any settings for item filters that are off and I can't for the life of me figure out what I'm doing wrong!</p>\r\n<p>&nbsp;</p>\r\n<p>Much thanks in advance.</p>",
    "PostedDate": "2009-08-19T11:58:54.02-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "225578",
    "ThreadId": "66395",
    "Html": "<p>Nothing that you're doing wrong.&nbsp; Healadin currently filters out items with irrelevant stats (Hit, Spirit, etc.), apparently.</p>",
    "PostedDate": "2009-08-19T12:41:11.437-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "225608",
    "ThreadId": "66395",
    "Html": "<p>Ugh, is there anything at all I can do to modify that?&nbsp; At least temporarily to add those items? (Besides waiting until my armor updates each time?)</p>",
    "PostedDate": "2009-08-19T14:17:50.91-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "225613",
    "ThreadId": "66395",
    "Html": "<p>A quick solution that isn't a good one, but should do okay for your purpose, is to remove the hit from that gear using the Edit Item function. This may impact any other models you use however.</p>",
    "PostedDate": "2009-08-19T14:38:05.63-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "225628",
    "ThreadId": "66395",
    "Html": "<p>That worked great!&nbsp; Thank you!</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-08-19T15:24:38.47-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "225944",
    "ThreadId": "66395",
    "Html": "<p>I am going to try implement an option in the options tab that you can toggle it counting items with spirit and hit as irrelevant or not.</p>",
    "PostedDate": "2009-08-20T09:47:48.443-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]