[
  {
    "Id": "225717",
    "ThreadId": "66445",
    "Html": "<p>Gentlemen,</p>\r\n<p>Outstanding work on Rawr.&nbsp; I've been a user since it was all but a feral only program.&nbsp; How do I make gear comparisons within Rawr that keep one or two items fixed while optimizing the rest?&nbsp;</p>\r\n<p>Right now I am trying to set up my kitty gear.&nbsp; Since my tank set is the primary set, I have to weigh using 2T8.5 gemmed and chanted for tanking (stam, etc.) vs using 4T7 gemmed and chanted for dps (agi/hit, etc.)&nbsp; For example, I want the optimizer to evaluate my Conqueror's Nightsong Cover with a +stam meta and tank Arcanum vs. a Heroes' Dreamwalker Cover with a +agi meta and dps chant on it.&nbsp; Whenever I try to use the T8.5, Rawr uses it with the DPS gems/chants.&nbsp; I have to keep them set up for tanking and I want Rawr to ignore those versions.&nbsp; The &quot;Delete Custom Gemming&quot; option from the menu is grayed out.</p>\r\n<p>Thanks in advance.</p>\r\n<p><br>P.S.&nbsp; I did a search on &quot;fixed gems&quot; &quot;delete custom&quot; &quot;lock gems&quot; and several others to no avail.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-08-19T22:14:00.717-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "225719",
    "ThreadId": "66445",
    "Html": "<p>Thanks!</p>\r\n<p>Look at the help topic on gear optimization, at the part about marking gear as specifically available (blue diamond/red dot).</p>",
    "PostedDate": "2009-08-19T22:20:13.627-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "225946",
    "ThreadId": "66445",
    "Html": "<p>You can also use the Batch Tools: Progressive Optimize to</p>\r\n<p>1) Optimize for the best possible Bear kit.</p>\r\n<p>2) Get the best possible Cat kit, that doesn't involve re-gemming or re-enchanting anything that was selected for the bear kit. &nbsp;Of course the bear gear can still be worn for kitty, it just won't get modified.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-08-20T09:51:54.69-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "227005",
    "ThreadId": "66445",
    "Html": "<p>Out of curiosity, which of these methods is better? I've never quite gotten a grasp on Batch Tools, so I've gotten by through building progressive profiles (base profile, run optimize and save main spec profile, make changes and run optimize for dual spec profile).</p>\r\n<p>Just a note though, there's some tricks to this method that aren't really mentioned in the gear optimization help. First, it's a very good idea to change models first, so that Rawr displays the gear it will actually be considering. After that, I sort the gear slots alphabetically - not only do I have to mark each item with the blue diamond or red dot, I've found I have to also specifically remove other gemmings from the list (just one, all the non-locked items then become correctly unavailable), and they're clustered all together when it's alphabetized. So far as I can tell this has to be done unless you have more than one of the same item.</p>",
    "PostedDate": "2009-08-24T05:18:24.973-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "227116",
    "ThreadId": "66445",
    "Html": "<p>The Batch Tools way is more complicated, but allows you to specify weights to the different sets. ie, I'm usually a Bear, but using this item for Cat would be a gigantic DPS upgrade, and not impact my tanking very much, so I want to do it, that sort of thing. If you use the simple method, you're restricted to just optimizing one set (ie, Bear), and then optimizing the second set with whatever's left over (ie, Cat).</p>",
    "PostedDate": "2009-08-24T09:50:37.157-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "227270",
    "ThreadId": "66445",
    "Html": "Thanks for all the feedback.  I found the ctrl-click to make the diamond blue helpful but there were times it seemed Rawr still  tried to optimize that slot with a different gemming.  Also, I couldn't find a way to compare 2 items with different chants (i.e. Valorous Nightsong Helm w/tank chant vs. Hero's Dreamwalker Helm w/dps chant) Rawr seemed to optimize the chant or not, not compare two pieces with different enchants.  For single items, I can get a pretty good idea by simply sorting for overall value, but with 0 vs 2 vs 4 piece bonuses I can't easily solve for that.<br>\r\n<br>Thanks again for all the help.  Any more would be appreciated.<br><br><div>On Mon, Aug 24, 2009 at 7:18 AM, solitha <span dir=ltr>&lt;<a href=\"mailto:notifications@codeplex.com\">notifications@codeplex.com</a>&gt;</span> wrote:<br>\r\n<blockquote style=\"margin:0pt 0pt 0pt 0.8ex;padding-left:1ex\">   <div> <p>From: solitha</p> <div><p>Out of curiosity, which of these methods is better? I've never quite gotten a grasp on Batch Tools, so I've gotten by through building progressive profiles (base profile, run optimize and save main spec profile, make changes and run optimize for dual spec profile).</p>\r\n\r\n<p>Just a note though, there's some tricks to this method that aren't really mentioned in the gear optimization help. First, it's a very good idea to change models first, so that Rawr displays the gear it will actually be considering. After that, I sort the gear slots alphabetically - not only do I have to mark each item with the blue diamond or red dot, I've found I have to also specifically remove other gemmings from the list (just one, all the non-locked items then become correctly unavailable), and they're clustered all together when it's alphabetized. So far as I can tell this has to be done unless you have more than one of the same item.</p>\r\n</div><div> <div> <p>Read the <a href=\"http://rawr.codeplex.com/Thread/View.aspx?ThreadId=66445&ANCHOR#Post227005\">full discussion online</a>.</p> <p>To add a post to this discussion, reply to this email (<a href=\"mailto:Rawr@discussions.codeplex.com?subject=[Rawr:66445]\">Rawr@discussions.codeplex.com</a>)</p>\r\n <p>To start a new discussion for this project, email <a href=\"mailto:Rawr@discussions.codeplex.com\">Rawr@discussions.codeplex.com</a></p> <p>You are receiving this email because you subscribed to this discussion on CodePlex. You can <a href=\"http://www.codeplex.com/site/discussions/thread/unsubscribe/66445\">unsubscribe</a> on codePlex.com.</p>\r\n <p>Please note: Images and attachments will be removed from emails. Any posts to this discussion will also be available online at <a href=\"http://codeplex.com\">codeplex.com</a></p> </div> </div></div> </blockquote>\r\n</div><br>",
    "PostedDate": "2009-08-24T17:25:35.907-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "227273",
    "ThreadId": "66445",
    "Html": "<p>OK, after reading Astrylian's comments on the bottom of the main page, I realized the reason Rawr was over-writing gemming was I failed to de-select the green diamonds before selecting the blue.&nbsp; I thought Rawr would use the blue ones regardless of whether or not green diamonds were selected.&nbsp; I still am having trouble comparing two items with different enchants.&nbsp; Thanks.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-08-24T17:41:16.817-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "227292",
    "ThreadId": "66445",
    "Html": "<p>Yeah, the 'both blue and green' situation is an odd one, usability-wise. It does have a valid use (a very rare one), so we leave it in at the moment, but we'd like to revamp that when we have a chance.</p>\r\n<p>To compare different enchants, right click on the diamond for an item and choose the enchant for that item.</p>",
    "PostedDate": "2009-08-24T19:26:20.013-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]