[
  {
    "Id": "226365",
    "ThreadId": "66612",
    "Html": "<p>Hi,</p>\r\n<p>&nbsp;&nbsp;Take dps for instance. Currently, the dps calculated by rawr is way less than the actual dps in game. And too incorrect for frost or blood dps.</p>\r\n<p>&nbsp;&nbsp;Although, somehow rawr is still able to tell me whether a gear is better, with nothing else changed. When I re-model my char, for example, to see if another talent is better for me. I cannot get the right answer.</p>\r\n<p>&nbsp;&nbsp;I do not know how rawr calculate the dps. But with some experience, I think the way it uses is nothing like the skills we actual used.</p>\r\n<p>&nbsp;&nbsp;For example, frost DW. It tells me that <a style=\"color:#a335ee !important;cursor:pointer;text-decoration:none;font-family:Verdana, sans-serif\" href=\"http://www.wowhead.com/?item=45254\">Sigil of the Vengeful Heart</a>&nbsp;is better than <a style=\"color:#a335ee !important;cursor:pointer;text-decoration:none;font-family:Verdana, sans-serif\" href=\"http://www.wowhead.com/?item=40207\">Sigil of Awareness</a>, since awareness contributes 0 to my dps. How could that be possible? Does it mean that rawr uses NO <a style=\"color:#1eff00 !important;cursor:pointer;text-decoration:none\" href=\"http://www.wowhead.com/?spell=60837\">Obliterate</a>&nbsp;in dps calculating?</p>\r\n<p>&nbsp;&nbsp;So I say, let's add the function of skills loop to rawr. This would be very helpful.</p>\r\n<p>&nbsp;&nbsp;How do you think?</p>",
    "PostedDate": "2009-08-21T08:27:00.37-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "226375",
    "ThreadId": "66612",
    "Html": "<p>If I understand your request correctly, you want to be able to create a custom rotation for your abilities. If that's what you are asking for, you already have it. Check the Options Pane for the Rotation Details button.</p>\r\n<p>From there you can select which rotation to use and then customize it. I noticed while looking at it that Unholy and Blood do not use Obliterate by Default but Frost definately does.</p>",
    "PostedDate": "2009-08-21T08:47:22.293-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "226682",
    "ThreadId": "66612",
    "Html": "<p>DPSDK is still in need of updates for 3.2 (WTB DPSDK Dev!), FYI.</p>",
    "PostedDate": "2009-08-22T09:08:25.117-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "226691",
    "ThreadId": "66612",
    "Html": "<p>...it is? All the talent changes are implemented, and I'm working on T9 bonuses and the new sigil right now.</p>",
    "PostedDate": "2009-08-22T10:06:47.043-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "226849",
    "ThreadId": "66612",
    "Html": "<p>Oh! Err... Perhaps I was thinking of TankDK then? Did Shaz get that done? Huh, perhaps I'm just confused there then, nevermind me.</p>",
    "PostedDate": "2009-08-23T11:10:47.833-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "226854",
    "ThreadId": "66612",
    "Html": "<p>Shaz was out of town for like a month and a half, but I think he's back now... dunno how the tankDK model is faring, though.</p>",
    "PostedDate": "2009-08-23T11:53:40.093-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]