[
  {
    "Id": "226857",
    "ThreadId": "66744",
    "Html": "<p>Big thanks to everyone who chatted with me about Rawr at BlizzCon! I had a great time, and loved meeting you all, and hearing how you used Rawr! :)</p>",
    "PostedDate": "2009-08-23T12:24:06.23-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "227008",
    "ThreadId": "66744",
    "Html": "<p>What's your impression of the changes to come in Cataclysm? Sounds like they're simplifying it rather dramatically... a bit of a relief to those like me who consider the background math daunting.</p>",
    "PostedDate": "2009-08-24T05:20:56.357-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "227118",
    "ThreadId": "66744",
    "Html": "<p>Well, they're simplifying some things, and making alot more things very complicated. I seriously doubt that Cataclysm will make Rawr's job easier. But, it's really exciting.</p>",
    "PostedDate": "2009-08-24T09:52:24.277-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "228075",
    "ThreadId": "66744",
    "Html": "<p>I haven't seen anything that would make Rawr's job easier. &nbsp;They're removing some stats from gear, but they're adding those stats under the hood. &nbsp;If anything, it will make it more difficult. &nbsp;Consider what would happen if they changed Armor Pen's formula. &nbsp;We can't simply change our ARP gems out and do some parsing, we have to change our Mastery stat, which will affect more stats than just ARP (as an example).</p>\r\n<p>There will certainly be a lot more work needed to model path of the titans and Mastery, too. &nbsp;And adding Reforging to Optimizations...*shudder*</p>\r\n<p>For the casual user, it will make it easier for you to make the &quot;right&quot; gearing choice. &nbsp;But there will still always be that situation where you can't decide if it's better to swap three items out for three other items so you get more Strength but less Crit.</p>",
    "PostedDate": "2009-08-26T11:43:24.58-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]