[
  {
    "Id": "227204",
    "ThreadId": "66837",
    "Html": "<p>I'm trying to create a better tank set for Algalon 25 man. Given that he dual wields, is it a good idea to check the &quot;Dual Wielding Mob&quot; box under the buffs tab? Or does he suffer the 20% penalty in spite of dual wielding?</p>\r\n<p>Or is this the wrong way to do it entirely? Should I instead just lower the swing timer in the options tab to 1 second or something?</p>",
    "PostedDate": "2009-08-24T13:03:08.903-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "227212",
    "ThreadId": "66837",
    "Html": "<p>That box is for applying the +20% miss chance that most dual wielding mobs suffer. Unfortunately, Algalon does not suffer this penalty. However, because his MH and OH swings are synchronized, both get blocked by Savage Defense, if it's up when he swings. Because of that oddity, there isn't really an exact way to model him in Rawr, however 1.5sec swing timer should be a close approximation.</p>",
    "PostedDate": "2009-08-24T13:14:28.627-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "227256",
    "ThreadId": "66837",
    "Html": "<p>Thanks for the reply. Does this mean that parry haste will reduce the time for the next swing from both hands? And I am guessing that this also still implies that avoidance is favored more than armor/hp?</p>\r\n<p>Also I think I just found a bug. In the options tab when you set the target damage to &quot;hard mode heroic t8 raids&quot; and save it, then reload it, it is set back to just heroic t8 raids.</p>",
    "PostedDate": "2009-08-24T16:36:39.973-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "227294",
    "ThreadId": "66837",
    "Html": "<p>Ah, that is a bug probably; the display 'name' doesn't matter though, the number is what matters, and what is saved, so it's just a display bug.</p>\r\n<p>I'm not sure about the parry hastening both attacks; I always saw his attacks come in pairs, so I guess he either doesn't get parry haste, or it does affect both hands.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-08-24T19:37:21.46-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "227343",
    "ThreadId": "66837",
    "Html": "<p>He parry hastes. One of our 10 mans was attempting him tonight and one of the wipes, the tank got hit like 4 times in like 1-1.5 seconds. There was at least one parry in that timeframe.</p>",
    "PostedDate": "2009-08-24T23:37:31.57-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]