[
  {
    "Id": "227898",
    "ThreadId": "67040",
    "Html": "<p style=\"margin-bottom:0cm\">I miss a search bar for the Comparisons window, in example, i get a cloth head item and i would like to have it marked in the Comparisons window, that means i have to either look at every item in the head catagory so i can mark the diamond, or i have to click my head on my currently equiped gear bar and type in my new gear and then i can scroll down it the comparisons to find the item that is red so i can mark the diamond. That seems rather troublesome. If you could just implement a search bar next to the &quot;Filters&quot; and &quot;Export&quot; so i could quickly search an item in that catagory that i would like to roll for or an item i would like to add, that would be awsome.</p>\r\n<p style=\"margin-bottom:0cm\">In the Comparisons window i would love if there in the &rdquo;Filter&rdquo; drop down menu was a filter where i could type in or choose the max item level displayed, so i could filter off items above item level 226 for my alt character. Maby it should be able to filter words as well, in example &rdquo;perfect&rdquo; so it would not include perfect gems.</p>\r\n<p style=\"margin-bottom:0cm\">For my warlock i can in Optimizer set a Additional Requirements named Miss Chance which will calculate my gear/enchants/gems to have that value i set it for. This is a great feature. I just miss it for my Moonkin Druid, is it possible that it will come for those in the near future?</p>",
    "PostedDate": "2009-08-26T04:43:30.107-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "228083",
    "ThreadId": "67040",
    "Html": "<p>You can certainly already add a filter for &quot;perfect&quot;, or item level, or whatever.&nbsp; I agree that a search box (a la the gemming template's) would be great on he comparison pane's, though I can generally find something that's eluding me by switching the order to alphabetical.</p>",
    "PostedDate": "2009-08-26T12:05:04.68-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "228184",
    "ThreadId": "67040",
    "Html": "<p>I regularly switch to alphabetical to find items as well - although often I can't find it because it isn't in the item list anyway (usually for quested trinkets etc).&nbsp; A quick search bar (which ignores your filter settings) would be useful to quickly find items to mark - especially at the moment when some items aren't sorted correctly due to Wowhead being slow on updates.&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-08-26T17:37:59.063-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "230091",
    "ThreadId": "67040",
    "Html": "<p>I would allso like an added opputunity in &quot;Additional Requirements&quot; for my DK Tank, Miss Chance or Hit Rating. Dunno its not the most important, but still is annoying when you tank that you miss half the time.</p>",
    "PostedDate": "2009-09-02T02:18:31.527-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "230442",
    "ThreadId": "67040",
    "Html": "<p>I'll work on adding them to the TankDK optimizer list.</p>",
    "PostedDate": "2009-09-02T15:42:00.25-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]