[
  {
    "Id": "229067",
    "ThreadId": "67395",
    "Html": "<p>Hello,</p>\r\n<p>Recently i have created a tiny addon that supports rawr direct upgrates export data. You can take a look: <a href=\"http://www.wowinterface.com/downloads/info14572-Iloot.html\">http://www.wowinterface.com/downloads/info14572-Iloot.html</a></p>\r\n<p>To save you the click, here is the addon desctiprion from wowinterface:</p>\r\n<p><span style=\"color:#0000ff\">This addon helps you determine do you need an item while looting. <br><br>Do you keep lists of items you need, and you have to alt-tab on every boss kill?<br>Do you wonder when an item drops do you have to click need?<br>Do you use Rawr to check what upgrates you need?<br><br>If any of those is yes, then this addon is for you!<br><br>What it basicly does is to enhance your item tooltip to display do you need an item based on predefined item lists.<br><br>The addon itself is very, very light (arround 100 lines). It doesnot provide GUI or anything that you can manage ingame. BUT it provides excel scripts that will help you handle the item data, which you can import into the addon, and later enjoy your item loots ingame.<br><br>The addon manages upto 3 different sets. It can show the priority of the items you need, or already possess. It shows what set an item goes to, what improvement it gives you, and so on.<br><br>The basic step instructins are - you open provided excel file (Equipment.xls) and add your desired items, sorted by priority. You have to add itemIDs aswell for addon to work (required because of shared item names in 3.2). Then you run an excel macro (click 1 button) that prepares the item data in a way it can go into the addon. Afterwards you open the Iloot_data.lua and copy/paste the data parsed by the excel file. /reloadui and you are ready to go!<br><br>Sounds hard? Its more harder to alt-tab and check your lists, than hovering over an item and say - yes i need it!<br><br>Additionaly there is a second excel file that provides macros that parse data exported from Rawr. If you use Rawr to check your item upgrates you can make those upgrates reflect ingame tooltip with few clicks. Instructions how to accomplish that are included in the provided RAWR_direct_upgrates_parser.xls.<br></span></p>",
    "PostedDate": "2009-08-30T04:07:42.28-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "229119",
    "ThreadId": "67395",
    "Html": "<p>Very cool. Could you change it to just &quot;Rawr&quot; everywhere? It's just &quot;Rawr&quot;, not all caps :)</p>",
    "PostedDate": "2009-08-30T10:22:11.667-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "229165",
    "ThreadId": "67395",
    "Html": "<p>Additionally it might be a good idea to display the upgrade value, too.</p>",
    "PostedDate": "2009-08-30T15:49:34.137-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "229222",
    "ThreadId": "67395",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>Lord_Helmchen wrote:</strong><br>\r\n<p>Additionally it might be a good idea to display the upgrade value, too.</p>\r\n</blockquote>\r\n<p>&nbsp;It is there, the Buf: XXX text, that is displayed if you put something different than zero into Overal column in excel.</p>",
    "PostedDate": "2009-08-31T00:31:09.263-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "229223",
    "ThreadId": "67395",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>Astrylian wrote:</strong><br>\r\n<p>Very cool. Could you change it to just &quot;Rawr&quot; everywhere? It's just &quot;Rawr&quot;, not all caps :)</p>\r\n</blockquote>\r\n<p>&nbsp;Sorry, no idea how i came up with caps name :)</p>\r\n<p>Now fixed.</p>",
    "PostedDate": "2009-08-31T00:34:27.14-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]