[
  {
    "Id": "229181",
    "ThreadId": "67427",
    "Html": "<p>Hello again. Now with 2.2.14, an error occurs with my rotation, and wont work...and is stuck loading.</p>\r\n<p>I know this is a community project, but your missing out completely on one class. I don't know much about coding so i cant help.</p>\r\n<p>So why does this program support locks but no one is willing to fix them. Either please fix or cut them straight out so we don't have to play with this to try to get it *sorta* working for us and not have an accurate reading. Or just don't include warlocks until u have it running smoothly again.</p>\r\n<p>This may seem harsh, but realistically it would save the warlocks a lot of time and frustration.</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-08-30T19:43:27.75-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "229187",
    "ThreadId": "67427",
    "Html": "<p>Don't use it, if you find it too buggy. (Or, you know, do something helpful, like spread the word that we need help with it to the Warlock community.)</p>",
    "PostedDate": "2009-08-30T20:23:28.32-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "229192",
    "ThreadId": "67427",
    "Html": "<p>Klav,</p>\r\n<p>Can you post a link to your armory profile and also the rotation you are using so I can investigate this issue.</p>\r\n<p>Thanks.</p>",
    "PostedDate": "2009-08-30T20:58:59.29-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "229194",
    "ThreadId": "67427",
    "Html": "<p>(Post the character file instead, that's the best way to reproduce a problem.)</p>",
    "PostedDate": "2009-08-30T21:03:57.447-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "229455",
    "ThreadId": "67427",
    "Html": "<p>for astrylian, i didnt feel the need to say again that warlocks need more help for this program, its posted a couple times already so i didnt reiterate it. i will try posting in a couple more of the forums i use for anybody with knowledge on this sorta thing.</p>\r\n<p>dont get me wrong, this is a great program, i just wish it was more universal, and u guys are trying to help.</p>\r\n<p>i c the problem has been posted a couple other times, its states just to go back to 2.2.13 for now until next one, so u wont be needing my profile i guess. to be more specific for my rotation, i found it only bugged out when using immolate before my other spells. and maybe the odd other time, but that was the major one.</p>",
    "PostedDate": "2009-08-31T12:34:54.383-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]