[
  {
    "Id": "229356",
    "ThreadId": "67481",
    "Html": "<p>When I optimize for DPS as an enhancement shaman, the optimizer isn't socketing 2 blue gems so I can meet the meta requirment. I am not sure this was ever fixed after the change to JC epic gems in 3.2.</p>",
    "PostedDate": "2009-08-31T08:12:57.7-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "229378",
    "ThreadId": "67481",
    "Html": "<p>Check &quot;Enforce Gem Requirements&quot; on the main screen to enforce this.</p>",
    "PostedDate": "2009-08-31T09:18:51.857-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "229552",
    "ThreadId": "67481",
    "Html": "<p>Is there a way to have it enforce the meta gem, but not the gem bonuses for gear?&nbsp;</p>",
    "PostedDate": "2009-08-31T20:09:17.327-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "229557",
    "ThreadId": "67481",
    "Html": "<p>Enforce Meta Gem Requirements has nothing to do with matching socket bonuses.</p>\r\n<p>That is to say, checking the &quot;Enforce Meta Gem Requirements&quot; does not force *all* of your blue sockets to gems that would activate the blue socket for socket bonus.</p>\r\n<p>The <strong>only</strong> thing that does for Metas is make sure that you have enough gems of the appropriate colors to activate your Meta.</p>\r\n<p>If you meta needs 1 yellow, 1 red and 1 blue but your best dps gem is red and you would otherwise have all red gems, it will only replace enough of the reds to cover 1 yellow (either by a yellow itself or by a green or orange) and 1 blue (either by a blue, green or purple gem) prismatic gems (NOT prismatic sockets) can also fulfill requirements (I think).</p>\r\n<p>That said, since the optimizer needs to activate the Meta with a yellow and a blue, it will at least TRY to match up socket bonuses if they can give you a better total score. As an Arms Warrior, if I needed 1 yellow and 1 blue in addition to all my reds to activate my meta, it would try and put them into sockets where the bonus would be +STR or +ArP, etc. as opposed to a socket where it's +Stam or +Hit (if I'm over the Hit cap).</p>\r\n<p>The only <strong>other</strong> thing that it does is make it so you lose the effects of gems where their uniqueness has been violated, such as Nightmare Tear, which is Unique-Equipped. If you try to equip more than one, then it only counts one of them.</p>",
    "PostedDate": "2009-08-31T20:26:38.293-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "229589",
    "ThreadId": "67481",
    "Html": "<p>Why is this not the default behavior? Even though I am farmiliar with the program by now, when I make a new character file it always seems to take seeing bizzare optimizer results before I remember that I need to check that box. IMHO the box should say &quot;Ignore Meta Gem Requirements&quot; and should be defaulted to FALSE.</p>\r\n<p>&nbsp;</p>\r\n<p>~Droid</p>",
    "PostedDate": "2009-08-31T23:12:35.487-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "229594",
    "ThreadId": "67481",
    "Html": "<p>There are already a dozen threads about this, and they all say that we're changing the default for Rawr3.</p>",
    "PostedDate": "2009-08-31T23:46:05.82-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]