[
  {
    "Id": "229817",
    "ThreadId": "67616",
    "Html": "<p>Hello all,</p>\r\n<p>&nbsp;First off, thanks for a great application. I am seeing an issue where when I load up my TankDK, and under Options -&gt; Rotation Details, select Blood all the values for Sort: Overall turn into about 90% Threat. Am I doing something wrong here? Yes, I have searched and not found anything describing what I am saying, sorry if it has been discussed previously.</p>",
    "PostedDate": "2009-09-01T11:16:22.72-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "229819",
    "ThreadId": "67616",
    "Html": "<p>Weight values for stats, especially threat stats, have been in flux for a while on the TankDK module. My suggestion is to just set your threat modifier to 0. If you are actually interested in the threat values different items may offer, set it to something like 0.01. However, hit doesn't even seem to be valued as a threat stat, or if so, not very much. Also expertise doesn't seem to apply any threat value at all.</p>\r\n<p>So original suggestion: Just ignore threat in TankDK.</p>",
    "PostedDate": "2009-09-01T11:21:41.11-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "229854",
    "ThreadId": "67616",
    "Html": "<p>Rawr.&nbsp; Does.&nbsp; Not.&nbsp; Use.&nbsp; Weight.&nbsp; Values.</p>\r\n<p>&nbsp;</p>\r\n<p>The <em>closest</em> thing that comes to &quot;weighting&quot; is a slider that shows how much you want to consider, say, threat or survivability or whatever.</p>",
    "PostedDate": "2009-09-01T12:34:45.79-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "229875",
    "ThreadId": "67616",
    "Html": "<p>Please be a bit more specific on what's wrong w/ the threat numbers.&nbsp; All the shot rotation should be updated, but I haven't played a blood tank yet, and haven't had a chance to review the blood rotation specifically.&nbsp; Please write up an issue in the issue tracker, include your character.xml and give me exact steps to reproduce what you're seeing.</p>\r\n<p>&nbsp;</p>\r\n<p>Thank you.</p>",
    "PostedDate": "2009-09-01T13:35:40.593-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "230011",
    "ThreadId": "67616",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>BrWarner wrote:</strong><br>\r\n<p>Rawr.&nbsp; Does.&nbsp; Not.&nbsp; Use.&nbsp; Weight.&nbsp; Values.</p>\r\n<p>&nbsp;</p>\r\n<p>The <em>closest</em> thing that comes to &quot;weighting&quot; is a slider that shows how much you want to consider, say, threat or survivability or whatever.</p>\r\n</blockquote>\r\n<p>Not entirely true with the TankDK module. I would say, from a usability standpoint, the configuration options for survivability vs mitigation vs threat options are a ways behind the other tanking modules.</p>",
    "PostedDate": "2009-09-01T21:58:03.827-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "232763",
    "ThreadId": "67616",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>Devwar wrote:</strong><br>\r\n<p>Not entirely true with the TankDK module. I would say, from a usability standpoint, the configuration options for survivability vs mitigation vs threat options are a ways behind the other tanking modules.</p>\r\n</blockquote>\r\n<p>How would you suggest I change things?&nbsp; I know that I could look at the other tank modules, and see that Bear does X, and Tankadin does Y, but that doesn't tell me what features you are specifically looking for when evaluating the TankDK module.</p>\r\n<p>Thanks.</p>",
    "PostedDate": "2009-09-09T10:44:30.873-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "232769",
    "ThreadId": "67616",
    "Html": "<p>It would be nice to have threat numbers that are in line with the default survivability and mitigation numbers. As mentioned in an issue I posted, loaded from default settings, with only blood rotation selected, threat values out-weigh mitigation and survivability values on a margin of 10:1, and the module will optimize for DPS stats, as the optimizer optimizes for the biggest number, and threat is the biggest number by far. I've found that even when setting threat weighting to 0.01, threat values seem a lot more reasonable/manageable for dealing with upgrades, although a side effect of this is that every time you optimize with a threat weighting of 0.01, different optimizations come out that don't always result in the most optimized results.</p>",
    "PostedDate": "2009-09-09T11:01:30.33-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "232860",
    "ThreadId": "67616",
    "Html": "<p>Ok... Found the bug in the Blood Rotation that was causing the weird numbers.&nbsp; I was under the impression that you were looking for something more significant on a design level that was missing/different in the TankDK module.&nbsp;</p>\r\n<p>The fix should be in release 16.</p>",
    "PostedDate": "2009-09-09T15:58:21.503-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]