[
  {
    "Id": "229986",
    "ThreadId": "67661",
    "Html": "<p>Literally. I can't find a new file created anywhere by this and can't get LootPlan to import. Bugged?</p>",
    "PostedDate": "2009-09-01T18:49:21.05-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "230035",
    "ThreadId": "67661",
    "Html": "<p>It doesn't create a file, it copies it to clipboard so you can paste it in game.</p>",
    "PostedDate": "2009-09-01T23:13:23.69-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "230331",
    "ThreadId": "67661",
    "Html": "<p>This function&nbsp;is not well documented, the buttons do not name common Windows commands, and the &quot;export to Lootplan&quot; is misleading, so I appreciate Rhinobite's frustration.</p>\r\n<p>In Rawr, the &quot;Export to Lootplan&quot; should probably say something like &quot;Copy to clipboard (Lootplan format)&quot;</p>\r\n<p>After several attemtps, I got it to work:</p>\r\n<ol>\r\n<li>Open WoW for your character, and then the lootplan gui.&nbsp; Go to the import tab.</li>\r\n<li>From rawr, open (or create) your upgrade table</li>\r\n<li>Choose the &quot;Export to Lootplan&quot;... this is really just copying the table in LP format to your clipboard</li>\r\n<li>Return to WoW, click somewhere in the import text box, and click &quot;Import&quot; or just ctrl-V; both do a &quot;clipboard paste&quot;</li>\r\n<li>Go get coffee... the paste can take a minute or so (during which time WoW appears to be frozen for me)</li>\r\n<li>After the paste is complete, you will see your gear in the text box in the LP format.</li>\r\n<li>Click &quot;Accept&quot; to load into the lootplan database (this happens more quickly)</li>\r\n<li>Unless you've turn off some chat items, you will get a list of confirmation messages in the&nbsp;general chat box&nbsp;as the items are loaded.</li>\r\n<li>Rinse and repeat for each toon (don't forget to logout to your next toon!)</li>\r\n</ol>\r\n<p>Hope that this helps,</p>\r\n<p>NylanMage</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-09-02T11:10:15.71-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "230439",
    "ThreadId": "67661",
    "Html": "<p>Well it did help, I can get everything copied into the LP gui, unfortunately once I hit 'Accept' nothing happens. I gave it some time because it was such a large list, with no result, and then took out everything but a single item. With the single item, I can hit 'Accept' and again nothing will happen, unless I then hit 'Import' at which point I get an error saying the item does not exist (ex: Error: '47192: Upgrade Score 142993.2;' does not exist). This looks as if the format is incorrect, LP is looking at the entire statement as being the item ID instead of just the first digits. I tried messing around with the format but I can't get LP to recognize anything. This isn't Rawr related but I was hoping someone might have an idea of what I'm doing wrong.</p>",
    "PostedDate": "2009-09-02T15:20:02.77-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "236364",
    "ThreadId": "67661",
    "Html": "<p>It's odd, but this worked for me:&nbsp; Since the update,&nbsp;IMPORT does not do the &quot;Paste&quot;.&nbsp; So, I clicked &quot;Save to Lootplan&quot; (which actually copies to clipboard in LP format),&nbsp;then I opened NotePad and pasted the entire list.&nbsp; I then coped it AGAIN (ctrl-A, ctrl-C) and went to the LP/GUI in WoW.&nbsp; I pasted (ctrl-v) in the text box and hit ACCEPT.&nbsp; It appeared nothing happend, and for some reason, the IMPORT button only scrolled the textbox.&nbsp; So, I deleted everything in the text box (click in the box, ctrl-a, DEL) and THEN clicked IMPORT... and it worked.</p>\r\n<p>I have no idea what he did in the code; I didn't look.</p>\r\n<p>Nylan</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-09-18T23:57:45.883-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "236425",
    "ThreadId": "67661",
    "Html": "<p>What I usually do is as follows, it works for me:</p>\r\n<ol>\r\n<li>Click &quot;save to looplan&quot;</li>\r\n<li>Do &quot;/lootplan gui&quot; in wow and then go to the import box</li>\r\n<li>Paste the text into the box</li>\r\n<li>Click Accept</li>\r\n<li>Click Import a bunch of times until it scrolls all the way to the bottom</li>\r\n<li>All your items should have been imported (at least the ones you have in your item cache)</li>\r\n</ol>\r\n<p>~Droid</p>",
    "PostedDate": "2009-09-19T09:34:37.68-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]