[
  {
    "Id": "230988",
    "ThreadId": "67943",
    "Html": "<p>Rawr has a lot of useful filters for finding the best items availble to you, but you can't seem to turn off triumph rewards requiring a trophy, which you will only get in Trial of the Crusader raids.</p>",
    "PostedDate": "2009-09-03T21:48:12.443-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "251096",
    "ThreadId": "67943",
    "Html": "<p>I feel the same way. While I'm filtering for those items I can achieve without any raids its annoying to not be able to differentiate betwen the &quot;triumph&quot; items and those which require the trophy in addition. Would be really helpful if they can get identifiable by a filter</p>",
    "PostedDate": "2009-10-29T02:52:30.02-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "251486",
    "ThreadId": "67943",
    "Html": "<p>Make a new sub-filter (I call it &quot;trophy gear&quot;) under &quot;Special Currency&quot; with the pattern &quot;1 \\[Emblem of Triumph&quot; in it.&nbsp;&nbsp;&nbsp; Then in the Armor token filter, remove the &quot;1 \\[Emblem of Triumph&quot;.</p>\r\n<p>Lastly, you need to update all the tier gear from Wowhead (right click and select &quot;Refresh Item Data from Wowhead&quot;) which changes the location to &quot;Purchasable for 1 [Emblem of Triumph]&quot;&nbsp;&nbsp;&nbsp;&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>Net result is you have all the 232 tier peices in the Emblem of Triumph category,&nbsp; all the 245 tier pieces in the new &quot;Trophy Gear&quot; category and all the 258 tier pieces in the &quot;Armor Token&quot; category.</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>BTW - thanks devs for the links to the &quot;regular expressions&quot; in the new documentaion.&nbsp;&nbsp; At the moment, trying to read them is making my brain melt, but once i've had some sleep i'm sure it'll help me :)&nbsp;&nbsp;&nbsp;&nbsp; Much better than having to try and examine the current filters to work out what I want to do.&nbsp;&nbsp;&nbsp;&nbsp; Mind you, the filters are so good now that there is very little that I need to change ever :)</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-10-30T00:52:28.277-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]