[
  {
    "Id": "231015",
    "ThreadId": "67956",
    "Html": "<p>I was wondering why we cant select 2h weapons from the menu refine types of item listed and also why is there not a major glyph for flame shock</p>",
    "PostedDate": "2009-09-04T00:27:47.1-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "231019",
    "ThreadId": "67956",
    "Html": "<p>No idea about the major glyph for Flame Shock, but you can't select 2H weapons for Shamans because that would be dumb.</p>",
    "PostedDate": "2009-09-04T00:39:27.63-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "231027",
    "ThreadId": "67956",
    "Html": "<p>It might be a little strange but I still like the option</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-09-04T01:14:41.927-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "231031",
    "ThreadId": "67956",
    "Html": "<p>It's such an inferior 'option', that to choose it means you really don't care about performance, which means Rawr probably isn't for you.</p>",
    "PostedDate": "2009-09-04T01:20:31.833-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "231033",
    "ThreadId": "67956",
    "Html": "<p>not true, with the t9 for enhance shaman set bonus we lose 20% to Storm strike and lava lash I just trying to explore option in how I can recover the lost damage</p>\r\n<p>3% to static static proc chance or 25% more to my shock damage</p>\r\n<p>over the t8.5 2 piece bonus why would a shaman go to t9</p>",
    "PostedDate": "2009-09-04T01:26:53.337-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "231184",
    "ThreadId": "67956",
    "Html": "<p>...what does this have to do with using 2H weapons?</p>",
    "PostedDate": "2009-09-04T09:07:15.957-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "231206",
    "ThreadId": "67956",
    "Html": "<p>Glyph of Flame Shock ... I see that it is there, 5th one down.</p>\r\n<p>As for using a 2h for Enh Shaman ... despite it being an inferior setup (and Blizz has stated somewhere this is the current direction/intent), if it's a &quot;minor enough&quot; adjustment to allow into Rawr, I don't see the harm in it.</p>\r\n<p>This year I had inquired about allowing staves to be a visible option for dps warriors (since they've always been able to train/use). If anything, Rawr showed me the dps loss I would get equipping one. Being allowed to equip a weapon type and then Blizzard making it inferior, in all regards, rankles me too but what can ya do? lol</p>",
    "PostedDate": "2009-09-04T09:50:49.137-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "231213",
    "ThreadId": "67956",
    "Html": "<p>What we can do is know that Staves will never be a warrior item so don't bother bogging the selections down with items that can't help warriors.</p>\r\n<p>Same thing for 2h Shamans, if it's never gonna be a decent build as opposed to DW there's no reason to show it. When/if Blizzard make a change in how 2h works for Shamans that makes it competitive, I'm sure they'd be glad to re-enable 2h weapons.</p>",
    "PostedDate": "2009-09-04T10:13:04.217-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "231230",
    "ThreadId": "67956",
    "Html": "<p>I'm pretty sure every single developer has more pressing issues than implementing features just to see how bad something would be in a &quot;what if&quot; scenario. If you'd really like to see how bad 2H enhancement is, the project is open source. Grab a copy of the code and implement it yourself.</p>",
    "PostedDate": "2009-09-04T11:20:45.79-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "231260",
    "ThreadId": "67956",
    "Html": "<p>Unfortunately, going 2h loses a lot of things. &nbsp;No FT in the offhand, much fewer Flurry procs, no laval lash, 1/2 or less mana returned from Shamanistic Rage, Lots of wasted hit rating, Extremely fewer maelstrom procs, the list goes on and on my friend. &nbsp;Almost every mechanic in enhance revolves around very fast attacks and having two weapons.</p>",
    "PostedDate": "2009-09-04T13:18:58.26-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "231281",
    "ThreadId": "67956",
    "Html": "<p>as for flame shock its not in the list for enhance shamans I check its there for elemental</p>",
    "PostedDate": "2009-09-04T14:14:24.91-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "231380",
    "ThreadId": "67956",
    "Html": "<p>There is no glyph of flame shock as flame shock is not modeled. &nbsp;It sounds like you are looking for something like Enh-sim, not Rawr. &nbsp;</p>\r\n<p>Same as going 2h, not using that second earthshock is very detrimental to DPS in most cases. &nbsp;</p>\r\n<p>Take 2k spell power, Base flame shock's total damage (With glyph) would be 2770 over 18 seconds, 3140.96 at 40% Crit.</p>\r\n<p>Earth shock's base damage is 1667, 2334 at 40% crit, then 2986 due to storm strike buffs. &nbsp;So, you'd gain about 100 damage per 1k spellpower, but you also have to spend a glyph slot to even make it worth it. &nbsp;That means you're giving up glyphed Lava Lash, Windfury, or Lightning shield, all of which net you much more then that 100 per 1k. &nbsp; &nbsp;That extra 200 damage per 18 seconds comes to that glyph honestly only being worth 11 dps. &nbsp;Loading a 2k spellpower shaman into Rawr in enhance shows that Glyph of Lava Lash, the worst of the lot, nets 28.2 DPS overall. &nbsp;The only real reason to use enhance is if you intend to try out Lava burst, but I believe that too has been proven through enhsim to be a drop.</p>\r\n<p>The above is most likely why you won't see it modeled in Rawr.Enhance, as it's just not usable for best DPS in almost any situation.</p>",
    "PostedDate": "2009-09-04T22:40:59.617-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]