[
  {
    "Id": "231307",
    "ThreadId": "68027",
    "Html": "<p>Haven't been able to figure out how to add different enchants, nor can I find a post on it. I wanted to add Boar's Speed as an option to IceWalker.</p>\r\n<p>Thanks is advance for any help.</p>",
    "PostedDate": "2009-09-04T16:01:46.147-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "231319",
    "ThreadId": "68027",
    "Html": "<p>If you mean add enchants as in Physically add it to the program where it otherwise isn't there, there's no method to do that.</p>\r\n<p>If you mean select the enchant as available for the optimizer with a Green Diamond and the enchant isn't listed, then the enchant is most likely not relevant to the model so it's not going to show up.</p>\r\n<p>What model is it missing from and for what purpose would you add that as an option. PvP doesn't count as Rawr isn't for PvP.</p>",
    "PostedDate": "2009-09-04T16:46:42.923-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "231331",
    "ThreadId": "68027",
    "Html": "<p>I guess I meant to add one where it doesn't exist. The enchant that I choose is not available for selection. Many DPSers have recently been switching to Boar's Speed for the mobility boost in a very movment demanding raid atmosphere. IceWalker is nice, but the minor speed boost and stamina is proving better for a hitcapped DPSer. I was looking for a way to add an enchant to RAWR, not just select one. Thanks.</p>",
    "PostedDate": "2009-09-04T17:21:19.93-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "231332",
    "ThreadId": "68027",
    "Html": "<p>If you are already Hit Capped and the 12 Crit isn't really good for you at your gear-set, usually you would swap to Greater Assault (32 AP) rather than Boar's Speed, which gives Stam (useless for DPS) and a very small amount of movement speed which doesn't help at all on fights where you don't move.</p>",
    "PostedDate": "2009-09-04T17:24:17.347-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "231344",
    "ThreadId": "68027",
    "Html": "<p>No no no no NO.</p>\r\n<p>Movement speed is AMAZING for DPS, heals, and tanks alike.&nbsp; Unless you're a Ret (innate speed boost) or a Kitty (innate speed boost), you would much rather go for a runspeed enchant (8% movement increase) than a &quot;pure stat&quot; enchant.</p>\r\n<p>I'll do a writeup of it soon on my blog, but suffice to say, you should be using a runspeed enchant&nbsp; as your default enchant for ALMOST EVERY CLASS/SPEC, as a general catch-all.&nbsp; Almost the only type of fight that you would want to rather use a &quot;pure stat&quot; enchant is a pure tank and spank, with no movement.&nbsp; Given how there are almost none of those fights in Ulduar or in Coli (you could, if you're a melee or a tank on Vezax, but casters would definitely want TV).</p>\r\n<p>This even counts for casters - I believe the maths were worked out for a mage, showing that if you moved at all for at least 4 secs out of a minute, then runspeed beats out a &quot;pure&quot; enchant in terms of raw damage output.&nbsp; With time-on-target being even more crucial for tanks and melee, it's a just a very good enchant all around, certainly better than a gem and a half worth of stats.</p>\r\n<p>You would actually not want to use Boar's speed and instead either opt for <strong>Tuskarr's Vitality </strong>for most players, or if you REALLY want every oomph for a physical DPS, <strong>Cat's Swiftness</strong>.</p>\r\n<p>----</p>\r\n<p>Regardless, there's an easy way for you to not consider Assault or Icewalker or whatever.&nbsp; Just mark all buffs as not available, and pretend that you have no enchant.&nbsp; This should work fine for all casters and physical DPS that are using Tuskarr's.&nbsp; We would want to model Tuskarr's for tanks, and model Cat's Swiftness for physical DPS.</p>\r\n<p>BTW, Dunwich, which model are you working under?</p>",
    "PostedDate": "2009-09-04T18:09:24.13-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "231348",
    "ThreadId": "68027",
    "Html": "<p>Yeah, Boar's Speed should be relevant to every single model. If it's not, that's a bug we need to fix. It's the enchant that should be on every raider's primary pair of boots, unless they have some other talent/effect which increases their run speed and doesn't stack with it (ie, feral swiftness for cats, swift retribution for paladins, etc). The DPS/Healing/Tanking performance gain from movement speed is vastly superior to the gain from any other enchant, if you have to move almost at all in any fight.</p>",
    "PostedDate": "2009-09-04T18:35:05.397-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "231412",
    "ThreadId": "68027",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>BrWarner wrote:</strong>\r\n<p>Regardless, there's an easy way for you to not consider Assault or Icewalker or whatever.&nbsp; Just mark all buffs as not available, and pretend that you have no enchant.&nbsp; This should work fine for all casters and physical DPS that are using Tuskarr's.&nbsp; We would want to model Tuskarr's for tanks, and model Cat's Swiftness for physical DPS.</p>\r\n<p>BTW, Dunwich, which model are you working under?</p>\r\n</blockquote>\r\n<p>&nbsp;Selecting no enchant is what I have started doing.</p>\r\n<p>Sorry about that, I'm working under the Warlock model, which makes Stamina (which I trade for mana) all the more important. And you are correct it is Tuskarr's Vitality that I meant to say, guess I had old enchants on my mind. Since moving to this enchant my time-in DPS has increased dramatically. I'm getting out of the fires faster and repositioning quicker.</p>\r\n<p>I forgot to add that I stole this idea from the guild Ensidia. In almost all of their guides they recommend the speed boost, and in doing a quick armory pull on them and other top raiding guild warlocks I found Tuskarr's Vitality to be the enchant of choice. Now I know why.</p>",
    "PostedDate": "2009-09-05T06:24:04.163-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "250492",
    "ThreadId": "68027",
    "Html": "<p>*thread necro*</p>\r\n<p>Should the DPS bonus to run speed apply also to the Feral Swiftness talent? Currently it appears that Rawr gives no&nbsp;value to the talent at all; if asked, it puts those points into Feral Aggression instead. Is the extra 6%&nbsp;FB damage a viable tradeoff for&nbsp;30% increased movement?</p>\r\n<p>I recall discussing this thread with Ron, and him explaining to me a rather daunting amount of DPS lost per x amount of time spent running.</p>",
    "PostedDate": "2009-10-27T23:19:26.577-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "250687",
    "ThreadId": "68027",
    "Html": "<p>Aye, I should model that; the bottom line is that any feral without Feral Swiftness is Doing It Wrong.</p>",
    "PostedDate": "2009-10-28T07:39:23.11-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "446312",
    "ThreadId": "68027",
    "Html": "<p>Yes, please add the end-game enchants for run speed increase. For example, my raiding guild asks almost all classes to put Tuskarr's Vitality on their boots. It is very useful... and so currently I am not selecting any enchant for boots, since you don't have the one I am required to use.</p>",
    "PostedDate": "2010-05-22T23:46:58.817-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "446314",
    "ThreadId": "68027",
    "Html": "<p>Not sure what you're asking, LaCavalier. All models should (do?) support Tuskarr's Vitality.&nbsp;</p>",
    "PostedDate": "2010-05-23T00:01:10.047-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "446342",
    "ThreadId": "68027",
    "Html": "<p>Unfortunatly that's not the case, I know that at least the moonkin model doesnt offer movement speed boot enchants (despite a recent commit stating it was added).</p>",
    "PostedDate": "2010-05-23T03:19:59.673-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "446433",
    "ThreadId": "68027",
    "Html": "<p>Unless you see a yellow Release commit after the commit with the fix it's not released.</p>",
    "PostedDate": "2010-05-23T12:38:21.12-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "446531",
    "ThreadId": "68027",
    "Html": "Actually I complile my own as I add patches to the moonkin and tree models that are not in release, but regardless the commit I'm talking about pre-dates 2.3.16.",
    "PostedDate": "2010-05-24T01:18:25.777-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]