[
  {
    "Id": "232073",
    "ThreadId": "68234",
    "Html": "<p>Hey Rawr team. Thx for the early release, was excited to see it out before the patch but as i understand there are</p>\r\n<p>still some small details that need to be adressed. I havent looked at the code at all, so just my observations at a</p>\r\n<p>quick glance after playing around with the warlock module :</p>\r\n<p>&nbsp;</p>\r\n<p>1. The spellpriority list seems to be working fine for me, in version 2.2.14 it defintely was the cause of the crash,</p>\r\n<p>&nbsp;&nbsp;&nbsp; but for the time being it seems fine. (this is inconclusive as i have only fiddled with it for 30mins at most thusfar)</p>\r\n<p>2. I encountered a definate loop when trying to use the Gear/Enchants/Gems menu though, making the app stall,altho</p>\r\n<p>&nbsp;&nbsp; still responsive to some actions. (Awaiting an input mayb?)</p>\r\n<p>&nbsp;</p>\r\n<p>Hope it helps and good luck! Keep up the good work!</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-09-08T00:41:58.437-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "232075",
    "ThreadId": "68234",
    "Html": "<p>We're working on this issue, and will be releasing v2.2.16 as soon as we have it fixed. We believe that it's related to having Immolate first in your spell priority list, currently, but aren't positive. If it works for you, great; if not, use .13 until we get .16 out.</p>\r\n<p>&nbsp;</p>\r\n<p>Sorry; we hate having crashing bugs that prevent you from using Rawr as much as you do, trust me.</p>",
    "PostedDate": "2009-09-08T00:43:59.397-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "232080",
    "ThreadId": "68234",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>Astrylian wrote:</strong><br>\r\n<p>Sorry; we hate having crashing bugs that prevent you from using Rawr as much as you do, trust me.</p>\r\n</blockquote>\r\n<p>Lol, its quite allright! I really admire all of you keeping this project alive and putting a huge amount of effort and professionlism into it. This really is a valuable tool. I think most get so rude and upset</p>\r\n<p>because they just have no idea what what it entails having to reflect changes from blizz every month on such an enormous scale, or feel a bit lost without Optimiser ;P.. All the best, good luck and lookin forward to the release!</p>",
    "PostedDate": "2009-09-08T00:53:59.29-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]