[
  {
    "Id": "232375",
    "ThreadId": "68325",
    "Html": "<p>&nbsp;</p>\r\n<p>My latest Filters for Rawr. Allows you to select professions and filter out for almost any situation for pre-raid and planning. Also includes a quick switch that lets you see everything in the database so you do not have to search for where it is in the filters. By default all profession items are disabled, but if you have that profession, just enable it to show the BOP items when you view crafted items. No more missing out on an item because it was lost in the current Rawr filters, this one filters it all. Even filters gems and only show BOP gems if you enable jewel-crafting as your profession.</p>\r\n<p>Look in Issue Tracker for the latest version under the title &quot;<span id=\"ctl00_ctl00_MasterContent_Content_TitlePanel\"><span id=\"ctl00_ctl00_MasterContent_Content_TitleLabel\">Revised Filters....&quot;</span></span></p>\r\n<p><br>Be sure to let me know what you think...</p>",
    "PostedDate": "2009-09-08T12:58:46.263-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "232397",
    "ThreadId": "68325",
    "Html": "<p>The Profession Filters were already in there... what did you do differently than what was already available?</p>",
    "PostedDate": "2009-09-08T14:11:25.043-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "232408",
    "ThreadId": "68325",
    "Html": "<p>I added on options tab for users to select or elect to show BOP items. This way if they select that they have the profession then they can just easily select that they want to see all crafted items and already have there professions pre-selected. Also trimed out a lot of fat in the old filters to make them just a bit faster and smaller, yet with more options and greater accuracy.</p>",
    "PostedDate": "2009-09-08T14:26:25.503-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "232412",
    "ThreadId": "68325",
    "Html": "<p>Also includes Dungeons normal/heroic, Trial of Champions, Tier ranks are broken down better to include 10man and 25 man normal and heroic, More PVP options, crafted items can be setup to show BOP as an option and then you do not need to mess with it unless you change professions, purchasable items have more configurations as to the type of currency you have, Champion's Cache and Tribute drops are also in filter, Gems can be listed for various types (PVP/BOP/Crafted/World Drops), Quest rewards can be filtered and easily located, unknown items are listed in filters and can be refreshed to possibly get better information on where they are. Took out a lot of unnecessary (?&lt;!Heroic.*) and code that was messing up the filters. Items where being omitted based on flaws in current filter &quot;wording&quot;...</p>",
    "PostedDate": "2009-09-08T14:38:52.14-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "232419",
    "ThreadId": "68325",
    "Html": "<p>About half of that was already in there, but it does sound like you added some functional stuff. Can you directly compare the current filters with the 2.2.15 release against yours and add/remove as necessary so there's only 1 filter file? Then upload that file to the patches section?</p>",
    "PostedDate": "2009-09-08T15:02:29.657-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "232436",
    "ThreadId": "68325",
    "Html": "<p>Two things i'd like fixed in the filters are (i) a select/deselect all button&nbsp; (ii) for all gems to not be filtered out if you don't have the crafted stuff selected - everytime I go to select the gems for a toon, I seem to never have crafted items selected and have to change it again.</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-09-08T16:29:35.197-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "232443",
    "ThreadId": "68325",
    "Html": "<p>For a quick fix regarding gems being filtered out go to edit filters, and change the crafted filters to not apply to gems.</p>",
    "PostedDate": "2009-09-08T17:23:27.113-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "232650",
    "ThreadId": "68325",
    "Html": "<p>That was part of the reason I changed the filters. Soon you will be able to filter Gems more thoroughly. Having the benefit of PVP , crafted, world-drop, or profession gems. Still sorted by Rawr according to benifit of use.</p>",
    "PostedDate": "2009-09-09T05:49:34.803-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]