[
  {
    "Id": "232961",
    "ThreadId": "68488",
    "Html": "<p>I realize that, as an Arcane Mage, haste is very important, but I want to play with leaning just a bit towards crit. How can I tell Rawr to, say, use crit gems instead of haste gems, or just give a little more attention to crit?</p>",
    "PostedDate": "2009-09-09T23:32:27.287-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "232969",
    "ThreadId": "68488",
    "Html": "<p>Well, I think you can optimize with a minimum requirement on crit, if you really want...</p>\r\n<p>...but why? Crit is terrible for Arcane, Haste is stellar. Why would you want to purposely gimp your dps for no reason?</p>",
    "PostedDate": "2009-09-09T23:58:56.367-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "232986",
    "ThreadId": "68488",
    "Html": "<p>Actually, I said crit because I had been thinking about that earlier, but it's really spell power I want to give a little more emphasis to. Rawr sometimes chooses Reckless Ametrines rather than Runed Cardinal Rubies, even in red sockets. I'm not saying I want all gems to always match the socket color, but sometimes I think Rawr is too hasty (pun intended) to push haste over SP. I know haste is important for Arcane, but it's very player-dependent too, and I want to see if putting a little more into SP will help my increase my damage.</p>",
    "PostedDate": "2009-09-10T00:58:27.117-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "232989",
    "ThreadId": "68488",
    "Html": "<p>You could only enable gemming templates where red sockets are filled by red gems.</p>\r\n<p>Additionally, you might be able to set a haste cap in the same way, not sure if Rawr.Mage supports that, but I think so.</p>",
    "PostedDate": "2009-09-10T01:02:53.823-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "232992",
    "ThreadId": "68488",
    "Html": "<p>Being able to control the haste cap would be nice, but I don't see any way to do that.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-09-10T01:12:44.26-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "233004",
    "ThreadId": "68488",
    "Html": "<p>I was refering to when you optimize, you can set an Additional Requirement of Haste Rating &lt; Whatever.</p>",
    "PostedDate": "2009-09-10T02:04:59.733-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "233193",
    "ThreadId": "68488",
    "Html": "<p>Ah, okay, I see. Thanks.</p>",
    "PostedDate": "2009-09-10T09:51:03.483-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "233797",
    "ThreadId": "68488",
    "Html": "<p>But the whole point of rawr is to tell you what is going to give you the *highest* dps given a ton of fight parameters.&nbsp; There is no other accurate ways to do this.&nbsp; When I optimize for best in slot...yes, it is putting reckless over runed in red slots, but that's because the character has *so much* spell power that haste is simply going to give you the highest dps increase - more so than more raw spellpower.</p>\r\n<p>&nbsp;</p>\r\n<p>Why you would want to counter this or gimp yourself is beyond me :&lt;&nbsp; If it tells me to put reckless in, I shall :p</p>",
    "PostedDate": "2009-09-11T17:57:25.133-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "236384",
    "ThreadId": "68488",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>zifnab wrote:</strong><br>\r\n<p>There is no other accurate ways to do this.&nbsp;</p>\r\n</blockquote>\r\n<p>&nbsp;<a title=Simcraft href=\"http://code.google.com/p/simulationcraft/\">Simcraft</a> does this very well.</p>\r\n<p>The Simcraft project allows you to more accurately adjust minute settings to experiement with your gear, gems and enchants to determine under specified or generic raid conditions what the optimal configuration would be.</p>\r\n<p>Rawr appears to a great tool to quickly test new gear.</p>\r\n<p>I just wish i could easily tell it to favor crit over hast just slightly based on the Psuedo Point&nbsp;scale:</p>\r\n<p>If 1+ spell power is equal to 1 psuedo point then 1 crit is worth 0.72 psuedo points and 1 haste is worth 0.68 psuedo points, 1 spirit is with 0.25 psuedo points and 1 intel is worth 0.22 psuedo points</p>",
    "PostedDate": "2009-09-19T03:35:12.44-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "236430",
    "ThreadId": "68488",
    "Html": "<p>Again, that would be inaccurate. SimulationCraft's author specifically says to use Rawr, even.</p>\r\n<p>Ever using relative stat values ('psuedo points') is <em>always</em>&nbsp;inaccurate.</p>",
    "PostedDate": "2009-09-19T10:14:53.347-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "236434",
    "ThreadId": "68488",
    "Html": "<p>It seems to me that haste is a volatile stat and that a lot of your speed will depend on your own reaction time and your connection. While Rawr may calculate the best dps based on optimal or even average conditions and reaction time, each individual person may have their own &quot;haste cap&quot; above which more haste just doesn't help and higher crit is more effective. I have no idea how you would determine what your personal haste cap is, though, aside from playing with the haste/crit balance.</p>",
    "PostedDate": "2009-09-19T11:17:16.813-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "236435",
    "ThreadId": "68488",
    "Html": "<p>No, it doesn't work that way, thanks to the spell&nbsp;queuing&nbsp;system.</p>",
    "PostedDate": "2009-09-19T11:21:29.317-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "236436",
    "ThreadId": "68488",
    "Html": "<p>I'm glad to hear that but can you be more specific or point me to an explanation?</p>",
    "PostedDate": "2009-09-19T11:23:51.343-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "236438",
    "ThreadId": "68488",
    "Html": "<p>It's not obvious to most users, but there is a spell queue. If you try to cast your next spell within 0.3sec from the end of the last spell, it will cast it immediately after the previous one ends, removing latency from the equation. That works for all spells with a cast time. Rawr.Mage has a setting for Latency as well, to account for that on channeled/instant spells.</p>",
    "PostedDate": "2009-09-19T11:27:52.713-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "236485",
    "ThreadId": "68488",
    "Html": "<p>I do try to start each cast just before the end of the previous one, and I think I do pretty well at it. The problem for me is that, even with really good gear optimized according to Rawr (check my armory page at http://www.wowarmory.com/character-sheet.xml?r=Uldum&amp;n=Galacia), I don't do as much damage as I think I should be doing. I've experimented with spell rotations, and I've managed some slight improvements, but I'm still disappointed with my results. The only thing I can think of is that I'm somehow not taking full advantage of my haste.</p>\r\n<p>Incidentally, I went from 4pc T8.5 to 2pc T8.5/T9 and my damage appeared to go down. I've heard from other people that the T9 bonuses aren't as good as the T8 and that several people are refusing to upgrade for that reason. But Rawr recommended the upgrades, so I took them. Now I'm not so sure that was a good idea. One of the problems with the mage T9 2pc bonus is that it's hard to tell whether it's working or not. There's no buff icon and no obvious increase in stats that I could see.</p>",
    "PostedDate": "2009-09-19T16:41:34.79-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "236531",
    "ThreadId": "68488",
    "Html": "<p>Depending upon your spec, 4T8-&gt;2T9 can be either a mediocre trade (fire), or a really great trade (arcane). Nothing you describe suggests at all that you're not taking full advantage of your haste.</p>",
    "PostedDate": "2009-09-19T22:51:31.773-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "236624",
    "ThreadId": "68488",
    "Html": "<p>Arcane is proc based and there is a lot of logic that has to go into deciding exactly when you do various things based on your procs.</p>\r\n<p>Are you using a mod like Power Auras (Classic) to help with proc awareness?&nbsp; It greatly reduces &quot;brain lag&quot; in processing priority based rotations.&nbsp; Kith at StratFu and many other well known players are strong advocates.</p>",
    "PostedDate": "2009-09-20T10:54:13.407-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "236694",
    "ThreadId": "68488",
    "Html": "<p>I use a few warning addons, particularly Mik's Scrolling Battle Text, which tells me clearly when Missile Barrage procs, so I don't miss it. I really don't know what my problem is. I start out high on the damage meter, because I use all my CDs early. If it's a relatively short fight, like trash, I'm often at the top when the fight is over. But if it's a long fight, I start at the top and sink to the bottom. I have the best (or nearly) gear in my guild, so I feel like I have no excuse for such low damage. I can understand some classes (rogues, hunters) being above me because they're less likely to get interrupted. But I'm regularly beaten out by spriests and boomkin. It feels like I'm driving with the emergency break on, like there's something obvious I'm missing--I just can't think of what it is.</p>",
    "PostedDate": "2009-09-20T17:08:32.233-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "236700",
    "ThreadId": "68488",
    "Html": "<p>Well, you're Arcane, and you're a Mage. Mages are generally on the low side of DPS for most fights, and Arcane is especially low at the high end. That's why they're buffing Arcane in 3.2.2.</p>",
    "PostedDate": "2009-09-20T17:46:10.813-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "236744",
    "ThreadId": "68488",
    "Html": "<p>I wouldn't really agree with that, I'd say you'd have to be at least in the top half. I'm not in&nbsp;a top guild myself, but if you want you can check some of my parses for comparison (<a href=\"http://www.worldoflogs.com/reports/rt-hcco9oD7MuavgBaf/sum/damageDone/?s=198&e=721\">http://www.worldoflogs.com/reports/rt-hcco9oD7MuavgBaf/sum/damageDone/?s=198&amp;e=721</a>, I'm only in the 25 man parses). Relative position to others&nbsp;isn't really generalizable because that is mostly based on individual performance of other players, but you can check my&nbsp;spell breakdown and such.</p>",
    "PostedDate": "2009-09-20T21:33:41.03-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "236746",
    "ThreadId": "68488",
    "Html": "<p>Kavan, you are far <strong>far <em>far</em>&nbsp;</strong>from typical. :)</p>",
    "PostedDate": "2009-09-20T21:42:18.2-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]