[
  {
    "Id": "233808",
    "ThreadId": "68714",
    "Html": "<p>I was wondering what settings people have been using.&nbsp;&nbsp;&nbsp; By default, it is set to 2.5 sec boss attack speed, 10k hits &amp; 0% magic damage.</p>\r\n<p>I find that 10k incoming hits greatly values stam and gives me about 52k health in BiS.&nbsp; If I set it to 20k incoming hits, then optimiser gives me health of 44k in BiS (ie greater avoidance).&nbsp;&nbsp; Obviously, these settings make a massive difference to the make-up of your optimised gear sets.&nbsp;&nbsp; Do you alter the values for threat &amp; survivability?</p>\r\n<p>&nbsp;</p>\r\n<p>What settings would you recommmend for Heroics?&nbsp; Reg 10 &amp; 25 Coliseum?&nbsp; Hard 10 &amp; 25 Coliseum?</p>\r\n<p>&nbsp;</p>\r\n<p>Having been healing heroics, I have seen a massive difference between DK tanks.&nbsp;&nbsp; Some of them have big health pools, but take soo much damage that it can be almost impossible to keep up with, let alone getting heals off on the rest of the group when needed!</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-09-11T19:05:34.75-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "234400",
    "ThreadId": "68714",
    "Html": "<p>You ask a very good and key question.&nbsp; The avoidance vs. Effective health debate.&nbsp; I also have both a holy priest and my Tank DK.&nbsp; What I've found is that it's entirely situational, and I tend to gear more towards avoidance/mitigation than raw survival.&nbsp; We're also working on getting some generic models setup for different bosses to help people with the decision making process. The high health value helps also for those fights where there's alot of AOE damage, that can't be avoided. &nbsp;</p>\r\n<p>I tend to not worry about threat specifically, as the difference in gear between myself and the DPS has to be very drastic for me to worry about TPS. I do sometimes turn down the Survivability number from the 1.0/1.1 default to .75 or even .5 just to see what my gear options are rather than just looking at the basic BiS items at default.&nbsp;</p>",
    "PostedDate": "2009-09-14T10:35:03.9-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "234404",
    "ThreadId": "68714",
    "Html": "<p>The BossHandler is actually really starting to come along, DPSWarr.Arms is already using it (since I'm the one writing it) from the perspective of what Melee DPS has to do during a fight. If I had control on a Tanking Model, I would enter a lot more for how Tanks have to handle it as well (frequency of attacks, how hard the boss hits, etc).</p>\r\n<p>Since this is a newer concept to model, each boss has to have all of it's aspects of Phases, Damage, etc. modelled in a way that is universal to all the models, which is kind of a pain &gt;&lt;</p>\r\n<p>To mimic Shazear, I personally gear towards avoidance once I've met a minimal survivability point (depending on the content, I'd pick like 31k unbuffed HP or something) on my ProtWarr. That way I know I can hold out in a bad situation, even moreso with my trinkets and Last Stand, etc.</p>",
    "PostedDate": "2009-09-14T10:46:08.267-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "234440",
    "ThreadId": "68714",
    "Html": "<p>Coming from a DK Tank that has been tackling ulduar25 hard modes and has started hitting ToGC25 hard modes, while avoidance seems like a good idea to optimize for in later content, the problem I've experience is a lot of the &quot;big hits&quot; that come from the encounters, such as Northrend Beasts, Mimiron, Thorim, and others, are unavoidable. Gormok's impale is going to hit you for 30-35k whether you have 10% avoidance or 60%. Ultimately that is the problem I see with the current model of averaging incoming damage, but is it good for formulating an overall set of gear. Future integration of BossHandler might add some needed variance to gear sets in the future.</p>\r\n<p>For reference, I typically stick with the default values of the TankDK module, 2.5 swing speed (sometimes I lower it to 2.0) and 10k incoming damage. I feel if I put it over 12k it starts to favor avoidance too much for my preferences.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-09-14T12:29:39.743-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]