[
  {
    "Id": "233928",
    "ThreadId": "68747",
    "Html": "<p>I'm raiding DPS DK that's new to tanking.&nbsp; Currently I'm just trying to get defense capped to farm heroics, so I'm shooting for 535 defense.&nbsp; Whenever I optimize my &quot;Overall Rating&quot; with a requirement of &quot;Chance to be Crit&quot; =&lt; 0 it comes back leaving me with a defense skill of 500 (367 rating + 132 res).&nbsp; It shows my chance to be crit at 0.&nbsp; Am I missing something here?&nbsp;</p>\r\n<p>This is with a standard 15/51/5 frost spec, only self buffed, and some of my relevant settings are:</p>\r\n<p>Boss Level = 82</p>\r\n<p>Threat weight = 0.05</p>\r\n<p>Survival Weight = 1.10</p>\r\n<p>Thanks</p>",
    "PostedDate": "2009-09-12T12:57:00.95-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "234397",
    "ThreadId": "68747",
    "Html": "<p>If you're only looking to be uncrittable for heroics, the high level of resilience is making up for the lack of defense.&nbsp; That gets you started, but your avoidance will still be lower than a DK tank who is uncrittable with just defense.&nbsp;</p>\r\n<p>So the next thing you may want to do is get those PVP pieces replaced w/ normal +def gear as you gear up through Heroics and TOC. The other option is to gem very heavily in avoidance (Dodge &amp; Parry)&nbsp; it's still not the same as defense, but may get you close.&nbsp;</p>",
    "PostedDate": "2009-09-14T10:28:11.36-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "234412",
    "ThreadId": "68747",
    "Html": "<p>Thanks for the response Shazear.&nbsp; One of those PVP pieces did get replaced over the weekend, so I'm getting closer to a respectable tanking set!</p>\r\n<p>The problem here may very well be my ignorance of tanking mechanics, but doesnt the resilience add to my defense skill?&nbsp; I still dont understand why my defense skill isnt being optimized higher with gems to make up for the lack of gear.&nbsp;</p>\r\n<p>My understanding is that defense rating and resilience are the only stats that add to defense skill, while dodge and parry add to overall avoidance.&nbsp; Is that right?&nbsp; So when setting the &quot;chance to be crit =&lt; 0&quot; constraint I expect my defense skill to be about 535 after optimization.&nbsp; Or at least closer than 500.&nbsp; That seems off by too much to be right.</p>\r\n<p>Edit: when I think of using the chance to be crit constraint, i'm thinking of it similar to setting a target Hit value for dps casters, where with that is the magic number to be attained no matter how it gets there.&nbsp; Maybe i'm looking at it all wrong?</p>",
    "PostedDate": "2009-09-14T11:10:41.793-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "234425",
    "ThreadId": "68747",
    "Html": "<p>Resilience does not <strong>in any way</strong> add to Defense, it never has and it never will.</p>\r\n<p>whew! now with that out of the way...</p>\r\n<p>The <strong>only</strong> benefit to tanks that Resilience gives it the Reduced Chance to <strong>be</strong> Crit That is, the boss can crit you unless you use a combination of Resilience and Defense (which also reduces crit) to reduce the Bosses chance to 0%. Different classes also have talents that can reduce this, giving less need for as much Defense/Resilience.</p>\r\n<p>Why not just use Resilience all the way?<br>1) Because that would be really dumb<br>2) Because that's Resilience's only benefit. Defense however, also adds to Dodge, Parry, Block, etc. so it has TONS of other values that come as a side-effect of having defense<br>3) Because gear that has Resilience is all PVP gear, so it's designed to be your only defensive stat while PVPing and you blow things up, the rest of the stats on the gear is all OFFENSIVE. Unlike TRUE defensive gear, which stacks Armor, Stamina, Dodge, Parry, Block, etc.</p>\r\n<p>Setting the requirement '% Chance to be Crit &lt;= 0' means it will use a combination of Resilience and Defense to reach that point. If you don't want it to use Resilience gear for this at all, DONT mark that gear available to the Optimizer.</p>\r\n<p>Resilience (PvP) gear can be a crutch for early tanks to reach that uncrittable point until they can replace the gear by doing heroics, which is fine, even expected. But it *really* doesn't cut it when trying to step into Raids so make sure you replace all of it before stepping into them =^)</p>",
    "PostedDate": "2009-09-14T11:39:34.66-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "234449",
    "ThreadId": "68747",
    "Html": "<p>Thanks Jothay, that was exactly the answer I was looking for.&nbsp; I dont know if the information i had read was unclear, or if i just made a connection that wasnt there.&nbsp; At any rate, you've got me all cleared up now.&nbsp;</p>\r\n<p>And yes, you hit the nail on the head.&nbsp; My pvp gear is just a crutch until i can fill a couple more slots.&nbsp; And I have no aspiration so far of tanking any raids.&nbsp; I just thought i would throw together all the tank gear i've collected as off spec to make my life easier to find groups for badge farming.&nbsp; Looking for a group as (ANOTHER) melee dps can really be painful...</p>\r\n<p>&nbsp;</p>\r\n<p>Thanks for the rundown on defense.&nbsp; I think i get it now.&nbsp; =)</p>",
    "PostedDate": "2009-09-14T12:55:44.007-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "234543",
    "ThreadId": "68747",
    "Html": "<p>However, Resil item enhancements (gems, arcanums, inscriptions, even gems) can be a great way to either fill in the gaps, or to maximize one's effective health.&nbsp; The tradeoff between Resil and Def directly (stat to stat, not comparing gear that naturally carries the stats, though that can be helpful) is that Resil gets you uncrittable more efficiently (it takes less Resil than Defense to hit uncrittablity), while Defense helps your overall stats (you also get chance to be missed, chance to block, chance to dodge, and chance to parry with Defense, in addition to reducing chance to be crit).&nbsp; There's times when you would want one or the other, which depends on the content you're approaching.</p>",
    "PostedDate": "2009-09-14T18:27:12.37-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]