[
  {
    "Id": "234096",
    "ThreadId": "68791",
    "Html": "<p>I'm new to Rawr (awsome!) and it's obvious that an item with a higher numerical score is better than one below it. &nbsp;But, looking at the Comparison's window for example, is an item with a score of 160 <strong>twice</strong> as good as an item with a score of 80?</p>\r\n<p>Or, if my current item has a score of 75, is is worth the time/badges, etc. to upgrade to an item with an 85 score, or wait until I get a drop or enough emblems to go for an item with a score of 95?</p>\r\n<p>That's what I'm trying to get a feel for -- how <strong>MUCH</strong> of a difference does some increment of the score actually mean?</p>\r\n<p>Thanks.</p>",
    "PostedDate": "2009-09-13T15:06:26.127-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "234098",
    "ThreadId": "68791",
    "Html": "<p>The score can mean any number of things and it depends entirely on the model. For a healing model, the score could be in terms of Total Heals per Second (HPS) so a score of 95 for that item means that it is contributing 95 HPS to your score as opposed to a lesser item giving 65 HPS. If you currently have the item with a score of 65 equipped and you were to replace it with the item that had 95, you gained 30 HPS total.</p>\r\n<p>As far as checking one item over the other for Badges, I find it's best to make a cost per gain analysis on all the Badge Items.</p>\r\n<table border=0 cellspacing=0 cellpadding=0>\r\n<tbody>\r\n<tr>\r\n<th>Cost</th> <th>Item Name</th> <th>Slot</th> <th>Pt Dif (Up List)</th> <th>Cost Per Pt Dif</th> <th>Pt Dif (Direct)</th> <th>Cost Per Pt Dif</th> <th>Avg the Costs per</th>\r\n</tr>\r\n<tr>\r\n<td>50</td>\r\n<td>Banner of Victory</td>\r\n<td>Trinket</td>\r\n<td>57.29</td>\r\n<td>0.873</td>\r\n<td>57.29</td>\r\n<td>0.873</td>\r\n<td>0.873</td>\r\n</tr>\r\n<tr>\r\n<td>35</td>\r\n<td>Dexterous Brightstone Ring</td>\r\n<td>Finger</td>\r\n<td>35.23</td>\r\n<td>0.993</td>\r\n<td>45.43</td>\r\n<td>0.770</td>\r\n<td>0.882</td>\r\n</tr>\r\n<tr>\r\n<td>25</td>\r\n<td>Crimson Arc Throwing Stars/Crimson Star</td>\r\n<td>Ranged</td>\r\n<td>14.80</td>\r\n<td>1.689</td>\r\n<td>16.78</td>\r\n<td>1.490</td>\r\n<td>1.590</td>\r\n</tr>\r\n<tr>\r\n<td>35</td>\r\n<td>Bloodshed Band</td>\r\n<td>Finger</td>\r\n<td>31.66</td>\r\n<td>1.105</td>\r\n<td>15.62</td>\r\n<td>2.241</td>\r\n<td>1.673</td>\r\n</tr>\r\n</tbody>\r\n</table>\r\n<p>So what you are seeing above is the point difference (amount I would gain) from that item agains my current items then divide that into the number of badges it costs, so that I can spend minimal badges to get the most gain, in that order. I personally average the values I get from the direct upgrade of comparing the two items in the Comparison Lists and what I get out of the Build Upgrade List feature which factors in gem changes and the like to keep me hit capped, etc. As you can see in the list there, the item with the highest gain per badge spent is Banner of Victory, so I would aim for that first.</p>\r\n<p>Edit: Before anyone says anything: ya, I know where Banner of Victory actually drops, I do more than just compare badges on my chart</p>",
    "PostedDate": "2009-09-13T15:22:12.823-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "234104",
    "ThreadId": "68791",
    "Html": "<p>Thanks for the <strong>excellent</strong> reply!</p>\r\n<p>So, the above makes me suggest that Rawr provide such a set of calculations on request since it has all of that data available. &nbsp;Boy, would that answer many a question!</p>",
    "PostedDate": "2009-09-13T15:57:00.003-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "234106",
    "ThreadId": "68791",
    "Html": "<p>To be clear, you are suggesting that Rawr add some way of showing you a table like I just showed you?</p>\r\n<p>We probably wouldn't be doing that since it's a bit excessive. What you can do to get the data yourself and build a little table is to use the Item Filters (on the right side of Rawr, above the Comparison pane) and limit the list to just the Badge Drops, then change your Comparison Chart selection to Direct Upgrades. Record those values then run a Build Upgrade List (from the Optimizer) which should be really quick since you will have very few items shown. Then make a little table in Excel and go to town.</p>",
    "PostedDate": "2009-09-13T16:01:50.787-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "234107",
    "ThreadId": "68791",
    "Html": "<p>There's been an idea around for a while to be able to assign a 'cost' to an item, and have upgrade lists show you an 'upgrade per cost' value for each item, however it'll probably be a while until we get to that.</p>",
    "PostedDate": "2009-09-13T16:19:39.21-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "234113",
    "ThreadId": "68791",
    "Html": "<p>Thank you both for the clarifications. &nbsp;I'll use the above method, and I hope my 2 cents leads to an 'item cost' feature in the future.</p>",
    "PostedDate": "2009-09-13T16:56:32.293-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "234840",
    "ThreadId": "68791",
    "Html": "<p>One note I'd like to add: rather than using Build Upgrade List (which takes forever, and can be impossible if you see multiple upgrades in a short period of time), or from doing the direct upgrade (just comparing the difference between score when you swap the item in), try using the &quot;Evaluate Upgrade&quot; option (available by right clicking on the item).</p>\r\n<p>This basically runs the &quot;build upgrade list&quot; feature, but only for that item. &nbsp;If you need to regem/re-enchant, or swap in that hit ring, etc, it's the best way to go.</p>",
    "PostedDate": "2009-09-15T11:29:26.323-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]