[
  {
    "Id": "234439",
    "ThreadId": "68899",
    "Html": "<p>Are there any plans to add a filter for BoE items, or at the very least make it possible for uses to create a filter? &nbsp;Currently there is nothing denoting an item as BoE in the item source in Rawr so it can't even be filtered manually. &nbsp;This seems like something that is easy to fix as it is a filterable on wowhead, and shown on the WoW Armory. &nbsp;This would be very helpful for new 80's as well as those looking to quickly jump up from entry stuff to harder content, ei buying several ilvl226+ BoE items.</p>",
    "PostedDate": "2009-09-14T12:24:47.153-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "234491",
    "ThreadId": "68899",
    "Html": "<p>How many times has this been asked? If you had searched &quot;BoE Items&quot; and you would have seen 8 results.</p>",
    "PostedDate": "2009-09-14T14:31:29.863-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "234506",
    "ThreadId": "68899",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>Jothay wrote:</strong><br>\r\n<p>How many times has this been asked? If you had searched &quot;BoE Items&quot; and you would have seen 8 results.</p>\r\n</blockquote>\r\n<p>I DID search BEFORE saying anything, and this is what I found:</p>\r\n<p><a href=\"http://rawr.codeplex.com/Thread/View.aspx?ThreadId=68222\">http://rawr.codeplex.com/Thread/View.aspx?ThreadId=68222</a></p>\r\n<p><a href=\"http://rawr.codeplex.com/Thread/View.aspx?ThreadId=66630\">http://rawr.codeplex.com/Thread/View.aspx?ThreadId=66630</a></p>\r\n<p><a style=\"text-decoration:none\" href=\"http://rawr.codeplex.com/Thread/View.aspx?ThreadId=64465\">http://rawr.codeplex.com/Thread/View.aspx?ThreadId=64465</a></p>\r\n<p><a style=\"text-decoration:none\" href=\"http://rawr.codeplex.com/Thread/View.aspx?ThreadId=21896\">http://rawr.codeplex.com/Thread/View.aspx?ThreadId=21896</a></p>\r\n<p>NONE of which say HOW to implement this... AND if you had bothered to READ what I said I wasn't asking how to do it since in one therad YOU specifically say not it can't be done. &nbsp;I was Asking if there was any plans to make that change since it has been requested several time, and would be useful. &nbsp;So please stop being a jerk.</p>\r\n<p>:EDIT: &nbsp;If it is asked so much that it bothers you why don't you try putting it on the infomation page about item filtering?</p>",
    "PostedDate": "2009-09-14T15:21:16.047-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "234564",
    "ThreadId": "68899",
    "Html": "<p>xgamer15, you weren't asking how to implement this, you were asking when it would be done (and saying that it would be easy to do; always an irritating thing to do when you don't know what you're talking about). If you knew about those threads before, you should have posted there. Had you simply asked &quot;Any idea if you'll get to this feature soon?&quot; in one of the existing threads, you would have gotten a simple, happy answer of &quot;Probably not; it's really low priority for us right now.&quot;</p>\r\n<p>There are many instances of devs or regular posters being a dick on these forums, but this certainly isn't one of them.</p>\r\n<p>P.S. We get lots of questions. Reading the help would be too cluttered and taxing if we added every little question to the existing help docs. We'd also have no time to develop Rawr. (That said, we're working on a way that we can let our&nbsp;knowledgeable, frequent posters contribute to the help documentation, for the not-too-distant future)</p>",
    "PostedDate": "2009-09-14T20:49:10.697-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "234698",
    "ThreadId": "68899",
    "Html": "<p>I'm sorry if it is harder to add than it seems, but since it is filterable on wowhead, and rawr can import items from wowhead filters, and even update the item cache from wowhead I don't understand why the item source / notes can't have one extra word that says BoP for items that wowhead lists a BoP. &nbsp;If there were even a way people could set an item filter to only show content based on what was returned from a wowhead filter or insert info into the item notes based on if it was returned from a wowhead filter (ie an extra option on the &quot;Import from Wowhead filter...&quot;). &nbsp;There are several options that seem fairly straight forward, I do not know the inner workings of the program, but I am a programmer by trade, and to me it seems like the information needed to accomplish this is available, and the implementation is fairly close. &nbsp;But I do not know how the program was written so it may well be too hard to accomplish any of the previously mentioned ideas easily, if that is the case I am sorry for wasting your time. &nbsp;</p>\r\n<p>The option to edit notes based on if the item was returned from a wowhead filter would be a great addition for other things as well, ie filtering for twink items, zone drops, etc. &nbsp;Again I don't know exactly how you interact with wowhead, but since the ability to download based on a wowhead filter is available it seems the framework to accomplish this is in place already.</p>",
    "PostedDate": "2009-09-15T05:57:48.157-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "234782",
    "ThreadId": "68899",
    "Html": "<p>Glad to hear you're a programmer, and it should be so easy to do. Let me know when you've posted a patch to add this feature.</p>",
    "PostedDate": "2009-09-15T09:26:22.453-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "234801",
    "ThreadId": "68899",
    "Html": "<p>Xgamer15 - seriously it would be fantastic if you could assist and actually code this up. Yes it would probably be easy to add, however as you will appreciate being a programmer knocking up a quickie bit of code that seems to work is the easy bit. Testing it and making sure that it doesn't break all the stuff that currently works is the time consuming bit. This is where the challenge is.</p>\r\n<p>As its a low priority item and a bit of feature creep that might break existing code its not shown up on the radar of most developers. I was the one who added the view wowhead filter url and the Load possible upgrades from wowhead, so yes I agree its fairly easy to add.</p>\r\n<p>The code is in C# and available from the source code link on the website. We very much encourage users who are programmers to have a look and see if they can add extra code that would enhance the product. So please do download the code and have a play around. I and others will be happy to assist if you need to ask questions to find your way around the code as I am well aware its quite daunting at first.</p>\r\n<p>Once you have something that seems to work post a patch and we can evaluate it. If you get hooked when trying it out and would like to assist more I'm sure Astrylian would be happy to welcome you on board especially if your main is a Rogue, or one of the other specs where we need a developer.</p>\r\n<p>&nbsp;</p>\r\n<p>PS. If your main is a rogue, you are likely to be snapped up quickly and invited to be a full dev as we desperately need a good Rogue dev.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-09-15T10:04:36.063-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "236209",
    "ThreadId": "68899",
    "Html": "<p>So I'm working on adding BoP / BoE tags to the item source &amp; ran into an issue.</p>\r\n<p>If I update an item from The Armory it will give me BoP or BoE like expected and I can filter for BoE just fine on most items. &nbsp;But if I update the item from Wowhead it ALWAYS says None.</p>\r\n<p>So does anyone know how to pull the correct field from wowhead for the binding information as &quot;/page/itemTooltips/itemTooltip/bonding&quot; only seems to work with items updated from the armory. &nbsp;Because it only works with the armory some world drop items do not come up correctly, for example &quot;Signet of Edward the Odd&quot;. &nbsp;Updated from the Armory it has no source, thanks blizz, but updated from wowhead it says it's a world drop, but says &quot;None&quot; instead of pulling the correct BoP / BoE information.</p>\r\n<p>Any help on the structure of the info pulled from wowhead would be nice.</p>\r\n<p>thanks</p>",
    "PostedDate": "2009-09-18T13:22:45.813-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "236222",
    "ThreadId": "68899",
    "Html": "<p>You can see Wowhead's data for an item by appending &amp;xml to any item page URL on Wowhead.</p>",
    "PostedDate": "2009-09-18T13:42:09.85-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "236832",
    "ThreadId": "68899",
    "Html": "<p>ie: Signet of Edward the Odd is http://www.wowhead.com/?item=44308&amp;xml</p>\r\n<p>&nbsp;</p>\r\n<p>&lt;wowhead&gt;<br>&lt;item id=&quot;44308&quot;&gt;<br>&lt;name&gt;Signet of Edward the Odd&lt;/name&gt;<br>&lt;level&gt;200&lt;/level&gt;<br>&lt;quality id=&quot;4&quot;&gt;Epic&lt;/quality&gt;<br>&lt;class id=&quot;4&quot;&gt;Armor&lt;/class&gt;<br>&lt;subclass id=&quot;-2&quot;&gt;Rings&lt;/subclass&gt;<br>&lt;icon displayId=&quot;53042&quot;&gt;INV_JEWELRY_RING_76&lt;/icon&gt;<br>&lt;inventorySlot id=&quot;11&quot;&gt;Finger&lt;/inventorySlot&gt;<br>&lt;htmlTooltip&gt;<br>&lt;table&gt;&lt;tr&gt;&lt;td&gt;&lt;b&gt;Signet of Edward the Odd&lt;/b&gt;&lt;br /&gt;&lt;!--bo--&gt;Binds when equipped&lt;br /&gt;Unique-Equipped&lt;br /&gt;Finger&lt;br /&gt;+49 Agility&lt;br /&gt;+54 Stamina&lt;!--e--&gt;&lt;!--ps--&gt;&lt;br /&gt;Requires Level 80&lt;br /&gt;Item Level 200&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;&lt;table&gt;&lt;tr&gt;&lt;td&gt;&lt;span&gt;Equip: Improves haste rating by 29&amp;nbsp;&lt;small&gt;(&lt;!--r80:36:29--&gt;0.88%&amp;nbsp;@&amp;nbsp;L80)&lt;/small&gt;.&lt;/span&gt;&lt;br /&gt;&lt;span&gt;Equip: Increases attack power by 58.&lt;/span&gt;&lt;br /&gt;&lt;span&gt;Equip: Your melee and ranged attacks have a chance to increase your haste rating by 125 for 13 sec.&lt;/span&gt;&lt;br /&gt;Sell Price: &lt;span&gt;7&lt;/span&gt; &lt;span&gt;12&lt;/span&gt; &lt;span&gt;45&lt;/span&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;<br>&lt;/htmlTooltip&gt;<br>&lt;json&gt;<br>id:44308,name:'3Signet of Edward the Odd',level:200,reqlevel:80,armor:0,slot:11,source:[2],classs:4,subclass:-2<br>&lt;/json&gt;<br>&lt;jsonEquip&gt;<br>slotbak:11,displayid:53042,reqlevel:80,atkpwr:58,hastertng:29,agi:49,sta:54,sellprice:71245,avgbuyout:10000000<br>&lt;/jsonEquip&gt;<br>&lt;link&gt;http://www.wowhead.com/?item=44308&lt;/link&gt;<br>&lt;/item&gt;<br>&lt;/wowhead&gt;</p>",
    "PostedDate": "2009-09-21T04:00:10.31-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "236837",
    "ThreadId": "68899",
    "Html": "<p>I've added a forum request on Wowhead's forums http://www.wowhead.com/?forums&amp;topic=122103&amp;p=1425495 asking that they include instance type status info in the XML. Please feel free to add your support to this thread.</p>",
    "PostedDate": "2009-09-21T04:10:33.383-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "273681",
    "ThreadId": "68899",
    "Html": "<p>Any activity around this issue lately? xgamer15? Seem to be silent for 60+ days here...</p>\r\n<p>ps. I'll take a look into the code if I could find enough time to implement stuff like this...</p>",
    "PostedDate": "2010-01-06T01:41:00.27-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "273832",
    "ThreadId": "68899",
    "Html": "<p>&nbsp;I started to dig into the current sources and implemented item binding status support - from wowhead and&nbsp;armory. Added filtering support too. Everything seem to work well.</p>\r\n<p>The question is now: what is right way to participate in development? i.e. what it takes to get account for SVN submits to be done?</p>\r\n<p>Thank you,</p>\r\n<p>Juri.</p>",
    "PostedDate": "2010-01-06T08:08:43.017-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "274293",
    "ThreadId": "68899",
    "Html": "<p>If someone need it - check the &quot;Source Code -&gt; Patches&quot; section, I put the stuff there: binaries and sources.</p>",
    "PostedDate": "2010-01-07T05:46:53.583-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]