[
  {
    "Id": "234655",
    "ThreadId": "68960",
    "Html": "<p>Disclaimer: Yes, I searched. I read every single discussion thread (all 8), and the help from the home page :P</p>\r\n<p>Since I found out about the Evaluate Upgrade (I'll call it&nbsp;EU)&nbsp;option, I've been using it rather constantly. Thanks to having overburdened computers at work, running up full upgrade lists is a painful process and&nbsp;EU saves me tons of time.</p>\r\n<p>One thing I've found happens, though, is that in a run&nbsp;I might end up with several won items. Then, when I have time later for an optimize, I end up with some items not being used. They were upgrades to what Rawr had me wearing at the beginning of the run, but when all the &quot;upgrades&quot; I took were put together, some were no longer upgrades after all.</p>\r\n<p>So I have a suggestion based on a question.&nbsp;EU runs rather quickly - is it considering&nbsp; the item with all marked-as-available gear, or just the item being checked plus what's showing equipped?</p>\r\n<p>If it uses all available gear, how about an &quot;equip this set&quot; option on the&nbsp;EU result if it's an upgrade? Basically what I'm looking for is to accurately evaluate the next item without having to run a full optimize (which chews up my FPS) on what I've just won.</p>\r\n<p>Alternately, if EU is&nbsp;using only currently equipped&nbsp;items in comparison, am I missing out on possible upgrades that would come with gear switches?</p>",
    "PostedDate": "2009-09-15T01:56:04.46-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "234757",
    "ThreadId": "68960",
    "Html": "<p>Speaking of running upgrade lists...</p>\r\n<p>Is it just something on my end or are upgrade lists building incredibly slowly? I've got one running now that's going less than a % per minute (Rawr.Cat). That's far slower than it used to be; if it's just me I'll have the computer looked into.</p>",
    "PostedDate": "2009-09-15T08:27:21.21-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "234780",
    "ThreadId": "68960",
    "Html": "<p>Running an Evaluate Upgrade does indeed consider all marked as available gear. And on any upgrade list (including the single-item result of Evaluate Upgrade), you can right click on an item and say Equip All, to equip the optimal set, with that item. You'll still need to actually mark it available though, I believe.</p>\r\n<p>I'd like to find time to optimize the performance of Rawr.Cat in the not-too-distant future, but most of what you're seeing is probably 'special effect combinations'. It's a new feature we've added recently, to more accurately model the uptime of certain temporary effects that change in value when used in combination. It's currently only used for ArPen effects, because that's where it really matters. ie, using both Grim Toll and Mjolnir Runestone, each will be up what % of the time, both will be up what % of the time, and neither will be up what % of the time, then average out the damage reduction from armor when under each of those weighted uptimes. That matters for ArPen because it scales exponentially, AND has an attainable cap, so 1000arpen 50% of the time is better than 500arpen 100% of the time... unless 1000arpen puts you over the cap enough to offset its exponential scaling.&nbsp;</p>\r\n<p>Bottom line is; arpen effects are complicated, and we try to accurately model them now. There's a couple things you can do to improve performance though. First, unmark available any temporary arpen effects that aren't actually viable for you anymore. That probably just means Incisor Fragment, if you're up at the Grim/Mjolnir level. Executioner may end up being useful in certain situations, so leave that available (unless you tank with that weapon, then stick to Mongoose). Second, goto Tools &gt; Options &gt; General Settings, and there's a couple options there for special effect calculation modes. You can lower those to improve performance.</p>",
    "PostedDate": "2009-09-15T09:25:46.093-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "234972",
    "ThreadId": "68960",
    "Html": "<p>/facepalm</p>\r\n<p>Of course, another easy option that I wish I'd noticed long ago. And it'll make my emblem-purchase planning a bit easier too. Thanks!</p>\r\n<p>As far as Rawr.Cat... it took over an hour and a half to run that upgrade list. Didn't stay up to find out how long Rawr.Bear was taking. I've only got Grim Toll; I've got Executioner marked as available, although Rawr always prefers Berserking for me. I also have the trinket offset at 0 - I'm simply not likely to manage to pull it off right. With those few options in, I'm leery of what running a list would be like if I had more ArPen options in there... ugh.</p>\r\n<p>ArPen is one of those reasons I'm awfully glad there's tools like Rawr around.</p>\r\n<p>Is 3.2.2's changes to ArPen going to bring the list-building time back down again, or is the complexity pretty much there to stay?</p>\r\n<p>Edit: Completely forgot to ask my main question. If I change those FX calculation modes, is that going to notably impact the quality of Rawr's recommendations?</p>",
    "PostedDate": "2009-09-15T19:10:27.527-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "234975",
    "ThreadId": "68960",
    "Html": "<p>Generally, no. Try changing them, see how much it impacts your DPS; will likely be less than 1-2 dps.</p>",
    "PostedDate": "2009-09-15T19:22:45.337-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "235009",
    "ThreadId": "68960",
    "Html": "<p>Great! Thanks for your time.</p>",
    "PostedDate": "2009-09-15T22:52:26.127-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]