[
  {
    "Id": "235260",
    "ThreadId": "69140",
    "Html": "<p>&nbsp;</p>\r\n<p>Hello,</p>\r\n<p>I'm experiencing an issue with Rawr Enhance where the gear/gem choices are not&nbsp;consistent with the relative stats values.&nbsp; Initially I had assumed that it was an optimizer issue, but it doesn't appear to be the case.&nbsp;</p>\r\n<p>For instance, after optimization, Rawr recommends 20ap/10haste gems in some of my yellow slots.&nbsp; While those gems certainly aren't bad for enhancement shamans,&nbsp;I also know that haste generally isn't better than crit until high gear levels.&nbsp; This is confirmed by Rawr's relative stats values, which state that crit &gt; hit &gt; agi&nbsp;&gt; haste.&nbsp;</p>\r\n<p>To make sure that it wasn't an optimizer issue, I manually replaced a 20ap/10haste gem with a 20ap/10crit gem.&nbsp; Surprisingly, the overall points decreased.&nbsp; Afterwards I also verified that the relative stats values had not changed (I know haste is a tricky stat), which was not the case; crit was still valued higher.</p>\r\n<p>So what gives?&nbsp; Are relative stats values incorrect in Rawr?&nbsp; I guess that's possible but they absolutely do make sense to me.</p>\r\n<p>Thanks for any assistance!</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-09-16T11:15:01.547-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "235272",
    "ThreadId": "69140",
    "Html": "<p>There's a big red disclaimer at the bottom of Relative Stat Values stating that it's generally not a reliable resource for this sort of thing.</p>\r\n<p>Relative stat values shows you 1 point in that rating/stat, the gems you described have 10 per. It's entirely possible that 10 haste could put you into a tipping point that Crit does not, or vice-versa.</p>",
    "PostedDate": "2009-09-16T11:44:29.653-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "235349",
    "ThreadId": "69140",
    "Html": "<p>Thanks for the reply.</p>\r\n<p>I do understand the disclaimer and I'm fairly well versed in enhance shaman stats and their intricacies.&nbsp; I do know that haste is a finicky stat and that its relative value can change quite wildly.&nbsp; However, as I explained, crit remains rated significantly higher than haste regardless of which gems I manually swap in.&nbsp; Also, I haven't mentionned that the changes (in terms of overall points) are quite dramatic.&nbsp; Here's an actual example:</p>\r\n<p>1) 20ap/10haste gem: Overall points = 6399.41, Value for crit = 1.07,&nbsp;Value for haste = 0.95</p>\r\n<p>2) 20ap/10crit gem: Overall points = 6373.86, Value for crit = 1.06,&nbsp;Value for haste = 0.96</p>\r\n<p>3) 20ap gem: Overall points = 6363.25, Value for crit = 1.06, Value for haste = 0.96</p>\r\n<p>As you can see, swapping 10 haste for 10 crit results in a loss of 25 points, and entirely removing 10 haste results in a loss of 36 points.&nbsp; This indicates that haste is roughly 3 times&nbsp;more valuable than crit.&nbsp; Again, I understand that this conclusion is only valid&nbsp;for a&nbsp;particular data point, but something seems amiss considering that&nbsp;the relative values of crit and haste are essentially identical at the 3 data points.&nbsp; Wouldn't you agree?</p>",
    "PostedDate": "2009-09-16T15:14:02.477-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "235363",
    "ThreadId": "69140",
    "Html": "<p>One more comment.&nbsp; I just found a situation where replacing a 20ap/10haste gem with a 16ap/8haste gem (blue instead of epic) resulted in a gain of 25 points.&nbsp;&nbsp;This reinforces my belief that something isn't quite right with haste.&nbsp;</p>\r\n<p>Here's the important thing, though.&nbsp; If there isn't a bug&nbsp;in Rawr, then it means that haste is completely unreliable since gaming experience will never exactly match the model used&nbsp;in Rawr (or EnhSim for that matter).&nbsp; In other words, even though Rawr is saying that removing 2 haste should improve my DPS, I doubt it would actually be the case in practise.&nbsp;</p>\r\n<p>This might not be the proper forum for this discussion, but I'm curious about other enhance shamans' thoughts about haste now?&nbsp; I tend to think that it isn't a safe/reliable stat to gem for now...</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-09-16T16:20:26.723-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "235636",
    "ThreadId": "69140",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>RaphaBE wrote:</strong><br>\r\n<p>One more comment.&nbsp; I just found a situation where replacing a 20ap/10haste gem with a 16ap/8haste gem (blue instead of epic) resulted in a gain of 25 points.&nbsp;&nbsp;This reinforces my belief that something isn't quite right with haste.&nbsp;</p>\r\n<p>Here's the important thing, though.&nbsp; If there isn't a bug&nbsp;in Rawr, then it means that haste is completely unreliable since gaming experience will never exactly match the model used&nbsp;in Rawr (or EnhSim for that matter).&nbsp; In other words, even though Rawr is saying that removing 2 haste should improve my DPS, I doubt it would actually be the case in practise.&nbsp;</p>\r\n<p>This might not be the proper forum for this discussion, but I'm curious about other enhance shamans' thoughts about haste now?&nbsp; I tend to think that it isn't a safe/reliable stat to gem for now...</p>\r\n</blockquote>\r\n<p>You have hit on the problem. EnhSim and Rawr both suffer from the precision of computers. Haste in either program is a right royal pain because a tiny tiny change in haste can make the difference between squeezing in an extra ability just before the combat length expires thus boosting dps by a large amount.</p>\r\n<p>eg: you have a 6 min fight setup. And say 300 haste this might mean you can get 19.9999999 Earth Shocks in within the 6 mins (ie: only 19 ES). Now say that 301 haste allows you to get 20.000001 Earth Shocks in the same time frame. Suddenly the extra 1 haste gave you a boost in dps way way in excess of what a second point in haste would give you.</p>\r\n<p>This is true whether you use Rawr or EnhSim. With EnhSim we are looking to introduce variable combat lengths where it randomly adds or subtracts time to the combat length to try to smooth out this issue. Either way its a computer sim issue. Think about it, if the program works out you could do 20.000001 ES in 6 mins but you don't quite react as quickly as a computer then your actual dps is only 19 ES in the time, which accounts for a lot of why the sims and your real life experiences don't match up. Also factor in things like moving times, silences, just plain slow reactions or times when you have to eat pizza, knock the cat away from keyboard, answer phone/send txt etc whilst on a boss fight and you see where the sims will fall down in the prediction of your actual dps.</p>\r\n<p>Haste is a GOOD stat, but the computer sims are too precise to be sure exactly how good it is, as they can never accurately reflect the randomness of your reaction times.</p>",
    "PostedDate": "2009-09-17T08:40:23.333-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "235674",
    "ThreadId": "69140",
    "Html": "<p>To that very issue is the reason why we set DPSWarr to use partial abilities (19.99 activates is still 19.99, not 19) by default so that Haste and Expertise can't jump in value like that. Users have the option of turning on Flooring, which makes it act the other way (19.99 activates is 19) if they want to (but it doens't do that everywhere it needs to right now).</p>\r\n<p>Maybe a setting could be created for Enhance that would allow users to see this back and forth for a more flowing level of Haste?</p>",
    "PostedDate": "2009-09-17T10:06:17.367-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "235690",
    "ThreadId": "69140",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>Levva wrote:</strong><br>\r\n<p>Haste is a GOOD stat, but the computer sims are too precise to be sure exactly how good it is, as they can never accurately reflect the randomness of your reaction times.</p>\r\n</blockquote>\r\n<p>&nbsp;Thanks for&nbsp;addressing this&nbsp;guys. I wanted to post&nbsp;a question&nbsp;about haste on EJ, but felt I would look retarded.&nbsp;This makes sense to me.</p>",
    "PostedDate": "2009-09-17T10:43:33.06-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "235731",
    "ThreadId": "69140",
    "Html": "<p>Thanks for the answers, Levva and Jothay!</p>\r\n<p>I perused EJ again last night, going back to posts made several months ago, and I found valuable information along the lines of what you explained.&nbsp; As you may recall, someone created a plot of Haste EP versus Haste Percentage (from EnhSim results)&nbsp;and it was incredibly jumpy.&nbsp; Indeed the conclusion was that haste is a good stat (particularly at high gear&nbsp;levels; not so great otherwise), but that its precise EP value is fairly meaningless and unreliable.&nbsp; I&nbsp;also played some more with Rawr, and found situations where adding another haste gem actually&nbsp;resulted in worse damage.&nbsp; This confirms the &quot;jumpyness&quot; of the stat.&nbsp; Overall, going full haste versus going full crit didn't appear to make a huge difference, as the results kept oscillating within ~50 dps.&nbsp;</p>\r\n<p>That being said, I'm still wondering whether the algorithm that calculates EP values in Rawr is consistent with the main engine, since I haven't observed any situation where haste was valued higher than crit.&nbsp; How does it work?&nbsp; Are you simply incrementing a given stat by 1, calculating the overall points, and printing the difference (i.e. sensitivity analysis by finite differences)?&nbsp; It doesn't really matter since we have established that the EP value isn't too meaningful, but I'm curious.&nbsp; Here's one suggestion though: you could experiment by decrementing the stat instead of incrementing it, and possibly even using various increments (-5 to +5 for instance) then averaging the results to smooth out the EP values.&nbsp; (I deal with sensitivity analysis in my line of work, so I'm all too familiar with the pitfalls of such methods.)</p>\r\n<p>As for myself, since my gear is decent but not amazing, I will probably play it safe and avoid gemming for haste at this time.&nbsp; Thanks again for helping me reach that conclusion.</p>",
    "PostedDate": "2009-09-17T12:26:32.687-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "235947",
    "ThreadId": "69140",
    "Html": "<p>As with most people you are misunderstanding how Rawr works. Rawr doesn't give a toss what the EP values are and makes zero attempt to use them. The graph showing EP values is a sop to those that insist on still using them.</p>\r\n<p>What Rawr DOES do is to use a formula for each and every ability. eg: It works out your average AP value for the duration of the fight and then applies that to each AP based ability factoring in miss rates, dodge rates, damage multipliers etc etc. This way it has zero bias towards any particular stat. If you increase hit and that reduces miss rate it simply gives you the new dps from missing less. So when you look at say chest pieces the graph is simply showing you the dps contribution of that item. ie: it works out the dps of your kit with NO chest piece then works out the dps of your kit with each of the different chest/gem combos. Then ranks those dps values in order in a nice graph.</p>\r\n<p>So no EP values used anywhere in the calculations no increments needed at all.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-09-18T02:08:57.25-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "236783",
    "ThreadId": "69140",
    "Html": "<p>I'm absolutely not misunderstanding how Rawr works, and I don't believe I have ever inferred that Rawr uses the EP values in any way.&nbsp; I'm only saying that the EP values calculated by Rawr should be consistent with the gear recommendations.</p>\r\n<p>Perhaps I'm not explaining myself correctly, so let me use an example.&nbsp; Imagine that there exists a gem with +1 crit only, and equiping that gem increases my score by&nbsp;1 point.&nbsp; There also exists a gem with +1 haste only, which increases my score by&nbsp;2 points.&nbsp; Then, the EP values for crit and haste <strong>in this particular configuration </strong>should be equal to X and 2*X respectively.&nbsp; If they were any different, in particular if haste was valued lower than crit, then it would not be consistent.&nbsp; Of course such gems don't exist, and by equiping a +10 gem we're moving to a different configuration for which the EP values aren't valid anymore.&nbsp; I understand that as well.&nbsp;&nbsp;However,&nbsp;it's surprising that&nbsp;I have <strong>never</strong> observed haste being valued higher than crit in Rawr, in any configuration so far.&nbsp;</p>\r\n<p>In addition, as mentionned in the previous post, it's well known that the haste EP value calculated by EnhSim varies wildly.&nbsp; Sometimes it's higher than the value of&nbsp;other stats; sometimes it's lower.&nbsp; Again I'm surprised that it isn't the case in Rawr.&nbsp; Maybe it's just luck, but I felt that it was worth investigating.</p>\r\n<p>Finally, I'm still curious as to how EP values are calculated.&nbsp; I mentionned finite differences and I offered a suggestion to possibly improve it.&nbsp; That is where I used the wording &quot;increment&quot; by the way. :)</p>",
    "PostedDate": "2009-09-21T01:37:48.177-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "236792",
    "ThreadId": "69140",
    "Html": "<p>EP values are calculated in Rawr by adding a specific increment, and testing to make sure the results are contiguous. If not it uses wider values to take a range either side of the stepping it encountered. If the stat uses different ratios for different outcomes, eg: AGI gives 1AP and 0.3SP, thus adding 1 Agi wouldn't necessarily increase SP in calcs where its rounded to nearest whole SP. Thus we use a wider range to ensure we are better accounting for such stepping. EnhSim uses a similar method.</p>\r\n<p>Either way when getting the result it takes the total DPS gain and divides by the step to get the dps per 1 of the stat. If you tick the AEP box it then also normalises on AP=1.</p>\r\n<p>&nbsp;</p>\r\n<p>What you are misunderstanding is that EP values are a guide to what gear is best, having a high EP value for one stat <strong>does not mean</strong> you can multiply the values up and get an accurate result. This has NEVER been true, its commonly used however as in the past the models were a lot less volatile and it was easy to say that at say T5 gear your EP values were X, Y, Z. Now mainly due to haste you can't give fixed EP values for any tier of gear you need to work out your own.</p>\r\n<p>The reason you can't just multiply all the stats by the EP values, is that you must remember to remove the stats you are replacing as well and if haste is in there at all you can't really rely on EP values. Practical upshot is sim before and sim after using Rawr or EnhSim. Using EP values is just too unreliable.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-09-21T02:02:07.923-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "236930",
    "ThreadId": "69140",
    "Html": "<p>Calculating the relative stat values for a character is actually one of the more complex functions of Rawr. As Levva said, it tries various amounts of the stat, finding the exact fractional points where the stat changes in value. For stats which product multiple effects, that get rounded in different ways, it can get quite confusing, and make the stat bounce up and down in value quite alot.</p>",
    "PostedDate": "2009-09-21T08:58:59.117-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]