[
  {
    "Id": "235651",
    "ThreadId": "69262",
    "Html": "<p>Original post, from KleMiX:</p>\r\n<p style=\"margin-top:1em;margin-bottom:1em\">Hi,</p>\r\n<p style=\"margin-top:1em;margin-bottom:1em\">There are some healadins that dont use Holy Light at all, my friend for example, so Rawr is useless... I'm using Rawr for my ProtWarr and I&nbsp;like it, so i made alternate Healadin model for Rawr for those who spal FoLs...</p>\r\n<p style=\"margin-top:1em;margin-bottom:1em\">Regards,</p>\r\n<p style=\"margin-top:1em;margin-bottom:1em\">KleMiX</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>We'll review the patch, but out of&nbsp;curiosity, is there actually any potential benefit to doing that? It's been my understanding that it's just simply bad play to do that.</p>",
    "PostedDate": "2009-09-17T09:31:39.02-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "235694",
    "ThreadId": "69262",
    "Html": "<p>FoL spammer can be worst geared healer sitting in 1st place by healing with low overhealing, because of small effective heals to the raid... Easily can beat HL spammer, have no problems with mana.... But really its a holy war for healadins...</p>\r\n<p><a href=\"http://www.holypaladin.net/index.php/holy-paladin-healing-guide\">http://www.holypaladin.net/index.php/holy-paladin-healing-guide</a>&nbsp;example of fol spammer, theres many thoughts in his blog about healing strategy</p>\r\n<p>But its really can get to holy war, so we just should accept that fol spammers exist and do their job good :)</p>",
    "PostedDate": "2009-09-17T10:51:27.187-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "254341",
    "ThreadId": "69262",
    "Html": "<p>Hi,</p>\r\n<p>I just downloaded and started using Rawr, and at first I couldn't figure out how to get Rawr to know that I was an FoL Spammer, then I found this post and understand. &nbsp;Thank you KleMiX, I am now using your model and I hope that it will help me here. &nbsp;I am actually trying to decide which of the two specs to use...I have been an FoL spammer since I started playing (I only got into raiding at about when Ulduar was released). &nbsp;I was so good it convinced my guild's other HL spammer to switch. &nbsp;In otherwords it would be super if it was possible to implement this into Rawr as some thing like a switch or toggle. &nbsp;Us FoL spammers would appreciate it I'm sure. &nbsp;But, for now I can just switch the .dll files around. &nbsp;Thanks again!</p>\r\n<p>And yes, this sort of thing can definitely turn into a holy war...just read the current Elitist Jerk's topic on it :P &nbsp;I simply let the pally choose their own spec and cheer for them when they do well :)</p>\r\n<p>Sincerely,</p>\r\n<p>Sijet</p>",
    "PostedDate": "2009-11-06T11:55:51.083-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "254460",
    "ThreadId": "69262",
    "Html": "<p>Wait wait, what? Klemix, contact me immediately. We do not want some alternate healadin model out there. Please take that down, and contact me.</p>\r\n<p>(I didn't notice this earlier, I thought you had posted a patch, not an alternate DLL).</p>",
    "PostedDate": "2009-11-06T22:58:21.64-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "256102",
    "ThreadId": "69262",
    "Html": "<p>Hi Sijet,</p>\r\n<p>I challenge you to do MT healing on TOGC 10/25 during the Northrend Beasts with only FoL spam.</p>\r\n<p>Get back to us how that went. ;)</p>\r\n<p>Cheers,<br>&nbsp;- Robur</p>",
    "PostedDate": "2009-11-11T12:47:37.117-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "258895",
    "ThreadId": "69262",
    "Html": "<p>Robur, that's not exactly constructive. &nbsp;It's like challenging a Resto shaman to MT heal with Chain heal spam, or a tree-druid to MT heal with just Nourish. &nbsp;</p>\r\n<p>The FoL spam idea is the same as HL spam, you don't <span style=\"text-decoration:underline\">actually</span>&nbsp;spam it non-stop and nothing else. &nbsp;FoL spam is about knowing when to FoL, when to Holy Shock, and when to Holy Light. &nbsp;It's a bit stricter guidlines as well, as it only shines in a few situations. &nbsp;If you, for example, are on TOGC10 Northrend Beasts, and You are a HL spam centered paladin, you don't want another HL spam paladin as your secondary healer. &nbsp;Idealy, you'd want a druid, or possibly a resto shaman. &nbsp;Not everyone gets what they want though, so the FOL/HL Duo was born. &nbsp;You keep both tanks going with Holy Light while the secondary paladin uses FOL to raid heal and keep the FOL hot rolling on the OT or MT. &nbsp;</p>\r\n<p>It's not a MT healing spec necessarily, but it's a very powerful raid and OT healing spec, especially when you have a healing-wave shaman or a holy light paladin as the MT healer. &nbsp;The only real difference between the two is how they clean up damage. &nbsp;Both are still going to use Holy Light on things like plasma blast, or 4-buff Impales on Gormok, it's a common misconception Both sides have. &nbsp;Just because the playstyle is labeled &quot;FOL Spam&quot; or &quot;HL Spam&quot; doesn't mean you hit one spell, this isn't MC.</p>",
    "PostedDate": "2009-11-19T16:55:26.527-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "258901",
    "ThreadId": "69262",
    "Html": "<p>Hey Antivyris,</p>\r\n<p>my message wasn't meant to be overly constructive, look at the &quot;;)&quot;. Sometimes those kind of messages do actually yield good discussions, look at your message. :)</p>\r\n<p>I completely get your point. I probably should have addressed not Sijet but Klemix instead who stated this:</p>\r\n<p>&quot;There are some healadins that dont use Holy Light at all, my friend for example, so Rawr is useless...&quot;</p>\r\n<p>That's what I have an issue with. I don't believe that there is any paladin that will exclusively use FoL or HS during any raid successfully. I have also an issue with the statement that Rawr is &quot;useless&quot; for such a gameplay. Why not simply adjust the sliders appropriately, burst = zero and all that Jazz?</p>\r\n<p>And don't remind me of MC - five minute paladin blessings ftl. Terrible. I am still waiting for 30/60 minute blessings for paladins. Especially during long fights spot blessings can and will expire. But that's another topic.</p>\r\n<p>Cheers!</p>",
    "PostedDate": "2009-11-19T17:19:57.823-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "258914",
    "ThreadId": "69262",
    "Html": "<p>Actually, the sarcasm has a better place.</p>\r\n<p>If you move the FoL----+----HL slider all the way to the left, it makes HL not be used and achieve what they are looking for, the problem is they read the tooltip that makes it sound like that slider is actually only about Infusion of Light, not about total spell usage, so what they want is already in.</p>",
    "PostedDate": "2009-11-19T18:19:35.797-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "437516",
    "ThreadId": "69262",
    "Html": "<p>Im sorry antivyris but this (FoL----+----HL) did not reduce or change the holy light usage by more than 0.5% from 0% to 100%. On another note I have been really trying to play with the setting to better model Rawr to a HL spammer and i am disapointed.</p>\r\n<p>This site lists the BIS gear that most if not 100% of HL ICC raiders would agree with, he uses also an item value pt system for valuing gear which is not how Rawr operates. However Rawr is overvaluing spell power too much, and worst of all even though a Holy paladin needs haste and mana/5 in high levels, altering burst or setting to increase mana/5 directly lowers haste and vise versa. If this module is truly aimed towards HL spam as you devs have stated previously then it seams a complete overall of the mechanics is in order to match what experts and pro players consider the best type of gear and stats for HL spam longevity and speed with extremely minimal spell power.</p>\r\n<p>http://bis.vilepickle.com/slot-head.php</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-04-30T05:22:09.12-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "437656",
    "ThreadId": "69262",
    "Html": "Holy Necrobump, Batman! :)<br><br>\r\n\r\nThe slider that shows FoL and HL, if you mouse over it, has a tooltip that explains what the slider is for.  (Not sure it was there in previous versions, I've added a couple.)  Basically, that tooltip controls what you cast immediately following the Infusion of Light proc.<br><br>\r\n\r\nAs for the burst scale, I wasn't sure how it worked, so I looked it up. :)  Burst scale is defined like this:<br><br>\r\n\r\n* At 0% burst scale, the value is equal to your Average HPS for the entire fight.<br>\r\n* At 100% burst scale, the value is equal to your Average HPS for a single Holy Light.<br>\r\n* At 50% burst scale, you get half and half.<br><br>\r\n\r\nSo, if you move the slider up towards 100%, haste becomes most important, spell power nearly as important, and crit and intellect not so much.  MP5 falls off the scale completely because we're only looking at the Average HPS of a single Holy Light.<br><br>\r\n\r\nIf you move the slider down to 0%, what becomes important depends on your options.  Given your file you posted, intellect is most important, followed by MP5, Spell Power, and Crit.  Haste is getting low because you're not able to cast many more HL's due to running out of mana, and the model is force casting a few FoL's instead of twiddling its thumbs doing nothing.<br><br>\r\n\r\nWhat it sounds like you're looking for, the model currently doesn't provide.  It looks like you're trying to strike a balance between short cast time and big mana regen.  I'll have to look into what this would do to the Healadin model this weekend.",
    "PostedDate": "2010-04-30T12:19:52.607-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "437708",
    "ThreadId": "69262",
    "Html": "<p>Haha, you are right it is a bit funny i revived the post but it just felt right.</p>\r\n<p>Thank you very much for looking into this, the truth is I know there are endless (almost) amounts of data-oriented Holy Paladins who would LOVE to see a model like that implemented, I'm sure a lot of Holy Paladins were turned off to the current model and stopped using it because it was unable to model (Optimizer) what type of gear they needed for ICC 25 normal + content.</p>\r\n<p>I also understand how this situation could of occurred due to the difficulty in creating a logic based system for distributing heals/stats in a program like this whereas healing is ofc more challenging to model then straight forward DPS. If you need any help with this at all I would be glad to help (non-programming assistance) IE testing, tweaking or research.</p>\r\n<p>Ps: after spending hours trying to model what i wanted in Rawr that file i posted was the best i could come up with, the truth is for a holy light spammer Spell Power is bt far the least wanted stat as we need mana recovery and not more powerful heals (we get enough SP from the gear already) At the same time we need soft haste cap (1s global cd) in order to beat tough content. Its an odd (impossible) balance for the current Rawr to model.</p>\r\n<p>&nbsp;</p>\r\n<p>If this help at all: this is what the majority of HL paladins believe are the stat values currently for BiS items. (just FYI socket is 52 because a socket would be a 20 int gem (2.6 *20) = 52</p>\r\n<p>Even though crit leads to overhealing with HL it is still over 2x as good as SP because it returns mana when we crit.</p>\r\n<p>I know this has nothing to do in a way with Rawr i just wanted to show you how Rawr's brain programming should be thinking.</p>\r\n<table id=Table-general border=0 cellspacing=0 cellpadding=3 width=1269 height=51 bgcolor=\"#fefef3\">\r\n<tbody>\r\n<tr>\r\n<td width=\"16%\">Spellpower</td>\r\n<td width=\"16%\">Crit</td>\r\n<td width=\"16%\">Haste</td>\r\n<td width=\"16%\">MP5</td>\r\n<td width=\"16%\">INT</td>\r\n<td width=\"16%\">Sockets</td>\r\n</tr>\r\n<tr>\r\n<td width=\"16%\">0.3</td>\r\n<td width=\"16%\">0.7</td>\r\n<td width=\"16%\">1.2</td>\r\n<td width=\"16%\">2.4</td>\r\n<td width=\"16%\">2.6</td>\r\n<td width=\"16%\">52</td>\r\n</tr>\r\n</tbody>\r\n</table>\r\n<p>Source: http://bis.vilepickle.com/slot-head.php</p>\r\n<p>&nbsp;</p>\r\n<p>Thank you again, :)</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-04-30T14:59:51.92-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "437929",
    "ThreadId": "69262",
    "Html": "<p>Let me partake in the necro fest.<br><br>Not sure where that list surfaced from, Nodps, also I'm a bit sceptical because the don't link to EJ, but that's just me. Count me not to be part of the majority. ;)<br><br>What I found interesting is that the list you linked pretty much is what Rawr *does* show me for my HL focused paladin. The only thing that's a bit different is the Snowstorm Helm and the T10 (264) as they are rated lower/higher due to the fact that your site's model does seem to put a bigger emphasis on crit. Which, let's face it, will contribute to massive overhealing at this point in the game a lot.</p>\r\n<p>So roncli's model is actually pretty good.</p>\r\n<p>Have a look and put my stats in:</p>\r\n<p>- Burst Scale: 40 percent<br>- Activity: 85 percent, Model IoL checked<br>- Holy Shock: 20 percent<br>- 10 percent FoL - 90 percent HL<br>- SS uptime 100 percent<br>- FoL on SS target: 25 percent<br>- JoP and Judgment checked<br>- Fight length: 6,0 minutes<br>- GHL targets: 1,0<br>- Mana Pot: 5400<br>- DP: 2,0 min CD, no LoH self<br>- Replenishment up: 95 percent<br>- Beacon Uptime: 100 percent<br>- Effectiveness: 35 percent</p>",
    "PostedDate": "2010-05-01T15:48:47.267-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "437931",
    "ThreadId": "69262",
    "Html": "<p>P.S.: Check the list's author's disclaimer: <br><br>&quot;<strong>This list is not  absolute, and that is important to note.&nbsp; It  fails to acknowledge all  playstyles, guild ability, and personal  preference.&nbsp; It's simply a look  into what I, as a high end raiding  paladin, prefer as the best items to  use.&quot;</strong></p>\r\n<p>I subscribe to that notion. That is true for <em>any</em> list. Rawr would love for me to not gem just 20 int all around and a Nightmare Tear in the prismatic slot, but I still do it. I like my 40k mana pool that allows me to put out more HLs.<strong><br></strong></p>",
    "PostedDate": "2010-05-01T15:52:33.52-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "437932",
    "ThreadId": "69262",
    "Html": "<p>P.P.S. (really wish there would be an edit function, Microsoft): I'd go out on a limb to declare the &quot;BiS Holy Paladin Resource&quot; a bit dubious. <br><br>- Meteorite Crystal is rated above Hard Mode Solace.<br>- Libram of Renewal is *still* rated as BiS, not even mentioning Libram of Veracity.</p>",
    "PostedDate": "2010-05-01T15:58:21.527-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "437939",
    "ThreadId": "69262",
    "Html": "<p>Err... There is an edit function?</p>",
    "PostedDate": "2010-05-01T17:11:55.523-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "437941",
    "ThreadId": "69262",
    "Html": "<p>My bad.</p>\r\n<p>Running my browser in a window, hence those links were hidden to my eyes.</p>\r\n<p>Let me rephrase then: WTB shorter line breaks or lines that would adjust to the browser's width. :)</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-05-01T17:33:33.093-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "437961",
    "ThreadId": "69262",
    "Html": "<p>Robur it seams you are attacking my whole concept here of what Holy paladins in icc25 and heroic content gear, spec and gem. First thing i want to ask you is : are you a holy paladin (HL tank spec) currently raiding this content? if so please link your armory profile, second if not can you link the armory profile of the end game holy paladin(HL tank spec) that you were looking at on your server that defied my whole concept here of what a Holy Paladin in icc25 and heroic content gear, spec and Gem.</p>\r\n<p>Before i go and work to prove to you without a shadow of a doubt my whole concept, I ask a few things of you, to check up on if you would humor me. If you can in any way prove the fact that over 90% of HL spec tank healers spec/gem and enchant the same way as the model i posted please in some way prove that here. On my server every end game holy paladin (Tank healer (HL spec) ) gems. enchants and gears this exact way because it is the only way to defeat the tough content. there is 0% room for deviation or choice/personal preference. FoL spammers spec differently but as you have read above in this point, and the reason i posted this here is that the Rawr model is not for FoL spammers and is in fact mean for HL spammers as the devs have stated above. I can find you many other links besides the one i posted if you refute its credibility, but since you seam (seam, i could be wrong) to not know how Holy paladins on a live server spec/ gear I understand you need some kind of official proof of this hence why i asked you to try and survey your server.</p>\r\n<p>If you were to use the EJ holy paladin Rawr settings it would tell you to use by far mostly FoL and a few HL, even your own settings defied the EJ site's setting yet you mention them as the voice of how to set up a paladin. In fact you had to deviate a lot, and you failed to realize that your own settings would change things very differently then if i had used the settings you posted because of the gear you using currently which I have no idea the current level because Rawr calculates the rel. stat values dynamically. This is by far not correct so I would take some of the information on the EJ site with a grain of salt, there are issues in that post, perhaps it is the way the post goes back and forth between gearing for FoL or HL or the fact that it is impossible to model HL correctly in the Healadin Moduel currently but the information there is invalid regarding settings.</p>\r\n<p>I am prepared to go to the next level with proof that will show you and all the devs without a shadow of a doubt that what i am saying regarding how a modern HL tank healer has to gem/spec/gear and what stats they need on their gear to heal optimally in the rough content.</p>\r\n<p>Lastly I'm sorry if my previous posts offended you in any way, i was not sure with the amount of posts you made and effort if I had done so. This is just the way it is in the real world, on every server HL paladins who heal tanks have to spec this way and there is no argument you can make to refute this because there is math and real world experience that concludes it. I am a Holy Paladin and i use the profile that i outlined and it is the only way to go for a HL tank spammer (Core Paladin healer).</p>",
    "PostedDate": "2010-05-01T21:53:43.69-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "437975",
    "ThreadId": "69262",
    "Html": "<p>Nodps,</p>\r\n<p>happy to give you a look to my profile: Robur, US-Lightbringer. Just found out that mine is the only l80 paladin with that name on all US servers, who knew. The armory might still show my PvP gear and spec, though I made sure to log in PvE gear. Mind returning the favor and sharing yours? Also, RL issues prevent me from going all out raid wise, so please don't trash me or my opinions just because I'm not decked out in 277 iLevel gear. I've healed my fair share from Vanilla to LK and do stuff like VoA 25 with 2, 3 healers for kickers. :)</p>\r\n<p>Not sure from where you took that believe of me attacking your &quot;whole concept&quot;. My point was that I am not rushing to believe a site that basically presents some arbitrary numbers based on the statement that SP should be lowest on the importance rank because of overhealing.</p>\r\n<p>That said, I'm always happy to learn new things. I am however a bit weary of sites that say they have the  ultimate truth  and at the same time disclaim that that's just their  opinion. I'm  taking everything with a grain of salt, be it from EJ, Rawr or other   websites actually. The author of the site you linked did mention  &quot;subjective reasoning&quot; and &quot;personal feeling&quot; twice under the &quot;How gear  is chosen&quot; explanation. I also miss an explanation how the author of the  site derived the weight for each stat. Again, those are things I would  expect if he boldly claims that his site has the best in slot gear.</p>\r\n<p>Are you connected with the site you linked to in any way? Just curious. <br><br>Oh, and no offense taken here.</p>\r\n<p>Cheers!</p>",
    "PostedDate": "2010-05-01T23:57:01.147-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "437978",
    "ThreadId": "69262",
    "Html": "<p>&quot;Not sure from where you took that believe of me attacking your &quot;whole  concept&quot;. My point was that I am not rushing to believe a site that  basically presents some arbitrary numbers based on the statement that SP  should be lowest on the importance rank because of overhealing.&quot;</p>\r\n<p>Its not arbitrary. Logic dictates this as HL is already powerful enough and because of the length of fights in end game raiding the last thing we need is more powerful HL, we need to be able to cast more of them and faster (in order for us to make the heal in time) Common HPaladin Logic states that there is already enough SP on gear by far to ever need more.</p>\r\n<p>I visited your profile and its all pvp arena gear, the reason i made the point is ebcause it doesnt seam like you are with Holy paladins in general, in the way we think and i figured if you had been raiding end game in a guild you would be on the same page. its not the site that tells us how to heal or gear, it is a player among millions of Holy paladins who all think the same. If his site did or did not exist it would not change anything relating to the type of gear we need for high end raiding content.</p>\r\n<p>I am in no way connected to the site other than my like-mindedness regarding the content and the list of top choices for gear (As you can see for any slot depending on setting there is a detailed description of why this item is #1, #6 or even #10 from being the best in slot.</p>\r\n<p>&nbsp;</p>\r\n<p>PS i think the math suggest that using Divinity Glyph would be a better upgrade to your pve spec depending on how you use LoH in raids</p>",
    "PostedDate": "2010-05-02T00:10:46.077-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "437988",
    "ThreadId": "69262",
    "Html": "<p>Sigh.</p>\r\n<p>Did you even read what I have written? Let me break it down in smaller chunks.</p>\r\n<p>a) The Armory is slow, it takes a while to update. I just checked my profile, it shows PvE raid gear. NB: I can't raid every day at the moment, hence no iLevel 277 plethora.<br>b) What is your character and server? According to the Armory, there are four level 80 paladins on US servers named Nodps, none shows any current holy raid gear.<br>c) I did NOT disagree about more heals (Int) and faster casts (Haste) being beneficial. That is trivial knowledge. I mentioned ARBITRARY NUMBERS for STAT WEIGHTS (emphasis added to original statement) that I found no explanation for on the site.<br>d) I have been and am raiding on my paladin, in fact have played the character since 2004. Just because my current guild doesn't have 25 members doesn't mean that I don't raid.<br>e) Paladins and people who know paladin mechanics on my server agree that crit and mp5 on the same piece of gear are nonsense. Yet those pieces are plentiful among the headpieces under the link you provided.</p>\r\n<p>To your glyph comment, as you did not provide your Armory profile, let me point you to the glyphs that Eloderung is using, Paladin on my server in its #1 guild, Eternal Reign:<br>- He is using the same glyphs than I do.<br>- Lay on Hands has a CD of 10 minutes - how many fights are 11 minutes long so you can use it more than once, aside from the Lich King fight? <br>- Glyph of Seal of Wisdom, Glyph of Beacon of Light and Glyph of Holy Light are superior in terms of mana conservation and heal output in long fights. <br>- Besides, with Plea up every minute, you can counter its healing decrease with Avenging Wrath, Divine Illumination (Tier 10 2pcs) and Talisman of Resurgence or a combination of those.<br><br>I'd wish you would actually start to answer my questions with a few details and your own experiences instead of just repeating what you read on the website.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-05-02T00:52:53.663-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "437992",
    "ThreadId": "69262",
    "Html": "<p>I have seen you're gear and although it is tier 10 high end gear you completely miss how to spec optimally. You use a trinket libram of veracity.. no good holy paladin tank healer in their right mind uses that. The top holy paladin on both our servers (see Euphoric on Andorhal(My server) who has 277 gear and 6.4kgs, use Libram of renewal even though it is 200 i lvl. You use belt of the lonely noble, classic rookie misake as belt of the blood novas is better. basically i stopped there and am going to end our dialogue here as it seams that you are trying to debate the paladin class mechanics with me and you do not seem to have a firm grasp on them. Thank you for your questions.&nbsp; Rawr is a tool for ppl who want to optimize (min/max) their paladin among other uses.</p>\r\n<p>&nbsp;</p>\r\n<p>PS: breaking down you ideas in smaller chunks for me effectively trippled your previous post. I suggest you read the forums and see how good paladins are doing things. Even check on Wowhead for your libram of veracity and read the comments (and math). Also you claim you and a lot of paladins believe crit and mana/5 are terrible to have on gear, but what you fail to realize is that it often becomes one of the best choices when the top choices in gear composition is not available because both mana/5 and crit allow a Paladin to cast HL for a longer period of time. I suggest you read the descriptions for these choices on that BiS site, it is clearly stated why those items are there.</p>\r\n<p>Again, i am not gonna debate with you the commonly agreed logic in gearing with you when I have seen how you yourself do it and it is misguided.</p>",
    "PostedDate": "2010-05-02T01:07:37.633-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "437998",
    "ThreadId": "69262",
    "Html": "<p>Guys, quit it.</p>\r\n<p>Rawr is not meant for HL-spammers, or for FoL-spammers. It's meant for intelligent Healadins. Rawr.Healadin hasn't been getting much in the way of updates lately, but the intention is there. Your silly ideas about there being this huge difference are just that; silly. Stop perpetrating this rubbish.</p>",
    "PostedDate": "2010-05-02T01:52:00.443-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "437999",
    "ThreadId": "69262",
    "Html": "<p>Dude its not rubbish at all, there is only one way HL tank paladins are gearing end-game, if you think somehow i meant a Paladin would only spam HL (HL spammer as in your point) then perhaps I worded things wrong, an end game HL paladin WILL use some FoL , even a bit of HS on the rare occasion but if you think its rubbish i think we need to talk Astrylian. Who is the person currently coordinating Healadin module, in my opinion is is currently broken and I would like to submit some comments to him/her.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-05-02T01:56:14.697-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "438002",
    "ThreadId": "69262",
    "Html": "<p>No, the point is that there is no such thing as a &quot;HL Spammer&quot; vs a &quot;FoL Spammer&quot;. Only &quot;Good Healadins&quot; vs &quot;Bad Healadins&quot;. Rawr is for the &quot;Good Healadins&quot;.</p>\r\n<p>&nbsp;</p>\r\n<p>Careful how you word things such as &quot;Broken&quot;. We do this stuff in our free time, remember. Comments about Rawr.Healadin should be posted here. There's very little active maintaining of Rawr.Healadin right now, and we'd love a dedicated dev for it.</p>",
    "PostedDate": "2010-05-02T02:24:05.603-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "438003",
    "ThreadId": "69262",
    "Html": "<p>I understand, I am a very active user in Rawr for the Ret module and now Holy and the situation is just a little frustrating, i'm sorry if saying broken might offend someone but from my veiwpoint It needs some major changes and if i can help in any way to prompt some dev to take it on then i would feel more at ease.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-05-02T02:32:33.517-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "438086",
    "ThreadId": "69262",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>Astrylian wrote:</strong><br>\r\n<p>There's very little active maintaining of Rawr.Healadin right now, and we'd love a dedicated dev for it.</p>\r\n</blockquote>\r\n<p>I'm doing my best to keep it up to date and accurate, and I do have some plans to make further changes to it. &nbsp;A list of updates for the Healadin module can be found <a href=\"http://rawr.codeplex.com/wikipage?title=Rawr.Healadin&referringTitle=Models\">here</a>.</p>",
    "PostedDate": "2010-05-02T13:02:08.943-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "438112",
    "ThreadId": "69262",
    "Html": "<p>My last words here, as it makes no sense to have a monologue with someone who is not answering any question but instead just wants to pressure his own thoughts without explanation.<br>Or that constantly fails of listing his holy paladin for all to check out.</p>\r\n<p>Calling me a &quot;bad paladin&quot; that &quot;completely misses how to spec&quot; because of my libram choice or a &quot;rookie paladin&quot; because of my belt choice (when mail belts so far have gone to shamans) should speak for itself. <br>Especially when endorsing a website that lists gear with crit &amp; mp5 above Rawr recommendations of haste &amp; mp5 or haste &amp; crit and that doesn't explain its stat weighting.<br><br>At the end of the day, nobody cares about Gearscore or a certain gear  piece. People care about the fact that the boss is dead and the tank is  still alive. In my raids (ICC 25, ICC 10 normal/hard), that is the case.<br><br>And at the end of the day, I don't care about one sentence paragraphs anymore either.<br><br>roncli and Astrylian, thanks for your hard work. One can't say that often enough.</p>",
    "PostedDate": "2010-05-02T15:26:55.197-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "438315",
    "ThreadId": "69262",
    "Html": "<p>FWIW:&nbsp;&nbsp; Rawr.healadin is 'failing' at modelling holy paladins in todays setting.</p>\r\n<p>&nbsp;</p>\r\n<p>There is currently a trend for 2 types of paladin.&nbsp; The HL-spammers vs the FOL-spammers.&nbsp; This doesn't even have anything to do with &quot;good paladin&quot; vs &quot;bad paladin&quot;.&nbsp; Or in fact there is.&nbsp; If you are gearing neither towards HL-spam nor towards FOL-spam you're doing it wrong and you're bad. And that's where Rawr.healadin is &quot;bad&quot; since if doesn't properly provide (obviously) for either of the two. Or at least, I never managed to figure out how to make rawr suggest gear towards either a FOL 'spec' of a HL 'spec'.&nbsp; Whatever I try it always seems to prefer a balanced gearing.</p>\r\n<p>While there is (debatably) a place for FOL paladin in a non-frontier-progression setting.&nbsp; Any paladin geared for FoL in &quot;hardest content&quot; raid is doing it wrong.&nbsp; If you're a raidleader in a high end guild and you're inviting a paladin for your progression raids, then you'll expect them to be HL-spam geared.&nbsp; If you are expecting a FoL paladin in a raid as raidleader, it is because you already have tank healing sorted and need a more stable raid healing and there's no other classes around.</p>\r\n<p>FOL spam was viable in TOTC (even heroic) because of the somewhat strange approach on damage intake, and in particular, some top level guilds raiding with FOL spec paladins for Anub where lots of big heals is bad. Those paladins typically logged off in those specs, which resulted in people assuming they raided that way all the time.&nbsp; FOL is definately enough for heroics, and even raid content that you're outgearing.</p>\r\n<p>&nbsp;</p>\r\n<p>I wouldn't suggest changing things now. With cataclysm as close as it is, the &quot;smart&quot; healadin will return and gearing for HL spam or FOL spam won't be viable anymore (or we can hope), having a more balanced gearing may be the way to go in the future 'soon' (tm)..</p>",
    "PostedDate": "2010-05-03T05:57:43.82-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "438479",
    "ThreadId": "69262",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>roncli wrote:</strong><br><blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>Astrylian wrote:</strong><br>\r\n<p>There's very little active maintaining of Rawr.Healadin right now, and we'd love a dedicated dev for it.</p>\r\n</blockquote>\r\n<p>I'm doing my best to keep it up to date and accurate, and I do have some plans to make further changes to it. &nbsp;A list of updates for the Healadin module can be found <a href=\"http://rawr.codeplex.com/wikipage?title=Rawr.Healadin&referringTitle=Models\">here</a>.</p></blockquote><p></p>\r\n\r\nThank you very much roncli, for you're work on the Healadin Module. You are a shining light in the darkness that currently envelops the module. I look forward to seeing the changes you have made and in the future. Best regards and good luck.",
    "PostedDate": "2010-05-03T12:01:19.61-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "438487",
    "ThreadId": "69262",
    "Html": "<p>No one's going to agree on much of anything here when it comes to HL-spam vs. FoL-spam vs. balanced healadin. &nbsp;Everyone has their own opinion, and as such I'm not going to endorse any of these methods over the other.</p>\r\n<p>Calling out that Rawr.Healadin is broken or failing isn't helping matters any. &nbsp;If you want to help improve the module, please submit a patch or a feature request in the tracker, and I will give it a fair shake.</p>\r\n<p>2.3.16 will include optimization options to try to force HL-spam or FoL-spam. &nbsp;Use &quot;Flash of Light Time&quot; and &quot;Holy Light Time&quot; for such optimizations. &nbsp;I'm not sure how well it will work, but it was all of 4 lines of code to implement and doesn't disturb the default settings.</p>",
    "PostedDate": "2010-05-03T12:13:27.08-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "438506",
    "ThreadId": "69262",
    "Html": "Roncli the last thing i wanted to do was offend anyone working on this project(module) or adjacent projects but how can devs do their job if users who are so into the module and have issues and suggestions but dont communicate them effictvely. There was a need to express the urgency of the situation in order for good to come out of it. I thing the biggest feature inprovement at this point would not be to be able to force FoL or HL spam, as this will only save time because this is tweak-able although useful for that purpose. The change that will make this module make a lot more sense would be the ability to have both mana/5 and haste as priority stats on gear with mana/5 being by far the highest and haste somewhere in the middle and not forced down by mana/5 (burst slider) also to lower SP as a far low priority as HL is powerful enough with SP on gear and needs more casts not bigger ones.",
    "PostedDate": "2010-05-03T13:15:51.647-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "438533",
    "ThreadId": "69262",
    "Html": "&quot;how can devs do their job if users who are so into the module and have issues and suggestions but dont communicate them effictvely.&quot;\r\n<br>\r\n<br>\r\nI giggled.\r\n<br>\r\n<br>\r\nHere is an example setting for a HL focused paladin in 2.3.15:\r\n<br>\r\n<br>\r\nhttp://img62.imageshack.us/img62/9148/rawrv.jpg",
    "PostedDate": "2010-05-03T14:58:56.17-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "438534",
    "ThreadId": "69262",
    "Html": "<p>No offense taken. :) &nbsp;I just wanted to put things in perspective. &nbsp;1-button spam or balanced healing, I'd like to at least consider the options.</p>\r\n<p>As for Haste and MP5 co-existing in a HL spam scenario, I have a very simple explanation as to why Rawr doesn't like this.</p>\r\n<p>Haste reduces cast time, meaning more casts are going out, meaning your mana usage is going up, meaning you're going OOM faster. &nbsp;Rawr doesn't like you going OOM because it makes you cast Flash of Light, which is a lower HPS spell, and HPS is the bottom line in the default Rawr settings. &nbsp;MP5 and Int must be first for a HL spammer.</p>\r\n<p>&nbsp;</p>\r\n<p>Remember that under default settings, Rawr.Healadin's overall score is this:</p>\r\n<p>OverallHPS + HolyLightHPS * BurstScale</p>\r\n<p>This means that it's looking for the most HPS you can do, and cares about little else. &nbsp;Plus, BurstScale factors in how much throughput your Holy Lights have. &nbsp;This leads nicely to Holy Light spam since that's always going to be your best HPS, but if you sacrifice throughput to spam Holy Light all the time, it is possible that the model may find a solution with more throughput that does not spam Holy Light as much, but throws a balance of Flash of Light into the mix. &nbsp;This is why Rawr.Healadin doesn't give a solution involving both haste and mp5 99% of the time. &nbsp;The 1% where it does is only going to happen when you have enough mana regen to not go OOM and you have enough gem space leftover to give your Holy Light more throughput. &nbsp;Even then, Haste is not guaranteed to be the stat that will give you that throughput... there's still Spell Power.</p>\r\n<p>&nbsp;</p>\r\n<p>As for the new options, I don't really see the &quot;Flash of Light Time&quot; and &quot;Holy Light Time&quot; being used to directly optimize for, but rather I see them being used as conditions for the optimizer. &nbsp;For instance, you could optimize for Fight Healing with the condition of Flash of Light Time being less than or equal to 0. &nbsp;If your settings are correct (check Sacred Shield and Infusion of Light ratio!), have the fight length low enough (I was testing with 6 minutes), and you've got the gear, gems, and enchants available to do it, the optimizer should come up with a solution that spams Holy Light the whole time while giving you the maximum throughput possible.</p>",
    "PostedDate": "2010-05-03T15:02:05.063-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "438540",
    "ThreadId": "69262",
    "Html": "<p>robur - I wouldn't mind looking at that char file, if you can email it to me at roncli@roncli.com</p>\r\n<p>I think I know what's going on in there, but would like to take a look at it.</p>",
    "PostedDate": "2010-05-03T15:11:34.39-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "438541",
    "ThreadId": "69262",
    "Html": "You got mail. :)",
    "PostedDate": "2010-05-03T15:12:30.13-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "438544",
    "ThreadId": "69262",
    "Html": "<p>&quot;Haste reduces cast time, meaning more casts are going out, meaning your mana usage is going up, meaning you're going OOM faster. &nbsp;Rawr doesn't like you going OOM because it makes you cast Flash of Light, which is a lower HPS spell, and HPS is the bottom line in the default Rawr settings. &nbsp;MP5 and Int must be first for a HL spammer.&quot;</p>\r\n<p>The problem is, that when Rawr models HL it will assume we are spaming it non stop, as you mentioned earlier most paladins including myself use various healing spells based on the situation, so we wont spam HL if we can spam FoL and get away with it. However in order for the HL to be cast in time to same the tank or have enough burst to heal high burst boss dmg on tank the haste is essentiel even though it lowers the amount of HL we can cast overall. For this balance to occur i think maybe some reprogramming needs to happen so that a soft cap haste is very highly prized until capped and is not affected by mana concerns, like hit cap for example (on ret module, in turms of stat priority in a way).</p>\r\n<p>I highly agree that int and mana/5 (in that order) are BY FAR the most important stats. It is also very important to soft cap haste and Rawr with all its buff options is a good place to plan for this. As my stat coef. above states thet are prized way higher than haste, but SP is dead last and haste is above crit. I must emphasize how much more useless SP is over haste for the spell HL, as we do not need a bigger HL, just a faster one -&nbsp; even though it buffs SS, because the gear we have has already plenty of SP.</p>\r\n<p>This issue with the a module like this is how we can simulate the conditions of a raider. We need to spam HL like crazy sometimes for 30s but that doesnt mean we arent casting a hell of a lot of FoL at key times and regen mana there, the fights are dynamic but i believe it is possible. Even though we have good tech. on how to simulate healing with Healadin moduel it cannot atm simulate effectivly how mana use used, how many HL is used or even how fast HL has to be to have a tank survive on for ex. Rotface heroic 25 man. That is why users untied come up with sites like the ones i posted, we know what kinds of gear we need to deal with this content and&nbsp;if the module can think like us then that would be a great thing.</p>",
    "PostedDate": "2010-05-03T15:27:51.777-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "438545",
    "ThreadId": "69262",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>robur wrote:</strong><br>&quot;how can devs do their job if users who are so into the module and have issues and suggestions but dont communicate them effictvely.&quot; <br><br>I giggled. <br><br>Here is an example setting for a HL focused paladin in 2.3.15: <br><br>http://img62.imageshack.us/img62/9148/rawrv.jpg</blockquote>\r\n<p>&nbsp;haste should never be valued so high that it is equal to mana/5 and SP should def not be near being equal to mana/5 or haste</p>",
    "PostedDate": "2010-05-03T15:30:10.803-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "438546",
    "ThreadId": "69262",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>OReubens wrote:</strong><br>\r\n<p>FWIW:&nbsp;&nbsp; Rawr.healadin is 'failing' at modelling holy paladins in todays setting.</p>\r\n<p>&nbsp;</p>\r\n<p>There is currently a trend for 2 types of paladin.&nbsp; The HL-spammers vs the FOL-spammers.&nbsp; This doesn't even have anything to do with &quot;good paladin&quot; vs &quot;bad paladin&quot;.&nbsp; Or in fact there is.&nbsp; If you are gearing neither towards HL-spam nor towards FOL-spam you're doing it wrong and you're bad. And that's where Rawr.healadin is &quot;bad&quot; since if doesn't properly provide (obviously) for either of the two. Or at least, I never managed to figure out how to make rawr suggest gear towards either a FOL 'spec' of a HL 'spec'.&nbsp; Whatever I try it always seems to prefer a balanced gearing.</p>\r\n<p>While there is (debatably) a place for FOL paladin in a non-frontier-progression setting.&nbsp; Any paladin geared for FoL in &quot;hardest content&quot; raid is doing it wrong.&nbsp; If you're a raidleader in a high end guild and you're inviting a paladin for your progression raids, then you'll expect them to be HL-spam geared.&nbsp; If you are expecting a FoL paladin in a raid as raidleader, it is because you already have tank healing sorted and need a more stable raid healing and there's no other classes around.</p>\r\n<p>FOL spam was viable in TOTC (even heroic) because of the somewhat strange approach on damage intake, and in particular, some top level guilds raiding with FOL spec paladins for Anub where lots of big heals is bad. Those paladins typically logged off in those specs, which resulted in people assuming they raided that way all the time.&nbsp; FOL is definately enough for heroics, and even raid content that you're outgearing.</p>\r\n<p>&nbsp;</p>\r\n<p>I wouldn't suggest changing things now. With cataclysm as close as it is, the &quot;smart&quot; healadin will return and gearing for HL spam or FOL spam won't be viable anymore (or we can hope), having a more balanced gearing may be the way to go in the future 'soon' (tm)..</p>\r\n</blockquote>\r\n<p>&nbsp;I'm glad to see a dev who is 100% on the same page as me and most Holy paladins. I hope you will help Roncli in making the module something for us all to celebrate.</p>",
    "PostedDate": "2010-05-03T15:33:34.643-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "438553",
    "ThreadId": "69262",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>nodps wrote:</strong><br>\r\n<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>robur wrote:</strong><br>&quot;how can devs do their job if users who are so into the module and have issues and suggestions but dont communicate them effictvely.&quot; <br><br>I giggled. <br><br>Here is an example setting for a HL focused paladin in 2.3.15: <br><br>http://img62.imageshack.us/img62/9148/rawrv.jpg</blockquote>\r\n<p>&nbsp;haste should never be valued so high that it is equal to mana/5 and SP should def not be near being equal to mana/5 or haste</p>\r\n</blockquote>\r\n<p>We have yet to see a link to your armory and your Rawr settings. I find that this would be a good start for communication so I linked mine.</p>",
    "PostedDate": "2010-05-03T16:16:32.387-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "438555",
    "ThreadId": "69262",
    "Html": "<p>Perhaps a nice way to modify the model that would satisfy the complaints in this thread is to have the burst time eat up mana from the sustained time.&nbsp; That's really the way it works in a fight, so it makes sense to me.&nbsp; Have the model assume that for the % of the fight that is &quot;burst&quot; it just spams HL over &amp; over - or maybe throws in some shocks if that increases burst throughput?&nbsp; Then plug the remaining time &amp; mana into the current sustained code.</p>\r\n<p>[Edit]</p>\r\n<p>Oh wait - that would change absolutely nothing from the way it is now.&nbsp; Doh!</p>",
    "PostedDate": "2010-05-03T16:34:08.747-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "438581",
    "ThreadId": "69262",
    "Html": "<p>Seriously, quit trying to make 'sides' here. The whole 'HL-spammer' vs 'FoL-spammer' bullshit is just that, bullshit. Stop it. Rawr should support the different jobs that a paladin needs to do, and thus the different spell rotations they can use, and calculate performance accurately based on that. You should be able to just pure non-stop HL spam, or pure non-stop FoL spam, but that'd be a pretty dumb thing to do, since if you actually heal like that, you're terrible. The intelligent way to heal is somewhere in-between, with the occasional movement, occasional pause, occasional holy shock even, and a mix of HL and FoL, depending on mana supply and the damage intake of whoever you're healing.</p>",
    "PostedDate": "2010-05-03T18:35:07.71-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "439571",
    "ThreadId": "69262",
    "Html": "<p>FoL spec is very doable for Heroics - in fact, for undergeared tanks it can outperform HL simply because the tank dies before HL can go off.&nbsp; I haven't swapped to HL spec at any time yet, but so far it's worked pretty well - only boss in game that gives me headaches is Garfrost, and that has more to do with idiots than anything else.</p>\r\n<p>For raids, it's a lot more ...&nbsp; iffy.&nbsp; I've used it in ToC-10 as MT healer - which only worked because the tanks were overgeared (ICC-25 level) and had tons of health (Bear/Warrior IIRC).&nbsp; It takes a lot more finesse and luck to manage to do FoL spec in raids than it does to do HL, imo - you can't just spam HL, you must also use Sacred Shield constantly, generally (but not always) with the Flash-hot up.</p>\r\n<p>And, of course, I am not certain that it's the *best* way to play the toon - as a matter of fact, it probably isn't - but it certainly works reasonably well.</p>",
    "PostedDate": "2010-05-05T17:06:56.927-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "439589",
    "ThreadId": "69262",
    "Html": "<p>To be blunt, that sort of &quot;I can succeed despite myself&quot; style of play is not what we care about catering to here.</p>",
    "PostedDate": "2010-05-05T18:01:01.043-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "439599",
    "ThreadId": "69262",
    "Html": "I think if Karindia had said FoL spam instead of FoL spec, it might be true. :)<br><br>I usually swap some raid pieces out and go for a bit less haste and more SP and Int these days in heroics - remember however, that it's late in the expansion. Cata will reset that nicely. Yay healing pet.<br><br>-----Original Message-----<br><br>From:  &quot;Astrylian&quot; &lt;[email removed]&gt;<br>Subj:  Re: Healadin FoL Spammers [Rawr:69262]<br>Date:  Wed 5. May 2010 18:01<br>Size:  1K<br>To:  [email removed]<br><br>    From: Astrylian<br> To be blunt, that sort of &quot;I can succeed despite myself&quot; style of play is not what we care about catering to here.<br><br>  Read the full discussion online.<br> To add a post to this discussion, reply to this email ([email removed])<br> To start a new discussion for this project, email [email removed]<br> You are receiving this email because you subscribed to this discussion on CodePlex. You can unsubscribe on CodePlex.com.<br> Please no",
    "PostedDate": "2010-05-05T18:15:30.093-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "439651",
    "ThreadId": "69262",
    "Html": "<p>Firstly, a big thanks to the entire Rawr team for their&nbsp;<em>voluntary </em>efforts that we as a theorycrafting community have benefited greatly from - it can be a thankless task at time.</p>\r\n<p>Excluding all the FoL vs HL fluff, the underlying issue seems to be that the healadin module does not adequately model end-game raid and is recommending a sub-optimal gearing strategy (at least that's what I read the claim as). If someone disagrees with what Rawr outputs then constructive criticism of the Rawr model is actually useful to the Rawr dev team. Constructive criticism in a Rawr context is analysis of the&nbsp;deficiencies in the Rawr model preferably with data to back it up. Blanket statements saying that Rawr is bad are not constructive. So, on to some constructive criticism:</p>\r\n<p>Underlying Issue: Healadin does not model overhealing (BoL excluded).</p>\r\n<p>As the devs will know, overhealing is inherently difficult to model as it depends on so many variables outside the model and the variables themselves vary considerable between encounters and group composition.</p>\r\n<p>Current theorycrafting indicates that HL overhealing is greater percentage-wise than FoL overhealing. Since rawr does not model overhealing, this causes Rawr to&nbsp;overemphasize&nbsp;SP and to a lesser extent, crit.</p>\r\n<p>I propose extending the healadin model to model overhealing as a function of the size of the heal. Larger heals will have greater overhealing. In theory, this will cause Rawr will make recommendations more in line with actual end-game gearing (if they indeed different).</p>\r\n<p>The question how becomes: what does the overhealing function look like? Since that is far too difficult to theorycraft directly, we could do it indirectly by parsing a diverse set of combat logs and modelling the overhealing. I suspect it will vary considerably so multiple overhealing profiles would probably be required. Another option would be to provide a set of options for generating the overhealing calculation - similar to how the model already has a option for beacon overhealing.</p>\r\n<p>How does one get hold of a large number of end-game raiding parses from a diverse group of healers? Without out that, we won't know what to set the deafault overhealing model to.</p>",
    "PostedDate": "2010-05-05T22:08:09.33-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "439659",
    "ThreadId": "69262",
    "Html": "<p>WoL would be the obvious place. But, that said, I'd say that it should be an option, that you set based on your own personal WoL parses.</p>",
    "PostedDate": "2010-05-05T22:24:53.963-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "439667",
    "ThreadId": "69262",
    "Html": "<p>Unfortunately, raid parse summaries don't break down overhealing into enough detail. We could add some more sliders for HL overheal and FoL overheal but that still won't model the underlying claim that there's a significant increase in HL overhealing as the size of the heal increases. Plugging in 73% HL overhealing vs 63% FoL (aggregrate values from one of my HICC10s) into a naive implementation of overhealing still won't address the&nbsp;theorycrafting claim is that the additional SP on HL is wasted as overhealing. To model such as phenomenon we need to model a transfer function where overhealing increases as the size of the heal increases. To get this data we need the heal size &amp; overhealing% for each individual heal - aggregate overhealing % for each spell won't cut it.</p>\r\n<p>Personally, I believe the diminishing value of SP is overstated in the theorycrafting community and Rawr's value of SP is fairly accurate but that response doesn't hold much weight unless it's actually been modeled.</p>\r\n<p>Does anyone know if anyone over at EJ or anywhere else has actually done this analysis?</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-05-05T23:24:52.173-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "440024",
    "ThreadId": "69262",
    "Html": "<p>As the OP of the revived portion of this thread I would like to thank all of you who have participated in this discussion. It is in fact a dream of mine to see a Healadin module that would more accurately give us Holy paladins theorycrafting related information.</p>\r\n<p>I have noticed some talk about overhealing and an effort to possibly&nbsp;factor&nbsp;this into the module, however with the way the healadin module is currently designed&nbsp;I feel that all this would do would force Rawr to use more FoL in its rotation because the heal would cause less overheal and that would further complicate things for the module as a whole even if it would downgrade SPs significance.</p>\r\n<p>If there is a way for the logical algorithms to understand the need for hasted HL as well as the ability to cast as much HLs&nbsp;as posible while not&nbsp;valuing SP very much I and many many other &quot;Cookie-Cutter* hard-mode icc 25 raid healers would find use for the Healadin module and use&nbsp;it to find better gear upgrades and combinations. I do not think gemming would be an issue since these palasins gem all 20 Int gems except for satisfying meta&nbsp;( 1 nightmare tear for ex)</p>",
    "PostedDate": "2010-05-06T12:10:39.84-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "440058",
    "ThreadId": "69262",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>Astrylian wrote:</strong><br>\r\n<p>To be blunt, that sort of &quot;I can succeed despite myself&quot; style of play is not what we care about catering to here.</p>\r\n</blockquote>\r\n<p>I actually would disagree with that severely.</p>\r\n<p>First, I will admit that my play style with my Paladin is extremely unusual - he's an alt, I use him to screw around with.&nbsp; He isn't really supposed to be doing raids at all; I only took him in because I was bored and curious to know if it could be done.</p>\r\n<p>Second - correct me if I'm wrong, but Rawr is supposed to help players determine viable specs and gear choices, both at their current and future gear levels.&nbsp; Unless you have a model, how can you tell for sure if it does or does not work?&nbsp; Sure, it may not be ideal, but early on HL spec/spam isn't great either - you either burn your mana too fast, or you fail to get the heal off in time.&nbsp; Trust me, I tried it - and as soon as my gear level hit the point where I could get into FoS normal, people with great DPS gear would go in to tank it, get squashed and then blame me for not keeping them up.</p>\r\n<p>All this said, my toon's gear is probably to the point that I should stop using FoL spec.</p>",
    "PostedDate": "2010-05-06T13:19:09.803-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "440123",
    "ThreadId": "69262",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>nodps wrote:</strong></blockquote>\r\n<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\">\r\n<p>I have noticed some talk about overhealing and an effort to possibly&nbsp;factor&nbsp;this into the module, however with the way the healadin module is currently designed&nbsp;I feel that all this would do would force Rawr to use more FoL in its rotation because the heal would cause less overheal.</p>\r\n</blockquote>\r\n<p>Rawr wouldn't prefer FoL to HL untill the eHPS of HoL is greater than HL at which point it (should) use 100% FoL. Incorporating overhealing would also be likely to devalue regen stats as the HPS difference between FoL and HL would be less.&nbsp;</p>\r\n<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>nodps wrote:</strong><br>\r\n<p>and that would further complicate things for the module as a whole even if it would downgrade SPs significance</p>\r\n</blockquote>\r\n<p>Yes it would. What changes do you think are required to the Healdin module for it to accurately model end-game raiding?</p>\r\n<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>nodps wrote:</strong><br>\r\n<p>If there is a way for the logical algorithms to understand the need for hasted HL as well as the ability to cast as much HLs&nbsp;as posible while not&nbsp;valuing SP very much I and many many other &quot;Cookie-Cutter* hard-mode icc 25 raid healers would find use for the Healadin module and use&nbsp;it to find better gear upgrades and combinations. I do not think gemming would be an issue since these palasins gem all 20 Int gems except for satisfying meta&nbsp;( 1 nightmare tear for ex)</p>\r\n</blockquote>\r\n<p>The point of Rawr is not to validate your gearing assumptions - your (and other) gearing assumptions may be sub-optimal. A good example of this is dodge vs def for avoidance: which is better (we're not talking about EH here)? The usual answer is dodge but that does not hold true in all circumstances.&nbsp;For a prot pally in entry-level ICC gear (ilvl 245), dodge&gt;def for ToC but def&gt;dodge for ICC <em>even after the def soft cap</em>. It took me a while to work out why Rawr was massively changing the stat value of def when I selected/deselected&nbsp;the icecrown buff and it turned out that with the -20% dodge, total avoidance was less than 100% and the block portion of the additional def was effective in ICC but not in ToC. Rawr is great for these sort of things because - &quot;cookie-cutter&quot; build/specs/gearing choices can actually be wrong and Rawr is a useful tools for validating/challenging these assumptions.</p>\r\n<p>If you want Rawr to value hasted HL then increase the burst healing time or reduce fight time. Rawr will also value SP as that increases burst healing throughtput as well. Having a setting in Rawr to force the optimiser to require haste to be soft-capped (does Rawr already have this option?) could work but is a bit of a hack as it's not actually part of the model and you won't be able to compare eg 1.4s HL vs 1.3s HL.</p>\r\n<p>You say that SP is not useful: why? I believe the claim is HL heals are 'big enough' and largers ones are wasted. How do you know this is actually correct? Aren't the big heals that land when they don't overheal the most important ones for preventing wipes? A counter-arguement to the low SP value claim would go along the lines of: if the tank is on 40k/50k, it doesn't matter how big your HL is but if the tank is on 5k/50k then having that big HL is important (counter-counter: hasted HLs land before they lose that last 5k and prevents wipes). Yes, the &quot;cookie-cutter&quot; HICC raiding paladin will gear haste/mp5 and gem straight int but that actually may not be optimal. It's not optimal HPS - the healadin module already shows us that. If you're not gearing for maximum HPS or eHPS, what are you gearing for? It might turn out that you should be gemming for socket bonuses instead of straight int. If Rawr is giving the 'wrong' answer, what is it that the model is missing?</p>\r\n<p>&nbsp;Edit: grammar</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-05-06T17:46:32.02-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "440152",
    "ThreadId": "69262",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>Karindra wrote:</strong><br>\r\n<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>Astrylian wrote:</strong><br>\r\n<p>To be blunt, that sort of &quot;I can succeed despite myself&quot; style of play is not what we care about catering to here.</p>\r\n</blockquote>\r\n<p>I actually would disagree with that severely.</p>\r\n<p>First, I will admit that my play style with my Paladin is extremely unusual - he's an alt, I use him to screw around with.&nbsp; He isn't really supposed to be doing raids at all; I only took him in because I was bored and curious to know if it could be done.</p>\r\n<p>Second - correct me if I'm wrong, but Rawr is supposed to help players determine viable specs and gear choices, both at their current and future gear levels.&nbsp; Unless you have a model, how can you tell for sure if it does or does not work?&nbsp; Sure, it may not be ideal, but early on HL spec/spam isn't great either - you either burn your mana too fast, or you fail to get the heal off in time.&nbsp; Trust me, I tried it - and as soon as my gear level hit the point where I could get into FoS normal, people with great DPS gear would go in to tank it, get squashed and then blame me for not keeping them up.</p>\r\n<p>All this said, my toon's gear is probably to the point that I should stop using FoL spec.</p>\r\n</blockquote>\r\n<p>I think you made my point. I never said it shouldn't model gameplay; it definitely should. It shouldn't model *poor* play, which is what you were describing.</p>",
    "PostedDate": "2010-05-06T19:33:50.8-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "444374",
    "ThreadId": "69262",
    "Html": "<p>roncli,</p>\r\n<p>I noticed you mentioned a feature in .16 allowing us to experimentaly choose more FoL or HL focussed profile in the settings:</p>\r\n<p>&quot;Experimental optimization available for HL spammers and FoL spammers.   Please use with caution.  If these appear to be useful enough, I may  turn them into options for the comparison chart, but I need some  feedback first!&quot;</p>\r\n<p>I didn't notice this option in .17, am i missing something?</p>\r\n<p>&nbsp;</p>\r\n<p>Also, although you were able to allow DMC:Greatness to be viewed it is not modeled correctly, only the passive int seams to be modeled and with meteorite crystal the effect is not active only the passive int bonus is being modeled.</p>\r\n<p>&nbsp;</p>\r\n<p>thanks for your work</p>",
    "PostedDate": "2010-05-18T08:08:55.98-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "444434",
    "ThreadId": "69262",
    "Html": "When you optimize, you can now select &quot;Holy Light Time&quot; or &quot;Flash of Light Time&quot; in addition to the other options, such as &quot;Overall&quot;, &quot;Burst Healing&quot;, &quot;Fight Healing&quot;, etc.  These times represent the amount of time during the modeled fight that you would spend casting such spells.  You can either optimize for those values, or you can set a condition so that the times are greater than or less than a certain value.\r\n\r\nFor DMC:G, if it's modeled wrong, please file/reopen an issue with the details.  Thanks :)",
    "PostedDate": "2010-05-18T10:14:04.287-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "444471",
    "ThreadId": "69262",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>Nodps wrote:</strong><br><p>roncli,</p>\r\n<p>I noticed you mentioned a feature in .16 allowing us to experimentaly choose more FoL or HL focussed profile in the settings:</p>\r\n<p>&quot;Experimental optimization available for HL spammers and FoL spammers.   Please use with caution.  If these appear to be useful enough, I may  turn them into options for the comparison chart, but I need some  feedback first!&quot;</p>\r\n<p>I didn't notice this option in .17, am i missing something?</p>\r\n<p>&nbsp;</p>\r\n<p>Also, although you were able to allow DMC:Greatness to be viewed it is not modeled correctly, only the passive int seams to be modeled and with meteorite crystal the effect is not active only the passive int bonus is being modeled.</p>\r\n<p>&nbsp;</p>\r\n<p>thanks for your work</p></blockquote><p></p>\r\n\r\nI just tried the optimization using holy light time and it gave me some pretty disturbing results, i can upload my char file, you have an old one already. Basically it chose pvp items and way lower lvl items and pre and post optim had the same value. Should i create a new issue ticket?",
    "PostedDate": "2010-05-18T11:12:49.653-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "444527",
    "ThreadId": "69262",
    "Html": "<p>That sounds like you set constraints that weren't able to be satisfied.</p>",
    "PostedDate": "2010-05-18T12:54:14.297-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "444535",
    "ThreadId": "69262",
    "Html": "Sounds like your settings are off.  What's the length of your fight time?  If it's low (3 minutesish), I'd make the Holy Light Time a condition, greater than a fairly reasonable high amount given your settings (the value to use is in seconds), and optimize for Overall like normal.  Or you can jack up the fight time to something appropriate.\r\n\r\nPlay around with it some, and if you can't seem to find a difference, then post an issue with your character file.",
    "PostedDate": "2010-05-18T13:18:54.07-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "444654",
    "ThreadId": "69262",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>roncli wrote:</strong><br>Sounds like your settings are off.  What's the length of your fight time?  If it's low (3 minutesish), I'd make the Holy Light Time a condition, greater than a fairly reasonable high amount given your settings (the value to use is in seconds), and optimize for Overall like normal.  Or you can jack up the fight time to something appropriate.\r\n\r\nPlay around with it some, and if you can't seem to find a difference, then post an issue with your character file.</blockquote><p></p>\r\n\r\nYeah, the fight time is set to 3.1 minutes, everything has been tweaked to try and model rawr more like i want it to as in my previous posts. I don't really understand what you meant by &quot;, I'd make the Holy Light Time a condition, greater than a fairly reasonable high amount given your settings (the value to use is in seconds),&quot; \r\n\r\nIt was showing the same score pre and post otimiz. with your new setting (holy light time) but suggesting very odd gear and this be because of my current settings yes, it is asking for pvp gear and even a low lvl 219 item to replace a 264.",
    "PostedDate": "2010-05-18T18:59:16.84-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "444675",
    "ThreadId": "69262",
    "Html": "<p>Have you activated the filters for T10 etc. gear?<br> <br> Also, which fight in ICC is only 3 minutes, even more hard mode ones? <br> <br> On 18.05.2010 18:59, nodps wrote:</p>\r\n<blockquote cite=\"mid:CO1MSFTVADM022rnMwa0000d17e@CO1MSFTVADM02.SND.RNO.GBL\">\r\n<p>From: nodps</p>\r\n<div id=ThreadNotificationPostBody>\r\n<blockquote style=\"margin:0.25em 1em 0pt;padding:0pt 0.25em;font-style:italic\"><strong>roncli wrote:</strong><br> Sounds like your settings are off. What's the length of your fight time? If it's low (3 minutesish), I'd make the Holy Light Time a condition, greater than a fairly reasonable high amount given your settings (the value to use is in seconds), and optimize for Overall like normal. Or you can jack up the fight time to something appropriate. Play around with it some, and if you can't seem to find a difference, then post an issue with your character file.</blockquote>\r\nYeah, the fight time is set to 3.1 minutes, everything has been tweaked to try and model rawr more like i want it to as in my previous posts. I don't really understand what you meant by &quot;, I'd make the Holy Light Time a condition, greater than a fairly reasonable high amount given your settings (the value to use is in seconds),&quot; It was showing the same score pre and post otimiz. with your new setting (holy light time) but suggesting very odd gear and this be because of my current settings yes, it is asking for pvp gear and even a low lvl 219 item to replace a 264.</div>\r\n</blockquote>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-05-18T20:37:09.087-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "444679",
    "ThreadId": "69262",
    "Html": "Try lengthening your fight time (I use 10 minutes) and try again with the Holy Light Time optimization and see what it does.  Don't forget to have appropriate buffs, too.\r\n\r\nHave you played around with conditions in the optimizer?  That's what I'm referring to.\r\n\r\nThe reason you're getting odd gear is because you can probably cast Holy Light for the length of a 3.1 minute fight in entry level gear.  It's just picking the first one it comes across.",
    "PostedDate": "2010-05-18T20:55:21.483-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]