[
  {
    "Id": "235961",
    "ThreadId": "69358",
    "Html": "<p>ok I am little confuse why would a elemental shaman gem int or mp5 when on EJ that say its bad.</p>\r\n<p>would it be better to gem for haste over int</p>\r\n<p>&nbsp;</p>\r\n<p>here my profile http://www.wowarmory.com/character-sheet.xml?r=Auchindoun&amp;n=Woogyman</p>",
    "PostedDate": "2009-09-18T03:10:26.35-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "235994",
    "ThreadId": "69358",
    "Html": "<p>Are you sure that you have ticked all the raid buffs?</p>\r\n<p>If you have no replenishment you will run out of mana when casting nonstop for 5 minutes. That's why the modules suggest using mp5 gems.</p>\r\n<p>After checking those buffs you will get another result.</p>",
    "PostedDate": "2009-09-18T05:03:29.507-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "236145",
    "ThreadId": "69358",
    "Html": "<p>If you're using Thunderstorm every CD starting at about 80% mana, you shouldn't be having any mana issues.</p>",
    "PostedDate": "2009-09-18T10:56:56.713-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "236288",
    "ThreadId": "69358",
    "Html": "<p>so I have to be fully raid buff for rawr to tell me what gems to use.&nbsp; I thought I wanted to be unbuff to gem</p>",
    "PostedDate": "2009-09-18T17:10:43.937-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "236300",
    "ThreadId": "69358",
    "Html": "<p>You want to accurately model based on your raiding stats.&nbsp; This includes and relevant buffs that you expect to be running with.</p>",
    "PostedDate": "2009-09-18T17:50:26.73-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "236333",
    "ThreadId": "69358",
    "Html": "<p>So basically set rawr to use full raid buffs and then check and see what gems I need</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-09-18T21:36:47.71-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "236340",
    "ThreadId": "69358",
    "Html": "<p>'Full Raid Buffs' meaning what you would normally be running with. If you have a 10 man and there's 3 Blood DK's in the group you certainly wouldn't be able to apply all the buffs in the list pane.</p>",
    "PostedDate": "2009-09-18T22:00:44.743-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "236344",
    "ThreadId": "69358",
    "Html": "<p>&quot;This includes and relevant buffs that you expect to be running with.&quot;</p>\r\n<p>Was I unclear?&nbsp; I had a typo, but that doesn't really affect the readability of it.&nbsp; Yes, enable &quot;any relevant buffs that you expect to be running with&quot;, and then you can make more accurate comparisons in gemming and gear choices.</p>",
    "PostedDate": "2009-09-18T22:25:53.507-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "236486",
    "ThreadId": "69358",
    "Html": "<p>No you didnt have a typo or was in any way unclear in anything you said.</p>\r\n<p>so then question arises if I do a 10m setup for gems how do u setup a 25m regemming to meet the needs of a raid setup can get expensive</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-09-19T16:42:27.53-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "236488",
    "ThreadId": "69358",
    "Html": "<p>Generally, one of two things can happen in the presence of more buffs as an Elemental: You run out of mana less frequently, and you sometimes need less Hit.&nbsp; As far as I'm aware, Elemental generally doesn't have much issue with &quot;running dry&quot;, so that shouldn't really come into play too much (if the program starts recommending lots of mana regen stats, though, then you probably are running out of mana).&nbsp; However, you do often have instances where you need less Hit in a 25-man raid, and can trade out the excess Hit for a more &quot;direct&quot; damage stat - Spellpower, for example.&nbsp; It really depends on the buffs you expect to have in either raid situation, and how they compare.&nbsp; I generally swap in two pieces of gear when I can get a Draenei in my party, as that mean that I can free up 1% worth of Hit from my gear for better stats.</p>\r\n<p>You SHOULDN'T have a HUGE gear recommendation difference when switching between 25m buffs and 10m buffs.&nbsp; Really, the only major difference SHOULD be a possible freeing up of Hit itemization for other stats.</p>",
    "PostedDate": "2009-09-19T16:59:40.867-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "236532",
    "ThreadId": "69358",
    "Html": "<p>Simply put, buff yourself as you expect to be buffed in the environment that you want to perform optimally in.</p>",
    "PostedDate": "2009-09-19T22:53:33.583-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "246707",
    "ThreadId": "69358",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>paloop wrote:</strong><br>\r\n<p>ok I am little confuse why would a elemental shaman gem int or mp5 when on EJ that say its bad.</p>\r\n<p>would it be better to gem for haste over int</p>\r\n</blockquote>\r\n<p>Have the same issue:-&nbsp;</p>\r\n<p>Just downloaded 2.2.23 and unlike 2.2.22 it's rating Dazzling Eye of Zul (int) as top dps gem whereas 23sp is the best once hit capped.</p>\r\n<p>At first I thought it was using my resto talents but no it's using elemental.</p>\r\n<p>Either there is something funny with new version (unlikely) or I've got a setting set somewhere that is leading me astray.</p>\r\n<p>Any masters of RAWR out there who can advise?</p>\r\n<p>Abs</p>",
    "PostedDate": "2009-10-16T14:10:08.69-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "246737",
    "ThreadId": "69358",
    "Html": "<p>Buffs, Talents, and Fight Settings are what you should look at. It's thinking you're going OOM, try to find why.</p>",
    "PostedDate": "2009-10-16T15:54:28.197-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "247149",
    "ThreadId": "69358",
    "Html": "<p>I added a replenishment (judgement of the wise/hunting party) and it changed out all the int/mp5 gems to sp and sp/haste. I suggest trying that.</p>",
    "PostedDate": "2009-10-18T21:56:51.927-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]