[
  {
    "Id": "236190",
    "ThreadId": "69419",
    "Html": "<p>I'm unclear as to the difference between these two optimization choices. &nbsp;</p>\r\n<p>I assume that DPS maximizes DPS to the boss (such as by analyzing, from available gear, which combination yields the best <em>effective</em> DPS, taking hit cap into account). &nbsp;But if I'm correct, then what does Overall maximize? &nbsp;</p>\r\n<p>If I'm trying to get the best performance in a raid, which should I go for?</p>",
    "PostedDate": "2009-09-18T12:35:37.833-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "236237",
    "ThreadId": "69419",
    "Html": "<p>Overall is a sum of all of the ratings. For models which only include DPS, they're identical. For models that include, say, DPS and Survivability, it's a sum of those. Or Mitigation, Survival and Threat, it's a sum of those. It's <em>typically</em>&nbsp;what you want to optimize, but simply doesn't matter for single-rating models.</p>",
    "PostedDate": "2009-09-18T14:08:25.177-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "236240",
    "ThreadId": "69419",
    "Html": "<p>Note that if you're a DPS role whose model has survivability, you don't always want to optimize for Overall. &nbsp;Some fights, I'd take 500 extra DPS over 500 extra health (or whatever the &quot;survivability&quot; ratio is). &nbsp;Ideally, the model has a &quot;survivability&quot; ratio in the options that you can tweak, and then optimize for Overall. &nbsp;If this doesn't exist, be careful :)</p>",
    "PostedDate": "2009-09-18T14:18:58.943-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "236243",
    "ThreadId": "69419",
    "Html": "<p>Indeed, but it's <em>usually</em>&nbsp;set really low; something like 500hp to 25dps.</p>",
    "PostedDate": "2009-09-18T14:22:50.34-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "236250",
    "ThreadId": "69419",
    "Html": "<p>Interesting. &nbsp;Let me offer up a specific case. &nbsp;As far as I can tell the Warlock model only uses DPS. &nbsp;Yet with exactly the same gear, if I run the Optimizer set to <strong>DPS</strong> it yields a</p>\r\n<p>Score Before Op. of 2899.785 with Score After of 2991.293. &nbsp;</p>\r\n<p>Then, changing nothing else, running the Optimizer set to <strong>Overall</strong> yields</p>\r\n<p>Score Before of 2883.032 and Score After of 2976.761.</p>\r\n<p>Am I missing that the Warlock does use more than the DPS model (if so, where can I see this)? &nbsp;Or am I <em>really</em> confused?</p>",
    "PostedDate": "2009-09-18T14:44:57.513-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "236253",
    "ThreadId": "69419",
    "Html": "<p>I believe the Warlock model includes <strong>Pet DPS</strong> as a second rating, in addition to <strong>DPS</strong> (personal)</p>",
    "PostedDate": "2009-09-18T14:49:26.503-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "236256",
    "ThreadId": "69419",
    "Html": "<p>Just curious as to why someone might want to optimize for Pet DPS, rather than straight DPS? &nbsp;</p>\r\n<p>But in this case then, where the Warlock has both models, if I were to optimize for Overall it would get the maximized blend of personal plus Pet DPS?</p>",
    "PostedDate": "2009-09-18T14:52:47.803-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "236266",
    "ThreadId": "69419",
    "Html": "<p>I don't see any reason why you'd want to optimize for Pet DPS, but I'm not a Warlock. Overall is a sum of all ratings. If you optimize for Overall, you get the maximum total personal and Pet DPS. More likely, the use of them being split up is for when you want to optimize for DPS (personal), for fights where your pet isn't useful or dies or something.</p>",
    "PostedDate": "2009-09-18T15:09:07.593-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]