[
  {
    "Id": "236447",
    "ThreadId": "69485",
    "Html": "<p>Greetings!<br>I'm a long time fan of Rawr, first time poster - and I have a couple of questions for Astralyian and others who may have opinions on the thread's topic.</p>\r\n<p>I am planning on rolling the two profession that benefits me the most as a Feral Tank. I am thinking either engineer + jewelcrafting or leatherworking + jewelcrafting. Which one is to be considered the best?</p>\r\n<p>I also have another non-related question about Rawr.</p>\r\n<p>When one click on an item in Rawr a list appears ranking items from highest overall points to lowest. I wonder - is there a way to make this list disregard threat and list items by highest combined survival and mitigaton rating value? (I know one can list items after highest survival rating and highest mitigation rating seperatly - but I want items listed by +survival +mitigation -threat.)</p>\r\n<p>Thank you very much for your great creation Rawr which even a numbnut like myself can use. =)</p>\r\n<p>//Zarc</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-09-19T12:00:04.313-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "236451",
    "ThreadId": "69485",
    "Html": "<p>Haven't checked in a while which professions are most worthwhile to Bears. I'd guess Jewelcrafting and Blacksmithing. Should be easy to just try them out in Rawr and compare.</p>\r\n<p>Look at the options page for threat value. (And you probably want to turn it down, not remove it entirely)</p>",
    "PostedDate": "2009-09-19T12:46:27.197-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "236460",
    "ThreadId": "69485",
    "Html": "<p>Jewelcrafting + Leatherworking (since you said blacksmithing, leatherworking is purely an upgrade) it is then. :)</p>\r\n<p>Aha, I could change threat to &quot;none&quot;. Thanks! Got it now.</p>",
    "PostedDate": "2009-09-19T13:35:39.353-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]