[
  {
    "Id": "236678",
    "ThreadId": "69545",
    "Html": "<p>Hi all,</p>\r\n<p>Don't know it this has been asked, addressed or is it something I'm experienced becasue of misconfiguration or anything.</p>\r\n<p>Even though I have selected in the Edit Gemming Templates Options only the 5 epic gem groups that match the color requirement of their slots, evry time I run the optimizer, it assings gems of different color of the gem slot.&nbsp; For example, I'm a ProtWarr and it continuously assign the Solid Majestic Zircon, which is a blue epic gem, on items with yellow slots or red slots.</p>\r\n<p>Is there a way to configure the Optimzer so that it only select gems according to their color slots?</p>\r\n<p>Thanks,</p>\r\n<p>Nonak</p>",
    "PostedDate": "2009-09-20T15:52:01.73-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "236680",
    "ThreadId": "69545",
    "Html": "<p>You mean force all Yellow gems (or green/orange) to yellow slots and not allowing Blue gems to those slots? Why would you want to do that? If the optimizer finds a better score by loading an item that has 2 yellow sockets with Stamina, then that's the better score. The optimizer will put matching colors into sockets only if it determines that the socket bonus is necessary or it happens to be the highest value.</p>",
    "PostedDate": "2009-09-20T16:00:20.607-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "236687",
    "ThreadId": "69545",
    "Html": "<p>Gemming Templates are used for comparison charts, not for the Optimizer (other than that the Optimizer considers all gems in enabled gemming templates as 'available').</p>\r\n<p>There's no way to force the Optimizer to match socket colors, as that's no longer optimizing. If you're a ProtWarr, and not putting Solid Majestic Zircons in every yellow slot without a great socket bonus, you're not gearing optimally.</p>",
    "PostedDate": "2009-09-20T16:37:44.94-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "236691",
    "ThreadId": "69545",
    "Html": "<p>Actually, for Prot Warriors, I've found that it's best to match socket bonuses, at my level and tackling the content I'm tackling, to match most socket bonuses.&nbsp; It's much less straightforward than a DPS setup.</p>\r\n<p>Make sure that you have your fight modeling parameters set correctly (to match the fight you're optimizing for), and it will then Optimize to what gives the best results with the given variables, which doesn't necessarily gem/enchant/gear how you always expect/desire it to.&nbsp; If it's REALLY wrong, then open a tcket and include your character profile, and someone can take a look.&nbsp; But don't be freaked out when it doesn't want to match socket bonuses.</p>",
    "PostedDate": "2009-09-20T16:46:28.2-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "236698",
    "ThreadId": "69545",
    "Html": "<p>It commonly is best to match socket bonuses, when there's a great socket bonus. When there's not, it's not (and Solids are the gem of choice in almost all circumstances when it's not).</p>",
    "PostedDate": "2009-09-20T17:43:42.68-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]