[
  {
    "Id": "236755",
    "ThreadId": "69561",
    "Html": "<p>Ok, now hear me out on this. I'm trying to properly set up the filtering for the tribute run chest. The problem is that when getting info from the armory, it doesn't come in as coming from &quot;Trial of the Crusader (10)&quot;, &quot;Heroic Trial of the Crusader (10)&quot;, &quot;Trial of the Crusader (25)&quot;, or &quot;Heroic Trial of the Crusader (25)&quot;. It only comes in as &quot;Trial of the Crusader&quot; whether it is designated as a 10-man or 25-man run. Now after mulling over possible solutions for this, the closest I could come up with is set the base pattern as &quot;Trial of the Crusader,&quot; keep the existing patterns for the sub-filters, and add a 3rd filter specifically for the Tribute run (getting rid of the tribute run out of the Heroic Sub-filter).&nbsp; You do this for both 10 and 25 versions. <br><br>Now the problem with this solution is two-fold. Even with ilevel filtering set for all, if I turn off Tier 9 (25) (which like I said the base pattern is &quot;Trial of the Crusader&quot;), the other tab will still be used to show 25-man Tier 9. This means my solution is not the most optimal, however this is the closest I can think of to properly set up a filter for the Tribute run without adding the filter outside the T9 grouping.</p>\r\n<p>The second and this is kindof related to the first in that there is no way to filter specific slots. What I mean to say is this. Say I have the tribute run, with 25 attempts or more left, I get a weapon. 45 attempts or more, I get a cloak. There is no way to say sort by weapon or cloak in the filter. This makes things difficult with say the weapon. In 10-man the highest weapon is a 245 weapon, but the cloak is 258. So I have to set the max ilvl for the tribute run as 258. However, this will add in the 258 weapons from 25-man Heroic because of the other tab. I could add a sub-filter for 245 items and 258 items but that could also possibly add in unwanted data such as said 258 weapons showing when all I want to see is the cloaks and not the heroic 258 weapons run.</p>\r\n<p>So I'm at a complete loss on how to attack this problem.</p>",
    "PostedDate": "2009-09-20T22:44:21.81-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "236759",
    "ThreadId": "69561",
    "Html": "<p>Unfortunately, this is a data problem. Wowhead and Armory don't distinguish between normal and heroic, or 10 and 25, for chest drops. We could infer it based on which chest, and what ilvl, but we haven't gotten to that yet, unfortunately.&nbsp;</p>",
    "PostedDate": "2009-09-20T23:00:59.73-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "236896",
    "ThreadId": "69561",
    "Html": "<p>I was thinking as such. I'm just getting tired of having to look at ToC Tribute run items when I shouldn't be seeing it all because right now they are classified as a general &quot;other&quot;. Same can be said with naxx 10/25 Ulduar 10/25. Wowhead will say &quot;Heroic Such-in-such&quot;, while Armory will say &quot;such-in-such (25)&quot;. I started adding in these filters in the T7 and T8 filters.</p>\r\n<p>As a side note, &quot;Blazzek the Biter&quot; needs to be added into the PvP filter for the relentless pvp gear.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-09-21T07:40:26.063-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "237564",
    "ThreadId": "69561",
    "Html": "<p>I just added a new category with &quot;tribute&quot; in the filter so mine looks like :-</p>\r\n<p>&nbsp;</p>\r\n<p>*&nbsp; T9 (10)</p>\r\n<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; *&nbsp;&nbsp; Regular</p>\r\n<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; *&nbsp;&nbsp; Hard</p>\r\n<p>*&nbsp;&nbsp; T9 (25)</p>\r\n<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; *&nbsp;&nbsp; Regular</p>\r\n<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; *&nbsp;&nbsp; Hard</p>\r\n<p>*&nbsp;&nbsp; T9 Tribute items</p>\r\n<p>&nbsp;</p>\r\n<p>It has all the 10 &amp; 25 man items in there but that is not a big issue for me at this stage.&nbsp;&nbsp; You can go through and add comments to all the tribute items and set up sub-filters, but I think it isn't worth the effort at this stage.</p>\r\n<p>It would be really nice if the comments you add appeared in the item tooltips!</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-09-22T16:35:28.213-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]