[
  {
    "Id": "237224",
    "ThreadId": "69688",
    "Html": "<p>Is there any way to use rawr to produce 2 sets of optimized gear from 1 set of gear?</p>\r\n<p>Let me explain. I'm a dual-talent mage (arcane/frost) with lots of gear. I stick all my gear into rawr and get it to optimize for my arcane spec which is the one I use most. Is there any way to get rawr to then use the remaining gear and optimize it in conjunction with the gear it's just optimized to produce a second optimized set so I could swap pieces when I change specs?</p>\r\n<p>As luck would have it with my current gear, my spare pants are the t8 conq ones. To hit cap for my 2nd spec (frost), I can just gem them for 20 hit and swap pants without losing my other 2 set bonuses (2xt8, 2xt9). Obviously this works &quot;fine&quot; now but given future upgrades, it will doubtless prove difficult.</p>",
    "PostedDate": "2009-09-22T02:37:39.947-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "237227",
    "ThreadId": "69688",
    "Html": "<p>Yes. Look at the help docs on Batch Optimizations.</p>",
    "PostedDate": "2009-09-22T02:42:53.963-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "237247",
    "ThreadId": "69688",
    "Html": "<p>Cool, thank you.</p>",
    "PostedDate": "2009-09-22T04:07:17.317-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "237281",
    "ThreadId": "69688",
    "Html": "<p>Ok, I guess you mean the Progressive Optimize function? I'm playing with it now. That sounds like what I want; optimize for one spec, don't change those pieces but run riot over the rest of the gear to get the best out of the second spec.</p>\r\n<p>I have 2 copies of my character now with appropriate gear equipped and talents set.</p>\r\n<p>I'm not clear what the &quot;locked&quot; and &quot;weight&quot; columns actually do though. Do I set the spec I want to be &quot;important&quot; to a higher weight than my secondary spec?</p>",
    "PostedDate": "2009-09-22T05:52:49.397-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "237402",
    "ThreadId": "69688",
    "Html": "<p>For Progressive Optimize, I believe the weights are ignored. &nbsp;First spec gets all the love. &nbsp;Remaining specs get leftovers.</p>\r\n<p>The weights are used for Batch Optimize. &nbsp;Rawr tries to maximize wt1*score1 + wt2*score2 + ... . &nbsp;This more or less means that if your first spec had a weight of 2, and your second spec had a weight of 1, Rawr would be willing to sacrifice 1 DPS in your first spec, only if it would gain 2 or more DPS in your second spec as a result (assuming &quot;score&quot;==dps for both specs).</p>\r\n<p>I'm not sure what &quot;Locked&quot; means.</p>",
    "PostedDate": "2009-09-22T09:43:20.57-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]