[
  {
    "Id": "237638",
    "ThreadId": "69797",
    "Html": "<p>Currently, for Enhance shaman weapons, every viable weapon is listed, including primarily low dps, caster themed weapons. How can I make a filter so these caster weapons don't show up? I have to wade through dozens to find what I'm looking for.</p>\r\n<p>Secondly, I'm curious as to why these weapons even show up. Are some really so much better than physical dmg, double the dps weapons, just because they have spellpower to raise my lava lash and shock dmg?</p>\r\n<p>Last, and this has nothing to do with the title but, as often as I have to add new items to the item cache, I suppose its just gotten a little tedious. Could there be a direct Add Item command, without having to go through the Edit Item window?</p>\r\n<p>Thanks for any and all help and insight.</p>\r\n<p>Slayden, Silver Hand</p>",
    "PostedDate": "2009-09-22T21:32:57.703-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "237713",
    "ThreadId": "69797",
    "Html": "<p>If the item has been put into the item cache then it shows up, if it has stats that are viable. It sounds like you have never touched the item filters. Have a look at the chart frame and the drop downs above it. There you will see Filters. Now change that to filter out what you are not interested in.</p>\r\n<p>We cannot determine what you are interested in as that can be completely different from someone else, so YOU have to use the tools provided to select what YOU want. If a long list is a pain the easiest solution is to delete your ItemCache.XML file. Then run Rawr and import your character. Now select Load possible upgrades from Armoury (or Wowhead) and it will only populate the charts with items similar or better to what you have. That way a massive amount of lesser things are dropped and Rawr will run quicker.</p>",
    "PostedDate": "2009-09-23T01:42:17.317-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "239383",
    "ThreadId": "69797",
    "Html": "<p>It seems like you skipped over the point of my post. I know about the filters, and I've used them for my hunter, rogue, priest, and druid of course. However, I see no filter that would allow me to do what I want for enhancement weapons. IE: Block any weapon with +spellpower</p>\r\n<p>My question was &quot;How can I make a filter so these caster weapons don't show up?&quot;.</p>\r\n<p>If there is a filter that does this, could you name it for me, since I apparently can not find it? As it stands, the filters in the drop down menu you pointed out, that I regularly use for this toon and others, only includes filters for locations / expansions the items come from, which is not what I'm looking for. I've gone into Edit Item Filters to see if there are other filter options, but again, they are all for location of origin only. I would have to make my own filter, to block out the spellpower stat, but I do not know how. Which brings me back to my question.</p>\r\n<p>How can I make a filter to do this, if it is even possible?</p>",
    "PostedDate": "2009-09-27T21:43:09.48-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "239422",
    "ThreadId": "69797",
    "Html": "<p>No, Filters are not appropriate for this task. However, I'm not actually sure that this even *is* a correct task. If you've having to 'wade through' these weapons, then they actually *are* DPS upgrades for you.</p>\r\n<p>I also wouldn't delete the itemcache; there's a whole lot of items there, and you'll miss tons of them if you try to manually (or via find upgrades) add them all. Additionally, you mention adding items being a hassle... That's confusing to me. What are you doing, where you find you frequently have reason to add items?</p>",
    "PostedDate": "2009-09-28T01:01:05.43-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "239539",
    "ThreadId": "69797",
    "Html": "<p>Thanks Astrylian. I guess I'll just have to deal with it as it is.</p>\r\n<p>I suppose for the way I play my shaman the spellpower EP values just seem too high. When I equip a spellpower weapon, my dps suffers, unless I change my rotation to accommodate, but that takes me out of my playstyle. I'll have to wait til another caster weapon drops within the quality of my current main and offhand weapons before I can do more testing. It just seems that a weapon with no enhancement stats other than Intellect, a 50 weapon dps decrease and an often faster weapon speed, should not be better or even on par with an Agi, AP, Crit, and Exp weapon, just because it has over 300 spellpower. Is there a way to alter the EP values to fit my own style or is that something I'm better off using a spreadsheet for? I'd much rather continue to use Rawr for my shaman as I do my other toons, and just ignore the items I personally don't find appealing, as spreadsheets confuse me to no end.</p>\r\n<p>Anyway, I'll deal with that for now as I have been.</p>\r\n<p>As far as how often do I need to add items, well, I suppose thats my own fault in that updating the itemcache takes quite awhile, and I'm an impatient person. The update also doesn't always find new items from holiday events ( I could probably wait a few days then update to resolve this ) or lower level items still on fresh 80's. So I end up adding them one by one. This would probably be more of a personal convenience, and doesn't reflect a flaw in Rawr. I'm a bit embarassed for even bringing it up.</p>\r\n<p>I have one last question tho. Something I noticed on my druid last night. Between the Trinket 1 and Trinket 2 slots / charts, why do the bars shift (shorter or longer) and the trinkets change position relative to each other just by changing the charts from one to the other? I'll see a trinket at the 2nd BoS position for the first trinket slot, fall to 4th in a second trinket slot. I'm probably just missing something like a Unique item or some such that can't be used in both slots.</p>\r\n<p>Sorry for any confusion and my ramblings.</p>\r\n<p>Thanks again</p>",
    "PostedDate": "2009-09-28T07:57:56.457-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "239571",
    "ThreadId": "69797",
    "Html": "<p>The Trinkets are relative to each other, Trinket 1 is factored into the changes for Trinket 2</p>\r\n<p>if Trinket 1 is ItemA and it has a value of 84 crit and a 1000 AP proc and you wanna replace it with ItemB which is 84 Crit 500 STR proc then looking at Trinket 1 you will see DPS difference between THOSE 2 items, which could be fighting for BiS.</p>\r\n<p>if Trinket 2 is ItemC and it has a value of 84 ArP and 700 Haste proc and you wanna replace it with ItemB (84 Crit 500 STR) then it's comparing ItemB and ItemC not ItemA.</p>",
    "PostedDate": "2009-09-28T08:50:41.493-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "239620",
    "ThreadId": "69797",
    "Html": "<p>Also, there are no EP values. Rawr doesn't use stat weights. Items are valued by how much they contribute to your DPS, simple as that. I'm not familiar with how your rotation would have to change with a caster weapon, but if Rawr says a caster weapon beats your current weapon, that means that you could do more DPS with it. I'm not totally up on my Enh theorycraft myself, but I believe that only happens when going up to a higher ilvl. Most caster weapons have things like crit, haste, and hit ratings as well, which directly benefits enhance, since they're universal between casters and physical dps.</p>",
    "PostedDate": "2009-09-28T10:34:52.61-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "239717",
    "ThreadId": "69797",
    "Html": "<p>Thanks Jothay and Astrylian for educating me. I much appreciate it. I'll just have to see how these other weapons effect my dps, when I can get ahold of one, and I may just have to adapt my playstyle to fit each weapon.</p>\r\n<p>Thanks again for all the kind help. :)</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-09-28T14:46:25.067-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "240078",
    "ThreadId": "69797",
    "Html": "<p>Simulation for Enhancement Shaman weapons seems broken to me at the moment.</p>\r\n<p>It's currently telling me that MH-Masticator with OH-Frostbite Hatchet (245)&nbsp;is better than MH-Frostbite Hatchet (245) with OH-Vulmir, which is not true in practice.</p>\r\n<p>&nbsp;</p>\r\n<p>I've also had Enhancement models that tell me to keep getting hit as my primary stat even when I have already hit the spell hit cap, with and without Misery/Faire Fire.</p>",
    "PostedDate": "2009-09-29T09:31:10.877-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "240099",
    "ThreadId": "69797",
    "Html": "<p>You'll need to post your character file, demonstrating what you think is incorrect.</p>",
    "PostedDate": "2009-09-29T10:27:06.877-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "240321",
    "ThreadId": "69797",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>mmattai wrote:</strong><br>\r\n<p>Simulation for Enhancement Shaman weapons seems broken to me at the moment.</p>\r\n<p>It's currently telling me that MH-Masticator with OH-Frostbite Hatchet (245)&nbsp;is better than MH-Frostbite Hatchet (245) with OH-Vulmir, which is not true in practice.</p>\r\n<p>&nbsp;</p>\r\n<p>I've also had Enhancement models that tell me to keep getting hit as my primary stat even when I have already hit the spell hit cap, with and without Misery/Faire Fire.</p>\r\n</blockquote>\r\n<p>The spell hit cap for Enhancement shamans is NOT a solid cap. We also can gear hit towards the dual wield cap. This CAN increase our dps as it does a number of things namely... increased MW stacks (less white misses = more MW procs faster) more berserking procs off weapon enchants = more bonus AP uptime which of course gives more SP too, and of course more white dps.</p>\r\n<p>So for Enhancement Shamans stopping at the spell hit cap is not always a good idea. Often having a lot of hit well beyond the spell hit cap is fantastic for our dps.</p>\r\n<p>Please don't use EP values to work out what is good and what isn't. Run Rawr to see what items give best dps and use the Export to EnhSim to verify the Rawr calcs. We Enhancement Shaman have an excellent resource in EnhSim that gives us far more in-depth analysis than is desirable to have in Rawr. I've worked on Rawr to ensure that for the vast majority of users Rawr gives good solid results, I've also ensured that its quick and simple to export data from Rawr to EnhSim so that those that want to check my calcs in Rawr can do so using EnhSim.</p>\r\n<p>This double checking also allows great sanity checking for myself as a developer making sure that the output from Rawr is accurate.</p>\r\n<p>&nbsp;</p>\r\n<p>NB. I take the OP's point on board about spellpower items. I could include an option to ignore any weapon with spellpower if it really bothers you that much.</p>",
    "PostedDate": "2009-09-30T02:31:22.06-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "240702",
    "ThreadId": "69797",
    "Html": "<p>Hi,</p>\r\n<p>I have been experiencing this situation as well.&nbsp;&nbsp;Rawr is suggesting that I replace most of my gems with +hit gems, as well as my gloves enchant,&nbsp;thereby putting me well over the &quot;cap&quot;.&nbsp; I do understand that it isn't a cap per se and that +hit remains very beneficial, for instance&nbsp;over 342 for a Dranei with IFF or Misery.&nbsp; However,&nbsp;I was skeptical&nbsp;and therefore I did what&nbsp;I was&nbsp;supposed to do -- simulate with EnhSim.&nbsp; It turns out that, as I suspected, I'm getting better results with ap/crit (and haste&nbsp;but I won't touch that subject) than&nbsp;hit.&nbsp;&nbsp;None of the simulations showed any benefit from adding hit beyond 342 instead of other stats.&nbsp;</p>\r\n<p>Also note that this does not always happen, which makes it even weirder.&nbsp; Sometimes Rawr suggests what I would expect i.e. expertise to 26, hit to 340-350, and then ap/crit.&nbsp; Sometimes it recommends hit to 400 or higher.&nbsp; Simple swapping one item may produce dramatically different results regarding hit.&nbsp; This is surprising; I know the effects of haste are difficult to guess (see other thread) but the effects of hit are fairly straightforward.&nbsp; Either way, it doesn't agree with EnhSim which is the most important part.&nbsp; Any thoughts?</p>",
    "PostedDate": "2009-09-30T18:00:58.973-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "240848",
    "ThreadId": "69797",
    "Html": "<p>PLEASE PLEASE PLEASE supply me with a Rawr XML save file that has the hit to 340-350 and then simply swapping one item produces the dramatically different results.</p>\r\n<p><br>I very strongly suspect there is a irritating little bug in the code, however whilst I can see some people getting the massive +hit recommendations and some getting perfectly normal recommendations I've never seen the trigger case where swapping one item switches between the two situations.</p>\r\n<p><br>If I had an XML file and you said load that XML file and see that it all looks good, change item X and suddenly it goes hit crazy. Then I'd be able to trace what changes between the two states and thus work out what is going wrong and fix it.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-10-01T04:13:09.643-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "240999",
    "ThreadId": "69797",
    "Html": "<p>Levva, one thing I fixed recently that was giving me these sorts of results, was that I was flooring the stats received by SpecialEffects.GetAverageStats (notably Berserking).</p>\r\n<p>This led to hit being where I expected it, unless I was a few rating points away from getting 1ap more from berserking (the same held true for haste, or crit with a mirror equipped, etc), and then have it bounce back. &nbsp;I could view this at the &quot;Relative Stat Value&quot; tab (which isn't reliable, I know), but then practically when I slowly added hit rating I'd see my DPS increase 1.1, 1.1, 1.1, 3.4, 1.1, 1.1; an obvious bug.</p>\r\n<p>We should not be flooring any stat coming from Special Effects due to the fact that it's an average/estimate; only floor stats when incorporating buffs with your base/unbuffed stats, as those are floored in the game. &nbsp;Not sure if this is your bug or not, but thought I'd share it anyway.</p>",
    "PostedDate": "2009-10-01T10:59:49.443-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "241072",
    "ThreadId": "69797",
    "Html": "<p>Hmm I was flooring the bonus Str or bonus Agi &amp; AP from Paragon or highest stat buff in my special effects code. I've removed that. This might explain why it affects a small number of people if it is only affecting those with a &quot;highest stat&quot; or &quot;paragon&quot; proc trinket.</p>\r\n<p>Now I suppose I need those that had the issue to tell me if they have one of those sorts of trinkets.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-10-01T14:38:37.857-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "241074",
    "ThreadId": "69797",
    "Html": "<p>Levva, I will try to reproduce this behaviour with my current character file.&nbsp; It should not be too difficult as it has happened quite a few times in the past few days.&nbsp; However, I don't see any way to attach files here, so should I email it?&nbsp;</p>\r\n<p>Also,&nbsp;I'm not using any &quot;highest stat&quot; or &quot;paragon&quot; proc trinket on this character, so unfortunately that isn't the issue here -- assuming there is even an issue.&nbsp;</p>",
    "PostedDate": "2009-10-01T14:55:51.497-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "241274",
    "ThreadId": "69797",
    "Html": "<p>Create a new Issue rather than a discussion you can attach files to an issue. Please make the subject clearly to do with Enhancement shaman eg: [Enh] Example of hit variability.</p>\r\n<p>If you are trying to replicate and manage to get it down to just changing one gem that would be fantastic as that's only the effects of one or two stats to track, rather than the stats on an entire item.</p>",
    "PostedDate": "2009-10-02T06:13:04.453-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "241458",
    "ThreadId": "69797",
    "Html": "<p>Hi Levva,</p>\r\n<p>I haven't been able to reproduce the behaviour where Rawr recommends huge amounts of hit rating even though EnhSim disagrees.&nbsp; More exactly, I did obtain 473 hit rating once but I forgot to save the file and the optimizer never generated the same configuration again. (Drawback of genetic algorithms.)</p>\r\n<p>However, I was able to observe a situation which illustrates the problem to some extent, and which also&nbsp;conveniently matches your request.&nbsp;&nbsp;After replacing a 40ap gem with a 20hit gem (going from 380 to 400 hit rating), Rawr displays a sharp increase (50 points!) in DPS.&nbsp;&nbsp;EnhSim disagrees and calculates a minor decrease (5 points)&nbsp;in&nbsp;DPS, as I would expect since hit rating is still quite valuable after the &quot;soft&quot; cap.</p>\r\n<p>I will create an issue later today&nbsp;to describe this problem.&nbsp; Even though it isn't exactly the &quot;huge hit rating&quot; issue, it might help you pinpoint something related to hit rating.</p>\r\n<p>*edit* I have created issue 14321.</p>",
    "PostedDate": "2009-10-02T12:34:58.887-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "243082",
    "ThreadId": "69797",
    "Html": "<p>Great work on the plugin. Couple of comments - first I remember being stunned way way back when RAWR suggested I pick up Wraith Strike (+SP) over my Crimson Steel. It turned out to be a fantastic upgrade, and even though I kept getting questioned over it, the dps increase was undeniable. I never would have considered it if not for RAWR, and even though there are few viable +SP slow one-handers, I'm glad I gave it a shot... and I appreciate knowing where these types of weapons rank. Second re:hit, RAWR pushed me upwards of 460 before it eased off. I've wondered if having so much hit was truly more beneficial than other stats... but the dps has continued to increase, so what do I know :) Third, with 2.2.20 I've been unable to generate an XML for my enhsham, although the mage mod has no issues. Any ideas? I pulled fresh info from the armory, no luck saving it. Thanks!</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-10-07T12:00:35.237-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "243084",
    "ThreadId": "69797",
    "Html": "<p>There's currently an annoying bug with saving characters who are leatherworkers. We're working on it, and hope to release a new version very soon.</p>",
    "PostedDate": "2009-10-07T12:07:57.857-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]