[
  {
    "Id": "238049",
    "ThreadId": "69916",
    "Html": "<p>Hello -</p>\r\n<p>I do want to start off and say that Rawr is one of the greatest WoW tools since sliced bread.&nbsp;<br><br>My question, and I do apologize if this has been asked before, is there a way to establish a set percentage of hit rating so when I l look for upgrades, it doesn't always select hit % first?</p>\r\n<p>I am using v2.2.19 and I play a Destro Warlock. Thanks.&nbsp;</p>",
    "PostedDate": "2009-09-23T15:06:55.093-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "238059",
    "ThreadId": "69916",
    "Html": "<p>I'm not understanding what you're wanting.&nbsp; My closest guess would be that you want to tell the program to only gear up to (arbitrary number here) 33% hit rating, even if the cap is (arbitrary number here) 35%?</p>",
    "PostedDate": "2009-09-23T15:33:24.587-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "238062",
    "ThreadId": "69916",
    "Html": "<p>Yes, and sorry if my original post wasn't as clear as it should be.</p>\r\n<p>Basically, 16% hit is what any ideal caster should be at for raiding. For myself, I tend to try and gear roughly around 13% because in a raid situation, there are a lot of classes that bring additional hit to the raiding party (e.g. - Moonkin Druid 3%, Dreanei 1% - through heroic presence). Within Rawr though, any use of the&nbsp;optimizer appears to select gear with hit rating first. Even though I know hit is important, I was wondering if there is a way to set a threshold to hit so when optimized, it will look for gear that relies more on Critical and Haste rating. Does that make sense?&nbsp;</p>",
    "PostedDate": "2009-09-23T15:42:14.16-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "238064",
    "ThreadId": "69916",
    "Html": "<p>That's where the Buffs tab comes in handy.</p>\r\n<p>Give yourself the raid buffs you expect to have (Misery, Heroic Presence, etc.) that would give you bonuses to hit % and Rawr will automatically re-weigh each stat/item accordingly.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-09-23T15:53:34.7-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "238066",
    "ThreadId": "69916",
    "Html": "<p>While you can't specifically specify an amount of hit to go for, if you go into the buffs section, those buffs are available to be checked and there for rawr will account for those when gearing you.&nbsp; Is this more what you're looking for?</p>",
    "PostedDate": "2009-09-23T15:54:28.933-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "238076",
    "ThreadId": "69916",
    "Html": "<p>No that's perfect, thank you.</p>",
    "PostedDate": "2009-09-23T16:26:31.407-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]