[
  {
    "Id": "238298",
    "ThreadId": "69975",
    "Html": "<p>I have recently start using rawr (using 3/13/55) for upgrade paths and optimizations. Until recently my weakest piece of gear was my wand (shimmering scales) so I was excited to get the wand of sseratus from gundrak. I was surprised that rawr tells me the wand of shimmering scale is close to 33% better then sseratus.</p>\r\n<p>shimmering scales</p>\r\n<p>+26 spellpower</p>\r\n<p>+21 haste</p>\r\n<p>&nbsp;</p>\r\n<p>wand of sseratus</p>\r\n<p>+28 spellpower</p>\r\n<p>+24 spirit</p>\r\n<p>+18 intellect</p>\r\n<p>According to the destruction thread on ej &nbsp;haste is .01 better the spirit.&nbsp;What are the stat ratios/weights used in rawr? Is there a way to see them?</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-09-24T06:36:16.093-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "238387",
    "ThreadId": "69975",
    "Html": "<p>Select &quot;Relative Stat Values&quot; in the right-side pane of the interface. But note that I think the Warlock model is still in development.</p>",
    "PostedDate": "2009-09-24T09:53:31.027-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "238389",
    "ThreadId": "69975",
    "Html": "<p><span style=\"font-size:12pt\"><strong>Please search for existing threads on your issue before creating new threads.</strong></span></p>\r\n<p>&nbsp;</p>\r\n<p>If you had searched for your issues here, you would find two answers echoed over and over:</p>\r\n<p>Rawr does not use stat weightings in its internal calculations.</p>\r\n<p>If you have a specific question concerning a particular detail that appears to be wrong in some fashion, we need to see your character file.</p>\r\n<p>&nbsp;</p>\r\n<p>And potentially useful (somewhat related to the second point, but slightly harder to get through a search):&nbsp; If you're not in danger running out of mana, the Int and Spirit would be (correctly) greatly devalued.</p>",
    "PostedDate": "2009-09-24T09:59:30.087-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "238426",
    "ThreadId": "69975",
    "Html": "<p>Yeah I admit to not using the search but won't make that mistake again, sorry. So if I understand correctly raw compares my items by seeing what gain it will have over an empty slot and recommend the one that gives the biggest gain.</p>\r\n<p>Regarding BrWarner 2nd comment about spirit being devalued, isnt spirit a important stat for locks? Obviously it gives a nice stat bonus with lifetap glyph and fel armor &amp; aegis but why is it listed with a value of 0 in the relative stats section? Not really questioning the validity of rawr just trying to understand how it works. Getting back to my wand comparison. The wand I thought was better has +2 spellpower and +24 spirit &nbsp;which is another 12 spellpower so rawr is telling me that 14 spellpower is less valuable (based on my gear) then 21 haste? While searching for warlock &amp; haste I saw references to haste having many peeks and valleys so I assume I must of surpassed one of those peaks with an additional 21 haste from the shimmering scales wand. The haste peak/valley issue is confirmed by the haste rating gain screen where I see over a 50% gain (8 dps to 20 dps)&nbsp;when going from a 12 to 13 point haste gain (8 dps to 24 dps) which would mean that spellpower is worth less the 1 dps and the relative stat screen does suggest that is with a value .88. So this adds up to &nbsp;raw suggest that shimmering scales is 10 dps (almost 28%) better then sseratus? Do I understand the process properly?&nbsp;</p>",
    "PostedDate": "2009-09-24T10:59:48.373-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "238497",
    "ThreadId": "69975",
    "Html": "<p>Its showing zero on relative stats because you may be doing something wrong and until that is resolved the results wont be accurate...</p>\r\n<p>Did you remember to check off fel armor in the buff list and check off glyph of life tap in your glyph section...? if you did and it still reports zero dps gain...make an issue and post your character save file!</p>",
    "PostedDate": "2009-09-24T13:33:35.61-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "238503",
    "ThreadId": "69975",
    "Html": "<p>actually meant to include my save file last post but forgot. I just checked and I had Fel Armor check and still had 0 for spirit EP value but I didnt have life tap glyph checked.&nbsp;</p>\r\n<p>note - I am not sure how to attach save files, is the attach button only available to open issues.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-09-24T13:46:41.557-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "238504",
    "ThreadId": "69975",
    "Html": "<p>yup make an issue</p>",
    "PostedDate": "2009-09-24T13:50:00.133-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]