[
  {
    "Id": "238313",
    "ThreadId": "69982",
    "Html": "<p>Hey,&nbsp;</p>\r\n<p>I've recently (around when 3.2 came out) have encountered several times missing items in Rawr. It seems the items do not appear in the Comparison pane, or in the drop down list that opens when you click on the item in the left pane, but they do exist in the Edit Item option.</p>\r\n<p>One such item would be the Vestments of the Shattered Fellowship (the 245 Ilevel version).&nbsp;</p>\r\n<p>Any idea how can I add it, or see it?</p>",
    "PostedDate": "2009-09-24T07:27:01.093-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "238421",
    "ThreadId": "69982",
    "Html": "<p>A) It's filtered out, which is most likely. See filters, top right.</p>\r\n<p>B) It's not in your item cache. Add it. Tools &gt; Edit Items.</p>",
    "PostedDate": "2009-09-24T10:47:10.91-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "238513",
    "ThreadId": "69982",
    "Html": "<p>I'd have added screen shots to show you my setting had I&quot;ve known how, but I'll try and describe it.</p>\r\n<p>In the Filters part, all options but: Burning Crusade, Classic, Not Found on Armory, Options and All are turned on (checked with a checkmark) including all of the sub areas.</p>\r\n<p>As for the Edit Items part, that's the strange part. It is there, I can find it and edit it. I just cannot see it in the comparison pane or when left clicking the item in the left pane and searching through that list. Unless I'm missing some obvious way to add it from the Edit part to the places I mentioned, I'm kind of lost here....</p>",
    "PostedDate": "2009-09-24T14:02:45.347-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "238520",
    "ThreadId": "69982",
    "Html": "<p>Then it's either a Filters issue or a Refine Types of Items Listed issue.</p>\r\n<p>If you're having an issue with a particular character file, please open an item in the Issues Tracker as opposed to the Discussions thread.&nbsp; You can then upload files (like your character profile), and if the issue is resolved, we can close the issue.</p>",
    "PostedDate": "2009-09-24T14:18:33.2-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "238526",
    "ThreadId": "69982",
    "Html": "<p>The Filters have been changed, <strong>ANYONE WITH PROBLEMS ABOUT THE FILTERS</strong> please hold off on new comments/issues until the current Unreleased ones come out, which include fixes.</p>",
    "PostedDate": "2009-09-24T14:25:57.737-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "239208",
    "ThreadId": "69982",
    "Html": "<p>Burnished Quel'Serrar (http://www.wowhead.com/?item=49495) is such an item for me when working on my Prot Pally with Rawr.</p>\r\n<p>It shows up in the item database, I also added it manually, but it doesn't show up in the comparison panel, even if I set the filter(s) to &quot;ALL&quot;. And yes, I did check if I have chosen 1h-swords to be shown too.</p>\r\n<p>If I'm already here, I got another question:</p>\r\n<p>Did Ony 10 man the other day, and because we had no caster in the raid I took the Glinting Azuresong Mageblade (49298) for my heal gear. So far I used Ice Spire Scepter (#40488).</p>\r\n<p>Of course I know that the Mageblade is a caster weapon an normally not used by Healadins, but it is still much better than the Scepter, but doesn't show up in the comparison list too. Is that simply because it's initially a caster weapon (with hit on it) and not showing up in the Healadin modul, or is it the same problem as stated above with the Burnished Quel'Serrar?</p>",
    "PostedDate": "2009-09-26T21:01:17.277-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]