[
  {
    "Id": "238350",
    "ThreadId": "69992",
    "Html": "<p>It appears the filters or something may be pugged. I am unsure how to fix it. This problem has been occuring in the last two versions.</p>\r\n<p>Basically, items that have both 245 and 258 level versions only show the 258 version.&nbsp;</p>\r\n<p>If you open the Item Editor you can see the ilvl 245 item. However you can't equip any of these items, nor can you see them in the comparison panel.</p>\r\n<p>I tried adjusting the filter to take away the heroic GToC items, and that didn't work. All of the previous ilvl 258 items are still there listed as ilvl 258.</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-09-24T08:22:34.727-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "238368",
    "ThreadId": "69992",
    "Html": "<p>Please read other posts before creating a new thread.</p>\r\n<p>Some items in the itemcache do not have their full drop location listed, causing them not to show up under any filter. To allow these items to display, either select the ALL filter from the filters list, or update your item cache from Armory to get the full location listings applied to the items that are missing them.</p>",
    "PostedDate": "2009-09-24T09:04:55.113-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "238374",
    "ThreadId": "69992",
    "Html": "<p>Thank you, I didn't see another thread.</p>",
    "PostedDate": "2009-09-24T09:33:55.207-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "241539",
    "ThreadId": "69992",
    "Html": "<p>I must be doing something wrong when I access the forum.&nbsp; I don't see&nbsp;threads, all I see is a list of recent posts.&nbsp; This makes it very hard to find info in the forum.</p>",
    "PostedDate": "2009-10-02T16:28:31.867-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "241555",
    "ThreadId": "69992",
    "Html": "<p>Not sure what you could be doing wrong. What you see are threads, sorted by most recent activity in it. That's pretty standard.&nbsp;</p>",
    "PostedDate": "2009-10-02T18:18:35.607-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]