[
  {
    "Id": "238764",
    "ThreadId": "70096",
    "Html": "<p>Hi,</p>\r\n<p>I've been using Rawr for quite some time now and although I love the program and use it almost on a daily basis, there are a few things that start to annoy a bit.</p>\r\n<p>I'm using Rawr not only for myself, but as the raid leader I also look up other guild members to give them advise (and always point them to the program too :) ).</p>\r\n<ul>\r\n<li>The number 1 annoyance is that name and realm is not remembered. It would be a great help if those were remembered, and possibly even remember the last few entered so you can get a dropdown box and just select from the list. This is most annoying because the armory tends to not respond a few times in a row, and having to type the realm/username 3, 4 times in a row gets a bit tedious.</li>\r\n<li>The exported  gear upgrade list can be imported into excel, but the last collumn is split in two because the improvement number separator has a comma as well. It would be handy to have an option to use a custom field separator like a semicolon for instance. Also the description for certain weapons contain a comma (Voldretar, for instance).</li>\r\n<li>I also find myself editing the list quite a bit because sometimes I want to be able to sort on instance/boss. Right now this is one collumn with &quot;Found in cache of Storms ..&quot;. Making this into 2 collums with (1) boss/cache/gift name and (2) instance name makes the list easier to import and sort.</li>\r\n<li>After import, I always have to select to force gem requirements. As far as I'm concerned the majority of players would want that enabled anyways so let the minority deal with deselecting it :P. It would be helpful if an option could be set to &quot;always default to force gem requirements on new character import&quot;.</li>\r\n<li>Last but not least the program settings are gone after every upgrade. The program is a simple copy/paste and requires no installer, but the optimizer settings and gemming templates are always overwritten. Since we're getting updates quite regularly it would make life easier if those settings are kept in a file that won't be overwritten. I think this could simply be avoided if the default settings are kept in a separate config file and the changed user settings in a user.config file.</li>\r\n</ul>\r\n<p>&nbsp;</p>\r\n<p>Thx for reading.</p>",
    "PostedDate": "2009-09-25T06:06:41.443-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "238860",
    "ThreadId": "70096",
    "Html": "<p>We appreciate the feedback.</p>\r\n<p>I agree on all counts. However, several of those things should pretty minor, not 'the number 1 annoyance'. It sounds like you're not saving your character files, and that you're just loading from the armory every time.</p>\r\n<p>Regardless, yeah, all good feedback, plan to be implementing all of those.</p>",
    "PostedDate": "2009-09-25T09:11:39.943-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "238874",
    "ThreadId": "70096",
    "Html": "<p>Thanks.</p>\r\n<p>&nbsp;</p>\r\n<p>Different situations for different people. I am saving my own characters, not the guild characters. No use because I never know when they changed gear, gems, enchants etc. I will have to reload them from the armory.</p>\r\n<p>Thanks for considering them at least. I'll be looking out for them ;)</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-09-25T09:49:06.153-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "238923",
    "ThreadId": "70096",
    "Html": "<p>You can still save the characters, and just use Tools &gt; Refresh from Armory (or whatever it's called) on them. That'll regrab the items/enchants/talents from the Armory, but leave everything else of the saved character.</p>",
    "PostedDate": "2009-09-25T11:52:11.627-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]