[
  {
    "Id": "238907",
    "ThreadId": "70139",
    "Html": "<p>I wonder if the &quot;Spell Usage&quot; options in the Resto Druid model could be updated? Most of the rotations offered suggests rolling lifebloom in some form which is not mana-efficient for a while.</p>\r\n<p>I was thinking of perhaps:</p>\r\n<p>1. Tank Healing with Nourish Supported by HoT's (the Nourish glyph supports that)</p>\r\n<p>2. Raid Healing. Basically Rejuv, Wild Growth on most cooldowns, and an occasional Nourish and Swiftmend spell</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-09-25T11:19:41.123-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "239313",
    "ThreadId": "70139",
    "Html": "<p>The default spell usage has been for a number of patches:</p>\r\n<p>Tank Nourish (2 Tanks RJ/RG/Slow 3xLB)</p>\r\n<p>Basically it assumes  lifeblooms are refreshed just before they drop off, until a 3 stack has been reached, which is then left to bloom.</p>\r\n<p>Rejuv and Regrowth are kept active on the tanks.</p>\r\n<p>Nourish spamming is used in all available time/mana, to make maximum use of the Nourish T7 4-piece set-bonus and Glyphs.</p>\r\n<p>&nbsp;</p>\r\n<p>Is this what you had in mind with option 1?</p>\r\n<p>&nbsp;</p>\r\n<p>For raid healing:</p>\r\n<p>The basic options currently are: Ignoring tanks completely by going for Rejuv spam, while setting the required Wild Growth and Swiftmend rated, or going for the Raid heal with Rejuv option, which will place some lifeblooms on a tank.</p>\r\n<p>I agree the occational Nourish or Regrowth would be useful to model in there as well, since at the moment this option would assign no value to the Nourish glyph.</p>\r\n<p>&nbsp;</p>\r\n<p>In terms of lifebloom usage:</p>\r\n<p>If all the hard-core raider blogs etc. are correct and mana is really a non-issue, you shouldn't be worried about an inefficient rolling of lifebloom. For a constant stream of healing ticks, with low upkeep, rolling lifebloom is still valuable. (Nourish basically need all the glyph and set bonus buffs, to be able to beat even rolling lifebloom in terms of mana efficiency).</p>\r\n<p>If rolling lifebloom is too costly, fast restacking of lifebloom to 3 stacks again, can provide even higher hps, since you get the extra blooms as well. But it is costly in terms of cast time.</p>\r\n<p>Slow lifebloom stacking is the most mana efficient spell we have (beating even Wild Growth), if the bloom isn't wasted.</p>\r\n<p>&nbsp;</p>\r\n<p>This options panel has been on the &quot;needs work list&quot; for a long while, but I haven't yet figured out what is really needed to control this in a nice manner. So if you or other users of Rawr.Tree has got some constructive ideas, please pass them on.</p>\r\n<p>In terms of adding some Nourish or Regrowth to raid healing rotations, what is the suggestion in terms of ratios? Do we need a fixed value or sliders?</p>\r\n<p>If we add nourish or regrowths, what fraction of the time do we assume the nourish is on a target with a HoT (Nourish glyph) or the regrowth target is a refresh (Regrowth HoT)? Currently the assumption is tanks will have the HoTs active, while when raid healing with nourish or regrowth, it will be a new target every cast (i.e. no HoTs).</p>\r\n<p>I would prefer to not have too many more sliders. The spell rotations graph currently tries all available spell usage options, ignoring the sliders. This is useful in comparing different spell combinations, but uses only the current slider positions. Adding all possible slider positions to this list, will make it too long. But this approach does not help locate the optimal number of swiftmends to use (for some rotations using swiftmend is a positive hps, while for others it drops the hps). I assume adding nourish or regrowth to raid healing cycles will drop the overall hps scores, but will correctly value other stats and result in a more realistic accuracy overall. Thus I'm all for it.</p>\r\n<p>&nbsp; Thoughts?</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-09-27T12:27:16.08-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "242750",
    "ThreadId": "70139",
    "Html": "<p>Wild Growth is the king of Druid raid healing, yet I don't find it in any of the raid healing rotations provided by RAWR.&nbsp; This makes most of the other information RAWR provides meaningless. I simply tank heal with (RG, RJ, LB, Nourish - 3 LB simply won't keep a tank up usually) and raid heal with (RG, RJ, LB, WG) hitting the lowest health member in range until he's up.&nbsp; I'm hoping RAWR can help model and improve this.</p>",
    "PostedDate": "2009-10-06T15:44:37.62-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "242757",
    "ThreadId": "70139",
    "Html": "<p>First, a comment: Why do people keep using the word RAWR, it's Rawr, just Rawr.</p>\r\n<p>Second but certainly not least, did you not see the big slider below the Spell usage combo box and Fight Duration slider?</p>\r\n<p>&quot;x Wild Growth Casts per Minute&quot;</p>",
    "PostedDate": "2009-10-06T16:54:48.103-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]