[
  {
    "Id": "239025",
    "ThreadId": "70174",
    "Html": "<p>Here's an example of what I have when hovering over Spell Cycles on the Stats tab, excluding the DPS information:</p>\r\n<p>ABSpam024MBAM</p>\r\n<p>Arcane Power + ABSpam0234MBAM</p>\r\n<p>What does the &quot;024&quot; and &quot;0234&quot; signify? Is that the number of AB stacks I should have prior to casting the MBAM? (As in cast AM as soon as I have at least 0,2, or 4 stacks? If AP is active, can also cast at 3 stacks?)</p>\r\n<p>I've been trying to follow the arcane mage thread over at EJ but it's just not clicking. From what I'm gathering over there I should be casting AB to a minimum of 4 stacks and then casting MBAM if available. If MBAM is not available at the 4-stack I should fish if my mana can support it, otherwise cast ABarr to clear and start over.</p>\r\n<p>If my understanding of the EJ thread is accurate then I'm really confused about the &quot;024&quot; in the RAWR Spell Cycles.</p>\r\n<p>I am using 2-piece T9 and 2-piece T8 so I do not have the issue of the extra MBAM from the T8 4-piece.</p>\r\n<p>Thanks!</p>\r\n<p>PS: Is there a way to make the Spell Cycles frame static so it can be copied or be able to use the mouse for other things while viewing the information?</p>",
    "PostedDate": "2009-09-25T17:15:36.337-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "239035",
    "ThreadId": "70174",
    "Html": "<p>ABSpam024MBAM</p>\r\n<p>Spam AB until you get an MB proc. Use MBAM if you are at 0, 2, or 4 AB stacks.</p>\r\n<p>&nbsp;</p>\r\n<p>Arcane Power + ABSpam0234MBAM</p>\r\n<p>Arcane Power and same as above except you should cast MBAM if you are at 0, 2, 3, or 4 stacks.</p>",
    "PostedDate": "2009-09-25T18:57:46.62-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "239038",
    "ThreadId": "70174",
    "Html": "<p>So I'm reading it right.</p>\r\n<p>Is the &quot;option&quot; of casting at 0, 2, or 4 stacks (without AP) based on mana consumption or should I be casting MBAM as soon as it pops regardless of my mana situation?</p>\r\n<p>Another way: Am I shooting for a 4 stack before casting it (assuming good mana) or reacting as soon as I get the MB proc assuming I have the indicated number of stacks (regardless of mana)?</p>",
    "PostedDate": "2009-09-25T19:28:46.657-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "239042",
    "ThreadId": "70174",
    "Html": "<p>The cycle means to use it as soon as you reach one of the listed stacks.</p>\r\n<p>One thing to keep in mind though is that the Spell Cycles solution tells you what you should do in&nbsp;the average case. I would suggest trying to play around with fight duration, disabling evocation, changing drinking time (simulating starting with less than full mana) and see how that changes the solution. Try to understand how you should adjust your play based on how things turn out in practice.</p>",
    "PostedDate": "2009-09-25T20:03:02.097-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]