[
  {
    "Id": "239197",
    "ThreadId": "70227",
    "Html": "<p>Hello there,</p>\r\n<p>In the newest version of Rawr.Mage, I can see a lot of new slightly different rotations for an Arcane mage, and I'm a bit confused about how they work.</p>\r\n<p>For instance, one of the rotations listed in &quot;Spell Cycles&quot; for my character is ABSpam0234MBAM, which tells me to &quot;Spam AB, MBAM on 0, 2, 3 or 4 stack&quot;</p>\r\n<p>But how exactly am I supposed to cast MBAM on 0 stacks? Since the buff is used up on 2, 3, or 4 stacks, and needs me to cast AB to have a chance of triggering the proc, but at the same time this makes me gain a stack of AB. I do not have the 4-piece T8 bonus, so the MB proc is definitely used up with AMissiles.</p>\r\n<p>So assuming that ABSpam0234MBAM would be the same as ABSpam234MBAM for now, I would imagine that ABSpam1234MBAM is the same as well, because of the use of the casting queue which means that even if MB was triggered on the first cast of AB, the second one would already be underway, and pausing to check for the proc or stopping the second cast to cast AMissiles are both lost dps...</p>\r\n<p>Despite this idea, Rawr lists 0234 and 1234 as having different dps values. Could someone please tell me what's up with this?</p>",
    "PostedDate": "2009-09-26T18:51:54.687-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "239210",
    "ThreadId": "70227",
    "Html": "<p>Arcane Barrage can also proc MB</p>",
    "PostedDate": "2009-09-26T21:12:13.38-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "239217",
    "ThreadId": "70227",
    "Html": "<p>The current live version has arcane cycles for the bugged version of missile barrage (if last AB before MBAM procced it would proc after MBAM and be available after), but this was hotfixed. For now I'd suggest using an older version and enable 3.2.2 mode in options.</p>",
    "PostedDate": "2009-09-26T22:43:13.867-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]