[
  {
    "Id": "239282",
    "ThreadId": "70257",
    "Html": "<p>I would like to present some minor ideas that I feel can improve usability for certain situations:</p>\r\n<p>1. An option to reload just the gear, gems, enchants from Character Profiler or the Armoury - this would allows us to &quot;refresh&quot; our gear whenever we have something new without having to reset some of the stuff (for example without losing the current equipped gear IF not equal to the in the Profiler or Armoury);</p>\r\n<p>2. A new default filter in the item filters that just shows gear that you have. I've been creating one for each new version that comes out albeit in the latest versions this also has a new problem (or I'm doing something wrong) - in the past when using this technique Rawr would pickup the filter the items but still offer all possible options (for gemming, namelly). Now if the item is not gemmed you first have to &quot;include for optimizer&quot; a gemmed version before it shows the gemmed variations. Am I doing something wrong or is this by design?</p>\r\n<p>3. Create a quick export (just like copy-to-clipboard) but including gems and enchants for the items equipped</p>\r\n<p>&nbsp;</p>\r\n<p>By the way I also don't mind to actually code these ideas as long as someone helps me find the way around the code... if this is appropriate, just /whisper me (;))... and I'll get my hands dirty.</p>\r\n<p>Ihodael</p>\r\n<p>PS: Thanks for the great work... number 1 tool for any serious WoW gamer... :D</p>",
    "PostedDate": "2009-09-27T09:55:36.75-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "239291",
    "ThreadId": "70257",
    "Html": "<p>1. Tools &gt; Reload from Armory / Character Profiler.</p>\r\n<p>2. Definitely on my list; there's a 'Current Gear / Enchants / Buffs' chart which shows everything equipped, and I want to add an 'Available Gear / Enchants / Gems' chart, which shows everything available.</p>\r\n<p>3. Try exporting 'Current Gear / Enchants / Buffs'.</p>\r\n<p>&nbsp;</p>\r\n<p>Sure, more help is always welcome. Get the codebase running locally, poke around a bit, and feel free to ask me questions.</p>",
    "PostedDate": "2009-09-27T11:03:43.073-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "239423",
    "ThreadId": "70257",
    "Html": "<p>1. I know about the reload from armory/character profiler - but you loose some the setting when doing this, namely your the talent set you had previous to the reload and the gear equipped prior to the reload. My point was just refreshing the available gear without touching any other thing - ofc I also understand that the codebase is probably shared therefore I feel two options would be more appropriate so current functionality would still be offered while a new option just to refresh available gear would also be available;</p>\r\n<p>3. Was unaware of the option. Thank you.</p>\r\n<p>I'll download the codebase and tweak around with idea number 1 and get back to you with questions as soon as I have the time. Do you post the questions here or directly to you?</p>\r\n<p>By the way another idea was to import the character data not only from armoury/character profiler but also from Altoholic which I believe to have a fairly reasonable &quot;customer base&quot;. Is anyone working on this?</p>\r\n<p>Ihodael</p>",
    "PostedDate": "2009-09-28T01:03:52.327-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "239612",
    "ThreadId": "70257",
    "Html": "<p>Here's an idea for optimizer: How about adding a step at the end to <strong>match the optimizer results to your current setup as close as possible in terms of gemming</strong>? You can make this an option (checkbox) on the optimizer screen so that I'll only check it once I know I have a good, final result.</p>\r\n<p>The problem right now is that optimizer doesn't care what your current setup is, so it'll shift around gems unnecessarily when it comes up with an equal or better result. This is fine for when the result is the same as your current gear, you simply don't do anything. But when you do get a new optimized setup, it's hard to tell if you really have to regem all the different items it marks or if you can swap gems around in your mind and come up with the same result.</p>\r\n<p>This is especially a problem for Jewelcrafters, who can only have three Dragon's Eyes at a time...so shifting existing gems around in the optimizer results when they're not necessary is a headache.</p>\r\n<p>Hope this makes sense. If you need more explanation I'm happy to provide it.</p>",
    "PostedDate": "2009-09-28T10:22:45.57-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "239621",
    "ThreadId": "70257",
    "Html": "<p>Questions are fine here. I'm also dubious about Altoholic; nobody I know has even heard of it. *shrug*</p>\r\n<p>Regarding the optimizer swapping gems, yeah, we want to fix that, it's just not a quickly fixable thing, but we'll get to it.</p>",
    "PostedDate": "2009-09-28T10:36:52.73-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "239650",
    "ThreadId": "70257",
    "Html": "<p>I've actually been using Altoholic for quite some time. It's a mod that allows you to view information from your different alts, including what trade skills they have (you can actually link your trade skill list on a different alt from the one you are looking up. For example I can link my Priest's JC trade skill on my mage to guildies. It does this by splitting up the information into small chunks. They just recently (like within the last month or two) split up the information. It used to be all in one file, so the memory usage was huge, now I'm barely breaking 1-2 megs in game from the mod. It also saves information on what is in people's bags/banks. If you want I can upload my bag file to give you an idea of how it's is used. I know on Curse.com it's one of their top mod downloads.</p>\r\n<p>&nbsp;<a href=\"http://wow.curse.com/downloads/wow-addons/details/altoholic.aspx\">http://wow.curse.com/downloads/wow-addons/details/altoholic.aspx</a>&nbsp;for the mod itself</p>\r\n<p>The mod uses the &quot;Datastore&quot; series mods to save it's information.&nbsp;So <a href=\"http://www.megaupload.com/?d=3BVXKHUQ\">http://www.megaupload.com/?d=3BVXKHUQ</a>&nbsp;is what&nbsp;I&nbsp;currently have in my&nbsp;currently equipped items&nbsp;file. <a href=\"http://www.megaupload.com/?d=SDCT80M7\">http://www.megaupload.com/?d=SDCT80M7</a>&nbsp;is what is used for bags</p>",
    "PostedDate": "2009-09-28T11:38:51.123-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "239769",
    "ThreadId": "70257",
    "Html": "<p>Altoholic is a fantastic mod, one of the few that I personally keep enabled across every single character.&nbsp; Hinalover hit on all of the big points, but particularly relevant is the note about the &quot;Datastore&quot; set of addons that well, stores the data.&nbsp; If you use Carbonite, it's sort of similar to the Warehouse part of that package, but arguable even more powerful.&nbsp; It also boasts a rather large user base (check the download numbers on Curse and WowInterface).</p>\r\n<p>I don't believe that Altoholic saves exact info (current enchants, gems), but that shouldn't really be much of an issue.</p>",
    "PostedDate": "2009-09-28T18:23:06.58-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "253218",
    "ThreadId": "70257",
    "Html": "<p>I cant get the rpgo profiler to work anymore. I really like Altoholic and would like to see an import option for it in Rawr.</p>\r\n<p>Things like enchants and gems dont really matter, but if they really are missing in the raw data i think we can ask thaoky (datastore/altoholic) to include it .</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-11-04T04:52:33.197-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "253608",
    "ThreadId": "70257",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>BrWarner wrote:</strong><br>\r\n<p>Altoholic is a fantastic mod, one of the few that I personally keep enabled across every single character.&nbsp; Hinalover hit on all of the big points, but particularly relevant is the note about the &quot;Datastore&quot; set of addons that well, stores the data.&nbsp; If you use Carbonite, it's sort of similar to the Warehouse part of that package, but arguable even more powerful.&nbsp; It also boasts a rather large user base (check the download numbers on Curse and WowInterface).</p>\r\n<p>I don't believe that Altoholic saves exact info (current enchants, gems), but that shouldn't really be much of an issue.</p>\r\n</blockquote>\r\n<p>I don't know if it still matters, but I believe it doesn't carry over gems and enchants - or at least, it doesn't display them when viewing one toon's equipment from another toon.</p>",
    "PostedDate": "2009-11-04T21:34:35.58-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "253621",
    "ThreadId": "70257",
    "Html": "<p>Actually it does. If you look at the DataStore_Inventory.lua file in your general SavedVariable WTF folder, You will see what each character is wearing. As an example from my mage, I have the Skyweaver Robes worn. According to the dataStore file, this is the line that shows that:</p>\r\n<p>&quot;|cffa335ee|Hitem:47126:3832:3545:3563:0:0:0:1276628928:80|h[Skyweaver Robes]|h|r&quot;, -- [5]</p>\r\n<p>47126 is the item number of the Skyweaver Robes<br>3832 is my 10 stat enchant<br>3545 is my 12 SP/10 Spirit gem<br>3563 is my 12 SP/10 Haste gem</p>\r\n<p>Now I'm not 100% sure how those gem numbers come from considering those numbers are not the gem item IDs and I was not able to find an &quot;Aura id&quot; of sorts for it. I could be looking in the wrong part of WoWhead though but that was my understanding on how the linking worked.</p>",
    "PostedDate": "2009-11-04T22:45:58.52-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]