[
  {
    "Id": "239531",
    "ThreadId": "70328",
    "Html": "<p>Hi, I've gone through the past discussions and don't see an explanation of why leather armor is shown as upgrades to plate.&nbsp; How can the lower armor rating and lack of strength on leather surpass plate armor?&nbsp; Is leather truly a viable alternative to plate for a blood dps dk?</p>\r\n<p>Thanks.</p>",
    "PostedDate": "2009-09-28T07:42:02.107-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "239538",
    "ThreadId": "70328",
    "Html": "<p>Sometimes, yes, it is. Every once in a while a piece of leather or two will be phenomenally well-itemized while all other plate options will be less well-itemized. For example, Vest of Shifting Shadows is extremely well-itemized for blood and frost: crit, AP, and ArP are three of the strongest stats, agility is decent due to the vast majority of damage coming from melee (ie non-spell) abilities, it doesn't have a ton of item budget wasted in stamina (48 less stamina than titanium razorplate, for example). Yes, the leather pieces almost always end up having less total attack power, but the secondary stat gains can (and occasionally do) outweigh the loss of AP.</p>",
    "PostedDate": "2009-09-28T07:57:20.973-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "239563",
    "ThreadId": "70328",
    "Html": "<p>Thanks for such a quick reply!&nbsp; So, even not getting strength on the leather items and thus, a loss on those buffs based on strength, results in the leather being better than plate.&nbsp; I'm amazed, to say the least!&nbsp; It seems that strength which translates into about 10% more AP than straight AP, would be preferable over the AP-oriented leather.&nbsp; I know the DKDPS Rawr model is well-developed and been around for a while, but I'm still surprised by the results!</p>",
    "PostedDate": "2009-09-28T08:40:23.423-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "239566",
    "ThreadId": "70328",
    "Html": "<p>Note that this isn't the general rule, it's just that it occurs *sometimes* so it's marked as an option you can show, DPSWarr has the same thing.</p>",
    "PostedDate": "2009-09-28T08:45:12.657-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "239586",
    "ThreadId": "70328",
    "Html": "<p>OK, thanks to both of you for your rapid responses.</p>",
    "PostedDate": "2009-09-28T09:15:08.67-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]