[
  {
    "Id": "239710",
    "ThreadId": "70378",
    "Html": "<p>Hello</p>\r\n<p>Maybe I'm being dense, but I can't switch the filter to allow one-hand weapons in Bear or Cat. Am I missing something? It's grayed out/closed for input.</p>\r\n<p>Also, in edit items where do I find FAP? Does RAWR calculate this for me automatically?</p>\r\n<p>Thanks</p>",
    "PostedDate": "2009-09-28T14:24:30.3-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "239737",
    "ThreadId": "70378",
    "Html": "<p>Guessing this is a troll, but if it's not...</p>\r\n<p>A) Rawr.Cat/Bear do not allow you to see/equip 1H weapons, <strong>because that would be dumb.</strong></p>\r\n<p>B) FAP is calculated based on Weapon DPS.</p>",
    "PostedDate": "2009-09-28T16:06:15.65-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "239745",
    "ThreadId": "70378",
    "Html": "<p>What is with people trying to use 1 handers as a feral these days. &nbsp;Do we really want to go back to the AQ40 &quot;Oh mah gawd I still haz a blue offhand with mah epic mace that the warriors want&quot; style of gearing? &nbsp;Personally, I enjoy taking polearms from those dirty hunters.</p>",
    "PostedDate": "2009-09-28T16:27:12.063-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "240045",
    "ThreadId": "70378",
    "Html": "<p>Thanks, not a troll.</p>\r\n<p>I run with a small group of friends and have cat offspec. I'm fairly fresh level 80 gearing up my bear. Some onehand weapons &quot;APPEAR&quot; to be better DPS than the current tank staff I have [appearances can be deceptive though, I used wowhead to compare and saw in this particular situation that my tank staff was still better although much lower iLevel]. And I never roll on something some-one else needs, btw. Since we don't PvP or do raids I was curious about RAWR not doing it. I am aware that the offhand frills are retarded. So there is a reason for asking.&nbsp;  I would love to have the best two handed DPS feral weapon out there :), time, lucky drops and money permitting.</p>\r\n<p>Take care</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-09-29T08:45:36.817-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "240203",
    "ThreadId": "70378",
    "Html": "<p>As I posted in the other thread on the front page about this exact topic, run ToC or do Tournament Dailys for a few days and you can get a feral staff that blows away all but the very best high ilevel raid one-hander in the game (or you could have Marrowstrike drop from heroic ToC ).&nbsp;&nbsp; There is no reason to be using a one-hander unless Blizzard make massive changes to the game.</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-09-29T16:35:08.087-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "240588",
    "ThreadId": "70378",
    "Html": "<p>Glad you're not a troll. Yeah, 1Hs are not available in Rawr.Cat or .Bear, because they are not even remotely viable, and would only slow the performance of Rawr for all ferals.</p>",
    "PostedDate": "2009-09-30T12:09:59.577-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "240604",
    "ThreadId": "70378",
    "Html": "<p>Trolls can be druid in Cataclysm :(</p>",
    "PostedDate": "2009-09-30T12:55:12.04-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]