[
  {
    "Id": "239720",
    "ThreadId": "70381",
    "Html": "<p>I just did some initial implementation for changing the graph from Survival, Mitigation and Threat to Burst Time and Reaction Time for those people who like to view and itemize around those theories.&nbsp; With the default options, Burst time will be VERY large and completely eclipse the Reaction time values.&nbsp; To deal with this, increase the incoming damage from like 10k to 40k or higher.&nbsp; You will see a dramatic shift from Survival to Mitigation in the gear selections.&nbsp; (Before or after you actually change the graph).&nbsp; The gear will be far more optimized against raw Effective Health (Survival) and much more for mitigation (Avoidance).&nbsp; I also currently don't have all the kinks worked out of this system, however, if you find any issues, please right them up in the defect tracker.</p>\r\n<p>There are new Boss models that are coming down the pipe so that we can better deal with the possible different boss scenarios and allow the user to gear to best handle those bosses.&nbsp; Once they are ready, I will be adjusting the generic boss fight values to be very specific.&nbsp; 10k incoming raw damage isn't realistic anymore with some of the higher-end bosses rating at 50k and above.&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>Let me know what you think.</p>",
    "PostedDate": "2009-09-28T14:59:51.88-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "240042",
    "ThreadId": "70381",
    "Html": "<p>I like the sound of moving away from the current Mitigation/Survival ratings into Burst time and Reaction time. The one potentially major issue I see with weighting gear a lot more towards avoidance (which the boss model implementations will fix) is a lot of the encounters where bosses ARE hitting for such large amounts on tanks (Gormok on Northrend Beasts, Anub'Arak), are situations where the damage is unable to be mitigated (Steelbreaker's Fusion Punch, Thorim's Unbalancing Strike, Gormok's Impale + Bleed Effect, Anub'arak's Stun + Hit combos).</p>\r\n<p>Hopefully I'll have better feedback when I see the full implementation.</p>",
    "PostedDate": "2009-09-29T08:43:13.987-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]