[
  {
    "Id": "239747",
    "ThreadId": "70392",
    "Html": "<p>rawr figures out my talents fine on my mage.</p>\r\n<p>However I put in my level 72 DK frost tank. Specified that it was a tank. Sorted items for threat.</p>\r\n<p>Told rawr to optimize, slider max, clicked talents. Rawr does not figure talents.</p>\r\n<p>Tried several configurations.</p>\r\n<p>Used talents as they were, reset them to zero etc.</p>\r\n<p>Also rawr is recommending 80 gear for my 72 dk, is there anyway to filter it for gear I can actually use?</p>\r\n<p>&nbsp;</p>\r\n<p>Is there anyway to makie it figure talents for dks? and&nbsp;recommend&nbsp;gear usable by level 72</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-09-28T16:38:55.757-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "239776",
    "ThreadId": "70392",
    "Html": "<p>Many models do not support optimizing of talents.&nbsp; It's extremely finicky business.</p>\r\n<p>Rawr is designed and solely supported for level 80 characters.</p>\r\n<p>&nbsp;</p>\r\n<p>Please search for your issues before posting a new Discussion.</p>",
    "PostedDate": "2009-09-28T19:34:37.853-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "239967",
    "ThreadId": "70392",
    "Html": "<p>There is some valuation of DK talents in the Tank module, but as mentioned, it's not a complete solution.&nbsp; EG... how do you evaluate the improved tanking ability provided by Icy Reach.&nbsp; There are many talents that just don't have a good model. Also, the Mage module that I'm aware of that supports more than level 80 talents.&nbsp;</p>\r\n<p>Also, if you're just looking for threat, then really you want the DPSDK model.&nbsp; Since threat is such a small part of the over-all tanking picture.&nbsp; Threat is usually the last thing a new Tank DK needs to worry about.&nbsp; First get over those critical points: Reaching uncritable, then starting to work on getting your survival &amp; mitigation numbers where they should be.&nbsp; Generally if you've geared or talented for threat with a fresh 80, you've usually gimped on those necessary &quot;keep-me-alive&quot; aspects that make a tank what it's supposed to be.&nbsp; If you happen to be lucky enough to be tanking heroics with some Ulduar+ geared DPS, and they're pulling off of you, then it's their job to throttle their DPS to match then threat that you can generate.&nbsp;</p>",
    "PostedDate": "2009-09-29T06:24:47.917-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]