[
  {
    "Id": "240449",
    "ThreadId": "70594",
    "Html": "<p>In Rawr v2.2.1.9 haste is rated way to high, and crit way to low</p>\r\n<p>For example,</p>\r\n<div id=\"_mcePaste\" style=\"left:-10000px;top:0px;width:1px;height:1px;overflow-x:hidden;overflow-y:hidden\">Band of the Invoker</div>\r\n<div id=\"_mcePaste\" style=\"left:-10000px;top:0px;width:1px;height:1px;overflow-x:hidden;overflow-y:hidden\">+58 Stamina</div>\r\n<div id=\"_mcePaste\" style=\"left:-10000px;top:0px;width:1px;height:1px;overflow-x:hidden;overflow-y:hidden\">+58 Intellect</div>\r\n<div id=\"_mcePaste\" style=\"left:-10000px;top:0px;width:1px;height:1px;overflow-x:hidden;overflow-y:hidden\">+50 Spirit</div>\r\n<div id=\"_mcePaste\" style=\"left:-10000px;top:0px;width:1px;height:1px;overflow-x:hidden;overflow-y:hidden\">Equip: Improves haste rating by 50 (1.52% @ L80).</div>\r\n<div id=\"_mcePaste\" style=\"left:-10000px;top:0px;width:1px;height:1px;overflow-x:hidden;overflow-y:hidden\">Equip: Increases spell power by 89.</div>\r\n<div id=\"_mcePaste\" style=\"left:-10000px;top:0px;width:1px;height:1px;overflow-x:hidden;overflow-y:hidden\">Vs.</div>\r\n<div id=\"_mcePaste\" style=\"left:-10000px;top:0px;width:1px;height:1px;overflow-x:hidden;overflow-y:hidden\">Polished Dragonslayer's Signet</div>\r\n<div id=\"_mcePaste\" style=\"left:-10000px;top:0px;width:1px;height:1px;overflow-x:hidden;overflow-y:hidden\">+61 Stamina</div>\r\n<div id=\"_mcePaste\" style=\"left:-10000px;top:0px;width:1px;height:1px;overflow-x:hidden;overflow-y:hidden\">+56 Intellect</div>\r\n<div id=\"_mcePaste\" style=\"left:-10000px;top:0px;width:1px;height:1px;overflow-x:hidden;overflow-y:hidden\">+36 Spirit</div>\r\n<div id=\"_mcePaste\" style=\"left:-10000px;top:0px;width:1px;height:1px;overflow-x:hidden;overflow-y:hidden\">Equip: Improves critical strike rating by 53 (2.4% @ L70).</div>\r\n<div id=\"_mcePaste\" style=\"left:-10000px;top:0px;width:1px;height:1px;overflow-x:hidden;overflow-y:hidden\">Equip: Increases spell power by 89.</div>\r\n<div>Band of the Invoker</div>\r\n<div>+58 Stamina</div>\r\n<div>+58 Intellect</div>\r\n<div>+50 Spirit</div>\r\n<div>Equip: Improves haste rating by 50 (1.52% @ L80).</div>\r\n<div>Equip: Increases spell power by 89.</div>\r\n<div>Vs.</div>\r\n<div>Polished Dragonslayer's Signet</div>\r\n<div>+61 Stamina</div>\r\n<div>+56 Intellect</div>\r\n<div>+36 Spirit</div>\r\n<div>Equip: Improves critical strike rating by 53 (2.4% @ L70).</div>\r\n<div>Equip: Increases spell power by 89.</div>\r\n<div>Its&nbsp;obvious&nbsp;that the Polished Dragonslayer ring is&nbsp;better, altho Rawr 2.2.1.9 rates Band of the invoker ~15dps higher in my current gear.</div>\r\n<div></div>\r\n<div>Im not sure this is intended, but it is wrong.</div>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-09-30T08:00:19.3-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "240565",
    "ThreadId": "70594",
    "Html": "<p>It has been mentioned before but the Shadow Priest module has an issue where once you hit 15% haste it acts as though your haste cap, which is not intended. They are working on the haste mechanics in the module though, so hopefully soon (tm).</p>",
    "PostedDate": "2009-09-30T11:09:35.31-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "240615",
    "ThreadId": "70594",
    "Html": "<p>Its not directly a cap. Its a dip in usefulness due to a rotation change which gives worse dps. I'm going to try to add better deferment cost calculations to see if that fixes the haste problems.</p>\r\n<p>&nbsp;</p>\r\n<p>I also discussed with a shadowpriest, and we agreed that certain haste values can increase deferment cost of spells further down the pipeline, and thus actually does end up lowering the value of haste at certain points for humans, to the point where you may end up losing dps. I think I am going to add a warning to Rawr with an explanation so that players try to stay away from those haste values.</p>",
    "PostedDate": "2009-09-30T13:25:25.45-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "240732",
    "ThreadId": "70594",
    "Html": "<p>Nice to know use are onto it, Thanks.</p>\r\n<p>&nbsp;</p>\r\n<p>Munty.</p>",
    "PostedDate": "2009-09-30T21:39:08.707-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "242567",
    "ThreadId": "70594",
    "Html": "<p>I am still working on this, but there should be some improvement already in next release.</p>",
    "PostedDate": "2009-10-06T07:56:12.203-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "242616",
    "ThreadId": "70594",
    "Html": "<p>I suggest you consult shadowpriest.com for all things related to shadowpriest mechanics.</p>\r\n<p>http://www.shadowpriest.com/viewtopic.php?f=62&amp;t=22720</p>\r\n<p>A general ranking in pseudospower goes like:</p>\r\n<p><strong>3.2.2 Scaling factors</strong></p>\r\n<p>1 SP = 1<br style=\"padding:0px;margin:0px\">1 Crit = 0.76<br style=\"padding:0px;margin:0px\">1 Haste = 0.65<br style=\"padding:0px;margin:0px\">1 Spi = 0.34<br style=\"padding:0px;margin:0px\">1 Int = 0.23<br style=\"padding:0px;margin:0px\">1 Hit = 1.58</p>",
    "PostedDate": "2009-10-06T09:57:20.153-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "242618",
    "ThreadId": "70594",
    "Html": "<p>Rawr <strong>still </strong>doesn't use relative stat weights.</p>",
    "PostedDate": "2009-10-06T10:03:00.083-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "243279",
    "ThreadId": "70594",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>TNSe wrote:</strong><br>\r\n<p>I am still working on this, but there should be some improvement already in next release.</p>\r\n</blockquote>\r\n<p>As of version 2.2.21, Rawr is still ranking Abyssal Rune quite a bit higher than superior trinkets, like Eye of the Broodmother.</p>\r\n<p>Shadowpriest gear rankings:&nbsp;http://www.shadowpriest.com/viewtopic.php?f=62&amp;t=22720</p>\r\n<p>Discoveries like that make me question all of Rawr's optimizations.</p>",
    "PostedDate": "2009-10-07T23:41:32.023-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "243283",
    "ThreadId": "70594",
    "Html": "<p>I said improvement, not perfect. The reason for such occurances like this is that occationally some values of haste give a bit boost in (simplicity of) rotations, leading to higher dps due to less chance of making wrong choices in what spells to cast. You can change the slider for Game/Brain Latency to see if this changes things around a lot in order to see if its hitting an amount of haste which is getting a bit too high results.</p>\r\n<p>&nbsp;</p>\r\n<p>Also, sadly enough, I don't give a rats ass about shadowpriest.com's rankings. Not saying they got it wrong, just saying I don't give a crap about them.</p>",
    "PostedDate": "2009-10-07T23:56:15.727-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "243291",
    "ThreadId": "70594",
    "Html": "<p>Trevar, you can't just point at shadowpriest.com as gospel, you know. We care about actual mechanics, theorycraft, and logic. Those 'gear ranking's are inaccurate <strong><em>by design</em><span style=\"font-weight:normal\">.</span></strong></p>\r\n<p><strong><span style=\"font-weight:normal\">And your very example, Abyssal Rune vs Eye of the Broodmother, sounds extremely questionable. Abyssal Rune is an amazing trinket, and very likely better than Eye of the Broodmother; definitely is for many casters, not sure about spriests in particular. But it's certainly not some 'oh, that's obviously wrong' situation.</span></strong></p>\r\n<p>&nbsp;</p>\r\n<p><strong><span style=\"font-weight:normal\">That's not to say that you're wrong, just that we need you to back up what you're saying.</span></strong></p>",
    "PostedDate": "2009-10-08T00:23:29.15-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "243526",
    "ThreadId": "70594",
    "Html": "<p>It seems the game/brain latency setting has a *very strong* influence on the haste effect for shadow priests.</p>\r\n<p>With a 91ms setting and my current gear Rawr 2.2.21 rates haste at 40.33 (!) dps per rating - with a 92ms setting it's about 1.40.</p>\r\n<p>I assume this is due to a changed cast rotation which yields in this dramatic variation.</p>\r\n<p>&nbsp;</p>\r\n<p>However this effect needs to be somehow averaged because otherwise you can't really use rawr to evaluate shadow gear anymore since items with haste jump all over the place...</p>",
    "PostedDate": "2009-10-08T09:48:25.487-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "243581",
    "ThreadId": "70594",
    "Html": "<p>Isli, I think you may be mistaking Relative Stat Values for something Rawr actually uses in its calculations. You'll see some stats, <strong>especially haste</strong>, jump all over the place in Relative Stat Values, due to the nature of it showing only the next/last few haste rating. When comparing gear, you're changing larger quantities of Haste, so it does smooth out.</p>",
    "PostedDate": "2009-10-08T12:27:16.173-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "243585",
    "ThreadId": "70594",
    "Html": "<p>It does smooth out somewhat, however you still get large variations for item dps values at specific points.</p>\r\n<p>99 ms</p>\r\n<p>&nbsp;conductive seal: ~271 dps</p>\r\n<p>100 ms</p>\r\n<p>&nbsp;conductive seal: ~204 dps</p>",
    "PostedDate": "2009-10-08T12:44:16.673-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "243618",
    "ThreadId": "70594",
    "Html": "<p>I don't know an awful lot about Shadow Priest theory but I came across this thread when I found Rawr was ranking Haste higher than Crit.</p>\r\n<p>Now, correct me if i'm wrong; SP and Crit scale with our DoTs, however Haste does not. Haste effects all of our other abilities, as does SP and Crit. To that effect, I would naturally assume that 1 point of crit would be a lot better than 1 point of haste?</p>\r\n<p>Currently, I'm running with 20.68% crit and 302 Haste. My DPS is great, I have no complaints. I use Rawr to compare gear and gear sets but I can't understand exactly how these stat values work and how they benefit my spells and my rotations.</p>\r\n<p>Using the Brain/Game latency slider, I see my Stat Values jumping all over the place and Rawr doesn't tell me why this is happening. Would it not be possible to allow Rawr to output it's rotation or at least simplify this variable?</p>\r\n<p>Thanks.</p>",
    "PostedDate": "2009-10-08T14:59:22.377-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "243624",
    "ThreadId": "70594",
    "Html": "<p>Haste affects lots of spells, in very odd ways, because it changes your rotation. Haste *does* affect your dots' damage per cast time.</p>",
    "PostedDate": "2009-10-08T15:25:56.14-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "243637",
    "ThreadId": "70594",
    "Html": "<p>So I guess the question is: is there a somewhat consistent way to rate haste? In Rawr or even the game itself.</p>",
    "PostedDate": "2009-10-08T16:03:05.367-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "243644",
    "ThreadId": "70594",
    "Html": "<p>One issue that TNSe's working on solving right now is that at a few small ranges of haste, it actually pushes you into a rotation that ends up being lower DPS than if you had less haste. Of course, the obvious response to this, is that while technically accurate, you don't *have* to use that extra haste; you can just pause slightly longer after each spell, and still use the previous rotation. However, sometimes those key pauses need to be made 30+sec before where they actually matter, so that a typical player would never actually know not to use that haste when they can. Still, from a gear rating standpoint, it just seems odd that haste could actually lower your DPS.&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>Another thing we can do is to model the variability of server/brain lag. For example, in-game, haste is effectively smoothed somewhat by how much latency can vary, and brain lag can vary. We could do something like have a 'lag variance' setting, which would do the whole set of calculations twice, one with latency + lag variance, and once with latency - lag variance, and average the results. However, that still leaves those dips and spikes in the value of haste, they're just smoothed, rather than filled in like above.</p>",
    "PostedDate": "2009-10-08T16:16:42.483-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "243647",
    "ThreadId": "70594",
    "Html": "<p>Wouldn't adding random variability and averaging solve the &quot;more haste=less dps&quot; problem as well? And it is probably closer to &quot;reality&quot; anyway.</p>\r\n<p>The drawback is of course that those averaged random values aren't 100% reproducable, i.e. the same gear would yield in slightly diferent dps output (according to rawr), but i think this is more acceptable than those jumping item values.</p>",
    "PostedDate": "2009-10-08T16:36:05.357-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "243650",
    "ThreadId": "70594",
    "Html": "<p>As I said in my previous post; it would be nice to have Rawr show me it's rotation with Cast Times and Pause Times so that I am able to achieve an effective value of haste or somewhere between.</p>\r\n<p>Perhaps something like this can be incorporated into the Fight Time and Latencies?</p>",
    "PostedDate": "2009-10-08T16:42:14.147-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "243652",
    "ThreadId": "70594",
    "Html": "<p>Well I suppose it does show the &quot;rotation&quot; used to caclculate the dps values: in the stats tab hover your mouse over the Castlist entry and you'll get a popup list.</p>",
    "PostedDate": "2009-10-08T16:48:37.647-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "243661",
    "ThreadId": "70594",
    "Html": "<p>I should of said spell casts instead of rotation. Rotations are static, however I would really like to see Rawr casting.</p>",
    "PostedDate": "2009-10-08T17:37:49.65-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "243801",
    "ThreadId": "70594",
    "Html": "<p>Well the way Rawr calculates the DPS is static: &nbsp;Apparently it follows the priority list until it finds a repeating pattern and then uses that (usually 40-80 spells long) rotation to calculate DPS. This is the list you see when hovering over the castlist entry - it does not contain timing information though.</p>\r\n<p>The adavantage of this aproach is that it is pretty fast - radomizing and averaging the process would be a lot more expensive.</p>",
    "PostedDate": "2009-10-09T02:40:21-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "243814",
    "ThreadId": "70594",
    "Html": "<p>I could add timing info, but I'd prefer it more if I actually could improve the UI so that it is easier to view. Sorta like Event Horizon or something. Putting it in the tooltip was just a quick solution.</p>\r\n<p>&nbsp;</p>\r\n<p>And yes, Isli is right. Rawr simply goes through priority list just like a player does, but it notices when you are making a repeating pattern. This improves calculation speed, and also gives a &quot;static rotation&quot;, although they are usually a bit long.</p>",
    "PostedDate": "2009-10-09T03:28:48.377-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "243955",
    "ThreadId": "70594",
    "Html": "<p>While a better UI is nice, it doesn't solve the fundamental problem of Rawr picking one pattern resulting in sometimes dramatic item value changes with slight parameter modifications.</p>\r\n<p>&nbsp;</p>\r\n<p>Unfortunately I have no idea how to change this except for multiple randomized runs and averaging which would kill performance...</p>",
    "PostedDate": "2009-10-09T10:09:27.07-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "243970",
    "ThreadId": "70594",
    "Html": "<p>I do have an idea on how to improve upon this without dramatically lowering performance, by iterating a few more steps deeper to see how spells compare.</p>\r\n<p>&nbsp;</p>\r\n<p>Problem with this is, its not realistically how a Human plays. &nbsp;Right now I try to keep things as close to as how a Human make their choices as possible. I might also try to change how it works entirely and discard some accuracy on other stats for more reliable haste stats.</p>\r\n<p>&nbsp;</p>\r\n<p>Keep up the feedback. Even feedback about how things are bad is good as long as you understand that I'm not trying to give you bad results on purpose, but thats just how it is right now until I find better ways to do it :P</p>",
    "PostedDate": "2009-10-09T10:46:24.88-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "244003",
    "ThreadId": "70594",
    "Html": "<p>&nbsp;</p>\r\n<p>Well here's an idea - if you'd move away from trying to simulate working with a priority list you could try simply dividing combat time to the spells, e.g.</p>\r\n<p>&nbsp;</p>\r\n<p>1) calculate the GCD plus lag (let's assume 1.4s GCD + 0.1 ms lag -&gt; 1.5 lGCD)</p>\r\n<p>2) devide combat time by lGCD ( say 300 seconds, 1.5 lGCD -&gt; 200 lGCDs )</p>\r\n<p>3) detremine the number of MB possible and adjust fpr how well the lGCD fit in the CD ( 300/7 -&gt; 42.8, assuming 42 here)</p>\r\n<p>4) calculate the number of lGCDs needed to keep each Dot up (DP: 12.5 VT:20 SWP:1)</p>\r\n<p>5) calculate the number of DoT ticks (100) minus lag*casts minus some extra percentage to &quot;simulate&quot; higher priority spells or movement preventing timely recast.</p>\r\n<p>6) maybe throw in some GCDs used for SW:D while runing an subtract some for movement</p>\r\n<p>7) subtract lGCDs used for shadowfiend, and dispersion.</p>\r\n<p>7) assign the remaining lGCDs to mindflay (200-42-12.5-20-1)-&gt; 125.5 - 17.5 (wasted. dispersion, fiend) -&gt; 54 MF</p>\r\n<p>8) sum up the damage done by the Dot ticks, and spells and divide by total time to get the DPS.</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;Of course this need a lot more refining especially when it comes to proccs, heroism, mana costs, etc.</p>\r\n<p>&nbsp;</p>\r\n<p>This is an artificial approach that calculates the number of possible spells and treats the complex interference of CDs and Dot run times more or less as a percentage loss.</p>\r\n<p>This percentage may be too high or low given the actual complexity of the rotation and the player but it is at least somewhat consistent and while it may not give you the actual top DPS possible with your gear it may lead to better comparability of stats by avoiding simulated sweet spots for certain stats and values.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-10-09T12:42:48.463-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "244009",
    "ThreadId": "70594",
    "Html": "<p>What your refering to is similar to how the Cat dps is calculated. However there has been some extremely critical discussion on it's validity on it's rotation logic recently. There is now talks of it using a different logic rotation formula. One that is more difficult for others to comment/test but would give a more accurate evaluation. Cat dps is more priority based than Shadow Dps but the new rotation logic would also work with this but again the testing would be more difficult to calculate.</p>",
    "PostedDate": "2009-10-09T13:11:16.82-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "244043",
    "ThreadId": "70594",
    "Html": "<p>I'm not a shadowpriest, but I can't see how increasing haste could ever *actually* decrease your DPS, because you could always just delay between casts (ie, if haste makes your GCD go from 1.5 to 1.48, just continue to cast every 1.5). &nbsp;I've only looked briefly at the code;&nbsp;how is haste changing your rotation? &nbsp;Is it following the same spell priority, regardless of haste, but the changing cast times means that your spell order changes?</p>\r\n<p>If so, what about dynamically computing the spell priority, rather than relying on a list (and then displaying the new spell priority to the user). &nbsp;Compute the DPS of the spell if it's chain-cast (or chain-refreshed in the case of DOTs), and then compute the DPS lost if you delay it by one GCD. &nbsp;Sort them from most lost to least lost (keeping in mind things like &quot;I need to keep this spell up all the time because it's a raid utility&quot;), and then use that as your priority list.</p>\r\n<p>Then, if adding a stat like haste winds up decreasing the DPS of your priority list, it's probably because your priority list has changed. &nbsp;I know that this happens for other classes (one ability overtaking another in priority).</p>",
    "PostedDate": "2009-10-09T14:50:42.933-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "244054",
    "ThreadId": "70594",
    "Html": "<p>I've been working with TNSe last week on this and while it is clear more haste shouldn't be able to lower your dps, being able to compute the optimal spell selection logic is far from trivial. I've helped write a solver that takes into account first order collision effects and pauses, but to get to a true optimum where you have no dips in dps you'd probably need a complete dynamic programming solver over the fight duration (I'm guessing this is the better option to a markov process solution since there are no important&nbsp;random events and the state space is larger than what you would see in a single&nbsp;fight duration). As far as I know these new changes are not yet live.</p>",
    "PostedDate": "2009-10-09T15:32:53.477-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "244057",
    "ThreadId": "70594",
    "Html": "<p>It can change the order of spells since you have DoTs and CDs which don't scale with haste. So more haste may make you use a different spell since &nbsp;the one you used in a rotation with less haste is not ready yet. This may cause &quot;slack&quot; time later and decrease your DPS.</p>\r\n<p>This is mainly a problem in single pass simulations since human players introduce more randomness into those rotations.</p>",
    "PostedDate": "2009-10-09T15:46:24.667-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "249465",
    "ThreadId": "70594",
    "Html": "<p>I'm a shadowpriest and have often run into haste vs crit decisions.&nbsp; Since the latency setting in RAWR affects the decision so much, what is a good value to use?&nbsp; My in-game performance monitor says I typically have a latency of 80-120 ms.&nbsp; However, that doesn't take into account a slow brain and clumsy fingers.&nbsp; I currently leave the RAWR setting at 100 ms but should I increase it to take account of the human factor and if so what would you recommend as a good value?</p>",
    "PostedDate": "2009-10-25T07:14:20.77-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "249471",
    "ThreadId": "70594",
    "Html": "<p>I defaulted it to 350 after discussing with various people, including a guy that has to know how much humans have in reaction time to reconstruct accidents. &gt;_&lt;</p>",
    "PostedDate": "2009-10-25T08:54:41.697-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "249510",
    "ThreadId": "70594",
    "Html": "<p>Thanks for the info.</p>",
    "PostedDate": "2009-10-25T11:16:47.543-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "249523",
    "ThreadId": "70594",
    "Html": "<p>http://www.bbc.co.uk/science/humanbody/sleep/sheep/reaction_version5.swf&nbsp; ;)</p>",
    "PostedDate": "2009-10-25T12:18:09.137-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "249538",
    "ThreadId": "70594",
    "Html": "<p>That's a fun site, seems my reaction time averages 210 ms.&nbsp; I'm assuming this includes the internet latency which would mean a RAWR latency of 250 ms would make sense since a lot more is going on in a wow fight.&nbsp; If it doesn't then 350 ms would make sense.</p>",
    "PostedDate": "2009-10-25T13:35:38.67-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "249541",
    "ThreadId": "70594",
    "Html": "<p>Nope, that's pure human latency - it isolates the human reaction because it's not a message sent from the host server to your computer, but rather, a program that runs within your browser, isolated from the network.</p>",
    "PostedDate": "2009-10-25T14:09:47.237-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "249554",
    "ThreadId": "70594",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>BrWarner wrote:</strong><br>\r\n<p>Nope, that's pure human latency - it isolates the human reaction because it's not a message sent from the host server to your computer, but rather, a program that runs within your browser, isolated from the network.</p>\r\n</blockquote>\r\n<p>That's not <em>entirely</em>&nbsp;true. Your computer's input latency is still included. My roommate and I both tried it, me on the touchpad of my laptop, and him on his gaming mouse. Did several test cycles. Then we swapped computers, and did it again. We were consistently 50ms to 100ms slower on the laptop touchpad than on the desktop gaming mouse.</p>\r\n<p>Still, that input latency would also affect WoW, so it's still a valid test for what you should put in the setting in Rawr.SPriest.</p>",
    "PostedDate": "2009-10-25T15:51:34.983-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "249568",
    "ThreadId": "70594",
    "Html": "<p>Well, yeah, the human reaction measurement is only as accurate as the method of acquiring it, I think that goes without saying.&nbsp; A click (depressing a button to manually activate a sensor) will always be faster than the touchpad, because the touchpad takes a hair of a second to &quot;activate&quot; (register the electromagnetic whatchamacallit-doohingy).&nbsp; That's the technical term, anyways.</p>",
    "PostedDate": "2009-10-25T18:23:17.6-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "249594",
    "ThreadId": "70594",
    "Html": "<p>Err, no, it's just a button on the touchpad, not the 'tap to click' feature of touchpads (I don't use that, it pisses me off).</p>",
    "PostedDate": "2009-10-25T21:06:31.44-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "249604",
    "ThreadId": "70594",
    "Html": "<p>Ah, okay.&nbsp; If it's an especially long depress (or simply a less accurate signal, as I know many laptops have less-than-optimal clicking capacity, compared to a gaming mouse), I could see that still being a factor.&nbsp; Meh, whatevs.&nbsp; If it takes 220ms for you to receive the information, act on it, and have it register by clicking on computer A, and takes 270 on computer B, that's the real &quot;human delay&quot; in either case.</p>",
    "PostedDate": "2009-10-25T22:50:41.23-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "249629",
    "ThreadId": "70594",
    "Html": "<p>But then again, WoW has a small spell queue feature. While you are still casting a spell you can press the key for your next one within 300ms to the end of the spell cast or so (I will have to doublecheck a thread on EJ for this number) then the next spell will be cast right after the first one. This means, that reaction time is just important for procs, and perhaps channeled spells (unsure about this).</p>",
    "PostedDate": "2009-10-26T01:22:35.65-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "249829",
    "ThreadId": "70594",
    "Html": "<p>Right, reaction time is only needed for responding to unexpected things, like procs, etc. Anything you see coming, you should be able to time much closer, due to anticipation.</p>",
    "PostedDate": "2009-10-26T09:57:27.983-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]