[
  {
    "Id": "240438",
    "ThreadId": "70592",
    "Html": "<p>&nbsp;&nbsp; This is my first Tanking project, and I'm sorta confused. I just hit level 80, and I've only quested to level. Now that I'm here, I'm wondering if my Toon is up to the task of Tanking a dungeon. I have two other 80's, both are DPS, so I know the letdown of realizing that I'm in a raid with an underpowered Tank. I don't want to be one of those. I downloaded RAWR, hoping that it would provide a clue of what calibre of Tank I've created, at least a ball park estimate. It's a eally cool program to use, but the stats don't seem to answer my question, pro or con. Is there a graph or scale that I missed that puts the three main stats together and rates the Tanking ability of the Toon relative to it's level and time at that level. I guess what I'm saying is, if my toon is gonna fail, I'd rather it was on the drawing board, than in the instance, and the bad server wide rep that goes along with that. Here are the stats on the bottom toolbar: Overall:179808, Mitigation: 78786, Survival: 65793, Threat: 35228</p>\r\n<p>&nbsp;&nbsp; Could some kind soul please tell me what I need to adjust to Have a chance at success. Wow! I haven't sounded like a noob in quite a while, what a humbling experience.. Thank you in advance for any help you can give me.</p>",
    "PostedDate": "2009-09-30T07:38:13.553-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "240523",
    "ThreadId": "70592",
    "Html": "<p>Hey. There isn't really a &quot;you're ready to tank THIS instance&quot; bar, since that can vary so much. But, a good ballpark is to look at the presets for survivability softcap, on the options screen, and go by those, for Survival. And Mitigation should be at least within the same ballpark. Threat issues should mostly come down to whether you're using your abilities right, at that gear level.</p>",
    "PostedDate": "2009-09-30T09:58:30.843-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "240527",
    "ThreadId": "70592",
    "Html": "<p>However somewhere down the line, when the Boss Handler has been polished quite a bit, I am planning to create that type of bar to show what content your character would perform best in. Thisis probably 3-6 months out though and would be in Rawr3.</p>",
    "PostedDate": "2009-09-30T10:02:00.637-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "241515",
    "ThreadId": "70592",
    "Html": "<p>Thank you so much for your quick responses. No, I wasn't looking for a dummy bar, I was asking for the exact info that you provided, a place to campare stats, so that I can gage where my Bear is, in relation to where he should be to keep from wiping groups. You probably saved me from major embarassment, because I was really low in Survivability. Even after bringing it up another 15,000 after comparing the presets, I'm still lacking 15,000 , but I'm alot closer now.</p>",
    "PostedDate": "2009-10-02T14:43:14.047-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]