[
  {
    "Id": "240617",
    "ThreadId": "70637",
    "Html": "<p>Is there any way to calculate stats weights and show gear choices in same way as shaman_hep tools do? Shaman_hep uses actual logfile to calculate stats weights having in mind your specific &quot;healing style&quot;.</p>\r\n<p>If there is no way to support it then maybe there is a way to manually set stats weights for my actual gear set as i feel right and use Rawr as gear comparison tool?</p>\r\n<p>For now i have no idea how to set burst or sustained and other options to get stats weights similiar to what i get in shaman_hep report.</p>",
    "PostedDate": "2009-09-30T13:32:14.657-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "240635",
    "ThreadId": "70637",
    "Html": "<p>Rawr doesn't use stat weights, at all. They're only an output. Rawr.RestoSham shows the value of things by testing their contribution to your performance.</p>\r\n<p>&nbsp;</p>\r\n<p>(Stat weights are inherently inaccurate, by designed, and should not be used when more accurate tools are available)</p>",
    "PostedDate": "2009-09-30T14:08:51.8-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "240638",
    "ThreadId": "70637",
    "Html": "<p>Burst would be the way you heal when you are racing to keep someone alive, like Plasma Blast, or Impale on Gormok.</p>\r\n<p>Sustained would be how you handle normal incoming damage. &nbsp;What mix of skills do you use that are not represented in the two choices?</p>",
    "PostedDate": "2009-09-30T14:14:04.15-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "240697",
    "ThreadId": "70637",
    "Html": "<p>Stat weights are output from shaman_hep tool - same as from Rawr. As i understand they are somehow accurate when we consider doing small gear changes - for example 1 piece of gear at a time.</p>\r\n<p>I understand what Burst and what Sustained is but i did not find an option to set how long burst phase last during a fight or how long sustained phase last. There is no such slider?</p>\r\n<p>Usually for Sustained i use RT-LHW-LHW ocassionaly throwing CH.</p>\r\n<p>For Burst it depends one fight i use RT-LHW-LHW other CH spam.</p>\r\n<p>For example in my case for 5 minute fight Rawr suggest going for mp5 and shaman_hep suggest going for haste. Even if i remove&nbsp; sustained style at all and leave only burst rawr suggest i should stack more spellpower when i am sure i don't need more spellpower for burst healing but haste.</p>\r\n<p>How sustained model works? How often it cast spells?</p>\r\n<p>Also excuse if its already answered somewhere what exactly &quot;are you using Earth Shield&quot; and &quot;are you healing a tank&quot; boxes means?</p>\r\n<p>If i check ES box does rawr model guess i heal this target with LHW? or it simply add only ES charges to my healing?</p>\r\n<p>IF i check tank box does rawr model guess i am only MT healer or i heal everyone ex. MT and raid same time?</p>",
    "PostedDate": "2009-09-30T17:32:30.647-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]