[
  {
    "Id": "241261",
    "ThreadId": "70811",
    "Html": "<p>I am having two distinct problems that have arrisen since I got Illumitation (a 2h staff).&nbsp;</p>\r\n<p>1) Rawr keeps optimizing my gear set including both the staff and an off-hand item. Which while nice obviously doesn't allow proper modeling.</p>\r\n<p>&nbsp;</p>\r\n<p>2) When running 'build upgrades' Rawr fails to recognize that an upgraded off-hand item could justify dropping the staff for a 1H weapon. If I select that I have a better off-hand available it will properly itemize with the 1H / Off-hand combo, but won't suggest that any off hand could be an upgrade to my current gear.</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-10-02T05:09:06.147-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "241441",
    "ThreadId": "70811",
    "Html": "<p>If it is showing the staff as well as an off-hand, make sure the off-hand looks &quot;faded.&quot; It will have gray particles covering the off-hand. If this is not appearing, try re-installing RAWR. If it is still not working, put in a ticket. I know on mine, going from a 1-hand to a 2-hand, the off-hand DOES grey out.</p>",
    "PostedDate": "2009-10-02T11:55:00.3-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "241491",
    "ThreadId": "70811",
    "Html": "<p>Regarding your second question, that is by design. Upgrade list is telling you&nbsp;how much&nbsp;value you can get out&nbsp;of adding that item to your set of available items. It does not tell you anything about how adding an item to your available set changes upgrade value of other items.</p>\r\n<p>I agree that there is an inherent value of an item opening better future upgrades. We just don't currently have any such metric. If anyone has a well thought out metric in mind that would capture the concept I'd like to hear about it.</p>",
    "PostedDate": "2009-10-02T13:38:42.95-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "241519",
    "ThreadId": "70811",
    "Html": "<p>Kavan,</p>\r\n<p>&nbsp;</p>\r\n<p>I appreciate the responce, and all the work you guys do on this.</p>\r\n<p>&nbsp;</p>\r\n<p>As for a solution to the problem raised in 2). I can think of a number of solutions though they varry in value based upon 1) the amount of additional processsing time that would be reasonable 2) the level of completeness desired.</p>\r\n<p>&nbsp;</p>\r\n<p>Possible suggestions during build upgrade list (limiting the solution to weapon/off-hand calculations)</p>\r\n<p>1) Recognizing that it really is only with one hand vs 2 handed weapons that this is a problem then I would suggest have Rawr check best currrent gear, if 2 handed weapon then in upgrade list itemize all off handed weapons and one handed weapons that are 'better' than the best one handed weapon/off hand available.&nbsp;</p>\r\n<p>Of course this doesn't really get where we would like to be since there is no comparison between the current 2H and better 1H/OH but at least it is a work around. (BTW this is what I am currently doing to create a list for Lootplan)</p>\r\n<p>&nbsp;</p>\r\n<p>2) Freeze the current gear metrics at their relative value, and compare every (possibly limited by at least one of each combination being marked available) 1H/OH combo vs 2H. Those combinations that are better than what is currently equipped would then be listed. This of course introduced a known failing since i doesn't allow for on the fly comparisons and changes in gear metrics. But trying to do so would basically require a mainframe or a lot more time than most people could dedicate.</p>\r\n<p>This I think would be the most practical options since while it would require more processing time it wouldn't be that bad.</p>\r\n<p>3) Run a full optimizer on each weapon combination as part of the build upgrade process. This of course is impractical but would be the gold standard.</p>",
    "PostedDate": "2009-10-02T15:17:03.057-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "241672",
    "ThreadId": "70811",
    "Html": "<p>Hm, there is some logic that DPSWarr uses to determine when you can and cannot have certain weapons equipped. &nbsp;The plus side is that it doesn't even make them available for you TO equip (ie, a two-hander in the offhand if you have a Polearm MH equipped for TG warriors).</p>\r\n<p>However, I don't think this will necessarily work for Mage, because you won't find the shield unless you unequip the staff (this is acceptable for DPSWarr because you shouldn't find yourself in these situations anyway; they're mostly there to filter out things that you shouldn't be equipping anyway, but casters can go either way.</p>",
    "PostedDate": "2009-10-03T09:37:38.28-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]