[
  {
    "Id": "241593",
    "ThreadId": "70886",
    "Html": "<p>As it seems this feature is still being fleshed out, thought it might be good to dedicate a thread to it.</p>\r\n<p>&nbsp;&nbsp;&nbsp; &gt;&gt;&gt;&gt; Before we get started, this is about features/functionality, <strong>not</strong> support or FAQ. &lt;&lt;&lt;&lt;</p>\r\n<p>&nbsp;</p>\r\n<p>To kick things off:</p>\r\n<p>&nbsp;</p>\r\n<p>Allow control of multi-targeting mobs' level, separate from the primary target.</p>",
    "PostedDate": "2009-10-02T23:27:37.68-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "241596",
    "ThreadId": "70886",
    "Html": "<p>We actually do have a thread for it in the private dev discussions :P</p>",
    "PostedDate": "2009-10-03T00:08:58.24-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "241600",
    "ThreadId": "70886",
    "Html": "<p>To post some of where we are headed with it (some of this is for my own edification):</p>\r\n<p><strong>1.</strong> Rawr3 will have a new Tab next to Options, Boss Selector. This tab will not occur in Rawr2. Devs will be implementing their own little pieces of it where applicable in Rawr2 as preparations for Rawr3's new tab.<br><strong>2.</strong> There are Pros and Cons for this but it's been posed that we should move the individual boss information sets to an XML file, as a form of database. The biggest Pro for it is user editability, they can tweak their own files how they see fit on their end. The biggest Con is that I'm not just setting 'Every 8 sec you move for 3 sec' type values, I'm using multiple formulas across all these different values which aren't easily translatable. I will reach this point eventually but I'd rather keep it in the code for now until I've ironed out the kinks in these processes.<br><strong>3.</strong> I've already started working in Boss Attacks for classes to know how much raw damage they are taking in, models can implement their own forms of mitigation, resistance, avoidance, etc. This is a multiple phase process: first raw damage (60,000 unmitigated), then factoring in what kind of damage (physical vs spell vs nature, etc.), then how it's being delivered (Melee, SingleTargSpell, MultipleTargSpell, AoE) then work all these together so individual attacks can be handled by a model (presently, this and other forms are all pulled together for single values).<br><strong>4.</strong> I need to make extra little dialogs to handle adding/removing attacks for custom bosses, like how the Warlock module has a Custom Spell Priority dialog. You can add spells to the rotation and it then handles them.</p>",
    "PostedDate": "2009-10-03T00:31:37.317-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "436092",
    "ThreadId": "70886",
    "Html": "<p>sorry for necroing this old thread but any word on the Boss Handler development? Last I remember BrWarner was going to be evaluating each of the bosses and submitting design veriables to help simulate the fight. That was back in November or so. now that RAWR 3 is in beta mode I haven't seen any headway on this side of the project.</p>",
    "PostedDate": "2010-04-27T11:16:22.07-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "436142",
    "ThreadId": "70886",
    "Html": "<p>I haven't touched it and it will need a hand with better Silverlight knowledge than mine to move forward in Rawr3. Adding bosses is just grunt work.</p>",
    "PostedDate": "2010-04-27T13:15:58.883-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "437474",
    "ThreadId": "70886",
    "Html": "<p>Nah, life's just extremely crazy right now.&nbsp; :/&nbsp; I can try to remember to take a look at it this weekend, after I move most of my stuff over to my new apartment.</p>\r\n<p>And by &quot;right now&quot;, I mean, &quot;the last 5 months&quot;.&nbsp; =P</p>",
    "PostedDate": "2010-04-30T01:46:21.833-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]