[
  {
    "Id": "241625",
    "ThreadId": "70896",
    "Html": "<p>First off before im start spilling my guts about the little things that annoy me, i would like to give you a BIG thank you for creating this program. I couldnt wish for a better idea for a program than this, just sitting around optimizing my character is as much fun as actually playing the game.</p>\r\n<p>What bugs me out is that you cant remove all the lesser gems in the &quot;availble for optimizer&quot; function. i mean, who need to choose between all the different pure str gems in the game? Noone who is just the least committed would ever even consider using a lesser gem than &quot;Bold Cardinal Ruby&quot; (20 str). The 1-2-3-4-5-6-7-8-9-10 str gems that green or blue or even TBC could offer would ever be a choice and it bugs me out to have to go through that list and check it.</p>\r\n<p>My surgestion is to make a function that just removes any lesser gem when a gem that in every way is better and just as availble is an option. is it already there and did i not discover it? if so,please tell me cause i consider myself as an experienced rawr user.</p>\r\n<p>I looked at the gemming template and it didnt seem very useful for people who as standard as set the optimizer to max throughness since the gemming will vary on the rest of your gear, and the initial gemming hardly plays a role here.</p>\r\n<p>Again i would like to give a big TY to the creators and updaters of this program.</p>\r\n<p>&nbsp;</p>\r\n<p>Peter</p>",
    "PostedDate": "2009-10-03T04:37:08.593-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "241626",
    "ThreadId": "70896",
    "Html": "<p>I think I have done that with filters once, one filter to show only lesser gems. And one to show only Epic Gems (you have to move the filter to the top of the pile though). It was then much easier to mark/remove marks on the gems.</p>\r\n<p>Though a sort by quality level on the screen showing all the gems would be much easier. Or that you could somehow show which were epic ones in the list.</p>\r\n<p>A similar function could be to have the possibility to be able to tick a check list of what abilities should be listed... i.e. I want all +MP5 to show, or all +AGI etc.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-10-03T04:46:34.55-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "241685",
    "ThreadId": "70896",
    "Html": "<p>I think you are missing the point of how gems are being made available for the optimizer:</p>\r\n<p><strong>1) Gemming Templates:</strong> The templates provided for each model are customized to meet that models needs. Generaly, only 1 or 2 groups of Templates are enabled amongst, Low Quality, Rare Quality, Epic Quality and Jewelcrafter Specific. These groups were provided to you so you can quickly tell Rawr which level of gems you have access to. At this point the Epic Quality groups should be the defaulted enabled group for all models (though a couple are still set to Rare). In the Options Dialog (Tools &gt; Options) you can set whether the Gemming Templates that you have enabled are available for the optimizer, I personally turn these off in favor of the diamonds (explained next).<br><strong>2) Diamonds:</strong> On the Right-Hand side of the screen, above the comparison chart, you can select Gems -&gt; Normal (or Meta, or a subset of Normal: Red, Yellow or Blue) and mark specific Gems as available by use of Green Diamonds (see the Optimizer Help for more info on those). If you have Gemming Templates available to the optimizer, you might only mark gems that are not in the Templates that you would still be willing to use. A common case would be Hit and Expertise gems, in order to fill the gap to the caps so you don't have to jump well over those points with gear that has set values on these (eg- you need 8 more to cap but the only way to fill it is to equip a piece of gear with 24, mark the Gem and it will just fill a gem slot with a hit or partial hit gem like Rigid (+16 Hit) or Etched (+8 Hit, +8 Str) instead). With the Gemming Templates *not* available to the optimizer (like I do) you would want to mark all the gems that your character would use and nothing you wouldn't ever expect to use. So as an Arms Warrior, I would mark STR, ArP, Exp, Hit, Crit and partials for each of those but I wouldn't mark Haste or pure Stam or any Spellcaster gems. <strong>NOTE:</strong> If you have access to the Epic Gems (which at this point you should for relatively cheap) you would mark the Epic version of the STR gem as available but NOT mark the lesser ones.</p>",
    "PostedDate": "2009-10-03T11:08:52.597-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "244552",
    "ThreadId": "70896",
    "Html": "<p>Ty for your responses Jothay and Drizz.</p>\r\n<p>At this moment your post(Jothay) inspired me to work alittle harder to see if i can find a function in rawr that can forfill my needs, i will be back later.</p>",
    "PostedDate": "2009-10-12T00:56:28.183-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]