[
  {
    "Id": "242531",
    "ThreadId": "71117",
    "Html": "<p>Even though the Onyxia's head quest rewards, like Polished Dragonslayer's Signet, are not marked as unique, since you can only do the quest once they are effectively unique. Rawr is telling me I should equip 2 of them, which is dumb.</p>",
    "PostedDate": "2009-10-06T06:24:18.5-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "242563",
    "ThreadId": "71117",
    "Html": "<p>That &quot;dumb&quot; possibility is because the item is NOT unique.&nbsp; According to Wowhead/Armory, the item is not unique, and correctly so.&nbsp; If you wish to enforce this (only matters for all of 3 or so items), just use the Edit Item interface to mark the items you're referring to as &quot;unique&quot;.</p>\r\n<p>Rawr does not maintain its own, user-entered database of object details.&nbsp; The program grabs the data from Wowhead/Armory.&nbsp; No developer from Rawr make the booboo of not marking these items unique.</p>",
    "PostedDate": "2009-10-06T07:47:42.727-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "242613",
    "ThreadId": "71117",
    "Html": "<p>I know Polished Dragonslayer's Signet&nbsp;is not technically &quot;unique&quot;, but you can only have one of them, and so when Rawr says I should equip two of them, Rawr is making a mistake. I know I can <em>tell</em> Rawr to think of the item as unique, but that's not 100% correct either. I know Rawr doesn't maintain its own database of object details,&nbsp;but perhaps Rawr could more intelligently interpret the data from the armory. I mean, if an item is a quest reward, Rawr should know you can't get more than one of them. Correct me if I'm wrong, but there are no lvl 80 quest reward loot that can be obtained (and equipped) more than once.</p>",
    "PostedDate": "2009-10-06T09:53:39.82-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "242620",
    "ThreadId": "71117",
    "Html": "<p>Quest rewards are not unique, no. Thus, we do not infer uniqueness from being a quest reward.</p>",
    "PostedDate": "2009-10-06T10:04:02.723-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "242623",
    "ThreadId": "71117",
    "Html": "<p>Perhaps there is confusion about our terms. Just because something is not unique, that doesn't mean Rawr should automatically assume you can equip more than one of them. Rawr should not infer quest rewards are unique, but it should infer that you cannot equip more than one.</p>",
    "PostedDate": "2009-10-06T10:32:37.04-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "242629",
    "ThreadId": "71117",
    "Html": "<p>There are quest rewards that you can equip multiple of. This has come back to bite us before. You're welcome to mark it unique if you only have one, and it takes only 4 clicks to do so.</p>",
    "PostedDate": "2009-10-06T10:39:07.207-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "242630",
    "ThreadId": "71117",
    "Html": "<p>Trevar has a point, BUT some quests are repeatable (like the Zul'Drak daily chain Congratulations!, the timed reward for Pa'Troll).  Granted, THAT reward is Unique.  I don't think it's that big of a deal to flag all Items obtained as a quest reward as &quot;Unique&quot;, unless anybody can think of a reason not to (ie, an item that you can get more than one of, and is a quest reward).  Honestly, it just makes sense.</p>\r\n<p><em>Edit: Looks like Astry beat me to it. &nbsp;There are quest rewards that are not unique and repeatable; &nbsp;any idea which ones are off the top of your head?</em></p>",
    "PostedDate": "2009-10-06T10:40:13.72-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "242635",
    "ThreadId": "71117",
    "Html": "<p>I remember this originally coming up pre-BC, with the Argent Dawn rewards. Then I believe it happened again in BC with one of the boss 'head' items (Mag, perhaps?). I think I've seen it once in WotLK, but can't recall where off the top of my head... Sapphiron necks perhaps?</p>",
    "PostedDate": "2009-10-06T10:44:32.57-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "242636",
    "ThreadId": "71117",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>ebs2002 wrote:</strong><br>\r\n<p>Trevar has a point, BUT some quests are repeatable (like the Zul'Drak daily chain Congratulations!, the timed reward for Pa'Troll).  Granted, THAT reward is Unique.  I don't think it's that big of a deal to flag all Items obtained as a quest reward as &quot;Unique&quot;, unless anybody can think of a reason not to (ie, an item that you can get more than one of, and is a quest reward).  Honestly, it just makes sense.</p>\r\n<p><em>Edit: Looks like Astry beat me to it. &nbsp;There are quest rewards that are not unique and repeatable; &nbsp;any idea which ones are off the top of your head?</em></p>\r\n</blockquote>\r\n<p>Doing a search of wowhead, I could not find a single lvl 80 quest reward that you can equip more than of at a time. Can you think of a single example? Remember, in order to equip 2 of an item, it would have to be a trinket, ring, or 1 handed weapon (or 2-handed for fury warriors).</p>\r\n<p>Considering quest rewards as &quot;unique&quot; is a bit of a hack, but it does get the desired behavior.</p>",
    "PostedDate": "2009-10-06T10:48:55.603-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "242637",
    "ThreadId": "71117",
    "Html": "<p>It can only be an issue with one handed weapons, rings, and trinkets.&nbsp; Other items, if they are unique or not, is irrelevant to Rawr.</p>\r\n<p>So I doubt it was Sapph necks :).</p>\r\n<p>The fact that the item is or is not unique is entirely unimportant to Rawr.&nbsp; Rawr needs to know if you can get/equip more than one.&nbsp; Therefore when we find something not flagged unique by WoW but that you cannot equip more than one of (since the quest is not repeatable) Rawr should handle that.&nbsp; Whether it's through the use of said unique flag or not doesn't really matter.&nbsp;</p>\r\n<p>It may as well use that.&nbsp; That flag in Rawr has a slightly different use than it does in WoW.&nbsp; Rawr only needs it for the optimizer for three slots, really, and to a lesser extent it's useful in the gear ranking lists to prevent clutter.</p>",
    "PostedDate": "2009-10-06T10:48:58.467-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "242638",
    "ThreadId": "71117",
    "Html": "<p>The darkmoon card quest are a big one that are repeatable</p>",
    "PostedDate": "2009-10-06T10:49:20.183-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "242640",
    "ThreadId": "71117",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>highlandr wrote:</strong><br>\r\n<p>The darkmoon card quest are a big one that are repeatable</p>\r\n</blockquote>\r\n<p>You can't equip 2 at a time. They are unique-equipped.</p>\r\n<p>Purified Onyxia Blood Talisman and Polished Dragonslayer's Signet are the main reasons for the change to Rawr as those are both good and easily obtained (and hence many people will be annoyed by this current behavior of Rawr).</p>",
    "PostedDate": "2009-10-06T10:55:41.503-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "243446",
    "ThreadId": "71117",
    "Html": "<p>Essentially this is a Blizzard error in not flagging the items as Unique. The vast majority of quest items are flagged as Unique. What we could possibly do is make a special data exception for these two items and deliberately bash them into shape. What we wouldn't want to do is to create a rule that said if its from a quest then it must be unique as that is not always going to be the case.</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-10-08T07:31:55.57-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]