[
  {
    "Id": "243015",
    "ThreadId": "71263",
    "Html": "<p>With the latest release came the latest filtering system...</p>\r\n<p>Now to get to know your new filters, I will explain the intended use of them so you can be on your way to enjoying the benifits.</p>\r\n<p>First you will notice the filters come up with &quot;Unknown&quot; and &quot;Not Found on Armory&quot; selected, and your basic other filters. This was so you can update the missing information for these items. To correct these, simply load your profile, select &quot;Direct Upgrades&quot;, and hover your mouse over the items in the list and see that it does not give useful information for locating the item, then right click it and select &quot;Refresh from Wowhead&quot;. The item should then disappear from the list if it does not have a green diamond next to it. This is what you want to happen, as they disappear they are actually be properly filtered. If by chance the item did not disappear, check the information and compare it to what was originally there, and if it is more useful then move on to the next, otherwise right click and &quot;Refresh from Amory&quot;, and move on to the next. Basically you want to make this list as small as possible. You want to be sure to set it for &quot;Direct Upgrades&quot; verses &quot;Head slot&quot; or any other &quot;Slot item&quot;. This is to minimize the list of items to repair to a smaller list of just items that will benefit your character.</p>\r\n<p>Now that all your items are better filterable, now it is time to setup your filters to where you want to look for upgrades. The only things you really need to have checked at this point is &quot;Options&quot; and &quot;Gems&quot;, the rest is entirely up to you and your level in the game.</p>\r\n<p>The &quot;Options&quot; tab is simple, all you need to do is remove the check for the professions you have.</p>\r\n<p>The &quot;Gems&quot; tab can most likely be left as is, unless there are some types of gems you just do not want to see. An don't worry about the (BoP) Gems being selected here, as they will not show up if you have not first selected that you ARE a &quot;Jewlcrafter&quot; in the &quot;Options&quot; tab.</p>\r\n<p>Once both of these settings are set, there is little need to ever change them, and they can be left set that way till the end of time or until you change professions or load another profile.</p>\r\n<p>Now for the NEW &quot;I-Filter&quot;, this one can be set to filter OUT items of certain i-level range. This is best used with &quot;ALL&quot; and &quot;Other&quot; selected. It will then give you a list of all the items available in the range you selected. It can also be used in conjunction with all the other filters, just in case you wanted to know if you would be able to get that &quot;Epic&quot; achievement in the current dungeons you are able to farm.</p>\r\n<p>That is about it, everything else is just select what you want and go for it...</p>\r\n<p>Quick note:<br>As a rule, after a patch, loading of possible upgrades, or a cache update, be sure to refresh the unknown items to keep your information more usable.</p>\r\n<p>Also leave the &quot;World Drop&quot; and &quot;Other&quot; turned on, you never know when you might come across them. An if you still have items in the &quot;Unknown&quot; or &quot;Not found on armory&quot;, you may want to leave those on too, or recheck them from time to time.</p>\r\n<p>Any problems with the filters, just let me know, and I will get right on it...</p>\r\n<p>&nbsp;</p>\r\n<p>Have fun...</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-10-07T09:20:38.537-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "243095",
    "ThreadId": "71263",
    "Html": "<p>Titanium Spikeguards and Titanium Razorplate are now filtered as... something not listed. They only show up if you choose ALL. Should be listed as Crafted (note: not BoP). Might be for other crafted items too?</p>",
    "PostedDate": "2009-10-07T12:33:29.96-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "243184",
    "ThreadId": "71263",
    "Html": "<p>They are not listed as BOP...</p>\r\n<p>Look for the item in the &quot;?&quot; tab under &quot;Crafted&quot;. These items are known to be messed up and should be refreshed from Wowhead.</p>\r\n<p>As for the Titanium Razorplate, this is an error on my part. You will be able to select &quot;ALL&quot;, then find the item, and select &quot;Refresh from Wowhead&quot;. This will put it back to where it belongs.</p>\r\n<p>As for the error, anything that has a nul value for location description is automatically being sent to the &quot;ALL&quot; filter instead of the &quot;Other&quot; like it used to. This is fixed for the next version, but to find them just use &quot;ALL&quot;.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-10-07T16:25:59.93-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]