[
  {
    "Id": "243500",
    "ThreadId": "71397",
    "Html": "<p>Hi, i like Rawr but what bugs me is when i do an upgrade list i get suggestions like items with multiple sockets, that my professions cannot make. Is there a way to remove those suggestions ?</p>",
    "PostedDate": "2009-10-08T08:55:09.56-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "243506",
    "ThreadId": "71397",
    "Html": "<p>If you are talking about the blacksmithing sockets, uncheck the Extra Socket checkboxes underneath Gloves and Bracers on the Main Window if you are not a blacksmith. The Belt should stay as anyone can use that (it does not require blacksmithing). It would NOT be recommending gems to go in those sockets if those are not checked.</p>\r\n<p>If you are talking about high iLevel items, remember that 232 items with 245 counterparts sometimes don't have a gem like their 245 counterpart.</p>",
    "PostedDate": "2009-10-08T09:08:46.63-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "243542",
    "ThreadId": "71397",
    "Html": "<p>Like for exemple a suggestion in upgrade list from optimizer gives me my neck piece , Wail of the Val'kyr, with a socket as more powerful. Im sure it would be, but im a Tailor/Enchanter so i cannot put a socket on it. So can i remove this from the optimizer , so i only get what i can make/use with my professions ? Trying to be clear :-)</p>",
    "PostedDate": "2009-10-08T10:57:55.11-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "243562",
    "ThreadId": "71397",
    "Html": "<p>The one you're looking at with the socket is the ilvl 245 one. The ilvl 232 one doesn't have the socket.</p>",
    "PostedDate": "2009-10-08T11:52:02.537-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "243577",
    "ThreadId": "71397",
    "Html": "<p>You literally stated exactly what i said was the problem in paragraph 2 Kann.</p>\r\n<p>And btw the only Extra Sockets you can physically to Items is on Belts, Gloves and Bracers, not Necks....</p>",
    "PostedDate": "2009-10-08T12:16:54.2-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "243654",
    "ThreadId": "71397",
    "Html": "<p>To rephrase, Kann:</p>\r\n<p>There are two different items with the same name for pretty much EVERY item in ToC 10/25.&nbsp;</p>\r\n<p>Wail of the Val'kyr has no socket.&nbsp; Wail of the Val'kyr (heroic version) has a socket.&nbsp; You can get and use either regardless of your professions.&nbsp; The heroic version of the item drops in heroic mode.</p>",
    "PostedDate": "2009-10-08T16:54:28-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "244670",
    "ThreadId": "71397",
    "Html": "<p>Oh God , my bad... You would think that at 43 i would have learned to read/look at descriptions...... Thanks for your patience&nbsp; :-)</p>",
    "PostedDate": "2009-10-12T07:13:01.437-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]