[
  {
    "Id": "243627",
    "ThreadId": "71432",
    "Html": "<p>I really liked the addition of this feature in the previous versions.&nbsp;&nbsp;&nbsp;&nbsp; I assume copying the item filter settings for that particular filter in 2.2.20 will recreate the filter, but it would be good to put it back in for the next version :)</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-10-08T15:36:00.727-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "243629",
    "ThreadId": "71432",
    "Html": "<p>No, we don't want that filter. It was only used as a workaround for other issues, which we think we have fixed. (And it caused issues of its own).</p>",
    "PostedDate": "2009-10-08T15:37:22.353-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "243663",
    "ThreadId": "71432",
    "Html": "<p>I've been using it for my perf testing (turning on the &quot;All&quot; filter, turning off all the subtractive filters, making sure I wasn't filtering out leather/mail, and then seeing the performance while toggling the &quot;Enforce Gemming Requirements&quot; with, say, Chest items in the comparisons pane).</p>\r\n<p>What should we use instead of &quot;All&quot;? &nbsp;Just check all the filters? &nbsp;And for my own curiosity, what was the issues with the All filter?</p>",
    "PostedDate": "2009-10-08T17:46:38.103-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "243671",
    "ThreadId": "71432",
    "Html": "<p>Yeah, just check everything, except the two obvious 'disable' ones (by ilvl, or by BoP crafted). It prevent the 'Other' filters from working, since there no longer was anything that didn't match a filter. And therefore, meant that anything wasn't in one of the other filters could <em>only </em>be shown by showing ALL, negating all the other filters. We instead want the filters to work all the time, and anything that doesn't match a filter (ie, we have no data for), is controlled by the Other filter.</p>",
    "PostedDate": "2009-10-08T18:12:49.58-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "243708",
    "ThreadId": "71432",
    "Html": "<p>I understand the difficulty it caused and am happy with the decision not to include it anymore.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Having said that, I will be manually adding it to my filters as I found it useful if I wanted to compare all items for a slot briefly.&nbsp; It was much easier than having to select and de-select all the other categories.</p>\r\n<p>&nbsp;</p>\r\n<p>An enable/disable all categories would be nice though (other than the two obvious ones you mention of course).&nbsp;&nbsp; Sometimes I want to look only at crafted gear and other times I want to look at everything except the hard modes or something, and it is a bit of effort to go from one to the other :)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; This is only really an issue for me because I have so many toons (some nearing BiS and others with almost no gear) and IIRC the filter settings don't get saved in the character file.</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-10-08T21:15:04.23-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]