[
  {
    "Id": "243723",
    "ThreadId": "71456",
    "Html": "<p>Hi, I'm new to Rawr, and I'm using the Enhance module.&nbsp; I've got an <a href=\"http://www.wowhead.com/?item=49297\">Empowered Deathbringer </a>and I'm trying to compare it to my other weapons using Rawr.&nbsp; It's my offspec, what can I say :)</p>\r\n<p>I tried importing it from wowhead, and I think it was in the list of things that it tried to import, but it's not showing up in my list of available items.&nbsp; I did manage to get it into the system by equipping it, but&nbsp;rawr doesn't seem to think it's very good.</p>\r\n<p>I know it has a proc,&nbsp;is there some work to be done to get it into the system?</p>",
    "PostedDate": "2009-10-08T22:01:49.137-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "243733",
    "ThreadId": "71456",
    "Html": "<p>Since it has no other stats, if the Enhance model doesn't support that proc, that would explain it not showing up. Levva, how's procs on this one?</p>",
    "PostedDate": "2009-10-08T22:54:17.97-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "243790",
    "ThreadId": "71456",
    "Html": "<p>No one has coded the proc at all so its not supported in ANY model. I have no idea of the proc chance what co-efficients it uses if any so I have no data to go on. I do recall someone on EJ forums working out that even with 100% proc chance and 100% co-efficient it was a poor weapon so I've put no effort into modelling it.</p>\r\n<p>Any of us can code it in SpecialEffects.cs if anyone actually knows the proc chance and co-efficients, I'm happy to do that if someone can provide those figures. Probably someone somewhere has figured it out but because its not good for top level raiders most theorycrafters have ignored all the 5yr Onyxia weapons with their gimicky procs.</p>",
    "PostedDate": "2009-10-09T01:55:57.54-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "243962",
    "ThreadId": "71456",
    "Html": "<p>Cool.&nbsp; I might see if I can figure that out, then.&nbsp; If anybody has any pointers, I'd appreciate it - otherwise I'll go see what I can find on EJ.</p>",
    "PostedDate": "2009-10-09T10:21:02.757-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "243967",
    "ThreadId": "71456",
    "Html": "<p>Some posts on wowhead in the comment section there show it to be a 5% chance to proc and the damage can be increased by Spell Crit (giving it crit chance) and Shadow Damage Modifiers like DK's Black Ice. No Int Cd but it does take 2.2 sec to cast, which doesn't matter too much as the swing speed is 2.7 so it can proc every swing (though yellow abilities in that first 2.2 second probably won't pop it).</p>",
    "PostedDate": "2009-10-09T10:41:40.76-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "243994",
    "ThreadId": "71456",
    "Html": "<p>Wait, it's a melee proc with a<em>&nbsp;<strong>cast time? </strong><span style=\"font-style:normal\">Weird!</span></em></p>",
    "PostedDate": "2009-10-09T12:10:38.677-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "243996",
    "ThreadId": "71456",
    "Html": "<p>Just reading what it says: http://www.wowhead.com/?spell=69211</p>\r\n<p>That <em><strong>is</strong></em> really weird.</p>",
    "PostedDate": "2009-10-09T12:14:30.54-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "244186",
    "ThreadId": "71456",
    "Html": "<p>Now you get a bit of an insight into why I haven't tried to get my head around it and implement it as a special effect :)</p>",
    "PostedDate": "2009-10-10T08:00:32.353-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "244233",
    "ThreadId": "71456",
    "Html": "<p>Well not only that, but considering it has NO other stats, it's a really really crappy weapon. The only players that might have gotten any real benefit out of it over a blue would be Frost DK's as they have side-bonuses that jack up it's value. Even that would be a stretch.</p>",
    "PostedDate": "2009-10-10T12:04:49.853-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]