[
  {
    "Id": "244125",
    "ThreadId": "71579",
    "Html": "<p>Now Asy has stated that at least the Bear module currently only uses Parry as a threat stat. I am not sure if this applies to the other tanking though, but Asy has stated that they do plan on implementing parry as a mitigation stat once the boss module is fully implemented. However shouldn't there be a temporary solution until then. What I'm suggesting is using the current &quot;Target Damage (Raw)&quot; and &quot;Target Damage (Speed)&quot; information that the user supplies and add in a check box if they want to implement Parry Haste effect (defaulted on since most Ulduar and ToC bosses do Parry Haste). Next calculate the scores for both the information supplied by the user and one with attack speed * 60% (Parry haste decreses the next attack speed by 40%). Then in the calculations use the remaining parry % (the amount of parry % under parry cap) and times that parry hasted score. Then add that to the normal mitigation score. This should provide a temporary solution to parry not being used as a mitigation stat.</p>\r\n<p>Formula in a algebraic notation; generalized</p>\r\n<p>(Target Damage * Speed) + ( % of parry from cap * ( Target Damage * ( Speed * 60% ) ) ) = new mitigation score</p>",
    "PostedDate": "2009-10-10T01:09:41.827-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "244181",
    "ThreadId": "71579",
    "Html": "<p>Just to clear things up so others don't get confused as I did. &nbsp;He's talking about expertise being a threat-only stat vs being a mitigation stat as well.</p>",
    "PostedDate": "2009-10-10T07:50:14.103-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "244191",
    "ThreadId": "71579",
    "Html": "<p>I'm pretty sure that ProtWarr and ProtPaladin already support it, TankDK might too, not sure. Yeah, I'll try to get it into Bear soon as well; doesn't have to wait for the Boss Handler feature.</p>",
    "PostedDate": "2009-10-10T08:06:09.727-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "244197",
    "ThreadId": "71579",
    "Html": "<p>Sorry about the misunderstanding. But yea ebs that is what I was talking about. Probably shouldn't have written that up at 4 in the morning after I was having difficultly to sleep and that thought came to me. Also, thanks Ast. It is always disconcerting to see Rawr say that it's ok to be under dodge cap with expertise in Bear when the bare minimum should be dodge cap.</p>",
    "PostedDate": "2009-10-10T08:36:13.47-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "244295",
    "ThreadId": "71579",
    "Html": "<p>Correct TankDK already has it as a mitigation stat.&nbsp; Or more-over, there's a balance of haste &amp; expertise involved for mitigation.&nbsp; For example: until you're parry haste capped on Expertise, Haste is generally bad for mitigation for TankDKs.</p>",
    "PostedDate": "2009-10-10T19:35:51.977-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "244415",
    "ThreadId": "71579",
    "Html": "<p>Yeah ProtWarr does model it. I take a slightly more advantage approach and iterate on it 4 times, as basically both the player and the boss's parry hasting can feedback on eachother a bit. Otherwise, it isn't too complex.</p>\r\n<p>Although, I will note that the majority of bosses don't actually parry haste anymore.</p>",
    "PostedDate": "2009-10-11T13:42:10.183-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "244416",
    "ThreadId": "71579",
    "Html": "<p>Evan,</p>\r\n<p>It was my understanding that everything in ToC but Gormokk the Impaler parry hastes (and that was actually a hotfixed nerf to him because of how hard he hits with impale), is this not correct?</p>",
    "PostedDate": "2009-10-11T13:45:02.723-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "244443",
    "ThreadId": "71579",
    "Html": "<p>You are correct. Like I said I wrote that post at 4 am when I was half-asleep trying to fall asleep. So my information was partially incorrect. The next day I found out by reading some older posts on Elitist Jerks' Druid threads that only some of the Ulduar bosses do parry Haste. I forget off-hand which ones they said if any (cannot remember if they said all of them do not or just a small handful do).</p>",
    "PostedDate": "2009-10-11T15:21:21.907-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]