[
  {
    "Id": "244677",
    "ThreadId": "71719",
    "Html": "<p>I am use to working with code repositories like AccuRev or Subversion when submitting changes. The CodePlex website has a subversion server set up for this project. So I downloaded their client and checked out a fresh copy of the code. Now I am wondering when I make changes what is the correct method for submitting these?</p>",
    "PostedDate": "2009-10-12T07:29:38.407-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "244701",
    "ThreadId": "71719",
    "Html": "<p>You need to be granted developer access by Astrylian before you can commit changes to the source. Otherwise you can create a new issue and attach the proposed patch file.</p>\r\n<p><br>You will need to indicate what model it is you are interested in working on, if its one of the ones where we have no developer then it is likely we can welcome you to the team, if its a model where there is already an active developer it will depend on the extent of the activity as to whether or not your contribution as a full developer is required or whether submitting patches is preferable.</p>",
    "PostedDate": "2009-10-12T08:23:23.547-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "244705",
    "ThreadId": "71719",
    "Html": "<p>Go to the Source Code page, click Upload Patch at the top, submit a Zip file containing all the files you with to edit and a summary .patch file of all the changes. Please list the changes made in the summary of the Patch during your submission starting with the Model (&quot;Rawr.Rogue&quot; for example).</p>\r\n<p>Please note that when it comes to patch submissions we would prefer simple changes per patch, not complete overhauls at once.</p>",
    "PostedDate": "2009-10-12T08:31:11.043-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "244759",
    "ThreadId": "71719",
    "Html": "<p>That is because we manually have to check them.</p>",
    "PostedDate": "2009-10-12T10:21:18.643-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]