[
  {
    "Id": "245727",
    "ThreadId": "71997",
    "Html": "<p>Unsure if this is the correct place to ask this but, rawr is giving quite a difference on 2 very similar weapons:</p>\r\n<p><strong>Misery's End 245</strong> vs <strong>Heartcrusher 245.</strong></p>\r\n<p>On paper Misery has +3 Crit and +4 Haste everything else relevant is the same.</p>\r\n<p>But on my set up this Misery's end has a +71.2 Rawr score advantage <br>(64.86 fight healing, 6.34 Burst) <br>and this is without any gem being in the Heartcrushers socket?</p>\r\n<p>I did a quick stat for point comparison and from what I can tell, again my equiped gear, +3 crit and +4 Haste should be worth around +10.4 Rawr score, not +71.<br>(I did this by equiping a straight haste and straight crit gem in the socket of Heartcrusher and looking at what this added to the Rawr score for each, hence getting a value for each point of crit and haste)</p>\r\n<p>Now agreed this is a pretty small discrepancy, but its just the 1st time I have looked at the magic of what Rawr does, and this just doesn't seem to add up.<br>And so my faith in the magic has been called into question.</p>\r\n<p>Any pointers?&nbsp; I have looked at the edited stats of each item to make sure they are correct and they seem to be.</p>",
    "PostedDate": "2009-10-14T12:23:16.997-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "245741",
    "ThreadId": "71997",
    "Html": "<p>I actually noticed this the other day and was wondering the same thing. I decided to play around a bit, and the only major difference I saw was Heartcrusher/Heartsmasher has a 1.5 attack speed vs Misery/Suffering's End which has a 1.8 attack speed. Along these same lines, Polished Azuresong Mageblade, with an attack speed of 2.4, &nbsp;shows as a significant upgrade to either options, with a net gain of +12 crit +5 int and -58 haste compared to Suffering's End, an upgrade of over 200 Overall points according to rawr.</p>\r\n<p>Edit: This Behavior seems linked to Maintain Judgement. As I don't entirely understand paladins, I'll leave it to someone who does to explain.</p>",
    "PostedDate": "2009-10-14T13:31:16.877-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]