[
  {
    "Id": "245815",
    "ThreadId": "72026",
    "Html": "<p>I'm a feral druid, I have 2 Feral specs one for cat and one for bear.</p>\r\n<p>Is there a way that i can have 2 sets of gear that i can click between without having to save my cat gear and open another save for bear gear? I have been looking throught the options and such but i can't find if it can do that. If not is there a wish list i can post to?</p>",
    "PostedDate": "2009-10-14T16:41:31.807-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "245816",
    "ThreadId": "72026",
    "Html": "<p>No, your Bear needs to be managed separately from your Cat. We may incorporate this at some point but for now there's too much cross-over side-effects with trying to do multiple models in same file.</p>",
    "PostedDate": "2009-10-14T16:43:59.387-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "245818",
    "ThreadId": "72026",
    "Html": "<p>The only &quot;long part&quot; in setup of your file is green dotting all your old gear that you want to have available for the optimizer (and to some extent, the same in the gems/enchants tabs).</p>\r\n<p>I would suggest taking the route I have:&nbsp; Set up one file, your main spec, get all your gear in there correctly marked.&nbsp; Save As -&gt; other file.&nbsp;</p>\r\n<p>Then you can go into each and set up the enchants, gems and buffs you want.&nbsp; Going forward, whenever you get a new bit of gear you just green dot it on both files.&nbsp; One of these is your main spec, use the optimizer for that.&nbsp; The other is your offspec, optimize that by hand and use blue dots for pieces you are considering serving dual purpose.</p>\r\n<p>I personally keep additional main spec files where I have green dotted various levels/sources of gear and optimized so I can see what my final builds might look like down the road at various progression points.&nbsp;</p>",
    "PostedDate": "2009-10-14T17:11:53.557-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "246127",
    "ThreadId": "72026",
    "Html": "<p>You guys realize you can do this with batch tools almost exactly, right?</p>\r\n<p>From scratch... import your toon.&nbsp; Highlight all your gear, gems, and enchants for this spec.&nbsp; Save to current spec file (toon_spec).&nbsp; Then, save the file to another file (toon_altspec), and then while you're working on the alt file, modify the spec, and talents, and go through and now add all your&nbsp;alt spec enchants, gems, and gear, so that all items, gems, and enchants are selected for both&nbsp;specs on the&nbsp;alt spec file.&nbsp; Save&nbsp;your current&nbsp;file again to save all the updates.</p>\r\n<p>Open up the batch tools.&nbsp; Hit the &quot;...&quot; button and select the alt spec file.&nbsp; Then do the same for the main spec file.&nbsp; Go to the top, and select &quot;Tools &gt; Set Available Items&quot; which ensures that both spec files have both sets of gems, gear, and enchants available.&nbsp; Then click to select your main spec file on the list of two.. and go down to the bottom right corner and hit the available &quot;up&quot; arrow to make the main spec the first in the list.&nbsp; Now you can use &quot;Tools &gt; Progressive Optimize&quot; to optimize all your available gear, gems, and enchants for your main spec first, then your alt spec.&nbsp; Obviously it's not going to select heal gear for a tank spec, so there shouldn't be much crossover... but it's possible that RAWR may discover that some piece of gear will work better as part of your main spec and will gem it for the main spec first, making it non-optimal for the off-spec (but still useful).</p>\r\n<p>This does result in having a whole bunch of stuff selected on both files, so it makes the optimize process slower.&nbsp; IMHO it's worth it, but I also have an I7 so it doesn't bother me much.</p>",
    "PostedDate": "2009-10-15T09:53:53.657-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]