[
  {
    "Id": "246039",
    "ThreadId": "72096",
    "Html": "<p>First off; thanks for the awesome program! I use Rawr with all my toons and find that it's a very useful tool.</p>\r\n<p>One question; does Rawr value hit as much as it should for ret? My pally just hit 80 last night and even with my very low hit rating of 132 it's still calling gemming for pure strength a much greater dps increase then gemming for hit 'til capped which seems off to me. Thanks for the help.</p>",
    "PostedDate": "2009-10-15T06:59:53.727-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "246130",
    "ThreadId": "72096",
    "Html": "<p>Unlike many other classes, hit is not the highest DPS increase, pre-cap, for Ret paladins. So, that sounds like it's working as intended.</p>",
    "PostedDate": "2009-10-15T10:00:29.813-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "246158",
    "ThreadId": "72096",
    "Html": "<p>I've seen that mentioned before however I've also raid (EJ, etc) that since 3.1 hit cap of ~263 (8%) is vital and priority one. In that case I would think Rawr would weigh hit rating higher then strength 'til capped?</p>",
    "PostedDate": "2009-10-15T11:32:14.61-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "246162",
    "ThreadId": "72096",
    "Html": "<p>We don't set any weights, what you see in Relative Stat Values is the result of the calculations made.</p>",
    "PostedDate": "2009-10-15T11:42:26.837-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "246229",
    "ThreadId": "72096",
    "Html": "<p>The reason RAWR is telling you strength is the way to go has to do with the recent changes to paladins and SoV usage. You are correct that at higher end gear hit rating is more valuable then strength, but you answered that by saying you just turned 80. As ret hit rating's value rises with the magnitude of your hits, if you hit like a sissy then it's not really a big deal to miss one or two or more attacks. When you start getting a lot of attack power and gear and start hitting like a truck hit's value will rise ahead of strength.</p>",
    "PostedDate": "2009-10-15T13:54:11.217-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "246492",
    "ThreadId": "72096",
    "Html": "<p>Bacon thanks for that explanation. A guildy asked me the same question and I didn't have the answer.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-10-16T05:12:27.237-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]