[
  {
    "Id": "246659",
    "ThreadId": "72254",
    "Html": "<p>i dunno if its something im doing wrong in the settings, i'm running a rogue and i customized my gemming template for 3 possiblities of gem stacking i want being the gem of each color - red, blue, yellow, ect ect that i would stack such as stacking attack power, agility, or armor pen - but it seems the sets of gems i want to use rawr doesn't stick to the gear gem limitations. for example i was looking between the gem tweaking i want and for a blue gem slot it will throw in a +20 agility red cardinal ruby when i optimize - you can't do that... i mean obviously if i could just throw a +20 agility in EVERY gem slot like it wants to then yea im going to go up another 50k dps (exageration) basically what its doing is ignoring the gem color restrictions, specially on blues and metas. how do i fix this or is this a known problem?</p>",
    "PostedDate": "2009-10-16T11:55:59.963-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "246683",
    "ThreadId": "72254",
    "Html": "<p>I think you may misunderstand WoW's gemming system. You can indeed put gems in sockets that don't match their color. You just don't get the socket bonus. Commonly, that's worth it.</p>",
    "PostedDate": "2009-10-16T12:51:32.453-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "246684",
    "ThreadId": "72254",
    "Html": "<p>Checking 'Enforce Gem Requirements' will make it force the optimizer to fit the Meta Req's and limit JC Dragonseyes and Nightmare Tears, etc.</p>",
    "PostedDate": "2009-10-16T12:51:37.547-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "246777",
    "ThreadId": "72254",
    "Html": "<p>The only technical restriction on gem placement is that only metas can go in meta sockets.</p>",
    "PostedDate": "2009-10-16T19:17:15.663-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "246908",
    "ThreadId": "72254",
    "Html": "<p>wait wait... ur saying... i could throw a red gem in a yellow slot? and enforce gem requirements only reflects meta as far as you can't put in a meta gem that requires say 2blues and a yellow gem if you don't have the requirements for it - there for it won't recommend that gem if you only have 1 blue and 1 yellow - thats what i understood</p>",
    "PostedDate": "2009-10-17T13:58:47.167-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "246917",
    "ThreadId": "72254",
    "Html": "<p>Relentless Earthseige Diamond (+21 AGI, 3% Increased Crit Damage)</p>\r\n<p>Requires At Least 1 Red Gem<br>Requires At Least 1 Yellow Gem<br>Requires At Least 1 Blue Gem</p>\r\n<p>Here's one way I can satisfy it:</p>\r\n<p>My Helm has a Red Socket in addition to the Meta socket, so I'm placing a Fractured Cardinal Ruby (Red Gem, +20 ArP). Since I have a Meta and a Red in my Helm Sockets. I get my Socket Bonus of +8 STR. This Red Gem is also satisfying my Red req for the Meta. I still need a Yellow and Blue.</p>\r\n<p>My Legs have 2 sockets, a Yellow and a Blue. I put a Rigid King's Amber (+20 Hit) into the Yellow Socket which fulfills that socket req for the socket bonus and it is also taking care of my Meta's Yellow Req. However, I will be putting a Fractured (Red, +20 ArP) into the Blue socket. I get the Gem's +20 ArP but I no longer qualify for the Leg's socket bonus of +6 Crit.</p>\r\n<p>My Chest has 2 sockets, a Red and a Blue. I put another Fractured (+20 ArP) on for the Red slot and the Nightmare Tear (+10 All Stats) in the Blue. Since Nightmare Tear is Prismatic, it fills the Blue Socket on my Chest and fulfills that req for my Chest's socket bonus (+6 Crit). Nightmare Tear can also fulfill the Red or Yellow req's (but not both) for my Meta, but since I already have that filled, it's being my Blue Meta Req instead.</p>\r\n<p>So, for my Meta, I have a Fractured, a Rigid and a Nightmare Tear coming together to activate it.</p>\r\n<p>For my Socket Bonuses, I meet my Helm (+8 STR) and Chest (+6 Crit) but I fail my Legs (I don't get +6 Crit). All the other stuff works (red gem in blue slot still gives me the gem's value).</p>",
    "PostedDate": "2009-10-17T14:38:27.887-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "246919",
    "ThreadId": "72254",
    "Html": "<p>i... wow... been playing this game for a lil over a year and a half and i never knew you could put an unlike gem in the gem spot the gear asks for... i feel stupid...</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-10-17T14:46:15.497-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "246924",
    "ThreadId": "72254",
    "Html": "<p>Jothay, good explanation but you are a bit off on one thing, the Nightmare Tear will on it's own satisfy the Earthseige meta requirements. It counts as 1 red, yellow, AND blue gem.</p>\r\n<p>&nbsp;</p>\r\n<p>~Droid</p>\r\n<p>&nbsp;</p>\r\n<p>EDIT: Forgot to spell-check!</p>",
    "PostedDate": "2009-10-17T14:58:00.483-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "247070",
    "ThreadId": "72254",
    "Html": "<p>Droid is correct - the Nightmare Tear satisfies one Red, one Yellow, and one Blue concurrently.&nbsp; You can test this by removing all gear except a helm for the Relentless meta, and one piece with a Nightmare Tear gemmed.</p>\r\n<p>The reason most put this in a Blue socket is because the Blue component for socket bonuses is the most difficult to pick up.&nbsp; You don't want to put it in place of a Red component because of the stats you're sacrificing, and you usually don't want to put it in a yellow, because you're either a) intentionally ignoring the socket due to a poor socket bonus, or b) picking up the socket bonus with a yellow component gem, again sacrificing stats.&nbsp; The Blue would otherwise be ignored, and can usually pick up a solid (6 Str or better) socket bonus on its own, so it's the best place to throw the Nightmare Tear.</p>",
    "PostedDate": "2009-10-18T12:09:02.3-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "272866",
    "ThreadId": "72254",
    "Html": "<p>I am in a similar (kindof) spot.&nbsp; Trying to gem a rogue I notice there are only two default gemming templates - both of which use the agility gem and not the AP gem.&nbsp; When I go to gems and make them available for the optimiser, it suggests the AP gems over the Agi ones, but in the standard stat view comparing items, it only compares item with those two gemming templates ie) no AP gems.&nbsp; I know I could set up more custom gemming templates, but the variations once you throw in the AP gem, the expertise gem and haste (hybrids) gems, become daunting.&nbsp; Am I missing something here? Is there really only TWO rogue gemming templates?&nbsp; Can I simply make those other gems available in the standard stat view (to use) like you can for the optimizer?&nbsp;</p>\r\n<p>Thanks in advance.</p>",
    "PostedDate": "2010-01-04T05:47:33.24-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "272978",
    "ThreadId": "72254",
    "Html": "<p>What you describe is exactly what the gemming templates are for, and it's not as daunting as you imagine. From what gems you mention, you should be looking at adding... Looks like 4 gemming templates. [AP AP AP] [AP AP/Haste AP/Sta] [Exp Exp Exp] [Exp Exp/Hit Exp/Sta]</p>",
    "PostedDate": "2010-01-04T09:53:00.233-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "273056",
    "ThreadId": "72254",
    "Html": "<p>OK, that's kind of where I was heading.. but why wouldn't [AP AP/Haste Exp] be another template or [Hit Exp AP]?&nbsp; It was at this point that I found the task confusing and daunting!!&nbsp; Are those options somehow covered in the 4 templates you mentioned above?</p>\r\n<p>Cheers</p>",
    "PostedDate": "2010-01-04T13:22:10.097-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "273058",
    "ThreadId": "72254",
    "Html": "<p>That's why we state the basic templates should be all that's in there for templates and anything beyond that is just gems to be marked for the optimizer to figure out.</p>\r\n<p>I agree that 2 default templates isn't really cutting the mustard and we should really go in and add 3 or 4 more to cover more bases.</p>\r\n<p>WTB Rogue Dev.</p>",
    "PostedDate": "2010-01-04T13:25:40.283-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "273078",
    "ThreadId": "72254",
    "Html": "<p>It winds up being a tradeoff. &nbsp;More gemming templates = slower performance, but more accurate dropdowns. &nbsp;Less gemming templates = faster performance, but you have to do some tweaking.</p>\r\n<p>If you use the optimizer more than just playing with things, then less gem templates is better. &nbsp;If you're constantly swapping things around, then more gem templates are better.</p>\r\n<p>Honestly, warrior has ignored a lot of gem templates lately because our performance is already so bad, but I'm thinking about adding a more robust set (ie Str/Hit/Str, Arp/Hit/Arp, Exp/Crit/Exp, Str/Crit/Nightmare, Arp/Crit/Nightmare). &nbsp;It just turns in to so many permutations that you wind up with 40-50 gem templates to cover all users.</p>",
    "PostedDate": "2010-01-04T14:18:34.383-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "273103",
    "ThreadId": "72254",
    "Html": "<p>I think I was up to 80-something at some point, Ebs, if my memory serves me correctly.&nbsp; Just a few months ago, I think Astry clarified how the Optimizer works, which was to the effect that the Optimizer doesn't go through every individual template when looking at any given gear comparison, but rather, goes through an looks at only the <em>unique</em> gems in each slot.&nbsp; What I gathered from this was, if there is a straight Str, ArP, and ExP as the only options for the red socket, no matter how many templates you have, it will only try three different&nbsp; gems in the red socket, instead of 10+ Str gem permutations, 10+ ArP gem permutations, and 5+ ExP permutations.&nbsp; I'll try to find that older explanation, as it's probably a lot more clear than I am right now (and significantly more accurate =D).</p>",
    "PostedDate": "2010-01-04T15:21:00.037-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "273109",
    "ThreadId": "72254",
    "Html": "<p>Yes, BrWarner, you are correct (presuming you have the correct option selected, which it is by default -- Assume gems in gem templates as available, or something similar, iirc).</p>\r\n<p>However, the performance I was referring to is just from changing talents or swapping around items manually. &nbsp;The optimizer may not go through all the permutations, but the Helm Comparisons Chart, for example, will. &nbsp;It computes them all, then narrows them down to the 3 (by default) highest and only shows them. &nbsp;The performance isn't as bad when looking at RSV or when heavily filtered, but when all items are shown, it can be painful especially on a laptop. &nbsp;I know that using the Enhancement model was particularly painful on my laptop a while back when I was trying to help a shammy friend out with his gemming.</p>",
    "PostedDate": "2010-01-04T15:43:27.227-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "273934",
    "ThreadId": "72254",
    "Html": "i dunno i can't get it to gem right... i have set up custom gemming with full armor pens and full agility it never tells me to gem armor pen cause it lowers my dps according to rawr... but i can't get it to even get the right values for my character off armory i have 4164 attack power and it tells me i have 4558 with out any buffs selected its all screwed up<br>",
    "PostedDate": "2010-01-06T11:39:45.4-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "273940",
    "ThreadId": "72254",
    "Html": "<p>If its saying that ArP would reduce your DPS then it's because you can't generate enough ArP with your current gear to get past the threshold where ArP &gt; AGI. Until you can get enough to do that it won't tell you to gem for ArP.</p>\r\n<p>And the reason it shows you 4558 AP instead of 4164 is because you have procs that are occuring that are increasing your Attack Power. Like Berserking or Trinkets.</p>",
    "PostedDate": "2010-01-06T11:57:12.927-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]