[
  {
    "Id": "246912",
    "ThreadId": "72313",
    "Html": "<p>I currently have 4/5 T8 and was looking at upgrading to T9 but looking at the individual pieces Rawr considered all of them to be downgrades over the 8/8.5 pieces I'm wearing.&nbsp; I struggled for a while to figure out what the problem was because all the T9 pieces are stat upgrades and the set bonuses are better as well.&nbsp; What I finally did was load my char from the armory and removed all 4 pieces of T8 and then looked at them in the gear/optimizer list and every T9 piece was considered as an upgrade over the T8/8.5 piece I had been wearing.</p>\r\n<p>The only thing I can figure out is that Rawr is applying the set bonuses to each individual item rather than on the set as a whole and so it considers breaking the 4piece bonus to be a downgrade when the item itself is in fact an upgrade excluding set bonuses.&nbsp; I'm not sure if this is intentional or not but I had to do a lot of tinkering to make Rawr realize that T9 is in fact an upgrade.&nbsp; It might be worthwhile to investigate a better way to represent set bonuses so holy paladins won't skip T9 as even at the same stats the 4 piece set bonus makes it worthwhile in terms of tank survivability.</p>",
    "PostedDate": "2009-10-17T14:22:13.413-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "246929",
    "ThreadId": "72313",
    "Html": "<p>I think you said it yourself; when you've got 4T8, swapping any one piece for a piece of T9 is a <em>downgrade</em>, because you lose 4T8. That's accurate. If you get a 2nd piece of T9 (such as in that slot that you don't have T8 in), you'll find that T9 is an upgrade as you expect.</p>",
    "PostedDate": "2009-10-17T15:06:31.113-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "247537",
    "ThreadId": "72313",
    "Html": "<p>Astrylian,</p>\r\n<p>&nbsp;</p>\r\n<p>I have a related question for you. Lets say you have 4xT8 or 2xT8 and 2xT9 and you have 2 of the trophies available. How would you suggest figuring out which two tier pieces would be the best choice (i.e. the optimzier is based upon recalculating 1 at a time). I imagine that given the new trophy system that this is a more common tuning problem people are facing...</p>",
    "PostedDate": "2009-10-19T20:29:15.547-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "247567",
    "ThreadId": "72313",
    "Html": "<p>Suppose there's 3 pieces of T9 that you don't have, and you have 2 trophies, and you want to know which two to get. Lets call them A, B, and C, for simplicity.</p>\r\n<p>&nbsp;</p>\r\n<p>Mark A as available, temporarily. Right click on B, choose evaluate upgrade. That's the value of A+B. Then right click on C and choose evaluate upgrade. That's the value of A+C.</p>\r\n<p>Unmark A as available, and mark B as available. Then right click on C, and evaluate upgrade. That's the value of B+C. Whichever is higher, A+B, A+C, or B+C, that's the pair of items to buy.</p>\r\n<p>&nbsp;</p>\r\n<p>Yes, we could definitely implement some built-in way to do this, but we want to do it in a more general way; there's more than just trophies, there's all sorts of 'costs' for items, many of which are just arbitrary or user-assigned, and we want to build a feature to handle them as such. That's a ways off at the moment though.</p>",
    "PostedDate": "2009-10-19T22:40:09.487-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "247904",
    "ThreadId": "72313",
    "Html": "<p>Thanks!!! :)</p>",
    "PostedDate": "2009-10-20T15:45:01.31-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "248189",
    "ThreadId": "72313",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>Astrylian wrote:</strong><br>\r\n<p>I think you said it yourself; when you've got 4T8, swapping any one piece for a piece of T9 is a <em>downgrade</em>, because you lose 4T8. That's accurate. If you get a 2nd piece of T9 (such as in that slot that you don't have T8 in), you'll find that T9 is an upgrade as you expect.</p>\r\n</blockquote>\r\n<p>I apologize for not being more clear: I had enough badges to buy 4 pieces of T9 in one go so although I was looking at individual pieces I was planning on upgrading the whole set in one shot.&nbsp; Protecting the set bonus in that situation seems confusing in determining the value of the upgrade.&nbsp; Maybe a 'compare whole set' option could be added?&nbsp; That could at least tell you that while upgrading one or two pieces here and there is not an upgrade that it's worthwhile to hang onto them until you have the whole set to swap in. *shrugs* I can see where this would be a difficult situation to handle in code.</p>\r\n<p>Either way I applaud the work you guys put into making Rawr what it is.&nbsp; It's an invaluable tool.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-10-21T09:29:11.017-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "248383",
    "ThreadId": "72313",
    "Html": "<p>Aye, the situation you describe is exactly what the Optimizer is for.</p>",
    "PostedDate": "2009-10-21T20:06:06.433-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]