[
  {
    "Id": "247054",
    "ThreadId": "72356",
    "Html": "<p>I presently have a spreadsheet that takes my current armor's overall &quot;Rawr&quot; number and then I input the new upgrade from emblems into the spreadsheet with it's number as well as how many of what emblem it costs to obtain that piece.&nbsp; I do this for every slot with every emblem purchasable item then do the following calculation</p>\r\n<p>&nbsp;</p>\r\n<p>(UpgradeItemsRawr - OriginalItemsRawr) / NumberOfEmblems</p>\r\n<p>&nbsp;</p>\r\n<p>This tells me how much &quot;bang for the buck&quot; I get out of every emblem spent.&nbsp; Could this feature be included into Rawr as a report for those who wonder where to spend their emblems based on their current armor?&nbsp; or is there a feature already in Rawr that I have overlooked that offers this already? It is not difficult to manually copy numbers from Rawr over to my spreadsheet every time I upgrade my armor, but if that step could be eliminated for me and also offer the end result to all Rawr users I think it would be awesome!</p>\r\n<p>&nbsp;</p>\r\n<p>By doing this I decided to go with the 50 emblem of triumph Turalyon's Greaves of Conquest for my holy pally over the 75 emblem Turalyon's Greaves of Triumph.&nbsp;</p>\r\n<p>The 50 emblem ones offered a better amount of increase to my healing per emblem spent!&nbsp;</p>\r\n<p>Whereas on my shoulders I chose the 45 emblem of triumph Mantle of the Groundbreaker over 30 emblems of triumph for Turalyon's Spaulders of Conquest.</p>\r\n<p>Overall I am very pleased with the results I am having using Rawr to evaluate gemming/enchants and gear upgrades for my characters!</p>\r\n<table style=\"height:19px\" border=0 cellspacing=0 width=1 rules=NONE>\r\n<tbody>\r\n<tr>\r\n<td width=217 height=17 align=LEFT><br></td>\r\n</tr>\r\n</tbody>\r\n</table>",
    "PostedDate": "2009-10-18T10:08:54.503-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "247064",
    "ThreadId": "72356",
    "Html": "<p>Almost. I'd suggest using the Build Upgrade List feature, because that will accurately tell you the upgrade value of each item. That's the number you want to divide by its emblem cost.</p>\r\n<p>We don't <em>quite</em>&nbsp;want Rawr to do the division by emblem cost, because we'd like to do it in a more general fashion; a user-defined cost per item, in whatever unit they want. Be it emblems, DKP, gold, time spent grinding rep, etc. That idea is a ways off, but something that's on our minds, for sure.</p>",
    "PostedDate": "2009-10-18T11:36:48.723-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]