[
  {
    "Id": "247099",
    "ThreadId": "72372",
    "Html": "<p>I have several different classes and Use rawr to configure my equipment gemming etc etc.</p>\r\n<p>I mainly just use the &quot;Overall&quot; rating for deciding things, but now I'm getting more focused on reaching peak performance with my outfits.</p>\r\n<p>As such I'm wondering how Burst and Normal/Sustained DPS and healing are figured, and how they related to in game actions.</p>\r\n<p>On my Holy Paladin Burst and Normal healing tend to vary widely per item. Yet a lot of the time on my Shadow priest Sustained and Busrt DPS are exactly the same number.</p>\r\n<p>I couldn't find a wiki or any sort of page that showed what the various ratings referred to, so my question is, exactly what does Rawr consider Burst as opposed to Normal, or at least where can I find this information?</p>\r\n<p>I'm mainly asking in reference to the Holy Paladin side.</p>",
    "PostedDate": "2009-10-18T15:54:04.18-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "247106",
    "ThreadId": "72372",
    "Html": "<p>Did you check out the tooltips for the ratings on the Stats tab? What each rating means varies a bit by model, but in general... Sustained = Healing or DPS over the whole fight, considering mana limitations. Burst = maximum Healing or DPS, not mana constrained. If you want more total damage done at the end of the fight, or are running OOM while healing, you care about Sustained. If you want more damage/healing done during important parts of a fight, you want Burst. Overall is simply a sum of the others. Sustained and Burst are typically identical values when you've got enough mana to maintain your maximum burn for the full fight.</p>",
    "PostedDate": "2009-10-18T16:43:38.51-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "247127",
    "ThreadId": "72372",
    "Html": "<p>Thank you for the info.</p>",
    "PostedDate": "2009-10-18T18:33:11.567-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]