[
  {
    "Id": "247454",
    "ThreadId": "72466",
    "Html": "<p>Perhaps I am missing this feature somewhere, but is it possible to turn off set bonuses or be able to have it ignore them?&nbsp; I keep going through and looking at different possibilities and it ranks all four of my T8 pieces as being almost higher than any piece in the game minus one or two pieces.&nbsp; While I know there are better pieces in some slots, I like to have my T8 remained checked that way I can compare if it is indeed better than the previous piece.</p>",
    "PostedDate": "2009-10-19T13:58:38.067-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "247455",
    "ThreadId": "72466",
    "Html": "<p>Doing that would defeat the purpose of the set bonuses, if you are breaking that bonus you need to know it.</p>",
    "PostedDate": "2009-10-19T13:59:40.887-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "247481",
    "ThreadId": "72466",
    "Html": "<p>This is a common mis-conception as to how Rawr works.</p>\r\n<p><br>Each model has hundreds of formulae that take a gear set with all the gems/enchants/buffs/talents/socket bonues/set bonuses/etc etc etc. This is then treated as a single collection of stats. This one collection is put into the model and it runs through the hundreds of formulae and settings for that model and spits out a few numbers eg: dps total, threat, heal per second etc whatever is relevant to that model.</p>\r\n<p>Now when it compares a new item for a slot it creates a new single collection of stats object - throws that collection to the model - runs that through the hundreds of formulae and gets a new figure for the new collection. Then guess what it compares the new with the old and sees what the difference is. The formulae are IDENTICAL each time round all that changes is that single collection of stats you give the model.</p>\r\n<p>So if you see a comparison list with 100 items in it Rawr has taken a base single collection and got a figure then it has done 100 other collections and got 100 other figures. It then sorts the results and displays it as a easy to read graph. So if it has done a full calculation with an item with a set bonus and worked out its better than a full calculation with a different item in that slot then that will be right.</p>\r\n<p>What you MIGHT be missing however is using the optimiser which takes lots of possible options and swaps out several items at a time not just one at a time. If you haven't already give the optimiser a try. Load your character and then mark each item you have in your bags or bank or could buy etc with a green diamond. Remember to do this with Enchants etc too. Then goto tools | optimiser and run the optimize option. It will take a while as it swaps round potentially thousands of different possible options given the stuff you mark until it finds the best combination of the gear you marked.</p>",
    "PostedDate": "2009-10-19T15:24:57.423-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "247816",
    "ThreadId": "72466",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>Jothay wrote:</strong><br>\r\n<p>Doing that would defeat the purpose of the set bonuses, if you are breaking that bonus you need to know it.</p>\r\n</blockquote>\r\n<p>Perhaps I wasn't clear in what I was asking.&nbsp; If you go under the &quot;Buffs&quot; tab you can see that the set bonuses are checked and grayed out.&nbsp; Is there not a feature for it to disable it?&nbsp; I ask because I have 4 set T7, 4 set T8 and then of course various gear pieces amongst all the tier levels.&nbsp; If I was to put my T7 pieces on it would say it outweighs any set including T9 set bonuses as the same would go for my T8.&nbsp; I know what my set bonuses are and the potential behind each one (or lack thereof) that I can tell myself if its worth it.</p>\r\n<p>For instance T8 4 piece an extra 200 something Shield Block Value does not outweigh anything else.</p>\r\n<p>&nbsp;</p>\r\n<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>Levva wrote:</strong><br>\r\n<p>What you MIGHT be missing however is using the optimiser which takes lots of possible options and swaps out several items at a time not just one at a time. If you haven't already give the optimiser a try. Load your character and then mark each item you have in your bags or bank or could buy etc with a green diamond. Remember to do this with Enchants etc too. Then goto tools | optimiser and run the optimize option. It will take a while as it swaps round potentially thousands of different possible options given the stuff you mark until it finds the best combination of the gear you marked.</p>\r\n</blockquote>\r\n<p>I've tried using the optimizer, but its not always working the way I want.&nbsp; I'm still going through and adjusting settings hoping I can get it to work the way I do want it to here soon.</p>",
    "PostedDate": "2009-10-20T11:23:46.363-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "247824",
    "ThreadId": "72466",
    "Html": "<p>Your idea for how it needs to work seems to be wrong, I think you are missing the purpose of having them non-selectable by the user. Those are grayed out on the Buffs Pane because we <strong>don't want</strong> users to turn them on/off manually, we want it to on/off <strong>as you equip those tiered items</strong>.</p>\r\n<p>For these kinds of decisions, you should be using the <strong>Optimizer</strong> to determine which will give you the best bonus set groups. Exactly what settings are you having to do to make it &quot;work the way [you] do want it&quot;?</p>\r\n<p>Edit: Also, if you have both T9 and T7 for the same slots, you should be tossing the T7 (or at least not marking it as available to the optimizer)&nbsp;as that gear is immensly less powerful than the T9 items. Then the question doesn't become T7 vs T8 vs T9&nbsp; but just T8-4 vs T8-2+T9-2.</p>",
    "PostedDate": "2009-10-20T11:39:19.883-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "247850",
    "ThreadId": "72466",
    "Html": "Well, as he's a tank, he's probably toying with the different settings to get it to reflect the fight he wants to optimize for.  Unfortunately, tanks can't just optimize out of the box, even with all the buffs set; their options are more....esoteric.  See the private discussion on building a tank set for Anub adds.\r\n\r\nAs for Lucetia, the only way to ignore set bonuses is to create duplicate items under a new ID, and using them instead.  What is your user story (ie, why are you using the app, and why are you asking for this feature?)  If it's just annoying that the dropdown is showing T9 pants weaker than T8 pants, take off a piece of T9 gear before looking at your pants dropdown :P",
    "PostedDate": "2009-10-20T13:03:10.927-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "247888",
    "ThreadId": "72466",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>ebs2002 wrote:</strong><br>Well, as he's a tank, he's probably toying with the different settings to get it to reflect the fight he wants to optimize for.  Unfortunately, tanks can't just optimize out of the box, even with all the buffs set; their options are more....esoteric.  See the private discussion on building a tank set for Anub adds.  As for Lucetia, the only way to ignore set bonuses is to create duplicate items under a new ID, and using them instead.  What is your user story (ie, why are you using the app, and why are you asking for this feature?)  If it's just annoying that the dropdown is showing T9 pants weaker than T8 pants, take off a piece of T9 gear before looking at your pants dropdown :P</blockquote>\r\n<p>Well as you said as a tank there are a few sets that are desired to have depending on the fighting situations.&nbsp; Physical fights plenty of mitigation and armor are a plus.&nbsp; Fast hitting bosses then more shield block settings and magical fights either resistance (if its available) otherwise heavy health pool.&nbsp; Part of the issue that I am having is T8.25 man gear is close to T9.10 man gear in some pieces, but some pieces not.&nbsp; When I go to look at its saying that the entire T8.25 is better than the T9.10 or even T9.25.&nbsp; In order to get around this issue I have been going through and removing three of the four pieces of gear to eliminate any set bonus from being active to give me a better view of what is better for what slot.&nbsp; As many tanks know from past tiers and pieces of gear that our Tier Sets are not always to be desired that we are better off picking up individual pieces of gear altogether.&nbsp; The only bonus worth having is the four set, but at the expense of losing a lot of other stats we can derive in the various slot pieces.</p>\r\n<p>Its like right now I am debating T9 Helm vs 75 Triumph Badge Helm and T9 Chest Piece vs Breastplate of the White Knight (Craftable).&nbsp; T9 always wins due to the &quot;added&quot; features of a set bonus.&nbsp; Part of the issue I am having with the optimizer is that I set it to <span style=\"text-decoration:underline\">&gt;</span> 540 then set whichever stat I want afterwards.&nbsp; I end up with it regemming most of my pieces with Defense + Stamina even though with all the pieces on I have insane amount of defense.&nbsp; I know I can go through and tell it not to accept that gem, but I use that gem so I make it available.&nbsp; I tell it not to regem it and then it gives me pieces that doesn't equal the mitigation setting I set it to, however I could be doing all of this part wrong as well.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-10-20T14:41:21.177-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "247898",
    "ThreadId": "72466",
    "Html": "<p>So let me get this straight, barring the set bonus issue, what exactly are you trying to accomplish?</p>\r\n<p>Are you trying to make a primary set then several other sets for different situations (like needing high mitigation or high block)?</p>",
    "PostedDate": "2009-10-20T15:16:39.677-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "247929",
    "ThreadId": "72466",
    "Html": "<p>I would make use of this option occaisionally.&nbsp;&nbsp; As a feral druid, i'm pretty sure my BiS will be 4pcT9 + 1 offspec.&nbsp; In this situation, I know that I will have the 4pc bonus and want to compare all the individual armor pieces without their set bonuses vs the iLvl 258 off-set pieces.&nbsp;&nbsp;&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>Having said that, i'm sure the option would cause a lot of confusion for other people and grief for the devs who have to answer the questions here :)&nbsp;&nbsp;&nbsp;&nbsp; So I am happy to not have the option and find my own way around the issue rather than confuse and irritate others.&nbsp;&nbsp;</p>",
    "PostedDate": "2009-10-20T17:30:10.803-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]