[
  {
    "Id": "247642",
    "ThreadId": "72527",
    "Html": "<p>I'm having trouble modell my gear after my playstyle. I choose rejuv spam on raid with hots on 2 tanks.&nbsp;</p>\r\n<p>The problem is that rawr then want me to swich all my gems to +INT gems and do prefer gear with alot of INT. This could be correct but my belife is that +spellpower gems always is better in a red slot. How can I change the settings to correct this or is there nothing to correct?</p>\r\n<p>I never go oom so it can't be a mana problem.</p>",
    "PostedDate": "2009-10-20T04:41:11.97-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "247648",
    "ThreadId": "72527",
    "Html": "<p>Buffs---&gt; Check all raid buffs you have&nbsp;available&nbsp;to you.</p>\r\n<p>Options---&gt; Mana---&gt; Set Replenishment Uptime (assuming you checked replenishment as a buff)</p>\r\n<p>&nbsp;</p>\r\n<p>Its likely that you didn't tell Rawr that you were buffed and so it's putting a greater value on regen based stats then it would otherwise.</p>",
    "PostedDate": "2009-10-20T04:54:12.327-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "247652",
    "ThreadId": "72527",
    "Html": "<p>Thanks for the fast answer.</p>\r\n<p>I have added buffs but not that many since I wan't to have gear thats optimal for none optimal situations if you get my point. Replenishment uptime is set as standard.</p>\r\n<p>Could I solve this by seting the fight time lower or would that change anything else than mana regen?</p>\r\n<p>Edit: Also wouldn't spirit get a high value since it's both adds regen and some spellpower?</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-10-20T04:58:54.36-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "247653",
    "ThreadId": "72527",
    "Html": "<p>Shortening your fight would make intellect less valuable, yes. &nbsp;Remember that Replenishment scales with intellect, as does spirit based regen. &nbsp;Because of this, intellect is a valuable stat to healers. &nbsp;Its possible to have &quot;too much spirit&quot; for the amount of intellect you have; its more of a balancing act with stats then a &quot;stack this stat forever&quot;</p>\r\n<p>&nbsp;</p>\r\n<p>If you still disagree with how Rawr is optimizing your character, you'll need to post a character file, and what specifically you disagree with so we can take a look.</p>",
    "PostedDate": "2009-10-20T05:03:22.47-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "247656",
    "ThreadId": "72527",
    "Html": "<p>I think I need to go back and make my settings more carefully. I'm aware that int and spi have a balancing act and that int can be very good with replenishment. The thing is that it's such a big difference when I chose &quot;raidspam with rejuv&quot; or Tank heal with Nourish. Int get's higher values with rejuv spam and I guess that's becaus thats a more mana demanding way to heal.</p>\r\n<p>I will look at my settings again and get back to you if I'm still having trouble. Thank you for your help Gwindor</p>",
    "PostedDate": "2009-10-20T05:11:08.04-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "248222",
    "ThreadId": "72527",
    "Html": "<p>I am having this problem as well with my resto druid.&nbsp; Even if I set replenishment uptime to 100%, RAWR still tells me to gem for int.</p>\r\n<p>Also, where do you check replenishment as a buff?&nbsp; I don't see an option to do this under the &quot;buffs&quot; tab anywhere.</p>\r\n<p>At this point RAWR is prioritizing mana far more than it should for me, and I have no idea why.&nbsp; I have my full 25-man raid buffs checked.</p>",
    "PostedDate": "2009-10-21T11:03:55.103-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "248228",
    "ThreadId": "72527",
    "Html": "<p>You dont check a &quot;Replenishment&quot; buff you check buff that <strong>provides</strong> replenishment such as Mana Spring Totem. On the options Pane for Tree the 3rd tab is Mana and deals with other replenishment things. And make sure you don't have the Fight Duration set really high.</p>\r\n<p>Also it's not RAWR its Rawr.</p>",
    "PostedDate": "2009-10-21T11:16:18.657-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "248256",
    "ThreadId": "72527",
    "Html": "<p>Got it, I will make sure to only call it Rawr from now on.&nbsp; ;)</p>\r\n<p>And okay, I have Improved Blessing of Wisdom checked in the buffs tab, and I am still having the problem I described above.&nbsp; Rawr tells me to gem for int even with 100% replenishment uptime.&nbsp; Fight duration is at 4 minutes.&nbsp;&nbsp; I rarely have mana issues even on 8-minute fights, so I'm not sure why the gem recommendations are coming out that way.&nbsp;</p>",
    "PostedDate": "2009-10-21T12:37:10.947-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "248385",
    "ThreadId": "72527",
    "Html": "<p>Errr, forgive Jothay, he's a warrior, he knows nothing of Mana. Mana Spring Totem provides mp5. It's Vampiric Touch, Hunting Party, Judgements of the Wise, Improved Soul Leech, and Enduring Winter that provide Replenishment (which are all listed in the Replenishment category).</p>\r\n<p>&nbsp;</p>\r\n<p>Replenishment uptime is useless if you don't select one of those Replenishment buffs.</p>",
    "PostedDate": "2009-10-21T20:12:39.493-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "248396",
    "ThreadId": "72527",
    "Html": "<p>Rage: Like the blue bar, only cooler.</p>",
    "PostedDate": "2009-10-21T21:14:24.31-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "248406",
    "ThreadId": "72527",
    "Html": "<p>I was wondering what the mana spring totem had to do with replenishment.&nbsp; ;)</p>\r\n<p>Nonetheless, I don't see any replenishment category in the buffs tab, and no option to check something like Vampiric Touch or Hunting Party. Where can I find this option?&nbsp; I looked all over Rawr and was unable to find it.&nbsp; I'm using 2.2.23.</p>",
    "PostedDate": "2009-10-21T21:51:48.523-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "248408",
    "ThreadId": "72527",
    "Html": "\r\n<p>Hey, it's your job to be the glass cannon, it's mine to slice it into little peices, or keep it from slicing\r\n<strong>you</strong></p>\r\n",
    "PostedDate": "2009-10-21T22:23:14.967-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "248414",
    "ThreadId": "72527",
    "Html": "<p>Glass cannon? Dude, I'm a bear.</p>",
    "PostedDate": "2009-10-21T22:46:01.573-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "248415",
    "ThreadId": "72527",
    "Html": "<p>Err, looks like the Tree model has a bug; it just assumes replenishment, and doesn't allow an option for the buff to be selected.</p>\r\n<p>So, you're fine, just the 100% replenishment uptime in the Options is full replenishment currently then.</p>",
    "PostedDate": "2009-10-21T22:52:01.423-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "248542",
    "ThreadId": "72527",
    "Html": "<p>Realize that in addition to your spell rotation and buffs, you should consider burst/sustained ratio.</p>\r\n<p>I can pick settings, where the stats pane says &quot;Unused cast time percentage: 22%&quot;. &nbsp;In other words I am mana limited. &nbsp;That 22% is equivalent to casting each Rejuv/Lifebloom 0.1s later than optimal, plus having a 6s break every minute. &nbsp;I suspect I actually waste more than that in practice (as resto I don't usually have 260+ casts in a 5 minute fight).</p>\r\n<p>With &quot;Options/Stats/Burst : Sustained Ratio&quot; at 75% Sustained, I see stat weights of</p>\r\n<p>Int: 8.0</p>\r\n<p>SP: 6.7</p>\r\n<p>If I change that ratio to 50%, I see SP at 7.1 and Int at 5.3. &nbsp;Of course my unused cast % remains at 22%.</p>\r\n<p>Some modules (for instance Mage) have time-spent-casting as an input. &nbsp;Tree has it as an output. &nbsp;Decide for yourself if it is at an acceptable level.</p>\r\n<p>TLDR: If Rawr tree values mana too much, consider lowering the &quot;Options/Stats/Burst : Sustained Ratio&quot; input.</p>",
    "PostedDate": "2009-10-22T06:08:24.757-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "248576",
    "ThreadId": "72527",
    "Html": "<p>Erdluf, thanks for your input.&nbsp; That's helpful information to have.&nbsp; I have been playing around with the burst/sustained ratio, but maybe I need to play with it a bit more.&nbsp; With so many factors affecting relative stat weightings, it's hard for me to tell what's causing int to be valued so highly.&nbsp; Right now I'm set at 70% sustained, 30% burst, which I think is an accurate reflection of my general healing style, but I may have to play with it to get the weightings that I want.</p>\r\n<p>How would I manually change the unused cast time percentage?&nbsp; My suspicion all along is that Rawr has been assuming that I cast every single time I have an available GCD, which would obviously put me OOM very fast.&nbsp; Between latency, human reaction time, needing to get out of the fire, etc, I suspect that I cast far less than Rawr thinks I do.</p>\r\n<p>Maybe the default settings for tree should be tweaked a bit?&nbsp; From searching it seems like a lot of people have this issue where mana regen is valued too highly.</p>\r\n<p>&nbsp;</p>\r\n<p>On another note, will the Tree model be fixed so that we can manually select a replenishment buff?&nbsp; Because sometimes I do find myself in unfortunate situations where I don't have it, and I'd like to be able to model that sometimes.</p>\r\n<p>&nbsp;</p>\r\n<p>Also, glass bear cannons FTW!</p>\r\n<p>Thank you everyone for your help.</p>",
    "PostedDate": "2009-10-22T07:18:39.727-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "249247",
    "ThreadId": "72527",
    "Html": "<p>Hi All</p>\r\n<p>I had a major PC crash. Spent most of last weekend and the beginning of this week rebuilding system, but my dev environment isn't back yet. Also have huge work deliveries for the next month. Will see what I can do today, but if I cannot get my dev environment back online this weekend, it will probably mean no changes to Rawr.Tree from my side until next month this time.</p>\r\n<p>All the answers I'm getting out of Rawr.Tree seems to suggest that Spirit is low on the list. For a class that gets a aura bonus based on spirit and for which it used to be a decent approach to stack spirit, it feels weird that MP5 and Int are the top regen stats, but haven't been able to find a bug on that yet. I don't see the balancing act Gwindor was referring to anymore.&nbsp;</p>\r\n<p>I believe the replenishment buffs was in the buffs tab at some point, not sure when it went missing. The easiest way to disable it is to set the slider to 0%, but I could argue that Bliz added in their &quot;bring the player and not the class&quot; speeches, the proviso &quot;... but make sure you have replenishment&quot;. For the sake of consistency, I'll try to fix it though.</p>\r\n<p>Yes, when I took over Rawr.Tree, it was working from the assumption that you use all available GCDs. I don't fully know how latency is handled by WoW, but I believe that latency less than a GCD doesn't really affect instant casts (I believe the GCD is largely controlled client side, so the next cast can be started after a GCD, without having to add the latency of getting to the server first) and normal spells can be queued, again not having much effect. So the arguement that typically experienced latency numbers would affect cast percentage isn't really valid. Your a tree, your supposed to be excellent at healing while on the move :-) (atleast slow raid HoTs). But yes, moving does distract, meaning slower reaction times. This gets closer to the topic discussed on Rawr.Cat the other day about modelling imperfect player behaviour, although in this case, there is also the simple fact that sometimes no1 needs any more healing.</p>\r\n<p>Making the fight duration shorter, will remove some of the value of mana regen, but it can also affect the value of trinket procs. A trinket with 2 min CD, will likely change its value when the fight duration gets close to 2 minutes, since it can only give 1 proc instead of 2. I'm also not totally happy with the value of Innervate on too short fights, it probably reports giving too much mana, but since your doing this to reduce the value of mana regen, the innervate modelling might actually be a good thing, in that it suppresses the value of mana regen further.</p>\r\n<p>&nbsp;The burst/sustained slider is probably the best way to address this. If you typically find yourself with mana remaining at the end of the fight, move closer to the burst side. Maybe a better default position for the slider would be closer to 50:50. That was the position I used for a long time.</p>\r\n<p>About as many people having an issue that mana regen is valued too highly, argue that they want to use all GCDs and even be sure their haste capped to ensure that they use all GCDs. Unless I'm missing something, 10% slower GCD should be identical to 10% unused cast time (in terms of healing numbers). Thus different people asking for opposite things. There probably is a difference in play perception though: Having 10% unused cast time, is a good thing, since you can move that 10% around and decide when to go into a casting frenzy or when to relax. Having the 10% slower GCD means you need to cast asap and that you cannot burst when you need it.</p>\r\n<p>I have been in very few fights where I have actually tried to cast 100% of the time, so your probably right in that Rawr.Tree over values mana. Adding a slider in there to control what fraction of the GCDs you have available, shouldn't be too difficult. Modelling how/if it affects your HoT refreshing/clipping is a much tougher problem, which I don't think I'll attempt today.</p>",
    "PostedDate": "2009-10-24T04:35:14.03-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "249442",
    "ThreadId": "72527",
    "Html": "<p>Although the fight-time and the burst/sustained sliders&nbsp;are useful, making a slider for idle time is perhaps not ideal. It's very hard to look at combatlogs and know how much time you are idle because of: slow reaction, no/low incoming damage, movement, phase change, etc. What is much easier to see from combat logs is how much damage needed to be healed in a fight. If Rawr is using a 4 minute fight time and calculating that you could heal for 2 million, but actually there is only 1 million damage for you to heal, then it's not surprising that Rawr is going to be overvaluing intellect gems.</p>\r\n<p>My suggestion would be to add a textbox where you can fill in max healing needed. If it were empty, then Rawr can go nuts on max healing, but if it were filled then Rawr could perhaps switch down to an even more efficient healing rotation for the 'sustained healing' part of the calculation.</p>",
    "PostedDate": "2009-10-25T04:49:49.437-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "249907",
    "ThreadId": "72527",
    "Html": "<p>I just checked in change set 37852, which fixed the replenishment bug and added the idle slider.</p>\r\n<p>My initial feedback from using it, is that it isn't very useful: The gearset+buffs I worked with gave 22% unused time. Having the slider an any position less than that meant that it had no effect. Moving the slider past this, it starts having an effect, but slightly changing buffs or other settings can push me above or below the position where the slider starts becoming active and ultimately this edge behaviour didn't feel as if it really adds anything useful. I left it in (for now), but might drop it again in the future, depending on feedback. Changing the old burst sustained slider felt more reliable and I changed its default position back to 50:50.</p>\r\n<p>I have long thought/wondered about the idea of a fight's healing requirements like wisk is mentioning. With the introduction of a boss handler, this might become more of a reality, but it does pose a fundamental question: At the moment all the models are addressing an unbounded problem, since you can always improve your gear (assuming Bliz added the needed items). But if you go to optimise for a specific fight, for healing models (and maybe for tanks to a lesser extent), this becomes a bounded problem. The boss only puts out a certain dps. Once you are able to heal through that, what do you spend your extra gear budget on? One approach would be the coolness factor: Clearing lvl 80 Naxx in Tier 3 would be cool, since that is where it droppped originally. But somehow I don't think that is what wisk had in mind. At the point where you know you can survive the fight, the next step would be to make the fight farmable (get it to feel easy). Having a larger spare pool of mana remaining after the fight, is one way to make it feel easier, but then we are back to the large value on int. Higher haste should give you more time, making things seem less rushed. Bigger heals might make things seem easier if it results in fewer casts, but if it only results in more overheal, it wouldn't make a difference. Minimizing cooldown use?&nbsp; If we can figure out what the measure of gear improvement is after reaching a particular healing target number, I would be willing to look at it when I get a chance, but at the moment, I don't have good ideas except to keep chasing larger potential healing numbers. And a large part of sustained numbers is Int and MP5.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-10-26T13:25:01.273-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "252355",
    "ThreadId": "72527",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>wildebees wrote:</strong><br>\r\n<p>I have long thought/wondered about the idea of a fight's healing requirements like wisk is mentioning. With the introduction of a boss handler, this might become more of a reality, but it does pose a fundamental question: At the moment all the models are addressing an unbounded problem, since you can always improve your gear (assuming Bliz added the needed items). But if you go to optimise for a specific fight, for healing models (and maybe for tanks to a lesser extent), this becomes a bounded problem. The boss only puts out a certain dps. Once you are able to heal through that, what do you spend your extra gear budget on? One approach would be the coolness factor: Clearing lvl 80 Naxx in Tier 3 would be cool, since that is where it droppped originally. But somehow I don't think that is what wisk had in mind. At the point where you know you can survive the fight, the next step would be to make the fight farmable (get it to feel easy). Having a larger spare pool of mana remaining after the fight, is one way to make it feel easier, but then we are back to the large value on int. Higher haste should give you more time, making things seem less rushed. Bigger heals might make things seem easier if it results in fewer casts, but if it only results in more overheal, it wouldn't make a difference. Minimizing cooldown use?&nbsp; If we can figure out what the measure of gear improvement is after reaching a particular healing target number, I would be willing to look at it when I get a chance, but at the moment, I don't have good ideas except to keep chasing larger potential healing numbers. And a large part of sustained numbers is Int and MP5.</p>\r\n</blockquote>\r\n<p>Well at the moment it seems like Rawr is only helping healers how to win the meters at Patchwerk, which is really just &quot;chasing larger potential healing numbers&quot;. You mention overheal and this is something that's entirely missing in Rawr, yet it's something which can easily be determined from combat logs.</p>\r\n<p>I guess what I feel Rawr should be able to do, is let me figure out how to 2-heal Anub'arak-10-heroic phase 3. For example I have a priest and a druid in my group, both healing models are supported by Rawr. Who should be on the tanks (X and Y incoming dps), who should be on penetrating cold (Z incoming dps)? What rotations can they use? Do they need to switch some gear around or regem? How should they spec? How long can they last? Do they have any spare gcd's for combat res, rebuffing and so on?</p>",
    "PostedDate": "2009-11-02T03:43:30.247-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "252467",
    "ThreadId": "72527",
    "Html": "<p>Excellent points for me to focus on in making the BossHandler compatible for Healer classes. One of the advantages to the BossHandler that is already in place is the use of the AverageBoss. AverageBoss is the amalgomy of all the bosses (filterable) together, so if you are looking at an unfiltered list, you'll seee the average damage of every boss in the database. If you can outheal that, you have a safe bet you can outheal just about everything. I'll try to add messaging stating &quot;you are poswerful enough to reduce the number of healers required by this fight by 1&quot; or &quot;You are x% away from reducing the&nbsp;number of healers requirement of this fight&quot; or&nbsp;something similar.</p>\r\n<p>The models themselves need to start considering how their rotations change for movement, being stunned, feared, rooted, etc. Once they have that figured out and implemented, the BossHandler is simply a group of pre-sets and checking how well you fare on a fight is as easy as selecting the fight itself.</p>\r\n<p>Rawr3 will have these options implemented universally for all models, now that I can actually make the stupid thing :P</p>",
    "PostedDate": "2009-11-02T09:10:56.233-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]