[
  {
    "Id": "247869",
    "ThreadId": "72587",
    "Html": "<p>Hey guys,</p>\r\n<p>I see in the RAWR rotation that it mentions to keep up 5cpRip, 5cpSR, etc, but I have some specific questions about that:</p>\r\n<p>1. If I have full energy, 5cp, and only approximately 5 seconds left until Rip runs out, is it better to just Shred and waste the combo points?&nbsp; Or is it better to refresh SR, Rake, or Rip?</p>\r\n<p>2. Along the lines of Q1 above, sometimes if I have 5 or more seconds up on Rip, it won't let me refresh it.&nbsp; Any idea why?</p>\r\n<p>3. Generally speaking, is it better to let my dots fall off before I refresh them?&nbsp; Or is it better to clip them at like .5 seconds left to maintain 100% uptime?</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-10-20T13:59:25.617-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "247880",
    "ThreadId": "72587",
    "Html": "<p>I believe Gwindor was going to post a more in depth response, but short answers...</p>\r\n<p>1. If there's lots of time left on SR/Rake, just Shred, and waste the CP, then reapply Rip. If SR and Rip are falling off at nearly the same time, reapply SR early, to give you time to build the CP for reapplying Rip asap.</p>\r\n<p>2. Never, ever, reapply Rip early. You always want to reapply Rip as soon as possible,&nbsp;<em>after </em>it wears off.</p>\r\n<p>3. Never clip them. Uptime doesn't <strong>really</strong>&nbsp;matter, it's # of dot ticks that matters. Usually people just refer to uptime, because it's&nbsp;directly proportional to # of ticks, assuming you don't clip the previous one.</p>",
    "PostedDate": "2009-10-20T14:24:36.61-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "247899",
    "ThreadId": "72587",
    "Html": "<p>Awesome, thanks Astrylian!</p>",
    "PostedDate": "2009-10-20T15:19:50.817-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "247909",
    "ThreadId": "72587",
    "Html": "<p>1. There are a couple things to note here.</p>\r\n<p><span style=\"white-space:pre\"> </span>a) 1x5cp fero bite is worth around 2-3 ticks of rip uptime.</p>\r\n<p><span style=\"white-space:pre\"> </span>b) If shredding is going to put you in a bad situation in 20 seconds (ie: SR falling off at the same time as rip) then you shouldnt shred, you should SR instead.</p>\r\n<p><span style=\"white-space:pre\"> </span>c) Don't refresh Rake early.</p>\r\n<p><span style=\"white-space:pre\"> </span>d) Practice. &nbsp;I've spent upward of 50 hours on a target dummy in Stormwind since the launch of WotLK practicing feral dps. &nbsp;The result is that I perform VERY well for the gear that I have. &nbsp;Being good at feral dps means thinking about your buffs/debuffs 10-15 <span style=\"white-space:pre\"> </span>seconds in advance. &nbsp;If you get into the situation you described above, you probably should have done something &quot;sooner&quot; and planned better. &nbsp;Refreshing SR with 4cp might have been a good choice; I usually run a 4+SR and then 5Rip, 5Bite</p>\r\n<p>2. Don't refresh rip 5 seconds early.</p>\r\n<p>3. Don't clip. &nbsp;Refresh right after if alls off.</p>\r\n<p>&nbsp;</p>\r\n<p>--------</p>\r\n<p>If you have 5cp, 10 seconds on Rip and 20 seconds on SR, its probably safe to bite. &nbsp;I know some people will disagree with this, but I've always focused on maximizing bleed uptime, rather then allowing my bleeds to fall off in favor of more bites. &nbsp;You can try both and decide for yourself.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-10-20T16:14:10.417-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "247919",
    "ThreadId": "72587",
    "Html": "<p>Thanks Gwindor, great advice.</p>\r\n<p>Yeah, I have definitely found that it is possible to paint yourself into a corner if you don't plan ahead.&nbsp; Overall, I can typically keep my timers meshing nicely, although the timers change regularly since I've been playing feral, which typically takes a bit of practice to get in the groove again.&nbsp; For example, the 4 piece Tier 8 bonus extends SR time, while the 2 piece Tier 9 extends Rake time, so it takes a bit to get that new rhythmn worked out.&nbsp;</p>\r\n<p>The concept of never clipping on my bleed damage is great advice and probably worth a good deal of DPS.&nbsp; In fact, I'm feeling a little noobish for not knowing that...</p>\r\n<p>Knowing when to bite is still tough, especially because on occasion you may have NOTHING proc as you rebuild to 5cp, so it may take 5 full shreds as opposed to 3.&nbsp; I usually FB if I have Rip and SR both over 8 or 9 seconds.&nbsp; On world of logs, I was perusing the ferals on the top guilds and it is interesting to note that pound for pound, they seem to FB much less than me and Shred way more, with their Shred being over 5% more than their white damage.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-10-20T16:46:34.35-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "247932",
    "ThreadId": "72587",
    "Html": "<p>Just as a side note, for everyone's info, the 'top logs' on WoL contain at least some bugged or doctored logs. The current #1 parse for 25H Northrend Beasts, for example, is a feral, with damage numbers that (<em>as far as Gwin and I can tell, anyway. If someone can correct us and show us how it's possible, we'd love to see it</em>) are simply impossible to produce in reality; it's just not possible, even using the best gear in the game, to shred/rip that hard, by our calculations. So they're not necessarily the best examples to look at. There are probably some good ones in there too, just don't take them as gospel either.</p>",
    "PostedDate": "2009-10-20T18:08:01.7-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "248235",
    "ThreadId": "72587",
    "Html": "<p>/agree</p>\r\n<p>I only look at the top logs for the top guilds in progression, not really the overall top logs.&nbsp; I'm sure there is some...fudging going on there, heh...&nbsp; I think this is the log you are referring to, correct?</p>\r\n<p><a href=\"http://www.worldoflogs.com/reports/rt-Yxx4fFmG7SQ1IRt0/sum/damageDone/?s=3329&e=3771#Neonjoe\">Possible Shinnanigans Log</a></p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-10-21T11:55:19.323-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "248278",
    "ThreadId": "72587",
    "Html": "<p>It's not a WoL bug, as the same parse exists on WMO.&nbsp; While I won't go as far to say they're impossible, I will go so far as to say that something unusual is going in that parse.&nbsp; As in, Neonjoe doesn't come within 20% of the damage he showed on that parse, typically.&nbsp; I'm not sure the log is necessarily doctored-- at least the easy things are all more or less correct, like total damage taken by the bosses, and no one is clearly underperforming-- but I wouldn't be surprised if he got a bugged buff that stacked twice (specifically something spiking his AP).&nbsp; His rip ticks on that fight far outpace his previous fight moments before.&nbsp; It's as though he had a double mangle bonus on the boss, constantly. &nbsp; His buffed damage was also downgraded back to &quot;normal&quot; for heroic Jaraxxus later.&nbsp; In addition to the mystery buff, he also got lucky with his rip tick crits-- all but one of them crit during Icehowl's increased damage periods.&nbsp;</p>\r\n<p>I disagree on the &quot;never clip&quot; advice, though.&nbsp; A common situation you can run into with running a 5SR/5Rip cycle is you SR, then you rip with 20 seconds left on your SR timer (11 seconds later).&nbsp; You FB sometime 7-10 seconds later (because you'll have 10+ seconds on both buffs), and you end up with 10 seconds and two finishing moves to get up.&nbsp; Now, you can always pool energy, but couldn't it be better to maintain rip, losing a maximum of 1 tick (if you can overwrite it), then use a low-point SR, dropping neither buff?&nbsp; The alternative, post-FB, is using a low-point SR very early.&nbsp;</p>\r\n<p>Optimally, you see those collisions happening before you FB, you energy pool as much as you can and then refresh SR early, while still having time to build CP before you need to Rip.&nbsp; But given that you need to account for shred extensions on Rip, you've got a lot of 20-seconds-ahead math you need to manage even before you think about boss mechanics.&nbsp;&nbsp; You could see &quot;Rip expires 4 seconds earlier&quot; and fail to see the extended time, so you think you can just Rip and then low-point SR anyway.&nbsp;</p>\r\n<p>Ideally, yes, you wouldn't clip.&nbsp; Situationally, when you've screwed yourself over because you didn't do the math right in your head while playing, you're only losing 1 tick and a little energy-- that's a lot better than Ripping after SR falls, or losing several ticks of rip by using a 5-point SR early.&nbsp;</p>\r\n<p>Finally, a remark on top-guild ferals:&nbsp; they aren't always doing what's optimal, only what works well for them.&nbsp; In a situation where you're trading one kind of damage for another, being sub-optimal isn't throwing away that much damage-- a single upgrade might get that damage back.&nbsp; Whereas letting mangle/SR drop isn't a damage tradeoff as much as simply throwing damage away.&nbsp;</p>",
    "PostedDate": "2009-10-21T13:36:30.487-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "248382",
    "ThreadId": "72587",
    "Html": "<p>Aye, that's the parse I was referring too. Would love to be proved wrong, but as best I can tell, either there was some bugged double-buff going on there, or it's simply doctored. I know nothing about Neonjoe, and don't want to spread slander about him, so I'd guess some sort of double-savage roar or something.</p>",
    "PostedDate": "2009-10-21T20:05:16.957-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "248409",
    "ThreadId": "72587",
    "Html": "<p>Yea I am not 100% sure either on how he was able to do almost 10k on that fight.&nbsp; I thought I saw something but I misread the sheet (I wish WoL allows comma markings &gt;_&lt; so difficult to read without them.</p>\r\n<table style=\"height:27px\" border=0 width=22>\r\n<tbody>\r\n<tr>\r\n<td></td>\r\n<td></td>\r\n<td></td>\r\n</tr>\r\n</tbody>\r\n</table>",
    "PostedDate": "2009-10-21T22:23:35.323-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "248824",
    "ThreadId": "72587",
    "Html": "<p>The only fishy thing I see about his log is the fact his mongoose proc has a 58% uptime and that his dps spikes are the same with and without berserk up.</p>",
    "PostedDate": "2009-10-22T17:36:42.433-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "248837",
    "ThreadId": "72587",
    "Html": "<p>58% mongoose uptime is high, but not unreasonable. Certainly on the lucky side, but certainly possible. 16k Shred Crits on Gormok, without Hysteria... Not so much.</p>",
    "PostedDate": "2009-10-22T19:34:55.167-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "249014",
    "ThreadId": "72587",
    "Html": "<p>The fishy thing is even his autoattack, even during non-buffed phases, is doing 20-30% more damage than it's done for him in the same fight (or any other fight for that matter) at any point before or since, without the benfit of any special buffs like chain-Hysterias.&nbsp; And presumably several gear upgrades ago.&nbsp;</p>",
    "PostedDate": "2009-10-23T07:50:56.41-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "249356",
    "ThreadId": "72587",
    "Html": "<p>Astryl and I did some maths and decided he needed somewhere in the range of 17000 attack power to be putting up the numbers he was. &nbsp;(we did our calculations based off his rip ticks on Gormok) &nbsp;All ilvl 258 gear puts you in the 13000 range of AP with all raid buffs currently. &nbsp;4000 AP is &quot;alot&quot; to have suddenly gained from something that doesnt show up in any of your buffs.</p>",
    "PostedDate": "2009-10-24T15:02:20.517-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "252553",
    "ThreadId": "72587",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>Gwindor wrote:</strong></blockquote>\r\n<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\">Practice. &nbsp;I've spent upward of 50 hours on a target dummy in Stormwind since the launch of WotLK practicing feral dps. &nbsp;The result is that I perform VERY well for the gear that I have. &nbsp;Being good at feral dps means thinking about your buffs/debuffs 10-15 <span style=\"white-space:pre\"> </span>seconds in advance. &nbsp;</blockquote>\r\n<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\">\r\n<p>&nbsp;</p>\r\n</blockquote>\r\n<p>That was the best feral advice I've read in a long time. Cheers.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-11-02T13:31:48.54-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "254554",
    "ThreadId": "72587",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>jinxology wrote:</strong><br>\r\n<p>Hey guys,</p>\r\n<p>I see in the RAWR rotation that it mentions to keep up 5cpRip, 5cpSR, etc, but I have some specific questions about that:</p>\r\n<p>1. If I have full energy, 5cp, and only approximately 5 seconds left until Rip runs out, is it better to just Shred and waste the combo points?&nbsp; Or is it better to refresh SR, Rake, or Rip?</p>\r\n<p>2. Along the lines of Q1 above, sometimes if I have 5 or more seconds up on Rip, it won't let me refresh it.&nbsp; Any idea why?</p>\r\n<p>3. Generally speaking, is it better to let my dots fall off before I refresh them?&nbsp; Or is it better to clip them at like .5 seconds left to maintain 100% uptime?</p>\r\n<p>&nbsp;</p>\r\n</blockquote>\r\n<p>&nbsp;Aside from the general advice, there's a direct answer to question 2 that I didn't see in the other responses.&nbsp; I'm betting you're getting a message that there is a more powerful spell active.&nbsp; It means you had a buff up, like TF, on the last rip, and WoW won't let you replace it with a rip with a lower attack power.&nbsp; In fact, you probably tried to rip after SR dropped.</p>",
    "PostedDate": "2009-11-07T10:43:26.117-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]