[
  {
    "Id": "247912",
    "ThreadId": "72601",
    "Html": "<p>How does the item comparison work?<br>I can't understand how it's putting my ilvl 226 T8 head on top of the list, with ilvl 258 T9 right below it, with the exact same gems...</p>\r\n<p>http://img18.imageshack.us/img18/8183/rawrcat.jpg</p>\r\n<p>And it's the same for almost every other Tier slot.</p>",
    "PostedDate": "2009-10-20T16:18:19.373-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "247917",
    "ThreadId": "72601",
    "Html": "<p>Swapping out <em>ONE</em>&nbsp;and breaking the 4T8 or 2T8 set bonus wouldn't be worth it. &nbsp;I think what you want is a list of upgrades. &nbsp;You'll need to mark all the gear you have&nbsp;available&nbsp;using the green diamond to the left of the gear in the right hand charts. &nbsp;Then, go to Tools&gt;Optimize, set the dropdown to &quot;DPS Rating&quot; add any additional requirements (hit cap, etc) that you might have and click &quot;Optimize&quot;.</p>\r\n<p>Once you're done optimizing, and you've&nbsp;equipped&nbsp;the optimized gearset, go back to Tools&gt;Optimize and hit &quot;Build Upgrade List&quot; &nbsp;This will spit out a list of all upgrades for you.</p>",
    "PostedDate": "2009-10-20T16:37:45.887-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "250182",
    "ThreadId": "72601",
    "Html": "<p>That totally makes sense, thanks for the response.</p>\r\n<p>So how does it rate the various set bonuses? Is there a way to see/change these set bonus ratings?</p>",
    "PostedDate": "2009-10-27T07:45:47.077-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "250231",
    "ThreadId": "72601",
    "Html": "<p>No, you can not change the value of the set bonuses - they are what they are.&nbsp; You can see what current tier bonuses you have activated near the bottom of the Buffs tab, and their value on the Comparisons &gt; Current Gear/Enchants/Buffs pane.&nbsp; You see the value of all available tier bonuses on the Comparisons &gt; Buffs &gt; All Buffs pane.</p>\r\n<p>The set bonuses are calculated the same way Rawr handles the rest of the character - seeing how the bonus actually affects the model's performance, given the settings and variables.</p>",
    "PostedDate": "2009-10-27T09:18:36.597-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]