[
  {
    "Id": "247994",
    "ThreadId": "72620",
    "Html": "<p>Thought I'd throw this out there since PvE Frost is getting buffed up considerably. I know Kavan has started to work on the PvE changes with build <a id=\"ctl00_ctl00_MasterContent_Content_ChangeSetList_ctl24_ChangeSetLink\" style=\"font-weight:bold\" title=\"Browse change set 37592\" href=\"../SourceControl/changeset/view/37592\">37592</a>. However it sounds like Ghostcrawler maybe changing that Frozen Core talent once again:</p>\r\n<p>&quot;We're not 100% sure we're going to go forward with the Frozen Core change. It isn't a major PvE damage buff and has some problems with haste. While it does, perhaps, get Ice Lance into PvE, it might encourage some builds that don't feel all that frosty. It also doesn't add much of a dynamic to PvP really, so all in all we're not sure the change is worth it.&quot;</p>\r\n<p>However with the change to the Water Elemental glyph to be a permanent pet (the waterbolt from the Water elemental now only costs 1% instead of 5% of it's base mana) and the new change to Deep Freeze, Lhivera over on the main forums and on the EJ forums is indicating that Frost may be within 10% of Arcane and Fire. I'm posting this to get the other developers into the discussion.</p>\r\n<p>Lhivera posted her calculations here (http://forums.worldofwarcraft.com/thread.html?topicId=20432626969&amp;postId=205640097166&amp;sid=1#365). These take into account &quot;Best In Slot&quot; Frost ToC 258 gear according to the current RAWR build. It also does not factors in that Ice Shards is currently bugged on the PTR and is not being factored into the Deep Freeze crit modifier correctly. The calculations she posted is assuming that Ice Shards is working as intended. It also sounds like the rotation will be similar to how it is now except that we would want to keep the Deep Freeze on CD as often as possible except when a FoF procs and if the DF is off cooldown, use DF instead of Ice Lance for the Shatter Combo. I am not sure if this will involve any significant changes to the Frost calculations though.</p>",
    "PostedDate": "2009-10-21T00:38:37.95-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "248059",
    "ThreadId": "72620",
    "Html": "<p>I probably won't be making cycles for use in the main solver until things get much more finalized. I'll try to update the cycle analyzer with deep freeze when I get some time.</p>",
    "PostedDate": "2009-10-21T03:44:22.047-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]