[
  {
    "Id": "248114",
    "ThreadId": "72658",
    "Html": "<p>Some of this is similar to optimizer warnings, but it might be valuable to have a panel that critique's the current toon's gear and Rawr settings:</p>\r\n<p>Examples:</p>\r\n<p>You aren't using all your glyph slots (or you have major glyphs not contributing to your score). (Moonkin, load from character profiler erases glyphs)</p>\r\n<p>No shoulder enchants are marked as available.</p>\r\n<p>You have available pants (or gem) that would increase your score by 32.8 over your current pants (gem in hand slot).</p>\r\n<p>You want to bear tank with no points in SotF?</p>\r\n<p>Toon is massively short on mana. &nbsp;Check your buffs or fight options.</p>\r\n<p>Rawr sees no benefit from currently equipped Manual of Awesome Good Looks</p>",
    "PostedDate": "2009-10-21T07:05:22.687-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "248238",
    "ThreadId": "72658",
    "Html": "<p>I do like the idea as a person who tries to help others. &nbsp;And I do think that major &quot;warnings&quot; would help us with all of our FAQs, like &quot;why is it telling me to gem Int?&quot; when you don't have replenishment.</p>\r\n<p>Things that I think would make the most sense on a Rawr-wide setting:</p>\r\n<ul>\r\n<li>No glyphs checked (or not enough glyphs checked). &nbsp;Repeat for item slots and enchant slots</li>\r\n<li>Unspent Talent Points</li>\r\n<li>Gem/Item equipped but not marked as available (ie, for people who don't have their JC gems marked as available or in a gem template for that item)</li>\r\n</ul>\r\n<p>Other things are more at the model level, and can likely be displayed in the Stats Results panel:</p>\r\n<ul>\r\n<li>Missing key talents (especially when logic is assuming you have them; for instance, DPSWarr assumes you have Whirlwind glyphed for its rotation; if you don't have that glyph, your results will be wrong)</li>\r\n<li>Major codepath followed (like running out of mana vs not)</li>\r\n</ul>\r\n<div>I'm not a fan of things like checking for direct upgrades, or questioning decisions made that don't inherently rely on the model's calculations (like not having the +5% crit talent for a DPS warrior). &nbsp;Checking for upgrades is something that the optimizer does. &nbsp;Telling people how to spec is not something Rawr is in the nature of doing.</div>\r\n<div></div>\r\n<div>From a UI perspective, I don't know if a panel is the easiest thing to implement, but a suppressible Warning message box or a string in the display calculations should be easy.</div>",
    "PostedDate": "2009-10-21T12:00:08.39-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "248241",
    "ThreadId": "72658",
    "Html": "<p>This reminds me of an Add-On I used to use, I think it was called &quot;Scrub&quot;. It would tell me if there were variances beyond the allowed variances for a spec, like for a Fury Warrior, if I didn't have Cruelty 5/5 it would state a warning, but for an Arms build Weapon Mastery vs Improved Execute would be allowed.</p>",
    "PostedDate": "2009-10-21T12:05:03.533-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]