[
  {
    "Id": "248892",
    "ThreadId": "72871",
    "Html": "<p>A couple of things I have noticed with the Rawr tooltips :-</p>\r\n<p>&nbsp;</p>\r\n<p>1)&nbsp;&nbsp; In the case of say the priest tier pieces, it is hard to tell which pieces are the shadow items and which are the healing ones.&nbsp; The stats on both are quite similar so they both appear near each other in the listsand even have similar names, but I have to open them in Wow-Head to work out which is which.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Even the ability to see our own user-added comments in the tooltips would be ok to deal with this.</p>\r\n<p>&nbsp;</p>\r\n<p>2)&nbsp;&nbsp; Knowing which slot or type an item is.&nbsp;&nbsp;&nbsp; For my rogue (which I have just started to look at Rawr for) it is quite important to know whether a weapon is a sword, axe, dagger etc and in many cases it is difficult to tell from the name.&nbsp;&nbsp; Same with other classes and being able to tell whether an item is a 1H or 2H weapon or knowing if a pieces is plate, mail or leather.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; This is particularly an issue for me when using the &quot;direct upgrade tab&quot; when you have say neckpieces like &quot;Heritage&quot; for example or other similarly non-descriptive titles.</p>\r\n<p>&nbsp;</p>\r\n<p>All minor things, but would make the Rawr experience a little more friendly.</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-10-23T00:37:37.083-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "248897",
    "ThreadId": "72871",
    "Html": "<p>I completely agree on all accounts, and hope to adjust things for the better, once we're into the Rawr3 era. One note though; part of #2 is solved by Tools &gt; Options &gt; General &gt; Show Item Type in Tooltips. Not totally, mind you, but at least a bit of it.</p>",
    "PostedDate": "2009-10-23T00:51:21.23-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "248932",
    "ThreadId": "72871",
    "Html": "<p>Wow - thanks for that.&nbsp;&nbsp; I hadn't seen those options mentioned anywhere before :)&nbsp;&nbsp; Much better.</p>\r\n<p>&nbsp;</p>\r\n<p>Any timeframe on Rawr3?&nbsp;&nbsp; I keep hearing lots of nice things!</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-10-23T03:07:30.097-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "249153",
    "ThreadId": "72871",
    "Html": "<p>We know, we know, Rawr3 is taking forever. Soon, we hope! We've been pushing hard to get everyone working on it, lately.</p>",
    "PostedDate": "2009-10-23T14:46:05.55-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "249170",
    "ThreadId": "72871",
    "Html": "<p>Are you updating the Web version on a daily basis or whenever the new live build is updated?</p>\r\n<p>Because I'll start doing some power-testing on the web version if you want.</p>",
    "PostedDate": "2009-10-23T15:48:34.967-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "249181",
    "ThreadId": "72871",
    "Html": "<p>I don't update it every day, but it's like twice as often as normal releases.</p>",
    "PostedDate": "2009-10-23T17:37:02.1-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]