[
  {
    "Id": "249307",
    "ThreadId": "72978",
    "Html": "<p>Hi,<br><br>I really like the Rawr optimizer for my Ret Paladin, but everytime I buil a upgrade list it lists all the items (including all the items that dont 'upgrade' me).<br><br>There's a way to list only those items that upgrades my equip?<br><br>Thanks :)</p>",
    "PostedDate": "2009-10-24T10:20:45.103-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "249325",
    "ThreadId": "72978",
    "Html": "<p>That's exactly what it does. Upgrade lists only contain items that are potential upgrades for you. If you're seeing items in it that you already have, it means that <em>they are potential upgrades for you</em>. You typically want to optimize before building an upgrade list, for that reason.</p>",
    "PostedDate": "2009-10-24T12:10:03.993-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "249434",
    "ThreadId": "72978",
    "Html": "<p>Hi,<br><br>Thanks for the quick response, but what I am trying to say is that some items on the list downgrades me. For example if I have 134 upgrade points actually on my gearset I should not see items with 80 upgrade points on the list.<br><br>Maybe I am doing something wrong...<br><br>What I am doing right now is:<br>1) Load my char from Armory, set the buffs, change fight parameters &amp; rotations.<br>2) Tools -&gt; Optimize<br>3) Optimize DPS Rating, Thoroughness to max, Build Upgrade List.<br>Then the list appears with a large list of items including items that downgrades me.<br><br>I just want this items with less points than my gearset removed, how should I do it?<br><br>Thanks a lot</p>",
    "PostedDate": "2009-10-25T03:19:14.277-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "249441",
    "ThreadId": "72978",
    "Html": "<p>Put your mouse over the item which you think is a 'downgrade', you'll see a suggested new gear-set which should explain why Rawr calculates that the item is an upgrade. Sometimes this is as simple as, for example, a switch from hit rating on legs moving to hit rating on gloves, which then suddenly makes another item better.</p>",
    "PostedDate": "2009-10-25T04:30:15.017-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "249501",
    "ThreadId": "72978",
    "Html": "<p>I dont see that.<br><br>Please, load Zim from server Sanguino in EU. And do the following steps:<br>1) Tools -&gt; Optimize.<br>2) Select Optimize DPS Rating and click Build Upgrade List. (Put thoroughness to min, that will be faster for the test).<br><br>Now the list you see is:<br>My gear (134 upgrade points)<br>Better gear (&gt;134 upgrade points)<br>A lot of bad gear (&lt;134 upgrade points)<br><br>The point is that when I export this list to LootPlan I dont want that bad gear listed.<br> <br>I just want  a clean list with &gt;134 upgrade points.<br><br>Thanks again :)</p>",
    "PostedDate": "2009-10-25T10:49:05.943-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "249514",
    "ThreadId": "72978",
    "Html": "<p>bugmenot2, what you're seeing is accurate. It is <em>exactly</em>&nbsp;what I said before.<em> Upgrade lists only contain items that are potential upgrades for you.</em></p>\r\n<p>Those items, which are &lt;134 points, <strong>are potential upgrades, from your current gear.</strong>&nbsp;Your problem is that your <strong>current gear</strong>&nbsp;is not your <strong>optimal gear</strong>. So, Optimize first.</p>",
    "PostedDate": "2009-10-25T11:32:07.863-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]