[
  {
    "Id": "249605",
    "ThreadId": "73054",
    "Html": "<p>I&nbsp;have usually&nbsp;optimized my bear gear using Overall. For a long time this seemed to keep Mitigation and Survival in a reliable balance as the tooltips indicate they should generally be... mitigation points on top with survival comfortably close behind.</p>\r\n<p>With the addition of the Brewfest trinkets and Black Heart, optimizing for Overall has put my survival (200112.3) notably higher than my mitigation (166594.8).</p>\r\n<p>Is there a general numerical difference at which I need to manually set a minimum requirement on mitigation? Or should I just rely on healer feedback and otherwise &quot;don't fix what ain't broke&quot;?</p>",
    "PostedDate": "2009-10-25T22:53:54.28-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "249614",
    "ThreadId": "73054",
    "Html": "<p>Overall provides a good balance of value between the two (which doesn't always mean that they'll stay equal, which isn't bad).&nbsp;Generally, you can just tell which one you need more of by how you die when tanking.</p>\r\n<p>Did you die to a burst of damage that healers couldn't heal through? Need more Survival.&nbsp;</p>\r\n<p>Did you die to sustained damage that healers couldn't keep up with, or healers ran OOM? Need more mitigation.</p>\r\n<p>&nbsp;</p>\r\n<p>Which one you need is decently fight-dependent, and also very healer dependent. You can use the Survival Soft Cap feature to gradually reduce the value of Survival past a certain point. There are presets for that, and those are generally 'enough' for each preset content, but it varies by fight/healers/other buffs/etc, so is customizable. It's not a hard cap either, Surv will still have value past it, it'll just slowly start depressing in value as you get further past the cap.</p>",
    "PostedDate": "2009-10-25T23:59:52.75-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "250046",
    "ThreadId": "73054",
    "Html": "<p>Yeah, the tooltips on that are&nbsp;nicely explanatory. What you said in the last part finally made it click in my mind just what &quot;survival soft cap&quot; is (I'd seen the phrase all over the place, but never in a denotative context), and probably why it's pushing survival so high on me - I've set the pulldowns to max encounters ever since I started changing them.</p>\r\n<p>So I suppose I need to adjust those to current content I'm facing instead of daydreaming about stuff I'm not quite up to the level for.... otherwise, trust in Overall optimization and pay attention to how it pans out in use.</p>\r\n<p>Thanks!</p>",
    "PostedDate": "2009-10-26T22:28:56.54-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]