[
  {
    "Id": "250014",
    "ThreadId": "73174",
    "Html": "<p>We now have a Documentation tab! Look at that! It's cool! We also have several pages with posting guidelines; thanks to Gwindor for those.</p>\r\n<p>We'd like to really start fleshing out more documentation there, guides on common use cases, walkthroughs, etc. Since us developers are usually spending our free time to develop (and try to get Rawr3 out the door), we'd like for our most active users to help out with this initiative when they have time. If any users here are interested in writing documentation, I can grant you permissions to edit the wiki pages. Would love to see people really cranking some quality help pages out! Let me know if anyone is interested. Thanks!</p>",
    "PostedDate": "2009-10-26T20:07:30.337-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "250015",
    "ThreadId": "73174",
    "Html": "<p>I can probably help out with the wikis. Right now I'm more active in the Mage, druid, and preist modules (since that is what I currently play). And can answer most questions.</p>",
    "PostedDate": "2009-10-26T20:18:02.437-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "250103",
    "ThreadId": "73174",
    "Html": "<p>Can I take it that individual developers are encouraged to flesh out/initially create their own model's page?</p>",
    "PostedDate": "2009-10-27T02:44:00.47-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "250200",
    "ThreadId": "73174",
    "Html": "<p>I'm sure that's the case, I really need to get in there for Arms myself.</p>",
    "PostedDate": "2009-10-27T08:19:44.173-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "250250",
    "ThreadId": "73174",
    "Html": "<p>Yes, absolutely. There's a Models page, that's largely not been updated. I'd love to have an up-to-date blurb about each model's status there, along with a page for each model with more detail.</p>",
    "PostedDate": "2009-10-27T10:02:14.39-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "250255",
    "ThreadId": "73174",
    "Html": "<p>I've somewhat updated the ProtWarr page, although it was a quick edit and not massively detailed.</p>",
    "PostedDate": "2009-10-27T10:06:47.783-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]