[
  {
    "Id": "250510",
    "ThreadId": "73302",
    "Html": "<p>I've followed the discussions on excluding spirit items from the Pally lists and now having the check boxes so we can choose whether they are visible or not.&nbsp;&nbsp; What I was wondering was the reasoning for this? &nbsp; I can understand that spirit is a very poor stat for a pally due to them having no talents that boost it and also the fact that a pally is usually chain casting spells and so aren't out of the 5 sec rule for very much of the fight, but it still seems a little unusual for a tool such as Rawr, which tries to model everything so thoroughly to give it a value of zero.&nbsp;&nbsp;&nbsp;&nbsp; Even something like the leg enchants where you have to choose between SP/Spi and SP/Stam.&nbsp; At decent gear levels, pallys aren't short on stam, so surely the SP/Spi patch would be a stronger patch option no matter how small the benefit of spirit is.</p>\r\n<p>&nbsp;</p>\r\n<p>This isn't a criticism or request for it to be changed - I was just interested in the thinking behind the current implementation (also, there may be something about Pallys I don't know!).&nbsp; The tick box is much appreciated though - at my Pallys poor gear level, there are many, many spirit items that are massive upgrades for me (such as in 5man ToC etc), so it has been very useful.</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-10-28T00:36:52.053-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "250689",
    "ThreadId": "73302",
    "Html": "<p>It doesn't give it a value of zero, it just doesn't find it relevant. Same way we try to hide spellpower gear for rogues, even if it happens to have a bunch of crit and haste. The idea being that if it has Spirit on it, a pally probably shouldn't be taking it, unless nobody else wants it. So, we have that checkbox instead.</p>",
    "PostedDate": "2009-10-28T07:41:22.247-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "250956",
    "ThreadId": "73302",
    "Html": "<p>Yeah, as I said, I understand the reason behind hiding the spirit items but am happy we have the checkbox as there is a big difference between SP items for rogues &amp; spirit items for Pallys :)</p>\r\n<p>Spirit is apparently not valued at all by the Pally model.&nbsp;&nbsp; The SP/Spirit leg patch has the exact same value as the SP/Stam leg patch.&nbsp;&nbsp; In fact, the Spirit doesn't even appear on the tooltip, so I assume that it is just totally excluded&nbsp; from any calculations at all - which just seems a little strange to me.&nbsp;&nbsp;&nbsp; Granted, I haven't done any research to examine just how bad or useless spirit is to a Pally - perhaps it is only 1 or 2 ticks of OO5sR regen in a whole fight or something stupidly small like that - it just seemed a little strange to be ignored by any caster class.</p>\r\n<p>&nbsp;</p>\r\n<p>Once again, please understand I don't in anyway want the model changed or anything like that - I just found it a little unusal.</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-10-28T17:44:41.237-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "250982",
    "ThreadId": "73302",
    "Html": "<p>When are you using the OO5SR, according to the fight variables? &nbsp;If you're not, then the value of Spirit is 0. &nbsp;and realistically, the value of Spirit for a Healadin is essentially 0, as far as I'm aware. &nbsp;Any Spirit on your gear is wholly wasted itemization, and only really better for you if you're getting a massive boost in Item Level by upgrading.</p>",
    "PostedDate": "2009-10-28T18:55:10.113-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "251019",
    "ThreadId": "73302",
    "Html": "<p>No matter which option in the settings you change, the value of the patches remains the same.&nbsp;&nbsp;&nbsp; The default on the &quot;activity&quot; slider (which I assume is time spent casting) is 85%, but changing it doesn't affect anything.&nbsp;&nbsp; Increasing the length of the fight and removing replenishment gives Mp5 a value but not Spirit even with the activity set low - Of course this is in the all too often pointed out &quot;dodgy&quot; relative stat values :)</p>\r\n<p>&nbsp;</p>\r\n<p>If&nbsp; the healadin model does incorporate Spirit in any way, I can't see it.&nbsp;&nbsp; It just seems to pretend it doesn't exist in the game (other than to be able to filter out items with it on).&nbsp;&nbsp;&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-10-28T21:24:26.273-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "251021",
    "ThreadId": "73302",
    "Html": "<p>I doubt it does. If a healadin gains more than 0 mana from spirit during a fight, they're doing it wrong.</p>",
    "PostedDate": "2009-10-28T21:27:13.697-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]