[
  {
    "Id": "250933",
    "ThreadId": "73423",
    "Html": "<p>I'm trying to use Rawr to help me figure out what the next item to purchase with Triumph badges are.&nbsp; I'm working under these conditions:</p>\r\n<p>- I don't want to regem my current gear ( I'm cheap, I'm poor and I don't want to do it each time I upgrade one item. )&nbsp; At some point later, once I have a few pieces of Triumph gear for this character, I will regem it all via the Optimizer.</p>\r\n<p>- I don't want to re-enchant my current gear</p>\r\n<p>- I don't have any other items besides those equiped on my character to work with.</p>\r\n<p>Here's what I did -</p>\r\n<p>- I marked all my current gear with blue diamonds with enchanting restrictions</p>\r\n<p>- I selected available gems and enchants for all slots</p>\r\n<p>- I refreshed all the gear from Wowhead to make sure the various filters were getting the right gear.&nbsp; I then narrowed my filters down to only badge gear purchasable via Triumphs.</p>\r\n<p>- I optimized my current gear ( which obviously resulted in pretty much the same gear, with one or two different enchants than what I had )</p>\r\n<p>- I then try and run 'Build Upgrade List'.</p>\r\n<p>My question here is based on a quote from the wiki about the Upgrade list option.&nbsp; The wiki states:</p>\r\n<p>&quot;Basically it will run optimize for each possible item using the available gems and enchants.&quot;</p>\r\n<p>My question is - where is it getting this list of 'each possible item' and is it possible to narrow this down so the upgrade list takes a shorter amount of time to build?&nbsp; I tried narrowing the filters to only badge gear.&nbsp; I tried marking all the badge gear as available after I optimized my current gear.&nbsp; When I run the build, I still see it trying stuff like 'Conjurer Slippers', a regular blue dungeon drop that is well below my current gear, isn't marked available and isn't showing because of my current filters.&nbsp; Is the upgrade list always going to go through every single item in the database that my character can equip?</p>\r\n<p>I did not mark all the T9 badge gear as available and then optimize, as that would obviously just replace all my gear with all the T9 badge gear.&nbsp; I'm trying to get the 'next step', not the end picture.</p>\r\n<p>The only way I've been able to do this so far is to narrow my filters down, then for each slot, go through each item and 'Evaluate Upgrade' for that specific item, write down the gemming, item, enchant and the DPS upgrade it displays, then go to the next item, then compare manually.&nbsp; Am I doing something wrong here?&nbsp; Is there a better way to be doing this?</p>",
    "PostedDate": "2009-10-28T16:29:24.453-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "251002",
    "ThreadId": "73423",
    "Html": "<p>Evaluate Upgrade on the 5 pieces of T9 would be the best way to do this. There's a forthcoming feature that will make Evaluate Upgrade add to the current upgrade list if there's one open, so that you don't have to write anything down.</p>",
    "PostedDate": "2009-10-28T20:04:00.313-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "251314",
    "ThreadId": "73423",
    "Html": "<p>Thanks Astrylian, that will be helpful.</p>\r\n<p>Are there any plans to be able to control the set of gear the 'Build Upgrade List' uses? In other words, if I wanted to have it build an upgrade list from *all* badge gear or some other combination of filters.</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-10-29T11:57:52.037-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "251376",
    "ThreadId": "73423",
    "Html": "<p>That's what it does, set the Filters then Build Upgrae list will only use what you can still see. Filtering the list *after* making it is still being worked on.</p>",
    "PostedDate": "2009-10-29T14:02:22.933-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "251426",
    "ThreadId": "73423",
    "Html": "<p>Jothay - Not really? At least, not for me.</p>\r\n<p>For instance, at the moment the *only* filters I have checked are:</p>\r\n<p>Special Curreny -&gt; Emblem of Triumph</p>\r\n<p>Gems -&gt; Crafted</p>\r\n<p>Disable BoP Crafted -&gt; All</p>\r\n<p>I then run 'Build Upgrade List' and see things such as ( going by the first few I'm seeing ):</p>\r\n<p>Shard of the Scale, Sergeant's Heavy Cloak, Weather-Beaten Fishing Hat, Cleric's Linen Shoes, a few pieces of Heroism badge gear, etc.</p>\r\n<p>It's obviously not paying attention to the filters I have ( I have double and triple checked the filters and the gear it's listing while building the upgrade list does not show on my right window pane. ).&nbsp; Is there something I'm missing that I need to check?</p>",
    "PostedDate": "2009-10-29T17:23:25.1-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "251428",
    "ThreadId": "73423",
    "Html": "<p>After you change filters, try closing and restarting Rawr, then try again.</p>",
    "PostedDate": "2009-10-29T17:25:36.417-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "251474",
    "ThreadId": "73423",
    "Html": "<p>That worked - thanks Kavan.</p>",
    "PostedDate": "2009-10-30T00:19:32.537-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]