[
  {
    "Id": "250964",
    "ThreadId": "73431",
    "Html": "<p>Hey there,</p>\r\n<p>here's a question for the Healadin theory crafter among the developers: wouldn't it be time to rank a Nightmare Tear higher in the gem ranking, despite the fact that the only useful stats from it for a holy paladin are +10 int and +10 sta?</p>\r\n<p>My reasoning is: with that prismatic in, say the non-meta helm socket, all other gem slots can be stacked up with +20 int gems which are supreme to all other gems, assuming one doesn't care too much about any slot bonuses aside from an activated meta gem.</p>\r\n<p>Thanks for your insights!</p>",
    "PostedDate": "2009-10-28T18:04:55.177-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "250975",
    "ThreadId": "73431",
    "Html": "<p><em>Rawr does not use stat weights. &nbsp;R<em>awr does not use stat weights</em>. &nbsp;R<em>awr does not use stat weights</em>.</em></p>\r\n<p>In other words, what you're saying is already in place. &nbsp;Nobody manually ranks items, or does it based on predetermined stat weightings, or anything liek that. &nbsp;The aggregate stats of you character, along with all buffs, ability usage and fight variables, are all used to calculate the actual benefit to your abilities (mana longevity, strength of spells, etc.) &nbsp;Equip the nightmare tear and switch gems accordingly, and see if it's better for you. &nbsp;It may well be, I'm not to up on Healadin theorycraft to be able to predict it.</p>",
    "PostedDate": "2009-10-28T18:36:57.89-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "251031",
    "ThreadId": "73431",
    "Html": "<p>Hey there,</p>\r\n<p>thanks for your answer. In game it is better in the way that my mana goes up from the int of course, while i lose 5 MP5 from the gem that Rawr suggests using instead of the Nightmare Tear. I also lose a bit of SP here and there from not using the other gems needed to activate the meta, but the benefits of the Tear/int outweigh it.</p>\r\n<p>My question probably would be why this helm/tear combo is still ranked lower than the other possible ones despite the indirect benefits I get from it. Did I manage to explain it this time? ;) Maybe indirect calculations are a bit too tricky, then no worries.</p>\r\n<p>Cheers!</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-10-28T22:16:06.64-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "251034",
    "ThreadId": "73431",
    "Html": "<p>It's not. If it's a better gemming, it will be rated higher. If you use the optimizer, it very well may use a Nightmare Tear if that's optimal. If it doesn't, it's not.</p>",
    "PostedDate": "2009-10-28T22:20:43.273-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]