[
  {
    "Id": "251317",
    "ThreadId": "73529",
    "Html": "<p>My warrior is a Jewelcrafter and I've got several pieces of tank equipment that I tend to swap out as needed depending on the fight.&nbsp; Since there's a limit of just 3 JC gems equipped at a time, this can sometimes cause issues if I just gem up all my best gear with Dragon's eyes.&nbsp; So what I generally do is designate 3 &quot;spots&quot; where I put my jewelcrafting gems.&nbsp; For instance right now, I always put them in the shoulder, chest and legs.</p>\r\n<p>What I'm finding is that when I run Optimizer, it swaps around gear but then goes and puts the Jewelcrafter gems pretty much anywhere.&nbsp; Is there a way for me to designate to only put the Dragon's eye gems in specific slots?</p>\r\n<p>If not, is there some other method other people are using to work around this?</p>",
    "PostedDate": "2009-10-29T12:03:03.747-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "251364",
    "ThreadId": "73529",
    "Html": "<p>I haven't tried it, but if you always use one kind of gem, then yes. &nbsp;See <a href=\"http://rawr.codeplex.com/wikipage?title=GearOptimization&referringTitle=Documentation\">http://rawr.codeplex.com/wikipage?title=GearOptimization&amp;referringTitle=Documentation</a>&nbsp;paying attention to setting the &quot;Blue Diamond&quot;. &nbsp;For all your shoulders/legs/chest items, only make available gemmings with the JC gem.</p>\r\n<p>There isn't really a way to say &quot;this gem cannot go in these slots&quot;, though.</p>",
    "PostedDate": "2009-10-29T13:39:59.107-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "251480",
    "ThreadId": "73529",
    "Html": "<p>In many cases you can safely &quot;ignore&quot; the gem placements of Rawr.&nbsp;&nbsp; For my mage I can just assume that the regular SP gems are interchangeable with the JC SP gems.&nbsp;&nbsp;&nbsp;&nbsp; Once Rawr does its optimisation, as long as I have SP gems in all the slots Rawr recommends, I can choose where the JC ones go.&nbsp;&nbsp;&nbsp; Then you can either load from armory once you have gemmed your gear or select &quot;equip custom gemming&quot; to move the JC gems to where you want them.</p>\r\n<p>&nbsp;</p>\r\n<p>That way you aren't limiting the optimiser to a gemming of an item that might not be optimal.</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-10-30T00:36:15.637-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "253013",
    "ThreadId": "73529",
    "Html": "<p>thanks Ebs, I'd totally missed the Blue diamond capability and was trying to do it just using the gemming templates.&nbsp; I'll play around with this tonight, but I think it will absolutely do what I'm trying to do.</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-11-03T14:39:36.393-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]