[
  {
    "Id": "251623",
    "ThreadId": "73615",
    "Html": "<p>I'm not sure these is advisable, but I'm curious if one could use Rawr's Batch Tools to load up a raid full of characters or just a subset (like all DPS or all healers) and run the Upgrade List tools to see who benefits the most from what items?</p>",
    "PostedDate": "2009-10-30T08:24:43.373-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "251638",
    "ThreadId": "73615",
    "Html": "<p>Unfortunately, I'm not sure if it's feasible at this time.&nbsp; Most of the models are just different enough that I don't believe you'd see consistent results across different classes.&nbsp; The DPS may be the closest to being possible, but I know that the Tanks for example have vary different values for what could be in-essence the same types of things.</p>",
    "PostedDate": "2009-10-30T09:12:46.6-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "251643",
    "ThreadId": "73615",
    "Html": "<p>Practically too its probably not a route we'd want to go down. I can just hear the whines now. &quot;I didn't get item X last night cos the raid leader said that Rawr said it was better for class Y.&quot; People have the capacity to get upset enough about whatever looting rules they have without Rawr trying to add to it.</p>\r\n<p>The point is we'd get blamed for every little tweak that was or wasn't in Rawr that favoured or went against your class. We can seriously do without that sort of hassles.</p>",
    "PostedDate": "2009-10-30T09:19:40.37-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "251675",
    "ThreadId": "73615",
    "Html": "<p>Fair enough. &nbsp;I wouldn't have allowed it to be the end-all measurement of gear but I've already got several raid members who are using Rawr, so they would understand the limitations of the tool.</p>\r\n<p>The most recent case where this got brought up was a Resto Shaman who doesn't do the 10 man ToGC, but does our 25 man ToC. &nbsp;He won a loot roll on Boots of Tremoring Earth from Faction Champions. &nbsp;They're item level 245. &nbsp;A Elemental Shaman threw a small fit because the Ele had been running 10 man ToGC and was wearing the item level 245 Boots of Tortured Space and felt the Tremoring Earth boots were BiS for him and a huge upgrade for him.</p>\r\n<p>We awarded the boots to the Resto anyway as he was running around in Lightning Grounded Boots, a crafted 226 item, while we felt the boost, if any, for the Ele would be minimal.</p>\r\n<p>Later a couple of our raiders had been running Rawr and informed me and the guild that we did the right thing anyway and that the Ele was mistaken in wanting those boots anyway. &nbsp;His own 10 man Heroic had an extra gem socket and he was having mana problems that would have been worse had he given up the 26 mp5 his current boots had.</p>\r\n<p>&nbsp;</p>\r\n<p>Anyway, the thought was it might have been useful to run these kinds of lists before the raid week as another data point to use when considering whether to override a /roll on certain items.</p>",
    "PostedDate": "2009-10-30T10:30:45.743-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]