[
  {
    "Id": "252411",
    "ThreadId": "73810",
    "Html": "<p>I'm wondering if there's a way to tell Rawr.Mage to JUST hitcap for arcane alone. Currently when picking gear, it defaults to hitcapping me for fire, frost, and arcane.... 99% of my dps comes from Arcane only spells, and as such, it seems like it's probably a&nbsp; pretty significant loss of dps to push for that extra hit needed to cap out Fire/Frost.</p>\r\n<p>When running the optimizer, you can tell it to do greater-than-or-equal-to or lesser-than-or-equal-to, but it'd be nice if there was a way to set a 'closest to', or optionally allow there to be a checkbox within the program (and I might be missing it, honestly) that allows you to set the requirement of hitcapping only for that tree.</p>\r\n<p>If I'm dumb, and I've missed it, please let me know. ;)</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>Thanks!</p>",
    "PostedDate": "2009-11-02T06:21:59.697-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "252608",
    "ThreadId": "73810",
    "Html": "<p>You shouldn't need to specify hit cap constraints at all. If the optimizer hit caps you for your off-schools that's most likely because you didn't give it enough alternative gear to get rid of the hit.</p>\r\n<p>If for some obscure reason you need to then just take the offset into account and optimize for however much hit rating you want.</p>",
    "PostedDate": "2009-11-02T16:36:53.41-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "252610",
    "ThreadId": "73810",
    "Html": "<p>Rawr doesn't try to hitcap you (other than if you explicitly require miss chance &lt;= 0 in the optimizer). It just shows the performance of your character, and other potential pieces of gear. If you're only using Arcane spells, the fire/frost hit obviously won't matter.  Also, check to make sure you have Misery checked on the buffs tab, if you want to gear with that assumption in mind.</p>",
    "PostedDate": "2009-11-02T16:39:53.173-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]