[
  {
    "Id": "253746",
    "ThreadId": "74181",
    "Html": "<p>As a Boomkin my current boots are Barkhide Treads.&nbsp; I am hit-capped at 275 with them and a Rawr-rating of 6154 DPS.</p>\r\n<p>Boots of Wintry Endurance as listed as a good upgrade (three slots above my current) by MaxDPS.com.&nbsp; Rawr rates them as a significant (five slots above current) upgrade.&nbsp; Ratingbuster shows them as a downgrade in every significant area; Spell Hit Chance -1.30% and Spell Crit -0.31%.&nbsp; My Rawr DPS then jumps to 6214, a significant upgrade.</p>\r\n<p>After running an Upgrade search with maximum thoroughness (all night run), Boots of Wintry Endurance still comes out as a superior upgrade.&nbsp; How?&nbsp; Rawr says that my hit rating drops to 241 (not capped) and my Spell Crit drops from 34.85% to 34.55% (minor).&nbsp; As a matter of principle, I prefer to be hit capped.&nbsp; It was been said before on previous postings that hit capping is not required for maximum DPS.&nbsp; I don't want simply good DPS when I <strong>might </strong>hit a a target (overall lower), I want good DPS when I am <strong>certain </strong>to hit the target (higher).</p>\r\n<p>The discrepancy between Ratingbuster and Rawr about Spell Crit is beside the point.&nbsp; However, using both gem slots to overcome the hit rating loss is a waste of two slots that can go to Spell Power gems.</p>\r\n<p>Please help this Rawr amateur.</p>\r\n<p>Eldorann of Antonidas, Night Elf Druid</p>",
    "PostedDate": "2009-11-05T05:43:11.553-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "253845",
    "ThreadId": "74181",
    "Html": "<p>First, ignore MaxDPS. It's terrible.</p>\r\n<p>What you want to do it sounds like is optimize your DPS, with an additional requirement of being hit capped. Unfortunately, the Moonkin model does not yet support that additional requirement, but we're working on that. In the mean time, just optimizing for DPS will be the best you can do. Comparing to RatingBuster is problematic, because it doesn't necessarily consider gems, enchants, affects of buffs on the value of stats, etc.</p>\r\n<p>I think an important note, however, is this: <em>&quot;I don't want simply good DPS when I&nbsp;might&nbsp;hit a a target (overall lower), I want good DPS when I am&nbsp;certain&nbsp;to hit the target (higher).&quot; </em>Simply, that's not accurate. Rawr already accounts for the miss chance in its DPS totals. Having any miss chance adds variance to your DPS, but it doesn't mean lower DPS. Your DPS will vary from attempt to attempt much more so because of lack of Crit, for example.</p>",
    "PostedDate": "2009-11-05T09:09:50.8-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "253958",
    "ThreadId": "74181",
    "Html": "<p>You have to be careful with those <strong>might </strong>vs. <strong>certain </strong>comparisons.</p>\r\n<p>Spirit is <strong>certain </strong>to increase the damage of every spell you cast (30% spirit -&gt; spellpower).</p>\r\n<p>Crit <strong>might </strong>increase the damage of some of your casts.</p>\r\n<p>Still, most Moonkin value crit &gt; spirit. &nbsp;If not, consider dropping Nature's Grace, Vengeance, Eclipse, and Nature's Majesty from your build, since they aren't <strong>certain </strong>to increase your DPS.</p>\r\n<p>&nbsp;</p>\r\n<p>If you were to gem Wintry Endurance with Rigid+Veiled (which I don't recommend), you'd still be above the hit cap. &nbsp;Your SP would be about 17 higher, your crit about 14 lower. &nbsp;17 SP &gt; 14 Crit, and that is using a bad gemming combination just to remain hit capped.</p>\r\n<p>Barkhide -&gt; Wintry (+Rigid+Veiled)</p>\r\n<p>+1 SP, +3 Int, +49 Spi, +5 Sta, -15 Cri, -4 Hit (but 275-4 Hit is still capped)</p>\r\n<p>+49 Spi (+10% BoK +2% IMotW) * 30% (IMkF) -&gt; +16.5 SP</p>\r\n<p>+3 Int (BoK, IMotW, Lunar Guidance) -&gt; +0.4 SP</p>\r\n<p>+3 Int (BoK, IMotW, Int-&gt;Crit) -&gt; +0.9 CR</p>",
    "PostedDate": "2009-11-05T13:21:49.257-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]