[
  {
    "Id": "254604",
    "ThreadId": "74426",
    "Html": "<p>`</p>\r\n<p>I hit 80 on my elemental shaman a month or so ago, have done some raiding with my guild and stuff, gearscore's at about 4400 now, i started using rawr the other day and i only have the buffs that i can give myself without heroism, now i went to a test dummy in ironforge(tried on both the ?? and the level 80 one) and started DPSing using the rotation that rawr suggested and i was expecting to be putting out about 4490 DPS because in rawr it says &quot;simulation&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 4490 DPS&quot;.....i got there and i could only push it up to about 3100 without heroism, can someone explain this to me?</p>",
    "PostedDate": "2009-11-07T14:35:24.893-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "255690",
    "ThreadId": "74426",
    "Html": "<p>I've had a similar experience which I recently posted in a thread: Burst vs. Sustained DPS.</p>\r\n<p>My $.02:</p>\r\n<p>The elemental shaman code base does not seem to be as far along in development as some of the other modules. I believe that a new developer has recently joined the Rawr team and has been working on the Shaman code bases, but I imagine it will take them some time.&nbsp;A few impacts:</p>\r\n<p>1. The burst vs. sustained DPS slider seems to be &quot;junk&quot; (i.e. provides no useful data). I have mine slid over to 100% burst so make the #s easier to read</p>\r\n<p>2. DPS/simulation calculations do not include some of the &quot;real life&quot; modifiers that some of the other modules provide. Latency can have a substantial impact on DPS especially when you have higher amounts of haste. Some of the modules are even starting to incorporate encounter specific calculations (i.e % of time moving). This of course has no relevancy for training dummies, but is relevant for real world usage</p>\r\n<p>3. I am personally skeptical of the algorithm/math/etc from the simulation DPS (I think that the numbers are high above and beyond what is listed above, but I have no hard evidence of this.. just my opinion ... so please take that as such!)</p>\r\n<p>One other sanity check I'd ask of you is:</p>\r\n<p>Are you simulation #s based upon buffs that were not present for you when using the training dummy?</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-11-10T13:38:50.22-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]