[
  {
    "Id": "254606",
    "ThreadId": "74428",
    "Html": "<p>I have just recently downloaded rawr and i love it. My only issue is I cannot seem to find one solid number for my expected DPS. I see all my gear pieces individual dps. How can i make it show me just one solid number (or range). I am trying to see how much DPS i will sacrifice by switching to fury from arms.</p>\r\n<p>&nbsp;</p>\r\n<p>thanks in advance!</p>",
    "PostedDate": "2009-11-07T14:58:56.29-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "254612",
    "ThreadId": "74428",
    "Html": "<p>Your total DPS is on the bottom of the Rawr screen, it's also on the Stats Pane</p>\r\n<p>Don't use Rawr to compare Fury vs Arms, that won't work, period.</p>",
    "PostedDate": "2009-11-07T15:20:50.78-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "254626",
    "ThreadId": "74428",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>Jothay wrote:</strong>\r\n<p>Don't use Rawr to compare Fury vs Arms, that won't work, period.</p>\r\n</blockquote>\r\n<p>Wait, why? It absolutely should, and I can't imagine why it wouldn't.</p>",
    "PostedDate": "2009-11-07T16:35:16.547-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "254627",
    "ThreadId": "74428",
    "Html": "<p>For the same reason that you shouldn't use Landsoul's sheet to compare the two. There are too many variables and drastic differences between the two. Ebs had a bigger post on this but I'm too lazy to go find it right now.</p>",
    "PostedDate": "2009-11-07T16:42:38.297-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "254639",
    "ThreadId": "74428",
    "Html": "<p>The output is DPS. How is DPS not comparable to DPS?</p>",
    "PostedDate": "2009-11-07T17:50:12.11-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "254660",
    "ThreadId": "74428",
    "Html": "<p>Because, for given fight mechanics, the two specs do their damage in such radically different manners that it's an absolutely terrible idea to use Rawr / spreadsheet to determine the &quot;best performance&quot; spec for any given character / player.&nbsp; The two models (and arguably the specs as a whole) approach their ability usage in such a way as to make them not directly comparable.</p>\r\n<p>It's just a Really Bad Idea.&nbsp; Comparing the output numbers to look for trends across upgrades, or to look for extremely large differences is one thing.&nbsp; Using them to compare when they are within a few hundred DPS (a few %) of each other is an exercise in futility / wasted time.&nbsp; If there is no specific fight mechanic that lends itself to one spec over the other (Anub 25H, with 4 adds with high uptime, favoring Fury, as one example), then they're close enough where they are on par with each other.</p>",
    "PostedDate": "2009-11-07T20:41:22.697-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "254664",
    "ThreadId": "74428",
    "Html": "<p>Can you clarify further? Of course different fights will favor different specs. If Rawr.Mage can be used to compare Fire and Arcane, why can't Rawr.DPSWarr be used to compare Fury and Arms? Are you saying it overstates DPS on one or understands DPS on the other? Can we not fix that?</p>",
    "PostedDate": "2009-11-07T21:18:49.807-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "254887",
    "ThreadId": "74428",
    "Html": "<p>There's a few reasons why it's a bad idea. &nbsp;We have to make some assumptions to model arms that are not technically possible, but a &quot;better&quot; solution is yet to be found. &nbsp;I know that Jothay and Kavan were working on building a state space for arms, but to my knowledge it's not done yet. &nbsp;In this way, the DPS for arms is approximated (higher than possible in practice)</p>\r\n<p>Fury's rotational modeling is better, but also not perfect. &nbsp;It's not &quot;smart&quot; enough to know when it's okay to push your BT or WW back to use a slam. This slightly approximates fury a little lower than it is in practice.</p>\r\n<p>Also, Arms doesn't really have rage-dumping (well, it does, but its contribution to DPS is much less than Fury). &nbsp;We haven't modeled the rage cap (nor has any other theorycrafter, to my knowledge), so we just assume that you can convert all that rage into &nbsp;Heroic Strikes without surpassing the cap. &nbsp;In this respect, arms and fury's HS damage is higher than in-game. &nbsp;This wouldn't be a big deal if both specs used HS equally, but they really don't at all.</p>\r\n<p>The inaccuracies aren't that big of a deal when comparing Arms to Arms, or Fury to Fury. &nbsp;But when comparing Arms to Fury, Arms' over-estimating is not equal to Fury's over-estimating.</p>",
    "PostedDate": "2009-11-08T20:26:34.113-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]