[
  {
    "Id": "254954",
    "ThreadId": "74514",
    "Html": "<p>Hello,</p>\r\n<p>Is there any place where I can get information of what means every option in the healadin module? For example, what modelizes burst scale or holy shock? Or what means GHL taget?</p>\r\n<p>Thanks.</p>",
    "PostedDate": "2009-11-09T01:12:03.187-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "256108",
    "ThreadId": "74514",
    "Html": "<p>Hi,</p>\r\n<p>I'd recommend reading up the documentation here and also learning a bit about the class itself.<br><br>For example, GHL is Glyph of Holy Light, whereas the targets are the numbers of players that have heals bouncing to them.</p>\r\n<p>Also, just run a Recount or WWS for a raid, then check the percentages for say Shock, Flash and Light so you can adjust the modeling towards your individual play style. This might and will change over time, so keep returning to that regularly.<br><br>I found that if you have more concrete questions, people here are happy to help. :)<br><br>Cheers!</p>",
    "PostedDate": "2009-11-11T13:01:30.65-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "256109",
    "ThreadId": "74514",
    "Html": "<p>Hi,</p>\r\n<p>I'd recommend reading up the documentation here and also learning a bit about the class itself.<br><br>For example, GHL is Glyph of Holy Light, whereas the targets are the numbers of players that have heals bouncing to them.</p>\r\n<p>Also, just run a Recount or WWS for a raid, then check the percentages for say Shock, Flash and Light so you can adjust the modeling towards your individual play style. This might and will change over time, so keep returning to that regularly.<br><br>I found that if you have more concrete questions, people here are happy to help. :)<br><br>Cheers!</p>",
    "PostedDate": "2009-11-11T13:01:33.813-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "256610",
    "ThreadId": "74514",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><br></blockquote>\r\n<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>Robur wrote:</strong><br>\r\n<p>Hi,</p>\r\n<p>I'd recommend reading up the documentation here and also learning a bit about the class itself.<br><br>For example, GHL is Glyph of Holy Light, whereas the targets are the numbers of players that have heals bouncing to them.</p>\r\n<p>Also, just run a Recount or WWS for a raid, then check the percentages for say Shock, Flash and Light so you can adjust the modeling towards your individual play style. This might and will change over time, so keep returning to that regularly.<br><br>I found that if you have more concrete questions, people here are happy to help. :)<br><br>Cheers!</p>\r\n</blockquote>\r\n<p>Can you give me a link for the documentation, because those that is in http://rawr.codeplex.com about the healadin model is very poor.</p>\r\n<p>I thought that GHL was Glyph of Holy Light, but I was a bit confused because you can say that the targets could be 1.3, 1.7, 2.1, etc, and I am not a 0.3 of a player :)</p>\r\n<p>Thank you for the advice of watching the recount, this can make me adjust my model.</p>\r\n<p>Thank you Robur for your answers.</p>",
    "PostedDate": "2009-11-12T23:38:58.743-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "256908",
    "ThreadId": "74514",
    "Html": "<p>1.3 targets suggests to me that there is an 'Average Number of Targets' being used, not a hard set 'there must be 1 or 2 targets'</p>",
    "PostedDate": "2009-11-13T11:49:41.863-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "257375",
    "ThreadId": "74514",
    "Html": "<p>In any case, if something &quot;suggests&quot; is because there is a lack of documentation. Again, is there any place where I can get more documentation about the module?</p>",
    "PostedDate": "2009-11-15T23:21:42.487-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "257487",
    "ThreadId": "74514",
    "Html": "<p>Unfortunately its the old catch 22. Would you rather the developer wrote code to get the model working properly or wrote documentation. Given a limited amount of time invariably we all tend towards coding rather than documentation. Such is the life of coders all over the planet. Ideally we have volunteers who aren't coders but still love the product and want to help, who assist in writing the documentation.</p>\r\n<p><br>Writing the documentation is a really really important part of the whole Rawr experience and we would love to hear from people who aren't coders but who can contribute to making Rawr easier to understand. Please contact Astrylian if you can help.</p>",
    "PostedDate": "2009-11-16T05:44:00.303-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "258907",
    "ThreadId": "74514",
    "Html": "<p>Hey Menthil,</p>\r\n<p>apologies for the delay.</p>\r\n<p>Granted, the documentation and the intro here are a rather broad overview that doesn't dive into the details of every single class and spec combination. But you're on a good way, you're asking questions.</p>\r\n<p>Jothay already mentioned the uneven target numbers - say your HL bounces off to 150 persons during 100 casts - then you'd have an average of 1.5. That's of course highly situational. If you are healing a fight like Iron Council in Ulduar, then you will most likely at one point just heal a tank that is tanking a boss away from the rest of the raid. The way to get some bounces going would be to put the beacon on the tank, cuddle up with some other players and heal yourself. That wouldn't work if you and the tank would be on the opposite site of a room, say back in the days at one of the adds in the Fathomlord fight in SSC.</p>\r\n<p>Burst is - as I understand it after some discussion and studying - how much raw healing you can pump out continuosly, aka how much you are using HL without caring about mana resources. I've recently adjusted my settings for that and now have set it 40 percent HL/burst rating.</p>\r\n<p>One thing to keep in mind is that even small movements of the sliders can and will cause a reshuffling of some item lists. Ideally, one would model each fight with the settings and then equip the best available weapon and gear for that fight. That of course is bogus as no bags would be deep enough to hold all those items. ;) That's why modeling an average use of spells and effects will still give you the on average best upgrades.</p>\r\n<p>Also, with the speed Blizzard is cranking out content these days, you might not even get to collect all the &quot;optimal&quot; pieces in time before the next tier of gear is out. But that doesn't make you a worse healer.</p>\r\n<p>Lots of rambling. Let me know if you have any specific questions I could help with.</p>\r\n<p>- Robur</p>\r\n<p>Edit: here are two links worth studying:<br><br>http://elitistjerks.com/f76/t36917-rawr_healadin_model/p10/<br>http://rawr.codeplex.com/Thread/View.aspx?ThreadId=55996</p>",
    "PostedDate": "2009-11-19T17:39:16.593-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]