[
  {
    "Id": "254983",
    "ThreadId": "74522",
    "Html": "<p>It would appear that my attempt to use stationary distributions has fallen flat on its face as I'd not thought about the outlier condition of fast weapons, and therefore the formulae didn't include any provision for them. As a result the current v2.2.26 shows fast weapons as THE weapons to get for Enhance Shaman which of course makes a total mockery of the Enhance model as its not even vaguely true.</p>\r\n<p>I have reverted the WF change and committed that and would ask if at all possible that a v2.2.27 is released (I know I know its just as bad to release 3 versions in quick succession as it is to have an unusable model).</p>\r\n<p>I note that the issue I raised on MSN about mis-spelt buffs adding nulls to Activebuffs was causing issues on other models and preventing models loading, and this was what was fixed for v2.2.26. I think this was the result of someone renaming &quot;Bloodlust&quot; to &quot;Heroism/Bloodlust&quot; without changing the uses of the old spelling in the models that used it hence causing those models to have crashes on load. Having no direct access to ActiveBuffs.Add is a better way to go as you then prevent the issue at source.</p>",
    "PostedDate": "2009-11-09T02:55:49.57-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "255136",
    "ThreadId": "74522",
    "Html": "<p>I'll release .27 tonight.</p>",
    "PostedDate": "2009-11-09T09:33:26.013-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "255145",
    "ThreadId": "74522",
    "Html": "<p>Many thanks and apologies for mucking you about with a bug like that.</p>",
    "PostedDate": "2009-11-09T09:50:52.627-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "255412",
    "ThreadId": "74522",
    "Html": "<p>v2.2.27 released.</p>",
    "PostedDate": "2009-11-10T01:45:45.413-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]