[
  {
    "Id": "256451",
    "ThreadId": "74931",
    "Html": "<p>&nbsp; The duration for a double pot trick&nbsp;shows 1 second less duration&nbsp;then the single pot use.&nbsp; It should be approximately 5-10 seconds (minimum 5 seconds to be able to use a potion again) less then the length of the two potions' durations.</p>\r\n<p>&nbsp;Versions where I've observed the error:&nbsp; 2.2.21, 2.2.24, 2.2.27</p>\r\n<p>Steps to reproduce:</p>\r\n<p>Start Rawr</p>\r\n<p>Go to the&nbsp;Buffs tab</p>\r\n<p>Scroll down to the potions area</p>\r\n<p>Check the 'double pot trick' durations</p>",
    "PostedDate": "2009-11-12T12:16:23.607-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "256555",
    "ThreadId": "74931",
    "Html": "<p>A) http://rawr.codeplex.com/wikipage?title=PostingGuidelines&amp;referringTitle=Documentation</p>\r\n<p>B) ...huh? <em>&quot;It should be approximately 5-10 seconds (minimum 5 seconds to be able to use a potion again) less then the length of the two potions' durations.&quot;</em>&nbsp;What were you trying to say? That doesn't make any sense...</p>",
    "PostedDate": "2009-11-12T20:01:31.963-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "262806",
    "ThreadId": "74931",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>Astrylian wrote:</strong><br>\r\n<p>A) http://rawr.codeplex.com/wikipage?title=PostingGuidelines&amp;referringTitle=Documentation</p>\r\n<p>B) ...huh? <em>&quot;It should be approximately 5-10 seconds (minimum 5 seconds to be able to use a potion again) less then the length of the two potions' durations.&quot;</em>&nbsp;What were you trying to say? That doesn't make any sense...</p>\r\n</blockquote>\r\n<p>A) &nbsp;I'm using the format for a bug report. &nbsp;If this is only the format for bug reports via e-mail or the program itself, I apologize, and will try to submit it that way.</p>\r\n<p>B) &nbsp;A double potion trick is where you use a potion a minimum of 5 seconds before entering combat, thus allowing you to use another after the general potion cooldown is finished. &nbsp;So, for example, I could use an Indestructible Armor Potion as a Blood DK with a DPS spec, granting me armour, and via a talent, AP, for the next 120 seconds, then pull 6 seconds later, gaining a free additional 114 seconds of bonus AP, then two minutes later, use a Potion of Speed. &nbsp;The duration varies according to how you use it, but based on the idea that your raid leader might coordinate this ~5-10 seconds before pulling, I suggested using double the potion duration minus 5-10 seconds (depending on what is thought of as an appropriate amount of time).</p>\r\n<p><span style=\"white-space:pre\"> </span>Currently, the 'double pot trick' in rawr displays a duration of <strong>1 second less then the duration of using a single potion</strong>, thus making it a bug, or an unintended error. I wish you luck with fixing the error.</p>",
    "PostedDate": "2009-12-02T09:00:16.31-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "262850",
    "ThreadId": "74931",
    "Html": "<p>A) Right format, wrong place. You should be posting bugs in the Issue Tracker (see the top of this page, next to the Green Discussions button).</p>\r\n<p>B) Where are you getting this 5 sec from? You can pop the pot then immediately start the fight, don't use another until you are ready.</p>",
    "PostedDate": "2009-12-02T10:53:37.5-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "262859",
    "ThreadId": "74931",
    "Html": "<p>I agree that 1sec is probably too short, and that 5secs is probably too long. &nbsp;Even you pop it 1s before entering combat, you won't be in position to start fighting for at least another 2secs (even with Charge). &nbsp;Unless you're the tank, in which case 1s is doable.</p>\r\n<p>Honestly, I'm not sure we should have double-potting in the buff section. &nbsp;It should probably be an option in the model. &nbsp;Come Rawr3 we can tie it into the boss handler and movements, if boss handler will support &quot;movement at start of fight&quot;.</p>",
    "PostedDate": "2009-12-02T11:10:49.6-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "262897",
    "ThreadId": "74931",
    "Html": "<p>I'd rather not try to over-complicate it by tying it into other stuff like the boss handler. I can see changing it to 2 sec from 1 but not 5 as that would give the double-pots a rather serious kick (for most of them, that's 1/3 of their uptime).</p>",
    "PostedDate": "2009-12-02T12:29:35.743-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "263033",
    "ThreadId": "74931",
    "Html": "<p>I think Sage may be thinking that the 'double pot trick' potion buff doesn't stack with the normal potion buff, when it does. If it's a 2min potion, and you have both checked, you're getting 239sec of uptime.</p>",
    "PostedDate": "2009-12-02T22:18:20.023-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "267442",
    "ThreadId": "74931",
    "Html": "<p>&nbsp; Except Rawr shows 119 seconds of uptime for the double pot trick.&nbsp; Really don't know how to say this clearer.&nbsp; I'll toss this in the issue tracker, thanks.</p>",
    "PostedDate": "2009-12-14T23:18:44.583-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "267459",
    "ThreadId": "74931",
    "Html": "<p>right, the 120 from the primary and another 119 from teh double, totaling 239</p>",
    "PostedDate": "2009-12-14T23:46:08.897-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]