[
  {
    "Id": "256990",
    "ThreadId": "75092",
    "Html": "<p>I was looking at the new gear coming out in 3.3, and I wondered how some of it stacked against my current gear in Rawr. &nbsp;Currently, i'm editing lowbie items and giving them the stats of the items on PTR, and that seems to work, but i'm wondering if there's a faster way to get the PTR items into the database.</p>",
    "PostedDate": "2009-11-13T16:17:37.697-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "256994",
    "ThreadId": "75092",
    "Html": "<p>If the item is on the PTR, WoWhead has most likely added the item to their PTR database. If you can find the item number on their PTR site (say <a title=\"ilvl 251 Bloodmage Gloves\" href=\"http://ptr.wowhead.com/?item=50275\">ilvl 251 Bloodmage Gloves</a> which is 50275). This can be found in the URL of the item where it says &quot;?item=...&quot;. At the top of RAWR, go:</p>\r\n<p>Tools -&gt; Edit Item</p>\r\n<p>At the bottom of the pop-up screen there will be a button named &quot;Add...&quot;. click this and a box with a text box will appear. Make sure that the WoWhead checkbox is checked. Next type in the item number (in the original example you would put in &quot;50275&quot; and press ok. It will first look on the live WoWhead database. If it doesn't find it, then it will look in the PTR database. If it finds, it it will add in the information automatically. Else, it will say it cannot find the item.</p>",
    "PostedDate": "2009-11-13T17:03:17.283-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "257209",
    "ThreadId": "75092",
    "Html": "<p>You can also do bulk upgrades by using Tools | Load Possible Upgrades from Wowhead (make sure the sub menu - Use PTR Data is ticked).</p>",
    "PostedDate": "2009-11-15T03:25:58.013-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "257211",
    "ThreadId": "75092",
    "Html": "<p>*whine* Rawr3 is using ooold item data, and doesn't have the import option implemented yeeet!</p>\r\n<p>;)</p>",
    "PostedDate": "2009-11-15T03:53:02.283-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "261068",
    "ThreadId": "75092",
    "Html": "<p>Any ETA on 3.3 Itemfilters?</p>",
    "PostedDate": "2009-11-27T00:30:40.483-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "261108",
    "ThreadId": "75092",
    "Html": "<p>Most likely NOT until 3.3 is released. They do generally release several releases after a major patch. During one of them they will probably add in filters.</p>",
    "PostedDate": "2009-11-27T02:21:42.23-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "261193",
    "ThreadId": "75092",
    "Html": "<p>Hina is correct, once the patch day happens, expect an initial release of 3.3 options. Then probably a day later another release that includes the full item lists (they don't get moved from PTR to regular immediately on wowhead/armory), we'll try to include filters on that day.</p>",
    "PostedDate": "2009-11-27T10:39:52.263-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]