[
  {
    "Id": "258760",
    "ThreadId": "75629",
    "Html": "<p>Every time I open my prot warrior I have to disable all the default buffs to get to the base stats so I can accurately tweak my gear. &nbsp;It's kind of a pain to have to do that every time (and I normally miss a buff or 2).</p>\r\n<p>Is there an XML file or something I can modify (or a setting to change) to disable buff-by-default on prt warriors?</p>",
    "PostedDate": "2009-11-19T09:45:26.973-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "258779",
    "ThreadId": "75629",
    "Html": "<p>Default buffs are hard-coded into the program, so no there isn't a way to turn that off.</p>\r\n<p>HOWEVER, you are stating that it happens 'every time you open your char'. That implies that instead of saving a character file, you are reloading from the armory/char profiler every single time. This isn't something I would advise doing as you end up repeating a lot of the same work over and over again. It's much faster to save a file then make changes as they occur.</p>\r\n<p>Also, why are you disabling all the buffs? You should have the buffs you normally run with active in order to best gem your gear as they significantly affect how to gear. The stam buffs alone drastically affect how much you should be gearing stam for survival instead of allowing it to go to Dodge or whatever.</p>",
    "PostedDate": "2009-11-19T10:22:50.223-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "258816",
    "ThreadId": "75629",
    "Html": "<p>Yes, I reload each time. &nbsp;I get new gear daily. &nbsp;I save the stuff every time I first load it and have a ton of files named following the pattern: MM-DD-YYYY.xml, but having to remove all those debuffs is really lame (Rawr doesn't do it for my hunter alt, just my prot warrior).</p>\r\n<p>Also... I don't have all those people with me to get all those buffs. &nbsp;I rarely have a pally with me, so Blessing of Kings is worthless. &nbsp;I don't even have fish feast, so that buff is useless. &nbsp;In fact, when I have a druid healer and I'm running a PUG with a few other warriors... almost all those buffs are meaningless. &nbsp;I can't rely on things that don't exist.</p>\r\n<p>In addition, you tweak your gear/gems/stats based on the base level, not the buffed version which will change from heroics to heroics. &nbsp;I guess if I were a raider things would be different, but I don't have the patience for the politics involved with that.</p>\r\n<p>The ONLY reason I use rawr is to see how my gem tweaking will affect my character. &nbsp;I can't ASSUME I always have a pally with me or whatever. &nbsp;I'm just focusing on the mins and caps.</p>",
    "PostedDate": "2009-11-19T11:50:11.617-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "258818",
    "ThreadId": "75629",
    "Html": "<p>I just found the source code. &nbsp;I'll remove this design flaw in my own local version. &nbsp;Thank you.</p>",
    "PostedDate": "2009-11-19T11:51:19.807-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "258831",
    "ThreadId": "75629",
    "Html": "<p>Hold up here. &nbsp;Default buffs are only applied when you are loading a new character from the armory. &nbsp;You should save your character, and then use Tools...Reload Current Character from Armory. &nbsp;This is NOT the same as just loading your character from the armory; the only thing it does is change your gear/talents/glyphs to match what armory has, and any new items it finds get added as available to the optimizer.</p>\r\n<p>You should NOT be reloading from armory every time. &nbsp;That's not why that option is there. &nbsp;What you're seeing isn't a &quot;design flaw&quot;.</p>",
    "PostedDate": "2009-11-19T12:21:37.623-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "259132",
    "ThreadId": "75629",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>quantum00 wrote:</strong><br>\r\n<p>I just found the source code. &nbsp;I'll remove this design flaw in my own local version. &nbsp;Thank you.</p>\r\n</blockquote>\r\n<p>Could you please tell me how to do this? I find it ridiculous that I'm raid buffed with all possible class buffs when trying to look at my base stats.</p>\r\n<p>&nbsp;</p>\r\n<p>Thanks</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-11-20T09:44:46.617-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "259134",
    "ThreadId": "75629",
    "Html": "<p>curiousq you are stating exactly what were showing as trying to avoid.</p>\r\n<p>If you don't want the buffs, turn them off for your saved file.</p>\r\n<p>When you refresh from the armory (note that we DON'T mean create a new character file) you won't suddenly be fully buffed again.</p>",
    "PostedDate": "2009-11-20T09:47:44.45-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "259137",
    "ThreadId": "75629",
    "Html": "<p>Why not just add a tick box for &quot;Deselect All Buffs&quot; on the buff tab instead?</p>",
    "PostedDate": "2009-11-20T09:55:45.633-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "259138",
    "ThreadId": "75629",
    "Html": "<p>Thank you, ebs2002, a TON for showing me the &quot;reload&quot; option. &nbsp;That will be a huge help (thought I'm still going to modify my base source code).</p>\r\n<p>However, curiousq and I both still find it really odd that we are buffed automatically. &nbsp;That's just not realistic. &nbsp;I hate having to debuff my dude every time I get Rawr on a new machine. &nbsp;And my friends have to unbuff me to see my true health too. &nbsp;Pragmatics aside... there's no reason to have those buffs applies any ways (esp Fish Feast-- I can't imagine ever wanting that... spell power? really?)</p>\r\n<p>So... ebs2002 has provided a very good work work around for us, but, the fact remains that the auto buff stuff is really uncalled for. &nbsp;Like I say, it's not on my hunter, just my warrior. &nbsp;We should have more consistency here (i.e. please unbuff the warriors-- I don't care about raids or raid buffing).</p>\r\n<p>I've said my piece and will un-watch this thread now. &nbsp;Just please, please take our recommendations under advisement: please remove the default buffs.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-11-20T09:57:16.187-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "259139",
    "ThreadId": "75629",
    "Html": "<p>Buff Sets will be coming in Rawr3, it will work similarly to how you can select Talent Specs and save/add buff sets.</p>",
    "PostedDate": "2009-11-20T09:57:22.563-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "259140",
    "ThreadId": "75629",
    "Html": "<p>Maybe if I use an analogy, people will understand.</p>\r\n<p>Rawr is like a cell phone. &nbsp;When you get a new cell phone, you transfer over your contacts from your old phone once. &nbsp;You may go through and delete old contacts. &nbsp;You may change the signature on your text messages/emails so it doesn't say &quot;Sent from my Verizon Blackberry&quot; at the end, set up your voicemail and your voice dialing, etc.</p>\r\n<p>If you are opening yourself in armory every time, you are basically wiping the memory and starting over. &nbsp;Every time. &nbsp;You wouldn't do that with your cell phone, why are you doing it with Rawr?</p>\r\n<p>Set the buffs you want, then save. &nbsp;If you want to re-sync with armory, there's a nifty little option called &quot;Reload Current Character from Armory&quot;. &nbsp;It's not that difficult, seriously.</p>",
    "PostedDate": "2009-11-20T09:58:43.103-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "259142",
    "ThreadId": "75629",
    "Html": "<p>Most people use Fish Feast because it gets dropped at the beginning of the Raid for the entire raid to eat and you don't have to spend extra money on your own personal food. It doesn't just give Spellpower, it has Attack Power as well, which is good for Threat.</p>",
    "PostedDate": "2009-11-20T10:02:15.083-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "259145",
    "ThreadId": "75629",
    "Html": "<p>Wow, while I was typing that, there were like 3 or 4 responses.</p>\r\n<p>Yes, buff sets will be coming eventually. &nbsp;The decision is made by whoever wrote the model which buffs they want as default, and you can't please everyone. &nbsp;There are probably hunters who are annoyed that they have to turn on every raiding buff whenever they use Rawr on a new computer. &nbsp;Personally, I'm annoyed that I have to turn on every raiding buff on my DPSWarr.</p>\r\n<p>As for the fish feast, it's just conjecture, but I know some tanks who do fish feast simply because it's economical. &nbsp;Fish Feast provides stamina and some threat to the whole raid, and it only takes up...2 northern spices? (I forget). &nbsp;Or, you can spend almost as much for your own personal food...a little bit of agi or hit or expertise. &nbsp;More threat/survivability than the feast, but if you don't really need it, it's hard to justify the cost when you're chewing glass on 45 Heroic Anub attempts.</p>\r\n<p>Just one example. &nbsp;</p>\r\n<p>Long story short, no matter what we choose, people will complain. &nbsp;It's just the way it is :(</p>",
    "PostedDate": "2009-11-20T10:05:12.67-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "259164",
    "ThreadId": "75629",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>ebs2002 wrote:</strong><br>\r\n<p>Maybe if I use an analogy, people will understand.</p>\r\n<p>Rawr is like a cell phone. &nbsp;When you get a new cell phone, you transfer over your contacts from your old phone once. &nbsp;You may go through and delete old contacts. &nbsp;You may change the signature on your text messages/emails so it doesn't say &quot;Sent from my Verizon Blackberry&quot; at the end, set up your voicemail and your voice dialing, etc.</p>\r\n<p>If you are opening yourself in armory every time, you are basically wiping the memory and starting over. &nbsp;Every time. &nbsp;You wouldn't do that with your cell phone, why are you doing it with Rawr?</p>\r\n<p>Set the buffs you want, then save. &nbsp;If you want to re-sync with armory, there's a nifty little option called &quot;Reload Current Character from Armory&quot;. &nbsp;It's not that difficult, seriously.</p>\r\n</blockquote>\r\n<p>I stand by my statement. A &quot;Disable ALL BUFFS&quot; option on the buffs tab would solve this. It's not that difficult, seriously.</p>",
    "PostedDate": "2009-11-20T10:29:13.903-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "259166",
    "ThreadId": "75629",
    "Html": "<p>Thought I would check the thread one more time.</p>\r\n<p>Ebs2002, you are correct, no matter what we say, someone will complain about something (and it's a relative thing, I&nbsp;perceive&nbsp;you&nbsp;complaining&nbsp;about what I want). &nbsp;Please give us the option to not have the default buffs. &nbsp;Give us the choice instead of forcing the world on us.</p>\r\n<p>Yes, we can just use &quot;reload&quot;. &nbsp;It's not about what's difficult. &nbsp;Again, stop pushing your world on us by default.</p>\r\n<p>Also, obviously fish feast was an example. &nbsp;I don't care it if it was great feash (my personal favorite). &nbsp;People should not have that by default.</p>\r\n<p>Not everyone is a raider, I don't care about raiding. &nbsp;I'm doing this gear stuff because I love, love, LOVE base stat comparison. &nbsp;It makes my day, actually. &nbsp;But again... that's completely irrelevant. &nbsp;It doesn't matter how I'm going to use it or what I like. &nbsp;Give us a tablua rasa that we can work with from the beginning.</p>\r\n<p>This is really a lot like when you get a new HP laptop... you have all that stuff installed that nobody wants. &nbsp;We don't need it. &nbsp;We don't want it. &nbsp;But even if we did need it and want it, it should be an optional addon.</p>\r\n<p>Lastly,&nbsp;for the love of all that is good and holy... please, please, please stop using pragmatic/utilitarian arguments. &nbsp;It has nothing to do with what's easy or not. &nbsp;It's about you pushing your world on us by default. &nbsp;It has to stop. &nbsp;It's the principle that matters. &nbsp;&quot;Most people&quot; this and &quot;easier&quot; that is irrelevant. Please, keep the pragmatic stuff in the Project Manager's office. &nbsp;We get enough of that during the day. &nbsp;If you do want a pragmatic argument though (which I find very inappropriate)... it's very confusing to my friends who DON'T save my settings when they load my acct and see that I have 47k hp, when I'm saying I only have 32k. &nbsp;Not everyone is computer-y enough to know to unbuff all the time.</p>\r\n<p>Maybe that buff set stuff will fix the problem. &nbsp;If so, consider this thread dead. &nbsp;It's a fixed design flaw (yes, I said design flaw -- and I'm sticking to it).</p>\r\n<p>End of Thread.</p>",
    "PostedDate": "2009-11-20T10:35:50.89-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "259167",
    "ThreadId": "75629",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>curiousq wrote:</strong><br>\r\n<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>ebs2002 wrote:</strong><br>\r\n<p>Maybe if I use an analogy, people will understand.</p>\r\n<p>Rawr is like a cell phone. &nbsp;When you get a new cell phone, you transfer over your contacts from your old phone once. &nbsp;You may go through and delete old contacts. &nbsp;You may change the signature on your text messages/emails so it doesn't say &quot;Sent from my Verizon Blackberry&quot; at the end, set up your voicemail and your voice dialing, etc.</p>\r\n<p>If you are opening yourself in armory every time, you are basically wiping the memory and starting over. &nbsp;Every time. &nbsp;You wouldn't do that with your cell phone, why are you doing it with Rawr?</p>\r\n<p>Set the buffs you want, then save. &nbsp;If you want to re-sync with armory, there's a nifty little option called &quot;Reload Current Character from Armory&quot;. &nbsp;It's not that difficult, seriously.</p>\r\n</blockquote>\r\n<p>I stand by my statement. A &quot;Disable ALL BUFFS&quot; option on the buffs tab would solve this. It's not that difficult, seriously.</p>\r\n</blockquote>\r\n<p>AMEN!</p>",
    "PostedDate": "2009-11-20T10:36:24.783-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "259229",
    "ThreadId": "75629",
    "Html": "<p>I'd have to say that if you are using Rawr to look at your base stats then you are in a very small minority.&nbsp;&nbsp; The vast majority use it to plan for raiding and use most of the buffs to work out what will improve their raiding performance.&nbsp;&nbsp; Your gearing decisions can be greatly affected by buffs.&nbsp; For instance, unbuffed 1 Str might equal 2 AP.&nbsp;&nbsp; Suddenly you add even just Blessing of Kings and an item with 19 Str suddenly is better than the item with 40 AP (very rough example).</p>\r\n<p>&nbsp;</p>\r\n<p>The only times I would remove buffs are: -</p>\r\n<p>1)&nbsp; Comparing my test dummy DPS in-game vs. Rawr</p>\r\n<p>2)&nbsp; Double-Checking Rawrs modules to make sure my base stats match with in-game (This could also be considered me having all the correct options set)&nbsp; :)</p>\r\n<p>&nbsp;</p>\r\n<p>I'd be far more interested in savable buff profiles like we have for the talents pane currently.&nbsp;&nbsp; Can't wait for Rawr3 :)</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-11-20T14:13:24.497-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "259339",
    "ThreadId": "75629",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>quantum00 wrote:</strong><br>\r\n<p>Thought I would check the thread one more time.</p>\r\n<p>Ebs2002, you are correct, no matter what we say, someone will complain about something (and it's a relative thing, I&nbsp;perceive&nbsp;you&nbsp;complaining&nbsp;about what I want). &nbsp;Please give us the option to not have the default buffs. &nbsp;Give us the choice instead of forcing the world on us.</p>\r\n<p>Yes, we can just use &quot;reload&quot;. &nbsp;It's not about what's difficult. &nbsp;Again, stop pushing your world on us by default.</p>\r\n<p>Also, obviously fish feast was an example. &nbsp;I don't care it if it was great feash (my personal favorite). &nbsp;People should not have that by default.</p>\r\n<p>Not everyone is a raider, I don't care about raiding. &nbsp;I'm doing this gear stuff because I love, love, LOVE base stat comparison. &nbsp;It makes my day, actually. &nbsp;But again... that's completely irrelevant. &nbsp;It doesn't matter how I'm going to use it or what I like. &nbsp;Give us a tablua rasa that we can work with from the beginning.</p>\r\n<p>This is really a lot like when you get a new HP laptop... you have all that stuff installed that nobody wants. &nbsp;We don't need it. &nbsp;We don't want it. &nbsp;But even if we did need it and want it, it should be an optional addon.</p>\r\n<p>Lastly,&nbsp;for the love of all that is good and holy... please, please, please stop using pragmatic/utilitarian arguments. &nbsp;It has nothing to do with what's easy or not. &nbsp;It's about you pushing your world on us by default. &nbsp;It has to stop. &nbsp;It's the principle that matters. &nbsp;&quot;Most people&quot; this and &quot;easier&quot; that is irrelevant. Please, keep the pragmatic stuff in the Project Manager's office. &nbsp;We get enough of that during the day. &nbsp;If you do want a pragmatic argument though (which I find very inappropriate)... it's very confusing to my friends who DON'T save my settings when they load my acct and see that I have 47k hp, when I'm saying I only have 32k. &nbsp;Not everyone is computer-y enough to know to unbuff all the time.</p>\r\n<p>Maybe that buff set stuff will fix the problem. &nbsp;If so, consider this thread dead. &nbsp;It's a fixed design flaw (yes, I said design flaw -- and I'm sticking to it).</p>\r\n<p>End of Thread.</p>\r\n</blockquote>\r\n<p>WOW you are one whining child.</p>\r\n<p>Sorry what part of &quot;Again, stop pushing your world on us by default.&quot; are we supposed to take on board. If you do not like what the development team have set up STOP using the product. Don't come on here and tell us that what we have chosen is wrong and we should change the defaults that work for the VAST majority of our users because YOU find them inconvenient.</p>\r\n<p>There is a world of difference between making a polite request for some feature to be added and crying and screaming because we don't believe your way would suit the majority of our users. Just because you are fighting against the programs design doesn't make you right. User's have in the past moaned that buffs are not ticked by default and they have to wade through them all to add them. Your attitude towards something you are getting entirely free absolutely stinks.</p>\r\n<p>As it happens I can agree that a simple Disable all Buffs feature would be useful. However you go totally the wrong way about requesting it. Not least of which is this is a discussion and not an issue thread.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-11-21T08:02:35.407-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "259593",
    "ThreadId": "75629",
    "Html": "<p>This thread discussion ends here. &nbsp;Both sides of this have become a little too heated.</p>\r\n<p>I have a few comments:</p>\r\n<p>a) <a title=\"Posting Guidelines\" href=\"http://rawr.codeplex.com/wikipage?title=PostingGuidelines\">http://rawr.codeplex.com/wikipage?title=PostingGuidelines</a></p>\r\n<p>b) <a title=\"Feature Request Format Guide\" href=\"http://rawr.codeplex.com/wikipage?title=FeatureRequestFormatGuide\">http://rawr.codeplex.com/wikipage?title=FeatureRequestFormatGuide</a></p>\r\n<p>c) The features and defaults of Rawr are set up to match the functionality requested and usage of the majority of our users.</p>\r\n<p>d) I am the Project Manager of this project. &nbsp;The time of the development staff of this project is valuable.</p>\r\n<p>e) If you are not the &quot;target user&quot; then certain things may be less then optimal to you. &nbsp;Thats fine, you are not our target user, we don't care.</p>",
    "PostedDate": "2009-11-22T11:19:30.88-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]