[
  {
    "Id": "259144",
    "ThreadId": "75743",
    "Html": "<p>Currently, what I'm doing is loading my current build, then exporting that to a text file (Copy char stats to clipboard). &nbsp;Then I play around a bit with my various gear/gem combinations, then do it again and kind of alt-tab back and forth to see the stat changes.</p>\r\n<p>I've noticed there is an &quot;Item Set Comparison&quot;, but I see no way to load an XML file into those.</p>\r\n<p>Ideally, I would like to be able to do one of the following two:</p>\r\n<p>Load two rawr (MUCH PREFERRED! and I do this with my own local modified copy now -- I can't imagine why you would only want one loaded-- I would like to compare my stats to people who are much more geared than I)</p>\r\n<p>or have the ability to compare XML files in the interface.</p>\r\n<p>For now, I'll continue to load multiple rawrs.</p>\r\n<p>Any suggestions on options I'm missing would be helpful. &nbsp;Keep in mind though, us users shouldn't have to change how we like to compare our information for the sake of using the app. &nbsp;The app should conform to how we&nbsp;naturally&nbsp;compare data (personally I like to compare data quickly as I do very rapid changes).</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-11-20T10:04:32.243-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "259239",
    "ThreadId": "75743",
    "Html": "<p>1) Start Rawr</p>\r\n<p>2) Click &quot;Tools&quot; then select &quot;Batch Tools...&quot;</p>\r\n<p>3) In the Batch Tools window, click on the &quot;...&quot; button and load the first profile you want to look at</p>\r\n<p>4) Click the &quot;...&quot; button on the next line down to load the 2nd profile (keep going to add more)</p>\r\n<p>&nbsp;</p>\r\n<p>Now you can click on the &quot;Show&quot; button to switch easily between the profiles.&nbsp;&nbsp; Also, you can mark the gear available in one profile, then highlight it in the batch tools and hit &quot;Tools&quot; and select &quot;Set Available Items&quot; to mark those items as available in all profiles (much easier when you get an upgrade).&nbsp;&nbsp;&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>Just make sure you save all the profile before you close by hitting the &quot;Tools&quot; menu on the BatchTools window and selecting &quot;Save characters&quot;</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-11-20T14:42:31.607-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "279734",
    "ThreadId": "75743",
    "Html": "<p>quantum00</p>\r\n<p>How did you get two copies of RAWR running on one computer?</p>\r\n<p>I'm trying to do the same type of comparisons as you.&nbsp; I use Batch Tools Optimize a lot but it's not that useful when trying to determine how the equipment/gems/enchants have changed between two or more profiles.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-01-20T14:18:24.33-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "279823",
    "ThreadId": "75743",
    "Html": "<p>Kernow:&nbsp; You make a copy of the whole Rawr directory, and run the 2nd instance of Rawr from there.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-01-20T19:04:09.437-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]