[
  {
    "Id": "259541",
    "ThreadId": "75861",
    "Html": "<p>I have (maybe weird) arcane build 71/0/0. The problem is, that If I have 3 points in Arcane Concentration, legs DPS score is 209,59, but when I remove one point from Arcane Concentration, keeping 2 points only, but keeping everything else the same, my legs DPS score with same gems, enchants etc will INCREASE (?) up to 229,98 !!!?</p>\r\n<p>What does that mean ? That with 2 points in 1 talent instead of 3 my DPS is much higher ? Shouldn t it be lower ? Or does that mean that value of that item is higher, because I am missing that 2% chance on clearcasting ?</p>",
    "PostedDate": "2009-11-22T06:22:21.71-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "259599",
    "ThreadId": "75861",
    "Html": "<p>A) That's a very odd build; almost certainly it's extremely gimping your performance. Look into 57/3/11. Regardless, you're not looking for spec advice...</p>\r\n<p>B) The DPS score of your legs is the DPS score of your legs. That's very different from the DPS value of your whole character. Look at the bottom bar, or the Stats tab to see the character DPS. Your total character DPS is probably going down, your legs just happen to be more valuable. (ie, perhaps they give you mana, which you need without that point in Arcane Concentration, but you don't need with that point in Arcane Concentration)</p>",
    "PostedDate": "2009-11-22T11:42:45.583-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "259633",
    "ThreadId": "75861",
    "Html": "<p>well....odd..I have 2 Savage items and GearScore according to GearScore addon 4004 nad am 2nd DPS on KT usually.....so it seems pretty good to me... thx for advice though.</p>",
    "PostedDate": "2009-11-22T13:29:38.13-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "259635",
    "ThreadId": "75861",
    "Html": "<p>Don't rely on GearScore. The only thing that mod does is show how much total ilevel gear you have. it does not factor in the balance of crit, haste, or spellpower you have.</p>",
    "PostedDate": "2009-11-22T13:36:36.107-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "259922",
    "ThreadId": "75861",
    "Html": "<p>Gearscore is nothing - absolutely nothing - when looking to evaluate the quality of gearing.&nbsp; <em>All </em>it does is tally up the item level of your gear.&nbsp; The resulting number has no bearing on your DPS potential whatsoever.&nbsp; It does arguably have its uses (for seeing when somebody is either very over-geared or very under-geared for a particular level of content), but those uses are limited to &quot;I haven't been able to actually look at this player's setup to verify their knowledge of the class/spec&quot;.</p>",
    "PostedDate": "2009-11-23T12:01:35.073-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]