[
  {
    "Id": "261245",
    "ThreadId": "76437",
    "Html": "<p>I'm wondering if it would be possible to filter out Ulduar hard mode achievements for gear selection. When sorting through a list of gear, there are times when something comes up which is only available through Firefighter25 (considered by some to be harder than One Light) or other Ulduar25 hard mode bosses. The Ulduar HM gear is good, but finding a group these days to actually do them can be difficult. These items are usually ilvl 239, which makes it impossible to filter them out by ilvl without removing items from Ony25, ToC25, or purchased with Triumph badges.</p>\r\n<p>This kind of filter would also prove useful for future versions of Rawr, since there will be hardmode versions of encounters in ICC.</p>\r\n<p>Thanks in advance.</p>",
    "PostedDate": "2009-11-27T17:55:42.847-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "261324",
    "ThreadId": "76437",
    "Html": "<p>These filters are already in place. You can filter globally by turning off 239s, or by unchecking the filters for the hard modes.</p>",
    "PostedDate": "2009-11-28T08:45:09.807-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "261417",
    "ThreadId": "76437",
    "Html": "<p>Unfortunately, filtering Ulduar Hard by using the global item level filters doesn't work when your guild does both Ulduar and TotC.</p>\r\n<p>There used to be a filter for Hard Ulduar a few versions ago, but lately it's been replaced by &quot;??Not Found on Armory?&quot; or something. I just rename that one &quot;Hard Uldaur&quot;, set it's levels to 220-1000 and change the regular Ulduar filter to level 1-219. (1-232 and 233-1000 for 25-Man obviously) Would be nice if we could get the Hard Ulduar filters back though.</p>\r\n<p>Actually, speaking of filtering by item level, perhaps there should be some more item level filters in the default set or make them a bit more descriptive? Maybe a group like:</p>\r\n<ul>\r\n<li>1-1: Heirlooms</li>\r\n<li>2-199: Questing Gear / Craftable Blues</li>\r\n<li>200-212: Heroics / T7-10 / Heroism Badges</li>\r\n<li>213-218: T7-10 Special/Hard / T7-25 / Valor Badges</li>\r\n<li>219-225 T8-10 -- Heroic Trial of the Champion</li>\r\n<li>226-231 T7-25 Special/Hard -- T8-10 Hard -- T8-25 -- Conquest Badges</li>\r\n<li>232-244 T8-25 Weapons/Hard -- T9-10 -- Triumph Emblems</li>\r\n<li>245-257 T9-10 Hard -- T9-25 -- Triumph Emblems</li>\r\n<li>258-1000: T9-25 Hard</li>\r\n</ul>\r\n<p>Maybe a line for each subsection instead of long names like this?</p>",
    "PostedDate": "2009-11-28T15:02:19.663-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "261419",
    "ThreadId": "76437",
    "Html": "<p>That section is complicated enough as it is, I don't think adding to it is going to help anyone more than it will hurt most.</p>\r\n<p>&quot;Unfortunately, filtering Ulduar Hard by using the global item level filters doesn't work when your guild does both Ulduar and TotC.&quot;</p>\r\n<p>Do they do it at the same time? Because you could turn the filter on when you are in Uld and back off when you go into TotC.</p>",
    "PostedDate": "2009-11-28T15:08:58.617-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "261949",
    "ThreadId": "76437",
    "Html": "<p>Yeah, the global item level filters are probably fine, I just thought I'd suggest new names for the sake of clarity.</p>\r\n<p>As far as toggling filters; Personally, I have all the raids my guild does turned on at once so I can see all the items available to me. I usually use Rawr ahead of time to plan out gearing options ahead of time instead of while we're in a raid.</p>\r\n<p>In any case, it would still be nice to have the Hard Ulduar filter back. It's simply a matter of tweaking the item level on the current filter and adding another filter &quot;Ulduar Hard&quot; to cover the rest. In fact, I'll submit a patch to ItemFilter.xml just to illustrate what I'm talking about in case I'm not clear. (which happens a lot) :)</p>",
    "PostedDate": "2009-11-30T09:20:32.38-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "264060",
    "ThreadId": "76437",
    "Html": "<p>It may work for Ulduar 25, but for 10-man raiding guilds it really doesn't.&nbsp; Ulduar 10 Normal modes drop iLevel 219 gear, and Hard Modes drop iLevel 226.&nbsp; Both of which fall into the same range on the default filters, 214-231.&nbsp; I know that I can change these filter manually, but it would be nice if I didn't need to, because in past versions I've made my own filters, then had an update the following day, and had to add them in again.</p>",
    "PostedDate": "2009-12-05T23:28:59.01-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "264290",
    "ThreadId": "76437",
    "Html": "<p>The problem is that, even if we got it down to&nbsp; 6-7 iLvL granularity, we'd still have 10m / 25m overlap (for example, 245 iLvL gear comes from Heroic 10s or Reg 25s).&nbsp; I suggest that you take a look at the source filters, and use these in combination with the iLvL filters to achieve your goal.</p>\r\n<p>Side note: you can keep your existing filters (or data, or gemming templates, or whatever) by copying the old .XMLs from your previous installation (Data folder) into the newly extracted one.</p>",
    "PostedDate": "2009-12-06T19:21:05.693-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "265904",
    "ThreadId": "76437",
    "Html": "<p>The ilvl filter is fantastic, but could it be changed to also have either preconfigurable filter or in the &quot;other&quot; the max ilvl it shows. At this point listing pages after pages 277 items does make it a bit tricky to plan proper item progression.</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-12-10T12:58:23.027-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "265983",
    "ThreadId": "76437",
    "Html": "<p>You can create the filters for Ulduar yourself, but it's annoying to make them every time a new version comes out, so it would be great if this was added. <br>I checked wowhead/wowwiki for all the ilevels of the items from the bosses (wowwiki is wrong about ilevels quite often) and it's easy to seperate the items:</p>\r\n<p>Ulduar 10 Normal: ilevel 219<br>Ulduar 10 Hard: ilevel 226-232<br>Ulduar 25 Normal: ilevel 226-232<br>Ulduar 25 Hard: ilevel 239</p>\r\n<p>This is what I did:</p>\r\n<p><span style=\"text-decoration:underline\">For Ulduar 10:<br></span>I changed the name of the 'Tier 8 Raids (10)/Ulduar' Filter to 'Ulduar Normal' and set the <strong>maximum</strong> itemlevel to 219.<br>I added a new filter 'Tier 8 Raids (10)/Ulduar (Hard Mode)' with the same filter as for normal, and set the <strong>minimum</strong> itemlevel to 220<br>then I added all the subfilters that Ulduar Normal has (no need to change the itemlevels here because the parent filter takes care of that).</p>\r\n<p>For Ulduar 25 I did the same but set the maximum for normal to 232 and the minimum for hard mode to 233.</p>\r\n<p>The only thing that could be a bit wierd, is that theres no 'normal' loot for Algalon as he drops &gt;219 ilevel gear (or &gt;232 on 25) but I'm ok with this because I think you can look at Algalon as a hard mode boss that doesn't have a normal mode.</p>\r\n<p>I didn't create all the boss filters manually. If you know some xml, you can copy/paste most of it when you open the ItemFilter.xml in the Data dir.</p>\r\n<p>BTW, To fix the Onyxia filter (in rawr 2.3.1), change the onyxia (10) filter from <strong>\\(10|(?&lt;!Heroic) </strong>to<strong> \\(10 <br></strong>That should stop the Onyxia 25 items to show up in the 10 man filter.</p>\r\n<p><strong>&nbsp;</strong></p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-12-10T15:41:27.893-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "266016",
    "ThreadId": "76437",
    "Html": "<p>Similar to mvnoppen above, I have set up my own Icecrown filters like this :-</p>\r\n<p>&nbsp;</p>\r\n<p>Icecrown Citadel (10)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Pattern = Icecrown Citadel \\(10</p>\r\n<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 10 Man Reg&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; set iLvl = 251&nbsp;&nbsp;&nbsp;&nbsp; - don't put anything in pattern</p>\r\n<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 10 Man Heroic&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; set iLvl = 264&nbsp;&nbsp;&nbsp; - don't put anything in pattern</p>\r\n<p>Icecrown Citadel (25)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Pattern = Icecrown Citadel \\(25</p>\r\n<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 25 Man Reg&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; set iLvl = 264 &nbsp;&nbsp;&nbsp; - don't put anything in pattern</p>\r\n<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 25 Man Heroic&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; set iLvl = 277 &nbsp;&nbsp; - don't put anything in pattern</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>I have actually also set up sub filters for the 4 bosses we can do so far&nbsp;&nbsp;&nbsp; Lord Marrowgar (pattern = Lord Marrowgar), Lady Deathwhisper (pattern = Lady Deathwhisper), Gunship Battle (Pattern = Gunship), Deathbringer Saurfang (Pattern = Deathbringer).&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; This way I can easily just set it to the loot that is currently available.&nbsp;&nbsp; Rawr automatically puts all the other bosses loots into an &quot;other&quot; subfilter.</p>\r\n<p>When a new version comes out, I check out the new version of the default filters and see if there are any good changes.&nbsp;&nbsp; If not, then I just copy the filters across from my old version.&nbsp;&nbsp;&nbsp;&nbsp; The more I play with the filters, the more I like customising them to suit my needs :)&nbsp;&nbsp;&nbsp;&nbsp; It is a pretty good system once you start getting the hang of it.</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-12-10T17:55:39.287-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]