[
  {
    "Id": "261483",
    "ThreadId": "76490",
    "Html": "<p>I've been messing with Rawr for some time now. Btw I love the program. But just curious is there anyways to set my own personal Haste Cap? Haste is awesome and lovely for Arcane Mages hands down but when you're over 600 Haste unbuffed it starts becoming a waste. Ive played with the Gear Optimizer to some degree but haven't found the solution yet. Every class has Hard&nbsp;and Soft Caps and Im just curious if there is some field or section Im overlooking that allows me to put in such a cap on my haste. Thank you</p>",
    "PostedDate": "2009-11-28T20:30:40.083-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "261556",
    "ThreadId": "76490",
    "Html": "<p>You're aware our hard cap for arcane is 150%, right? Not only that the soft cap for every class is 50%, and that's just to bring your GCD down to the minimum. I'm sitting on 662 atm and thats only 20%. The only real problem you'll ever run into with arcane is with your &quot;UDIENOW&quot; macro and a shammy. If its going to be a problem for me, i just take out the icy veins and use it after hero/bloodlust. Only reason i'd even consider stopping with haste stacking is if i'm having mana issues, which is normally due to user error/bad rotations. All that being said, if your dead set on a haste cap and know the rating you want it capped at, you can use the optimizer. Add a line with haste rating less than/ equal to whatever you want it to be, and let her fly. The thing with the optimizer though is you need to go through each item and click the diamonds next to what you think is obtainable for you. Unless i'm missing a check all button. Took me a few tries before figuring it out. It'll also give you some funky load outs as a result, as it may optimize to that number, then look for best in slot with no haste. Good luck though.</p>",
    "PostedDate": "2009-11-29T04:39:29.69-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]