[
  {
    "Id": "262220",
    "ThreadId": "76675",
    "Html": "<p>Hi,</p>\r\n<p>As a user it would be nice if Rawr had either planned releases for the next release, (i.e. you could se a date when clicking planned releases on the download page).</p>\r\n<p>Or that a new release of Rawr was packaged and published every 2nd Friday or something.</p>\r\n<p>It would provide something to look forward to as a user and also provide some predictability to when the changes/bug fixes that is tracked under &quot;Source Code&quot; tab will be available to me as a normal user.</p>\r\n<p>(Saying normal since un-normal users such as myself downloads the code and compile :) )</p>\r\n<p>Thoughts around this?</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-12-01T03:22:29.5-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "262308",
    "ThreadId": "76675",
    "Html": "<p>Kind of. I typically do releases every couple weeks, but don't plan it weeks in advance. Holidays and being busy with work have preempted another new release lately.</p>",
    "PostedDate": "2009-12-01T07:57:22.427-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "262314",
    "ThreadId": "76675",
    "Html": "<p>I suspect the next release should be planned for Sunday 6th December as its looking increasingly likely that patch 3.3 will hit the US servers on Tuesday 8th. We can then do our usual bug fixes etc once patch 3.3 hits live. Are we going for 2.3.0 at same time as Rawr 3.0.0?</p>",
    "PostedDate": "2009-12-01T08:01:05.84-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "262329",
    "ThreadId": "76675",
    "Html": "<p>Still not sure of the timing of Rawr3, but a new release focusing on 3.3 support on Sunday does sound likely.</p>",
    "PostedDate": "2009-12-01T08:27:21.903-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "262344",
    "ThreadId": "76675",
    "Html": "<p>How does one get in on Rawr3 testing anyway? Being a Mono user, I need to know if I can still edit the code to keep it working to my fancy and of course still use it effectively.</p>",
    "PostedDate": "2009-12-01T08:47:32.24-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "262358",
    "ThreadId": "76675",
    "Html": "<p>E-mail me about Rawr3 testing. Rawr will remain open source, you'll still be able to edit the code.</p>\r\n<p>&nbsp;</p>\r\n<p>Also, that's a good point to bring up because I get asked frequently... I'm behind on my e-mails, but I <strong>am</strong>&nbsp;responding to them, please be patient.</p>",
    "PostedDate": "2009-12-01T09:11:14.113-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]