[
  {
    "Id": "263519",
    "ThreadId": "77075",
    "Html": "<p>Greetings,</p>\r\n<p>&nbsp;</p>\r\n<p>Due to the Chill of the Throne debuff that's coming out in ICC (3.3), I was wondering if there was a way in RAWR to put in an arbitrary negative to an avoidance value (ie: a -20% to dodge).</p>",
    "PostedDate": "2009-12-04T00:07:58.083-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "263525",
    "ThreadId": "77075",
    "Html": "<p>I think Chill of the Throne may already be in; it's at the bottom of the buffs tab. If it's not already in there, it will be in v2.2.28, which we'll be releasing this weekend.</p>",
    "PostedDate": "2009-12-04T00:36:57.13-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "263534",
    "ThreadId": "77075",
    "Html": "<p>The Debuff is set up in the Buff tab however I do believe that DKTank did not support it until just a few days ago. Not sure off-hand if ProtWarrior and ProtPally have support for it though.</p>",
    "PostedDate": "2009-12-04T01:12:17.317-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "263556",
    "ThreadId": "77075",
    "Html": "<p>Doesn't currently appear in 2.2.27 in ProtPally.&nbsp; Hopefully it will in 2.2.28! :)&nbsp; Thanks!</p>",
    "PostedDate": "2009-12-04T02:36:28.243-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "263682",
    "ThreadId": "77075",
    "Html": "<p>Strange, neither Dodge nor Parry were considered relevant stats in the ProtPaladin module. &nbsp;This has been corrected for the next version, allowing Chill of the Throne to be a selectable buff.</p>",
    "PostedDate": "2009-12-04T08:36:58.2-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "263739",
    "ThreadId": "77075",
    "Html": "<p>TankDK took in all buffs, so if it was implemented in 2.2.27, it should be showing the values shift when the (de)buff is applied.&nbsp; However, I agree that I didn't check that it was working until I did my 3.3 changes to ensure that it was actually working.&nbsp; I am looking at some odd results when looking at the Gem Values &amp; Relative stat Values (I know Astry that we shouldn't be looking at those values for evaluation, but it's a good tool to find bugs) because both Dodge Rating and Parry Rating is changing, so I'm not sure why that's the case, but I'm looking into it.</p>",
    "PostedDate": "2009-12-04T10:57:07.25-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]