[
  {
    "Id": "263673",
    "ThreadId": "77132",
    "Html": "<p>I'm always using the line &quot;<strong>ABSpam04MBAM</strong>&quot; to check my dps with new items. I'm still wondering on what is based the DPS we see at the bottom of the page. I seems that items scale according to that number. And when I compared item's dps, I compared based on the list Rawr give me for &quot;Slot:Gear&quot; (the default option)</p>\r\n<p>Tinkets: Today I was amazed seeing that my &quot;Talisman of Resurgence&quot; that seemed to be 3rd in slot (after Unliving ilvl 245 and ilvl 258) looking at &quot;Slot:Gear&quot;, was complety beated by Abyssal Rune: &quot;ABSpam04MBAM&quot; passed from 8207 to 8499 DPS. (I saw that Flare of Heavens was also very good, passed to 8518, but my guild doesn't kill General HM)</p>\r\n<p>Question :</p>\r\n<p>1. Is this number correct for &quot;ABSpam04MBAM&quot; (the normal rotation for an Arcane mage I assume) ?</p>\r\n<p>2. If yes, is there a way to change the list items according to the &quot;ABSpam04MBAM&quot; ?</p>\r\n<p>3. What is the &quot;DPS&quot; we see at the bottom of the page ?</p>\r\n<p>Character : Human mage Everius - Kargath</p>\r\n<p>&nbsp;</p>\r\n<p>Thank you</p>",
    "PostedDate": "2009-12-04T08:22:06.837-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "263708",
    "ThreadId": "77132",
    "Html": "<p>The DPS of a specific rotation (ie &quot;ABSpam04MBAM') is <em>not</em>&nbsp;what you want to make gear decisions on, sort by, or even really look at for comparison most of the time. The plain &quot;Dps&quot; is what you want to look at, and is mirrored at the bottom of the page. Each rotation's DPS is just that rotation, raw, without fight constraints, cooldowns, temporary buffs, etc. It's already sorting by what you want. &quot;Dps&quot; includes the different rotations that you use throughout the fight, the cooldowns you use, mana constraints, everything. It's the total DPS done for the whole fight.</p>",
    "PostedDate": "2009-12-04T09:36:36.537-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "263754",
    "ThreadId": "77132",
    "Html": "<p>To anwer your other question, to know what cycles the overall DPS is based on mouse over the * next to Spell Cycles in the Solution section.</p>",
    "PostedDate": "2009-12-04T11:51:53.707-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "263781",
    "ThreadId": "77132",
    "Html": "<p>Thank you Astrylian and Kavan, everything more clear now. I'm going to keep Talisman of Resurgence combined with Reign of the Unliving trinket (ilvl 245).</p>",
    "PostedDate": "2009-12-04T13:26:46.343-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]