[
  {
    "Id": "263987",
    "ThreadId": "77227",
    "Html": "<p>Does one exist?</p>\r\n<p>I have been 'twinking' a level 70 warrior but have been unable to find a decent spreadsheet / dps calc program that allows 'level 70' to be selected instead of default 80. The numbers when using RAWR (level 80) are useless for me because of scaling.</p>\r\n<p>Is there an option for 70 that I overlooked in RAWR, and if not, is there the intention of ever adding this feature to RAWR?</p>",
    "PostedDate": "2009-12-05T12:11:05.797-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "263989",
    "ThreadId": "77227",
    "Html": "<p>A) Common misconception: Rawr is Rawr, not RAWR</p>\r\n<p>B) Rawr's intended use is for end game raiding, and is increasingly inaccurate the further down in levels you go. Yes, you can load the level 70 char in, but the stats will be off and it won't be populated with level 70 gear.</p>",
    "PostedDate": "2009-12-05T12:16:29.03-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "264016",
    "ThreadId": "77227",
    "Html": "<p>It's a HUGE amount of work getting the formulae right and accurate for level 80s without worrying about getting the formulae right for a level that most people will spend less than 8 hours of /played time in these days. This feature won't be catered for.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-12-05T15:00:35.917-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "472235",
    "ThreadId": "77227",
    "Html": "<p>what i do is look at the 70 sets and the 80 and find the gem ratio for example the Tier 6 preist armor, not including the meta, has 11 slots but the Tier 10 has 7 slots so i look at what Rawr suggests like 2/7(meta not included) Orange Epic gems giving Spell Power and haste so i do the math on it 2/7=0.28571428571428571428571428571429&nbsp;thats the ratio of&nbsp;0.286 times that number by 11 for the tier 6 slots, .286x11=3.146 so 3 Orange Rare/Epic Gems giving Spell Power and Haste should do the trick. &nbsp;Then do that for the rest of the gear and max out the enchants you can afford/make and have fun twinking. &nbsp;</p>\r\n<p>PS i dont get the idea of twinking but i use this for planning gems for my upcoming 70's</p>",
    "PostedDate": "2010-07-24T18:19:55.49-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "472238",
    "ThreadId": "77227",
    "Html": "<p>Hmm. I'm not sure what you were trying to say, gaclem, but it whatever you actually said just ended sounded really dumb.</p>\r\n<p>You should not plan gems for 70s. You should not care about gems for 70s. You should not use Rawr for 70s. You should only level as a 70.</p>",
    "PostedDate": "2010-07-24T18:39:24.563-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "472606",
    "ThreadId": "77227",
    "Html": "<p>To put it in numbers...<br><br>All rating calculations are made for level 80 characters (will be changed to level 85 for cataclysm, so we won't offer continued support for 80 'twinks').</p>\r\n<p>Ratings are on a diminishing curve, meaning as you get higher in level, you need more of a certain rating to get the same stat %.&nbsp; This is done on purpuse by blizzard to actively devalue gear as you level up.</p>\r\n<p>If your gear offers you 30% crit rating at level 70, that same gear will get&nbsp; you considerably less than 30% at level 80.</p>\r\n<p>This means that if you look at your level 70 character in level 70 gear, you'll see that Hit%, Crit%, Defense, Expertise, ... are all lower in the in-game character panel than what rawr is suggesting.</p>\r\n<p>This means the suggestions Rawr will do are equally to be taken with a grain of salt (or rather make it a boulder of salt).&nbsp; Usually, best dps means you need to max out on the cappable stats like Hit and Expertise, but since they're undervalued for your level, Rawr will make unreasonable suggestions for your level 70 character, asking&nbsp;you to equip <strong>a lot</strong> more hit and expertise than you really need to.</p>\r\n<p>Rawr for anything below level 78 is simply not going to be very helpful.&nbsp; At around level 78 you start to get reasonable suggestions and you can start to prepare and plan your early end-level gear. Such as doing some of the higher instances (HOL, HOR, TOC) in normal mode for some of the gear that drops there. You can also plan and look ahead for your initial heroic modes which don't come available until you're actually 80.</p>",
    "PostedDate": "2010-07-26T05:00:02.61-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]