[
  {
    "Id": "264212",
    "ThreadId": "77300",
    "Html": "<p>Hey all. Couple things.</p>\r\n<ul>\r\n<li>I have a massive inbox of requests for the Rawr3 beta. If I haven't responded to yours, please be patient, I'm going through them as fast as I can.</li>\r\n<li>Just posted a new build of Rawr3, which includes a new Chart Picker control. It's a new bit of UI to help you swap between charts quickly and easily, and to show off the fact that there are a variety of different charts to new users (so many people just would leave it on Gear charts with the Rawr2 chart dropdowns, and just change the slot, never realizing that there were enchant charts, buff charts, talent charts, model specific charts, gem charts, etc). I'm hoping that this interface will be much more usable. Please check it out if you're in the Rawr3 beta, and post your feedback here.</li>\r\n</ul>\r\n<p>&nbsp;</p>\r\n<p><strong>There are two known issues:</strong></p>\r\n<ol>\r\n<li>There's no 'stickiness' to the menu yet. It's very subtle, but notice in using normal menu controls (you know, like any standard program menu), an item with subitems doesn't pop open until you're moused over it for a brief period of time; it's not instant. It can vary by OS, but it's usually in the 0.1 to 0.3sec range. That's enough time so that you can mouse over one item, then go to move your cursor to the submenu items, but graze the corner of another parent item, and it won't swap you to the other submenu. Most people probably don't even notice it, but it's there, and it makes menus much easier to use, and forgiving of slightly off cursor movements. <strong>Rawr3's ChartPicker doesn't have this <em>yet.</em><span style=\"font-weight:normal\">&nbsp;I'm going to build it in, but in the mean time, expect to get annoyed with it as you try to move to one of the sub menu items, and accidentally switch the submenu.</span></strong></li>\r\n<li><strong><span style=\"font-weight:normal\">It includes several new charts, which are not yet implemented. I've implemented all of the charts from Rawr2 that weren't implemented yet in Rawr3, but there's still 5 more new ones which aren't implemented yet.</span></strong></li>\r\n</ol>\r\n<p>&nbsp;</p>\r\n<p>That's it, look forward to feedback on this.&nbsp;</p>",
    "PostedDate": "2009-12-06T12:29:05.303-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "264226",
    "ThreadId": "77300",
    "Html": "<p>I'm loving this new chart-picker, makes it REALLY obvious that there's more than just the Gear chart to look at. That stickiness you mention isn't really that big of a problem from what I can tell.</p>",
    "PostedDate": "2009-12-06T13:49:00.84-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "264244",
    "ThreadId": "77300",
    "Html": "<p>Cat Model</p>\r\n<p>Options Tab</p>\r\n<p>Fight Parameters - a newbie isn't going to have much idea about what Boss Armour value to input. Could also help more experienced people if there was a drop down menu or something indicating example levels for average boss in TOC10/25 or ICC10/25 heroic/normal.</p>\r\n<p>Misc - Sentence under Trinket Offset is cutoff - it reads &quot;This indicates that you unequip and then reequip one of&quot;.</p>\r\n<p>&nbsp;</p>\r\n<p>Install Offline - button not working?</p>\r\n<p>&nbsp;</p>\r\n<p>The new menu/mouseover system is a gigantic step forward in ease-of-use for me. Right on.</p>\r\n<p>&nbsp;</p>\r\n<p>Gemming Templates stuff is still confusing the new user and I still can't seem to figure out if I need to mess with it to be able to have Rawr tell me if/when it's a significant increase in dps if I switch from Agi to ArPen gemming.</p>\r\n<p>&nbsp;</p>\r\n<p>BossHandler (first time I've even seen it, being on a Mac and somewhat mono-challenged) is obviously a powerful tool if you know exactly which fight you need to optimize yourself for. However - still confusing for the average new user unless you use a drop down menu of common pre-configured typical encounters/bosses and what you could reasonably expect on them - or similar. I suppose a mouseover system could work, or just leave as is and have it for advanced users only. Or expand the Help documentation. This module also seems be a significant step up in workload on your programmers/developers, but not having any coding experience I wouldn't know. Awesome feature idea though.</p>\r\n<p>&nbsp;</p>\r\n<p>Everything in the Options drop down menu could use mouseover tooltips imo.</p>\r\n<p>&nbsp;</p>\r\n<p>Would dearly love mouse-wheel scrolling in the right-hand window pane.</p>\r\n<p>&nbsp;</p>\r\n<p>Gear &gt; Wrists didn't seem to work, everything else so far is fine. Click on Gear, mouse over Wrists and click on - gear display list doesn't change from whatever was there before.</p>\r\n<p>&nbsp;</p>\r\n<p>Tabbed away to write this and had to reload character after I tabbed back. Happened twice now.</p>\r\n<p>&nbsp;</p>\r\n<p>ChartPicker - I'm guessing this is the name for the drop-down menu in the top left of the right-hand part of the Rawr interface. Looks great!</p>\r\n<p>&nbsp;</p>\r\n<p>Cheers for all the hard work.</p>",
    "PostedDate": "2009-12-06T14:54:35.887-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "264245",
    "ThreadId": "77300",
    "Html": "<p>Well, wanted to keep this specific to the Chart Picker, but what the hell...</p>\r\n<p>Boss Armor: It doesn't change for anything except target level. All 83 bosses have the same armor, 10683 (or whatever the default is). It's just there for people theorycrafting stuff out.</p>\r\n<p>Install Offline: Looks like I broke that. Joy.</p>\r\n<p>Gemming Templates are an advanced feature that 95% of users shouldn't touch; the defaults should satisfy all the typically viable gemming schemes. To that end, I'll be adding arpen templates to Cat defaults in the future.</p>\r\n<p>BossHandler: You haven't seen this before because it's new, is totally not done, and isn't implemented at all in most models.</p>\r\n<p>Tooltips on Options: Definitely, just hasn't been high priority.</p>\r\n<p>Mouse Wheel support: Errr... This does work on PC... Could be that Silverlight's mousewheel support on Mac is broken... Will investigate.</p>\r\n<p>Gear&gt;Wrists: Oops, fixed.</p>\r\n<p>Why did you have to reload your character?</p>\r\n<p>&nbsp;</p>\r\n<p>Thanks!</p>",
    "PostedDate": "2009-12-06T15:07:50.207-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "264250",
    "ThreadId": "77300",
    "Html": "<p>Astry's Correct, I have not fully fleshed out the Boss Handler tab as it's a TON of work. If you want to know what this stuff does, go to DPSWarr in Rawr2 to see how the options play around. That's where this stuff is coming from, I'm just making it generic to Characters so that any model can use the same options instead of having to remake it per model.</p>",
    "PostedDate": "2009-12-06T15:21:12.213-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "264264",
    "ThreadId": "77300",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>Astrylian wrote:</strong>\r\n<p>Why did you have to reload your character?</p>\r\n</blockquote>\r\n<p>I use Firefox, had another tab open for this thread and was bouncing back and forth. Kept seeing a blank character sheet in Rawr when I'd come back, but it's not happening consistently. All I had to do was re-open my saved char file.</p>",
    "PostedDate": "2009-12-06T16:55:01.62-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "264296",
    "ThreadId": "77300",
    "Html": "<p>Hmmm... Odd. Does it seem like it's reloading the page or something? Is it completely fresh? Or are you still in the same model, same chart, etc?</p>",
    "PostedDate": "2009-12-06T19:58:20.373-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "264299",
    "ThreadId": "77300",
    "Html": "<p>I think it's a Firefox issue.</p>\r\n<p>1) When loading in my druid (Deldruid on Crushridge) if I load it in Firefox (Windows Vista Ultra x64) When I switch from Cat to Bear the stats for bear do not show. However if I run in IE v8, it works fine.</p>\r\n<p>2) Loading from armory doesn't seem to be applying professions yet</p>\r\n<p>3) (minor) still using 3.1 loot gear/gemming icons</p>\r\n<p>4) (semi-minor) if Window is partially sized (say half the screen) and the user selects &quot;Values &gt; Relative Stat Values&quot; the button can underlap (starts hidding behind) the &quot;Sort Overall&quot; button.</p>\r\n<p>5) Enforce Gem check box is not selected when importing a character from Armory</p>\r\n<p>6) (Suggestion) Probably should put up a list of what each race/class/spec is capable of (Night Elves are only able to use Warrior, druid, etc), and then by spec.</p>\r\n<p>7) Hovering over a set bonus does not show a &quot;pop up&quot; on what that set bonus does like 2.2.27 does.</p>",
    "PostedDate": "2009-12-06T20:17:36.01-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "264311",
    "ThreadId": "77300",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>Astrylian wrote:</strong><br>\r\n<p>Hmmm... Odd. Does it seem like it's reloading the page or something? Is it completely fresh? Or are you still in the same model, same chart, etc?</p>\r\n</blockquote>\r\n<p>happened twice a few hours ago, hasn't happened since, I wouldn't worry much about it</p>\r\n<p>Enforce Gem Requirement still doesn't have a tooltip, minor issue I guess.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-12-06T20:55:34.7-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "264640",
    "ThreadId": "77300",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>Astrylian wrote:</strong><br>\r\n<p>Hey all. Couple things.</p>\r\n<ul>\r\n<li>I have a massive inbox of requests for the Rawr3 beta. If I haven't responded to yours, please be patient, I'm going through them as fast as I can</li>\r\n</ul>\r\n</blockquote>\r\n<p>&nbsp;</p>\r\n<p>Oh oh oh... this even makes me wanna try it even more!</p>\r\n<p>I just have a silly question, will you reply by e-mail or by some PM here on codeplex? nut sure there is one tough, but just wanted to be sure!</p>",
    "PostedDate": "2009-12-07T13:55:30.117-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "264719",
    "ThreadId": "77300",
    "Html": "<p>E-mail.</p>",
    "PostedDate": "2009-12-07T19:03:04.78-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "265362",
    "ThreadId": "77300",
    "Html": "<p>1. Hope you get better so you can enjoy some new gated content that's rather easy if you're a TOGC25-type guild. Got a new movie in the works, no action, no pvp or pve or anything, just fun happy cool druid stuff. Also thinking about making a sequel to the Guide: How To Feral DPS correcting a bunch of things I got wrong and trying to get some more Peer Reviewers this time.</p>\r\n<p>&nbsp;</p>\r\n<p>2. Item Upgrade List - I'm guessing that Rawr3 currently comes with a pre-determined item list (cache?) that seems to be up-to-date with all 3.2.2, i.e. t9 content - and is likely sourced from the armory or wowhead (?). Problem is that we just started getting access to t10 content yesterday. I tanked my dkp to get a minor upgrade in ICC25 so I could test out what would happen when I loaded a new item in Rawr last night. Worked beautifully. However, when building an upgrade list I see nothing new, since the cache is t9-dated. I'm guessing either the 'standard' R3 cache has to wait for an update or we'll have to wait until some or all of the stuff in the 'Import' drop-down menu is workable, which I'm thinking could be a lot of hard work. Until then I'll be guessing what's an upgrade and how big, and importing new items by re-loading my char from armory.</p>\r\n<p>3. Filter on right-hand side of Rawr's main window does not have T10 radio buttons.</p>\r\n<p>4. Get well. This stuff can wait.</p>\r\n<p>EDIT:</p>\r\n<p>5. The issue with coming back to a blank character after tabbing away may be some sort of time-out thing. Seems to happen with some frequency if you leave the tab for a while. No big deal imo.</p>",
    "PostedDate": "2009-12-09T08:01:56.74-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]