[
  {
    "Id": "264468",
    "ThreadId": "77366",
    "Html": "<p>I'm leaving this open to the public to get some ideas from the Moonkin who actually use Rawr, as well as other developers.&nbsp; I'm going to be completely redoing the Stats panel interface for Rawr3, and I want your input.&nbsp; The top section (Health, Mana, Spell Power, etc.) will probably remain the same.&nbsp; There will also have to be a section displaying the selected and optimal rotations and their DPS/Time to OOM.&nbsp; Other than that information, what do you guys want to see?&nbsp; I've been thinking about making it more along the lines of Mage, which shows spell breakdowns and a lot of other cool stuff which I could do, but just haven't put the effort into.</p>",
    "PostedDate": "2009-12-07T06:40:16.637-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "264587",
    "ThreadId": "77366",
    "Html": "<p>Extra detail for spells is a good confidence builder. &nbsp;If I don't trust Rawr's overall DPS numbers, the first thing I'd like to check is how hard Rawr thinks my spells should hit, compared to how hard my logs say I'm actually hitting. &nbsp;If Rawr gets the individual spells right, I'll have more confidence in its composite score.</p>\r\n<p>It would also be helpful to see some timing related numbers:</p>\r\n<p>1) How long is the eclipse cycle (proc lunar to proc lunar)?</p>\r\n<p>2) How many nukes land during each eclipse proc?</p>",
    "PostedDate": "2009-12-07T11:23:22.743-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "264972",
    "ThreadId": "77366",
    "Html": "<p>I've created a new display and checked it in.&nbsp; I had intended it to be purely for Rawr3, but there's really no way to enforce that, so the next release of Rawr2 will have it as well.&nbsp; Please, feel free to play around with it and make suggestions.&nbsp; Some suggestions may take extra work, as I do not capture the exact same data that Rawr.Mage does and I can't make them look exactly the same without changing some behind-the-scenes calculations, but it can be done if you feel it is necessary or would give better information.&nbsp; I welcome you guys's feedback.</p>",
    "PostedDate": "2009-12-08T08:14:16.467-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "269216",
    "ThreadId": "77366",
    "Html": "<p>Hey dopefish - first, thanks for your work on Rawr.Moonkin - it helps a lot.</p>\r\n<p>What I would like to see is how far away/over I am from soft crit and haste cap.</p>",
    "PostedDate": "2009-12-19T02:18:41.68-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "270357",
    "ThreadId": "77366",
    "Html": "<p>First let me apologize if this topic I am about to bring up has been covered before. The interface is a little confusing to me as a Moonkin user, but&nbsp;while not the stats panel you mention specifically I have a comment overall.</p>\r\n<p>Originally I didn't realize I had to go to the options tab to tell it I use innervate on myself. That was my fault for not fully poking around, as that completely changed the gem recommendations I have. I am not sure what the &quot;delay&quot; means as I am unable to find a help file to show what that mean (seconds, minutes, intervals, whatever).</p>\r\n<p>Additionally I am confused as to if I need to select Moonkin Form(crit) and Improved Mookin Form (haste) on the Buffs tab. I am selecting Mark of the Wild and improved FF as I don't think they are automatically factored in.</p>\r\n<p>The reason I am confused on the first two check boxes&nbsp;is if I remove the related talents from my talent tree,&nbsp;RAWR adjusts the damage score of gems and gear. If I check the check boxes, it adjusts the damage scor of gems and gear. Since those talents only affect me when I am in moonkin form, it looks like checking the check boxes might be doubling up on the buffs for my character calculations. The reason I say this is if they weren't being calculated in until I checked those check boxes, then why would adjusting my talents w/o the check boxes make a difference?</p>\r\n<p>I would request the Moonkin Form at the least be grayed out if it is being already calculated, and graying ou the Improved Moonkin Form if the talents are maxed out for it.&nbsp;I could see leaving the check box available for the Improved if I didn't have the talent points for it maxed out since while I might not have it, another Moonkin in the RAID might.</p>\r\n<p>Right now If I have just Mark of the Wild and Improved FF checked, RAWR is telling me the best gem is&nbsp;a +20 Int gem. However if I check the Moonkin Form, it changes to +Spell Power and +Haste gems. So figuring out if these buffs in questoin are implied or not by default (which again adjusting the talent points for them suggests they are) will drastically change the gear and gem recommendation for me.</p>\r\n<p>For reference I am Althonis on Lothar US</p>\r\n<p>Again I apologize if this has been covered before, I just started searching these forums for information and yours was the first post I received. Hopefully the comments are relative to the overall question you asked.</p>",
    "PostedDate": "2009-12-23T09:51:38.957-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "270432",
    "ThreadId": "77366",
    "Html": "<p>Actually, I've been confused about the exact same things in just about every model I've ever used (which is nearly all of them). It would be really nice if models were more clear about what buffs they internally model so they can be selected properly in the buffs tab.</p>\r\n<p>That's one of the things I really like about DPSWarr; Everything is neatly documented right inside the model itself. Even the &quot;duh&quot; options are explained just in case. It would be nice if more models would implement something similar.</p>",
    "PostedDate": "2009-12-23T14:51:21.343-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "270454",
    "ThreadId": "77366",
    "Html": "<p>You're welcome :P</p>",
    "PostedDate": "2009-12-23T16:13:35.01-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "271755",
    "ThreadId": "77366",
    "Html": "<p>Dopefish,</p>\r\n<p>Is there any chance some of this information could get clarified, hopefully in the Moonkin user interface?</p>\r\n<p>Thanks!</p>",
    "PostedDate": "2009-12-30T09:49:40.627-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]