[
  {
    "Id": "266900",
    "ThreadId": "78038",
    "Html": "<p>Hello.&nbsp; As the subject line says, I recently discovered Rawr and I love it.&nbsp; I'm not one of those people who enjoys agonizing over whether 10 points of Haste is better than 5 points of Spellpower, or what have you.&nbsp; So when I found that your program does the work for me, I was very pleased.</p>\r\n<p>Anyways, on to the point of the post.&nbsp; I have a lower level alt (level 41) and I was wondering if Rawr supports these level characters?&nbsp; I have been able to load him up in the program, but all the suggestions for his gear start at level 80 stuff.&nbsp; Is there a setting I am missing for this?</p>\r\n<p>&nbsp;</p>\r\n<p>Thanks in advance!</p>\r\n<p>Mortavius.</p>",
    "PostedDate": "2009-12-13T23:25:58.253-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "266903",
    "ThreadId": "78038",
    "Html": "<p>Most models only work for level 80. You can load low level gear if you use edit items and pull it from armory, but all calculations will work assuming level 80 stats and abilities.</p>",
    "PostedDate": "2009-12-13T23:54:37.313-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "266904",
    "ThreadId": "78038",
    "Html": "<p>You can't really use it for low level charaters at all.&nbsp; Rawr is really aimed at raiding toons and has all the level 80 calculations in it.&nbsp;&nbsp;&nbsp; To program it for lower levels would be a crazy amount of work as all the stats change, the spells change, how much crit raiting for 1% crit changes etc.&nbsp;&nbsp; Basically it is not worth anyones time to do it.&nbsp; Your best bet is to use it to work out what crafted gear you want to prepare for your toon as it approaches 80.</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-12-13T23:56:03.253-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "267124",
    "ThreadId": "78038",
    "Html": "<p>Yes, the biggest problem is with ratings. &nbsp;At low levels, 6 hit rating can be a huge boon for dual-wielding classes. &nbsp;At level 80, it's worth next to nothing. &nbsp;And we do not have our ratings scale with level, in part because that formula isn't well-tested and in part because it's not our goal with Rawr. &nbsp;Rawr is for max-level raiding, and to a lesser extend max-level heroics. &nbsp;Solo, PvP, and low-level play just isn't in the scope.</p>",
    "PostedDate": "2009-12-14T09:21:38.547-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "267217",
    "ThreadId": "78038",
    "Html": "<p>Awesome!&nbsp; Thank you all for the quick responses; I won't bang my head against the wall anymore looking for a setting that doesn't exist.</p>\r\n<p>Keep up the great work!&nbsp; I love your program.</p>\r\n<p>Mortavius.</p>",
    "PostedDate": "2009-12-14T11:40:51.31-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]