[
  {
    "Id": "267178",
    "ThreadId": "78115",
    "Html": "<p>Using Tools/Edit Items I added the new elemental shaman badge totem (Bizuri's Totem of Shattered Ice).&nbsp; I added it using the Wowhead item number and I see that it appears now in the Edit Items list.&nbsp; How do I get that item to appear in the main Item Comparison frame for my toon?</p>",
    "PostedDate": "2009-12-14T10:45:37.763-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "267182",
    "ThreadId": "78115",
    "Html": "<p>The proc is not yet supported in the public release, tho I think they've already got it added in the Dev copy. You'll have to wait until then. To at least select the item, give it like 1 spell power or something.</p>",
    "PostedDate": "2009-12-14T10:51:33.027-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "267185",
    "ThreadId": "78115",
    "Html": "<p>Ah--ok.&nbsp; I'll give that a try when I get home today.&nbsp; Thanks for the quick reply!</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-12-14T10:54:16.717-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "267600",
    "ThreadId": "78115",
    "Html": "<p>I ended up giving it a value for haste.&nbsp; It still didn't appear in the Comparison list.&nbsp; I checked to make sure I wasn't filtering anything as well.&nbsp;</p>",
    "PostedDate": "2009-12-15T08:09:01.067-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "267652",
    "ThreadId": "78115",
    "Html": "Wow, I missed that you said you checked your filters.  Ignore this post.",
    "PostedDate": "2009-12-15T10:50:42.38-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "267793",
    "ThreadId": "78115",
    "Html": "<p>A useful way to find an item in a situation like this is to make a new filter called &quot;ALL&quot; (at least that's what I call mine) without putting anything in the pattern or other fields.&nbsp;&nbsp; When you select this filter it will bring up all items regardless of where it is from etc.&nbsp;&nbsp; Then you can find the item and look at it's location details and work out why the other filters aren't showing it.</p>\r\n<p>If the item doesn't show up with the &quot;all&quot; filter on then it may be due to the model itself filtering items - check the models options tabs to see if it is filtering out hit or SP or AP items.&nbsp; (not really an issue in this case)</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-12-15T15:26:32.63-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "267808",
    "ThreadId": "78115",
    "Html": "<p>The Item Filters dropdown doesn't do anythng based on stats, which is what the problem here is.</p>",
    "PostedDate": "2009-12-15T16:01:25.217-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "267833",
    "ThreadId": "78115",
    "Html": "<p>I finally got it to show up as expected.&nbsp; It turns out to have been a strict case of user error.&nbsp; When I added a haste value for it, I put it in a class-specific category (warlocks, to be exact) and surprise surprise it didn't show up in my shaman's gear.&nbsp; Adding a haste value to the class-less section worked great.&nbsp; Thanks for all the help folks.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-12-15T17:32:17.21-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]