[
  {
    "Id": "267430",
    "ThreadId": "78170",
    "Html": "<p>Please give us a time frame for updating the Warlock Model.&nbsp; I don't care about implementing professions, or different ways to use filters at the moment.&nbsp;&nbsp;Just please give us a decent warlock model to use in the&nbsp;very near future while you continue to improve other areas.&nbsp; If you do not plan on updating it just give us a heads up so we move on and&nbsp;stop checking your site every day only to be let down.&nbsp; I know you guys are busy and working hard, but it looks as if you have took a dump on warlocks and just don't care anymore.&nbsp;In this economy people can hardly donate to anything at all, but if we get a working lock model, &nbsp;I&nbsp;for one, will surely donate.&nbsp;</p>",
    "PostedDate": "2009-12-14T22:33:20.48-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "267467",
    "ThreadId": "78170",
    "Html": "<p>ArPharazon?</p>",
    "PostedDate": "2009-12-15T00:31:32.923-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "267762",
    "ThreadId": "78170",
    "Html": "<p>Zarie - did you search before posting? If so, you would know that I am infact working on the warlock module to bring it up-to-date. We have not forgotten about warlocks at all.</p>\r\n<p>I have been pretty slack tho and not posted any updates - what can I say, reallife work, heavy raiding schedule getting in the way etc etc.</p>\r\n<p>However, I know that warlocks need some love, so I'll check in the new module later today/tomorrow with the disclaimer that its not yet 100% up [for example, I just started reworking the handling of pets, but I'm sure you can live without that for a bit].</p>",
    "PostedDate": "2009-12-15T14:37:24.91-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "267809",
    "ThreadId": "78170",
    "Html": "<p>Honestly, most of us don't care that it's not 100%, we just want what fixes you have done.</p>",
    "PostedDate": "2009-12-15T16:02:13.27-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "267918",
    "ThreadId": "78170",
    "Html": "<p>When I started work on it Locks didn't even have pets in Rawr. If you check in others can help out, making the whole process faster.</p>\r\n<p>I have been looking at some of the things that were broken after people edited my last version but didn't want to check anything in as you were overhauling it anyway.</p>",
    "PostedDate": "2009-12-16T00:21:38.583-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "268196",
    "ThreadId": "78170",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>ArPharazon wrote:</strong><br>\r\n<p>Zarie - did you search before posting? If so, you would know that I am infact working on the warlock module to bring it up-to-date. We have not forgotten about warlocks at all.</p>\r\n<p>I have been pretty slack tho and not posted any updates - what can I say, reallife work, heavy raiding schedule getting in the way etc etc.</p>\r\n<p>However, I know that warlocks need some love, so I'll check in the new module later today/tomorrow with the disclaimer that its not yet 100% up [for example, I just started reworking the handling of pets, but I'm sure you can live without that for a bit].</p>\r\n</blockquote>\r\n<p>&nbsp;Yeah, I saw the posting..... Do you realize how long we have heard the word &quot;soon&quot;.&nbsp; How much longer is soon gonna be?</p>",
    "PostedDate": "2009-12-16T14:19:52.597-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "269414",
    "ThreadId": "78170",
    "Html": "<p>Soon obviously doesn't mean 4 more days as we are still waiting!&nbsp; Guess it's time for locks to just give up on RAWR.</p>",
    "PostedDate": "2009-12-20T13:08:07.643-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "269434",
    "ThreadId": "78170",
    "Html": "<p>Maybe a programmer will start a Warlock only application we can use.&nbsp; Gawd I miss my Rawr....</p>",
    "PostedDate": "2009-12-20T15:12:54.123-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "269435",
    "ThreadId": "78170",
    "Html": "<p>Please remember that these guys do this in their own time, because they <strong>want </strong>to, not because they have to.&nbsp; Sure, it frustrating that we warlocks can't use Rawr right now, but do as I have - make use of other tools, and be gracious that someone is at least working on the code.</p>\r\n<p>I wish I had time to contribute to the development, but I don't - so I will wait patiently until something arrives :)</p>",
    "PostedDate": "2009-12-20T15:27:42.75-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "269764",
    "ThreadId": "78170",
    "Html": "<p>Your absolutely correct Kharristan and I apologize if my comments sounded rude.&nbsp; I have used other tools, but Rawr is my fav.&nbsp; Therefore, frustration sets in and it's an on going thing now.&nbsp; Nice to hear ArPharazon is having so much fun during his summer, but I wish he would just set some time aside so us Warlocks can have some fun during our winter months this year.&nbsp; Thanks for all your hard work devs.</p>",
    "PostedDate": "2009-12-21T19:06:45.847-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "270090",
    "ThreadId": "78170",
    "Html": "<p>If one of the developers is willing to hand-hold me through how to create a new module and how everything hangs together I'm willing to write a working Warlock module. Alternatively, if ArPharazon wants to send me or check in what he's done and a list of what is yet to be done I'm willing to have a go at finishing it all off. If there's someone in particular I need to ask about this (ArPharazon didn't reply to my offer of help) please let me know who that person is. I'm not going to promise that anything will happen particularly quickly and updates to it will probably be sporadic at best. But I'd like to have a go.</p>",
    "PostedDate": "2009-12-22T15:54:25.267-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "270095",
    "ThreadId": "78170",
    "Html": "<p>At this point, we've just got to wait for Ar's progress, and then go from there.</p>",
    "PostedDate": "2009-12-22T16:37:33.34-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "270319",
    "ThreadId": "78170",
    "Html": "<p>&quot;reallife work, heavy raiding schedule getting in the way&quot;</p>\r\n<p>LOL</p>",
    "PostedDate": "2009-12-23T08:04:46.72-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "270849",
    "ThreadId": "78170",
    "Html": "<p>For all the waiters out there, ArP has FINALLY started posting updates for the warlock build. Just posted a massive update earlier today. So Yes, you will have your Warlock update next release.</p>",
    "PostedDate": "2009-12-26T09:42:20.453-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "270889",
    "ThreadId": "78170",
    "Html": "<p>Most of the new model is there, but still a lot to be added over the next few days, for example, demonology spec is not quite up to standard yet, and pets are being reworked, and also some new stuff.</p>",
    "PostedDate": "2009-12-26T15:15:50.547-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "270894",
    "ThreadId": "78170",
    "Html": "<p>Wonderful, /clap...&nbsp; When should we expect some updates?&nbsp; Anything you have now would be great!&nbsp; If we have to wait for the next release can you tell us when it will happen?</p>",
    "PostedDate": "2009-12-26T15:37:26.967-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "270902",
    "ThreadId": "78170",
    "Html": "<p>Releases are whenever Astrylian feels a release is needed. So we don't know when a release will take place. I would say definitely within the next week and a half though given that the next wing of ICC (and when most raiders will have their 2-piece T10) will open up (January 5th/6th). I know on my mage, I'll have 2-piece T10 on the 4th (155 frost badges total).</p>",
    "PostedDate": "2009-12-26T16:35:48.717-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "271066",
    "ThreadId": "78170",
    "Html": "<p>Awee, not what I wanted to hear....</p>",
    "PostedDate": "2009-12-27T21:47:20.437-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "271077",
    "ThreadId": "78170",
    "Html": "<p>Which can be relatively soon, if needed. Just not immediately soon, as all I got for Xmas was food poisoning. Typing this from bed... *zonk*.</p>",
    "PostedDate": "2009-12-28T00:03:46.357-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "271079",
    "ThreadId": "78170",
    "Html": "<p>Sorry to hear that Ast, that is NOT the holiday gift we wished for you!!!</p>\r\n<p>I know all the Locks, are eagerly awaiting the updated module!!!&nbsp; :)&nbsp;</p>\r\n<p>Thanks ArP and Ast!</p>",
    "PostedDate": "2009-12-28T00:10:27.5-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "271980",
    "ThreadId": "78170",
    "Html": "<p>ArP, when would you like bug reports to start coming in? I'm well aware there might be more stuff to check in yet - at the moment, with the current SVN checkout, my character appears to be doing 225k DPS which, while that would be nice, seems to be a touch on the high side. Seems to be something to do with too many shadow bolts being cast.</p>",
    "PostedDate": "2009-12-31T07:02:06.4-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "272091",
    "ThreadId": "78170",
    "Html": "<p>Ah yes - I am aware of tha, just have not gotten around to it.</p>\r\n<p>Feel free to start submitting bugs tho - theres still a lot of changes coming, but I want to forget anything before the next release.</p>",
    "PostedDate": "2009-12-31T15:50:06.297-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "272294",
    "ThreadId": "78170",
    "Html": "<p>Am I missing something in the compilation or testing of the module, as I am now seeing ZERO event / combat activity or any DPS listed apart from the initial warlock dps of 1003 (or whatever it is).&nbsp; I might be missing some flags or something in the compilation or debug testing that is required to grab the right information?&nbsp; Either that, or there is something amiss in general?&nbsp; Is anyone else experiencing no event information or DPS increase???</p>\r\n<p>&nbsp;</p>\r\n<p>And before anyone says I need to post this as a bug, I'd like to confirm that I am not doing something incorrect for testing the modules and updates.</p>\r\n<p>&nbsp;</p>\r\n<p>I have the most recent SVN update....</p>",
    "PostedDate": "2010-01-01T19:55:23.483-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "272326",
    "ThreadId": "78170",
    "Html": "<p>Do you mean on the Events tab?</p>\r\n<p>If so, then yeah - its not a bug - nothing is listed there at the moment cos i'm looking at changing that view into something much more usuable.</p>\r\n<p>However, there is going to be a release soon (sometime today/tomorrow), so I'll just restore the old view for now.</p>",
    "PostedDate": "2010-01-01T22:13:31.913-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "272359",
    "ThreadId": "78170",
    "Html": "<p>Aaaah, okay gotcha, because I was wondering why I was getting ZERO + DMG, and no specific events other than default DPS.&nbsp; Even the reported issue with SB causing overages in DMG, as nothing other than base DMG was reported.</p>\r\n<p>I'll wait for the build, and checkout the new code once completed.</p>\r\n<p>I may start &quot;throwing in my 2 cents&quot; once I fully understand the current code.&nbsp; If that's okay with you sir!??</p>",
    "PostedDate": "2010-01-02T02:03:20.063-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "272480",
    "ThreadId": "78170",
    "Html": "<p>Well,,,, I just don't know anymore.</p>",
    "PostedDate": "2010-01-02T18:14:25.17-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "272495",
    "ThreadId": "78170",
    "Html": "<p>Zarie - myself and faidwen, at the very least, will give this a good run-through before the next release, so it seems. You can't expect an entire new model written and tested by one person to just work perfectly immediately as it gets merged with the live tree. Just look at Windows 95.</p>\r\n<p>&nbsp;</p>\r\n<p>If I get time tomorrow I'll give all the stuff that's been uploaded a good read through and see if I can find any bugs or if I can break anything. Just have to hope work doesn't get in the way.</p>",
    "PostedDate": "2010-01-02T19:25:19.99-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "272496",
    "ThreadId": "78170",
    "Html": "<p>And to help with the checking, I am adding alot of extra information into the tooltips [coefficients, multipliers, and so on] so that anyone with theorycrafting knowledge can also double-check the calculations without having to dig thru the code.</p>",
    "PostedDate": "2010-01-02T19:35:36.36-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "272633",
    "ThreadId": "78170",
    "Html": "<p>Regarding Zwegan's comment on release:&nbsp; So he thinks you should just delete the Warlock Model and that Warlocks should be removed from the game as well.&nbsp; Just want to remind him it takes more skill to play a lock than a mage.&nbsp; Just a little stab back at you....</p>",
    "PostedDate": "2010-01-03T14:50:12.177-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "272731",
    "ThreadId": "78170",
    "Html": "<p>What absolutly baffles my mind is that anyone can make any kind of pushy, negative or even frusterated comment toward people who put in their own time without pay to create a free domain tool like Rawr (or any other tool or add on).&nbsp; I'm not one of the developers here but I really wish people would understand that &quot;Thanks&quot; works so much better than griping.&nbsp; In fact, it's the griping that makes developers say &quot;screw this&quot; and stop making these great tools for the rest of us.&nbsp; Oh, and guess what... There is a little thing called &quot;personal responsibility&quot;.&nbsp; Rawr isn't obligated to play your toon for you.&nbsp;It's every player's responsibility to gear their own toon.&nbsp; I am just extreemly thankful for people who put together tools like Rawr as they are such a huge help to me.&nbsp;</p>\r\n<p>THANK you ArPharazon (and any others) for all the recent work on the Warlock module!&nbsp; I'm really looking forward to the continuing updates.&nbsp; The Warlock DPS spreadsheet hasn't been updated since 3.3 and althougth it is also a great tool, I really miss the optomizer in Rawr.</p>\r\n<p>Thanks!&nbsp; Thanks!!&nbsp; THanks!!!</p>\r\n<p>-Grench</p>",
    "PostedDate": "2010-01-03T22:20:29.523-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "277534",
    "ThreadId": "78170",
    "Html": "<p>Hi, just wondering how the work on the warlock model is going, i'm longing to have a working warlock model again :) Rawr have helped me alot gearing up my 4 level 80's, donated 20$ as thanks.</p>",
    "PostedDate": "2010-01-15T04:13:10.49-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "277631",
    "ThreadId": "78170",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>grenchlok wrote:</strong><br>\r\n<p>What absolutly baffles my mind is that anyone can make any kind of pushy, negative or even frusterated comment toward people who put in their own time without pay to create a free domain tool like Rawr (or any other tool or add on).&nbsp; I'm not one of the developers here but I really wish people would understand that &quot;Thanks&quot; works so much better than griping.&nbsp; In fact, it's the griping that makes developers say &quot;screw this&quot; and stop making these great tools for the rest of us.&nbsp; Oh, and guess what... There is a little thing called &quot;personal responsibility&quot;.&nbsp; Rawr isn't obligated to play your toon for you.&nbsp;It's every player's responsibility to gear their own toon.&nbsp; I am just extreemly thankful for people who put together tools like Rawr as they are such a huge help to me.&nbsp;</p>\r\n<p>THANK you ArPharazon (and any others) for all the recent work on the Warlock module!&nbsp; I'm really looking forward to the continuing updates.&nbsp; The Warlock DPS spreadsheet hasn't been updated since 3.3 and althougth it is also a great tool, I really miss the optomizer in Rawr.</p>\r\n<p>Thanks!&nbsp; Thanks!!&nbsp; THanks!!!</p>\r\n<p>-Grench</p>\r\n</blockquote>\r\n<p>As much as I agree with you about the &quot;personal responsibility&quot; - and I agree wholeheartedly about the &quot;THANK YOU ArPharazon [and others]&quot; - I can see why there's frustration.&nbsp; Rawr is supposed to be &quot;the&quot; stand-alone character modeling software out there.&nbsp; Not everyone has current versions of Excel etc. that can run spreadsheets.</p>\r\n<p>A tremendous about of frustration is due to the fact that at this point the Warlock spreadsheet from EJ isn't updated, Rawr took out a model that seemed [to me at least] to be 90% accurate and replaced it with a model that was 99% accurate on the 60% of the model it had implemented and MaxDPS...&nbsp; well, it's MaxDPS.</p>\r\n<p>Personally, I work 8 hours a day [generally] and raid 4 hours a night 4 nights a week.&nbsp; I also work with numbers constantly; coming home and having to figure out my gear on a piece by piece basis is tbh too much like work for me.&nbsp; That's why I use(d) Rawr; it helped me determine the best gear I can possibly use, given what I have available.&nbsp; With Rawr's warlock model and EJ's spreadsheet down as well as MaxDPS and Wowhead using probably-faulty models, there's no software out there that will help me determine the absolute best gear I can equip.</p>\r\n<p>I can, fairly easily, swap one or two pieces around to determine what a decent set it with my available gear.&nbsp; It gets much harder when you have 2-3 pieces for most slots of gear.&nbsp; THAT is what Rawr can help me with; I don't have time to write myself a spreadsheet that determines exactly what gear would be best.</p>\r\n<p>All this said - I would like to reiterate, THANK YOU ArPharazon.&nbsp; Your work isn't underappreciated, we're just irritated that everyone seems to have stopped working at once.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-01-15T09:05:46.337-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "277704",
    "ThreadId": "78170",
    "Html": "<p>Very well stated Karindra.&nbsp; My biggest frustration is that the dev's are so busy working on other areas, such as implementing the cost and other tools to make Rawr better etc., while the Warlock Model is still so fail.&nbsp; We don't even have the basics working correctly.&nbsp; It would seem to me that getting the Warlock Model up and running smoothly would take some priority here.&nbsp; Also, when people do post about their frustration we get jumped on which makes us feel even more frustrated and hopeless about the Warlock Model.&nbsp; I love Rawr, always have.&nbsp; The dev's seem to be working very hard, just not on the Warlock Model.&nbsp; I'm sure a release will come out very soon, I just pray the locks have a somewhat decent working model when it does.&nbsp; Thanks dev's for everything, your hard work, and the new tools, but please give us more attention.&nbsp; That's all we are asking basically.</p>",
    "PostedDate": "2010-01-15T12:35:14.123-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "277710",
    "ThreadId": "78170",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>Zarie wrote:</strong><br>\r\n<p>Very well stated Karindra.&nbsp; My biggest frustration is that the dev's are so busy working on other areas, such as implementing the cost and other tools to make Rawr better etc., while the Warlock Model is still so fail.&nbsp; We don't even have the basics working correctly.&nbsp; It would seem to me that getting the Warlock Model up and running smoothly would take some priority here.&nbsp; Also, when people do post about their frustration we get jumped on which makes us feel even more frustrated and hopeless about the Warlock Model.&nbsp; I love Rawr, always have.&nbsp; The dev's seem to be working very hard, just not on the Warlock Model.&nbsp; I'm sure a release will come out very soon, I just pray the locks have a somewhat decent working model when it does.&nbsp; Thanks dev's for everything, your hard work, and the new tools, but please give us more attention.&nbsp; That's all we are asking basically.</p>\r\n</blockquote>\r\n<p>You're talking about different devs. There are dedicated devs for each model, as well as many of us work on the core functionality as well. The warlock dev(s) are entirely focused on Rawr.Warlock. For example, I'm not able to personally help out with Rawr.Warlock, because I know relatively nothing about warlocks, and it's not any code I'm even remotely familiar with. But I'm spending my time working on Rawr3, instead.</p>",
    "PostedDate": "2010-01-15T12:58:05.603-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "277767",
    "ThreadId": "78170",
    "Html": "<p>Yeah, I see.&nbsp; Thanks Astrylian.</p>",
    "PostedDate": "2010-01-15T15:08:17.263-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "278015",
    "ThreadId": "78170",
    "Html": "<p>Can we get an update like maybe tonight or tomorrow?</p>",
    "PostedDate": "2010-01-16T15:36:39.977-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "279000",
    "ThreadId": "78170",
    "Html": "<p>Swedish saying:&nbsp;When you are waiting for something good, you can never wait too long. In the meantime heres an motivation booster a la <a href=\"http://www.youtube.com/watch?v=JYc05gZFly0\">Futurama</a> for you devs ;)</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-01-19T08:06:11.31-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "279219",
    "ThreadId": "78170",
    "Html": "<p>I was wondering something about the warlock model. I want to understand more how trinket procs/crit or hit are taken into account when calculating the dps value of items.</p>\r\n<p>For what I can see, trinkets having Spell power as primary bonus are always on top, but base crit or haste are not taken into account when presented as primary bonus. Moreover, procs or use effect do not seems to being taken into dps account when I refer to the DPS ranking of those items. Am I wrong or there is something I'm not catching up?</p>\r\n<p>P.S.: Thx ArP for getting us some new content your afforts and work are really appreciated.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-01-19T15:47:43.07-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "279231",
    "ThreadId": "78170",
    "Html": "<p>Nope - you are absolutely correct, the reason being that trinket proc effects are not currently implemented.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-01-19T16:18:05.363-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "279731",
    "ThreadId": "78170",
    "Html": "<p>ah, this explains why its trying to get me to replace my Muradin's Spyglass with Lunar Dust as the best cost upgrade.&nbsp; *sigh*</p>\r\n<p>Are tier bonuses implemented?</p>\r\n<p>Could we get a consolidated message on what is and is not implemented / working in the warlock model?</p>\r\n<p>So far we have Pets, trinket procs, and dps events are not working.</p>\r\n<p>I appreciate your time and effort on the module, but what we do have is still unusable at this point as a whole.&nbsp; If we are at least aware of what is not implemented we can try and work around it to get some use out of the rest of the model.&nbsp; For example, we can't turn off optimization for specific slots, so trinket procs not being implemented throws off any optimization runs we would do for the character.&nbsp; However, we could only mark two trinkets as available to work around this, and remove the trinket costs for optimization to try and eliminate them from consideration.&nbsp; Not ideal, but workable.</p>",
    "PostedDate": "2010-01-20T14:15:49.647-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "279736",
    "ThreadId": "78170",
    "Html": "<p>Somehow I believe even without updating the warlock model, the application gives out some weird errors.</p>\r\n<p>For example, I have the exalted ashen verdict ring, yet rawr wants me to switch it to Valanar's other Signet Ring. Even without the procs calculated, the exalted ring has better stats, not mentioning the socket and bonus on it.</p>\r\n<p>Also, can I switch off hit rating calculation? I don't care that much that I'm not hit capped, I can always switch one item to cap in 10man, and in 25man there are buffs that will bring me to cap.</p>\r\n<p>I don't like how items socketed with 12sp 10hit are shown to have +10 or more dps than 12sp 10 haste. That's not what I've learned in Warlock School... Don't-socket-hit class was pretty strict on this.</p>",
    "PostedDate": "2010-01-20T14:22:28.96-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "279752",
    "ThreadId": "78170",
    "Html": "<p>Kerfax:</p>\r\n<p>1) This stuff doesn't matter right now cuz <strong>everything</strong> in the Warlock model is thrown off by the missing setups, which ArPharazon I'm sure is working tirelessly to correct.</p>\r\n<p>2) No, you can't switch off hit Rating calculation, if you don't have enough hit you need to get more, or you need to select the Buffs in Rawr so that it know you have that hit from those other resources.</p>",
    "PostedDate": "2010-01-20T15:10:40.157-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "279822",
    "ThreadId": "78170",
    "Html": "<p>Might I humbly suggest that in future any large code changes that are likely to make any module unusable be done in a separate branch or something?</p>",
    "PostedDate": "2010-01-20T19:02:43.797-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "279835",
    "ThreadId": "78170",
    "Html": "<p>No</p>",
    "PostedDate": "2010-01-20T19:37:15.08-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "279838",
    "ThreadId": "78170",
    "Html": "<p>That's the kind of unconstructive reply I've come to expect from you Jothay.&nbsp; :(</p>",
    "PostedDate": "2010-01-20T20:10:04.223-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "279856",
    "ThreadId": "78170",
    "Html": "<p>Regardless of whether you feel Jothay's answer is constructive or not, you're significantly off the mark in your question. Large changes that are likely to make any module unusable are already not checked in. That isn't what happened with Warlock. None of Ar-Pharazon's changes made Rawr.Warlock significantly less usable.</p>",
    "PostedDate": "2010-01-20T21:13:17.393-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "279912",
    "ThreadId": "78170",
    "Html": "<p>I'm pretty sure most locks would disagree with you on that, Astrylian.</p>",
    "PostedDate": "2010-01-21T00:05:50.17-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "279928",
    "ThreadId": "78170",
    "Html": "<p>Pay close attention to what I said. None of Ar-Pharazon's changes made Rawr.Warlock significantly less usable. It is definitely unusable for the most part, but it definitely was unusable for the most part before. It's not any <em>worse</em>&nbsp;than it was. It's just missing pets, instead of having all of the calculations totally fucked up and out of date.</p>",
    "PostedDate": "2010-01-21T00:46:59.54-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "279960",
    "ThreadId": "78170",
    "Html": "<p>The new model (even without pets) is starting to rate items correctly (except for T10-4pc and T9-2pc - which requires pets).</p>\r\n<p>The previous model (which had pets) was completely wrong - just look at the predicted spell damage values there.</p>\r\n<p>Anyway, pets will be added soon (dont waste your time making posts asking &quot;when&quot; / &quot;eta&quot; and so on), and then you'll see that the new model is shaping up nicely.</p>\r\n<p>Until then - sit down, stfu, and quit yer bitching. Its getting done.</p>",
    "PostedDate": "2010-01-21T03:06:12.36-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "280196",
    "ThreadId": "78170",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>Astrylian wrote:</strong><br>\r\n<p>Pay close attention to what AI said. None of Ar-Pharazon's changes made Rawr.Warlock significantly less usable. It is definitely unusable for the most part, but it definitely was unusable for the most part before. It's not any <em>worse</em>&nbsp;than it was. It's just missing pets, instead of having all of the calculations totally fucked up and out of date.</p>\r\n</blockquote>\r\n<p>Yes, this.&nbsp; I actually hadn't been paying close attention to EJ/Rawr discussions for a while and had been unaware that the model was borked until a few weeks before 3.3 dropped; as a result, my gear choices were suboptimal.</p>\r\n<p>No, the model doesn't entirely work.&nbsp; No, it is not &quot;close enough to use&quot;.&nbsp; Pets and pet-based procs are a vital part of most specs [Demo IIRC has several, Destruction has Empowered Imp, Affliction has Dark Pact/pet mana regen].&nbsp; While the gear without them might be reasonably close on an individual piece basis, it will be off on building sets by a significant amount.*</p>\r\n<p>That said, it is a work in progress, and ArP is working without getting paid on a program for a game that he enjoys, out of [presumably] pure goodwill.&nbsp; Stop yelling at him and let him work.</p>\r\n<p>*I may be a little unusual; I collect a ton of gear and save it so that when I get an upgrade for a piece in a slot that has hit I can swap it in easily.&nbsp; I rarely if ever swap one piece in or out; it's almost invariably 3-4 pieces and 2-5 gems.&nbsp; This last time, it was chest/weapon/pants.</p>",
    "PostedDate": "2010-01-21T11:41:39.147-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "280284",
    "ThreadId": "78170",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>Niightblade wrote:</strong><br>\r\n<p>I'm pretty sure most locks would disagree with you on that, Astrylian.</p>\r\n</blockquote>\r\n<p>Really?&nbsp; Well, I'm most certainly not in the majority then.</p>\r\n<p>The Warlock module has been providing very misleading results for a very long time; 6 months or more I would think.&nbsp; It has certainly not been a good tool to make gear choices in this time, and even the most basic inspection of what it would often suggest would reveal this.&nbsp; Given how long the module went without anyone to actively work on it, this is not surprising.&nbsp; I am grateful that ArPharazon has taken on the vast rework that is necessary, and IMHO everyone should be too. Stop bitching about someone that is spending <strong>THEIR OWN TIME</strong> trying to fix a very broken tool that will be extermely useful when working properly again.&nbsp;</p>\r\n<p>Sure I would like this working today, but entirely understand the reality of the work that is involved.</p>\r\n<p>Ultimately alienating ArPharazon will not help you, or any of us.&nbsp; A liitle bit of encouragement goes a very long way!</p>",
    "PostedDate": "2010-01-21T15:09:29.93-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "280344",
    "ThreadId": "78170",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>kharristan wrote:</strong><br>...\r\n<p>Ultimately alienating ArPharazon will not help you, or any of us.&nbsp; A liitle bit of encouragement goes a very long way!</p>\r\n</blockquote>\r\n<p>Yes, but it is entirely acceptable for the devs to alienate their users because hey, they volunteer their time!&nbsp; Whatever.&nbsp;</p>\r\n<p>Look at the replies to this thread and others from the Devs.&nbsp; I've never seen a more obvious display of contempt and general attitude from the people that should be fostering this community but instead lash out at just about everything.</p>\r\n<p>How dare we as users ask for any kind of update or status! or even a list of what is and is not currently working.&nbsp; To quote &quot;sit down, stfu, and quit yer bitching. Its getting done.&quot;&nbsp; Try that with your BA/PM or manager next time please.&nbsp; Oh what, you wouldn't do that?&nbsp; Then why is it acceptable here?&nbsp; Oh, because your a volunteer and we need to coddle your ego and so forth so we get something done on the model.&nbsp; Again, Whatever.</p>\r\n<p>Maybe if the devs showed a modicum of professionalism in their dealings with the users there wouldn't be this adversarial and combative exchange on the forums.&nbsp; But hey, they are just volunteers so we'll take what we can get I guess and not expect too much.</p>",
    "PostedDate": "2010-01-21T18:35:44.06-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "280351",
    "ThreadId": "78170",
    "Html": "<p>Yet another person that has to put 2 more cents in on a conversation that should already be over.</p>",
    "PostedDate": "2010-01-21T18:57:04.37-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "280371",
    "ThreadId": "78170",
    "Html": "<p>Yeah, uh... This isn't a job. We don't have to take shit from users. It does you no good to bitch at us. An occasional 'How's it going?' is fine. What some people are doing here is too far beyond that to be cool.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-01-21T21:09:01.557-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "280609",
    "ThreadId": "78170",
    "Html": "<p>I don't have a 'lock higher than lvl 15. &nbsp;But I get the Daily Digest and continue to hear a bunch of whiny ass titty babies crying because the 'lock developer won't drop everything and fix it up.</p>\r\n<p>Hell, Ar-Phazon(?) would be better off just playing the game and telling all you bitches to fuck off.</p>",
    "PostedDate": "2010-01-22T08:01:34.693-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "280664",
    "ThreadId": "78170",
    "Html": "<p>Alright, everyone needs to calm down.</p>\r\n<p>Warlocks are [for the most part] not demanding that the model be completely fixed.&nbsp; For many of us, it was unclear until recently that the old model was as screwed as it was; from our standpoint, the devs took a halfway-working model and replaced it was a half-done model.&nbsp; This is/was frustrating.&nbsp; From a car standpoint, would you prefer to have a car with a broken radiator or a car with a missing engine?</p>\r\n<p>Add to that, there was the appearance of a lack of communication from ArP.&nbsp; Not that there was an actual lack, just that he only tended to provide updates when people posted asking for them.&nbsp; I don't know about you guys, but if I did that on a project I worked on - for pay or not - the person I worked with would not be happy with me.&nbsp; Does it really take that much time to stop by the forums every day or two and say &quot;alright guys, I've been busy at work/home/etc, I didn't make progress&quot; or &quot;Hey, I'm about halfway through implementing the pets; I still need to do the felpup, and felguard, and I also need to do the Nibelung/Infernal/Doomguard non-demo pet modeling&quot;.&nbsp; That's all most of us are asking for.&nbsp; ArP's Thu post was almost perfect from that standpoint.</p>\r\n<p>When we get responses like Jothay's abrupt &quot;No&quot;, that doesn't actually tell the users anything except that he's being an ass.&nbsp; When it comes in response to a pretty much completely polite post by someone that doesn't necessarily know the background, it pisses users off.&nbsp; Jothay, a response like what Astrylian had immediately after would have been much better.&nbsp; Sure, it might have taken an extra 30 seconds to explain yourself, but it would probably have ended this discussion 7 posts or so ago.&nbsp; In the end, which option has taken up more time and caused more frustration?</p>\r\n<p>In response to Astrylian:&nbsp; True, it isn't a job.&nbsp; You are volunteering.&nbsp; On the other hand, you are volunteering on a very popular generally extremely high quality project of a type that could in the future get you recognition from people in the industry.&nbsp; Saying you don't need to take shit from users is very true; on the other hand, the very nature of this work is such that you can expect to hear sometimes very loud complaints sometimes.&nbsp; I understand you're getting frustrated and may need to vent sometimes, but saying you don't need to take shit from users is a very good way to get users more riled up, not less.</p>\r\n<p>Pennelope:&nbsp; No, we're frustrated and upset that the warlock dev has seemed to have been posting only when asked for status updates, and only sporadically at that.&nbsp; I think if we were kept reasonably updated [1-3 days between posts] instead of updated every week or so if we don't ask for updates, it would be better.&nbsp; Not everyone looks at the Issue tracker for updates; after all, which issue would they be under?&nbsp; Things get lost in there pretty easily.&nbsp; I now have his page http://www.codeplex.com/site/users/view/ArPharazon bookmarked so I can see all of his posts.</p>",
    "PostedDate": "2010-01-22T10:10:43.21-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "280707",
    "ThreadId": "78170",
    "Html": "<p>&quot;Until then - sit down, stfu, and quit yer bitching. Its getting done.&quot;&nbsp;&nbsp;&nbsp;&nbsp; Really?&nbsp; I mean Really?,&nbsp;&nbsp; Is this really necessary.&nbsp; I mean I may get on here occasionally and whine, big deal, but I don't talk to people like this and I think it definitely is extremely unprofessional to say the least.&nbsp; This will be my last post.&nbsp; I will never post anything in here again.&nbsp; I feel sorry for the dev's as well as the users.&nbsp; I have a friend that helps me crunch the numbers now so I'm not feeling so lost.&nbsp; Good luck to you all.&nbsp; I hope everything works out well for each and every one&nbsp;of you.</p>",
    "PostedDate": "2010-01-22T11:47:27.52-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]