[
  {
    "Id": "267632",
    "ThreadId": "78232",
    "Html": "<p>Was wondering if you can do that? Every top piece of gear has lots of hit on it, obviously because hit has the highest stat value.&nbsp; But after you're hit capped it would be nice to be able to change that value to 0 to only see pure dps scores.&nbsp; Is that possible?</p>",
    "PostedDate": "2009-12-15T09:39:43.28-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "267634",
    "ThreadId": "78232",
    "Html": "<p>You can edit items, Tools &gt; Edit Items. You cannot edit character stats, because characters do not have stats.</p>",
    "PostedDate": "2009-12-15T09:44:12.183-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "267638",
    "ThreadId": "78232",
    "Html": "<p>I don't think I was clear about what I was talking about. I'm not talking about character stats per say, I'm talking about, what scale value is assigned to each point of spell power, haste, crit, hit, or int by rawr in order to come up with the dps value for that item.&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-12-15T09:58:17.63-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "267651",
    "ThreadId": "78232",
    "Html": "<p>There is no scale value assigned to stats. &nbsp;Rawr does not use SEP or AEP or any other kind of stat weight. &nbsp;The value of an item, or of your character, is based on a mathematical model that takes in all of those numbers. &nbsp;If you're hit-capped and hit provides no further benefit to your character, then an item with 100hit and no other stats will have a score of 0.</p>",
    "PostedDate": "2009-12-15T10:45:43.363-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "267653",
    "ThreadId": "78232",
    "Html": "<p>Rawr does not use stat values to calculate dps increase from a piece of gear, exactly.&nbsp; I'm not the expert, but from my understanding it runs your total stats if you had that item equiped through a complex model to calculate total dps, and ranks gear relative to each other from that.&nbsp; So, if you're looking at a piece of gear that has lots of hit, but you're already hit capped without anything equiped in that slot (taking buffs, talents, and current gear&nbsp;into consideration), it will give you the exact same score as if it had 0 hit, since that stat is making no difference in your total dps.&nbsp; If only 1/2 of the hit from that item will contribute to your cap, it correctly scores based on that, too.</p>",
    "PostedDate": "2009-12-15T10:50:51.143-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "267662",
    "ThreadId": "78232",
    "Html": "<p>Are we talking about gear optimizer, or the list of items that show up in the main window on the right (titled Comparisons), or both?</p>",
    "PostedDate": "2009-12-15T11:08:40.387-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "267674",
    "ThreadId": "78232",
    "Html": "<p>Both.</p>",
    "PostedDate": "2009-12-15T11:38:45.673-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "267705",
    "ThreadId": "78232",
    "Html": "<p>Every score you see on a piece of gear in Rawr is based on a calculation of what your DPS would be with that item, based on the model's DPS/Tanking/Healing/whatever model.</p>\r\n<p><strong>Not</strong>, I repeat <strong>NOT</strong>, a &quot;this item has 25 hit, I value hit at 5, so it's total value is 125&quot;. All caps etc are being taken into account with these things like Ebs said.</p>",
    "PostedDate": "2009-12-15T13:16:33.03-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]