[
  {
    "Id": "267967",
    "ThreadId": "78323",
    "Html": "<p>Hey guys,</p>\r\n<p>I'm currently quite packed with work. And it seems that it won't change until after January since I have some really well paid tasks for that period.</p>\r\n<p>If someone is willing to add the 3.3 changes and/or multi target support to the Elemental module, then I am gonna write down my thoughts, plans and things I already discarded again for you.</p>",
    "PostedDate": "2009-12-16T03:44:49.067-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "268097",
    "ThreadId": "78323",
    "Html": "<p>At the moment I'm fairly busy with Tree. Once that is completed and the various people I involved in the project are also satisfied I could take a look at Elemental, especially since I wrote the original version.</p>",
    "PostedDate": "2009-12-16T09:16:34.397-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "275157",
    "ThreadId": "78323",
    "Html": "<p>I have made a few adjustments</p>\r\n<p>- modified special effects handling (internal effect only)</p>\r\n<p>- added statistics of average stats in combat</p>\r\n<p>- added custom chart Stats Graph (like in Mage/DPSWarr)</p>\r\n<p>- commented Elemental Mastery code out</p>\r\n<p>&nbsp;</p>\r\n<p>I advise the following:</p>\r\n<p>- change rotations code so the discontinuity disappears</p>\r\n<p>- come up with a way to deal with haste procs (similar problems in modules like Tree)</p>",
    "PostedDate": "2010-01-09T08:19:42.89-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "277294",
    "ThreadId": "78323",
    "Html": "<p>Hi, thanks for taking over for a while and the improvements made. I still don't have much time to develop.</p>\r\n<p>As for your suggestions:</p>\r\n<p style=\"padding-left:30px\">- change rotations code so the discontinuity disappears</p>\r\n<p>This should be possible by introducing fractional spells.</p>\r\n<p style=\"padding-left:30px\">- come up with a way to deal with haste procs (similar problems in modules like Tree)</p>\r\n<p>Do you have any suggestions here? What I planned to do was to calculate a second rotation under the influence of Elemental Mastery and sum the two based on a weight scale.</p>",
    "PostedDate": "2010-01-14T12:45:31.777-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "277297",
    "ThreadId": "78323",
    "Html": "<p>Regarding my plans:</p>\r\n<p>I wanted to add multi target support and variable rotations in the long goal. However I still need to think of a viable way to automatically create a rotation solely based on the best damage per cast time, dot duration and cooldown of spells. However I didn't do the necessary maths for it, yet.</p>",
    "PostedDate": "2010-01-14T12:48:36.207-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]