[
  {
    "Id": "268326",
    "ThreadId": "78407",
    "Html": "<p>Just wondering if the proc for the Nibelung staff is accounted for (for mages at least!) in the latest rawr version? Thanks!</p>",
    "PostedDate": "2009-12-16T21:44:18.017-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "268339",
    "ThreadId": "78407",
    "Html": "<p>It is not.</p>",
    "PostedDate": "2009-12-16T22:25:37.257-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "268644",
    "ThreadId": "78407",
    "Html": "<p>Thanks.</p>\r\n<p>I don't suppose anyone has any 'quick napkin math' on how much of a difference the proc might make?</p>",
    "PostedDate": "2009-12-17T13:50:19.977-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "268874",
    "ThreadId": "78407",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\">This staff is for DoT casters, apparently. I can only speak for mages though. Valkyr procs off the living bomb dot and MAY proc off all spell dots from locks and priests. It does not proc off pyroblast or fireball's dot or any other dots that are an after-effect of a spell. Arcane is horrible with this staff because it does not proc off each arcane missile, only at the onset of the channel. It procs off each target hit by AoE, such as blizzard, arcane explosion, and living bomb. It does not proc off waterbolt or mirror image spells.<br><br>This staff is proving very beneficial for frost. First, Val'kyr obey the commands for your water elemental. This has huge implications for pvp and pve alike. Also, for a reason unknown (and it might very well be unintentional, though I'd like to think it isn't), improved blizzard strikes (and specced into fingers of frost) are triggering this staff at a rate greater than 2%. That's more than double the intentional rate. My numbers vary from 2.2% and up, depending on how many mobs are being struck. With 600+ haste and blizzarding just 4 targets, Val'kyr pop out about every 6 seconds and will account for more than 12% of your damage! Clearing ICC trash will spawn 10+ Val'kyr at a time... Clearing 5-man heroic trash consistently spawns 3-6 Val'kyr! I've been unable to cast enough frostbolts to see if it's occuring here as well, but it appears it might be.<br><br>That being said, here are the raw numbers...\r\n<ul>\r\n<li>\r\n<div>1% proc rate with no internal CD.<br><br></div>\r\n</li>\r\n<li>\r\n<div>Spawns with 12,600 health and no mana bar.<br><br></div>\r\n</li>\r\n<li>\r\n<div>Visually, it's an exact mini-replica of the white Val'kyr of the Twin Val'kyr encounter in ToC. Blizzard could have added an additional rarity to each staff by having half spawn only white and half spawn only black Val'kyr. Oh well...<br><br></div>\r\n</li>\r\n<li>\r\n<div>Casts smite (holy damage) an average of 16.6 casts per summon or an instant cast every 1.81 seconds. The actual GCD of the val'kyr is probably 1.35 seconds and 0.45-0.5 additional seconds are added from server delay/lag. (It's the same affect that raises a water elemental's cast time from 2.5 up to 2.95-3.0 seconds.)<br><br></div>\r\n</li>\r\n<li>\r\n<div>min / max damage is 1061 / 1189, crit multiplier is 1.5<br><br></div>\r\n</li>\r\n<li>\r\n<div>crit chance is 5% vs lvl 80, ~2.6% vs lvl 83<br><br></div>\r\n</li>\r\n<li>\r\n<div>miss chance is 4% vs lvl 80, 17% vs lvl 83<br><br></div>\r\n</li>\r\n<li>\r\n<div>Does not scale with your stats.<br><br></div>\r\n</li>\r\n<li>\r\n<div>Benefits from curse of elements, but not arcane empowerment, ferocious inspiration, or sanctified retribution.<br><br></div>\r\n</li>\r\n<li>\r\n<div>Benefits from imp. scorch, imp. shadowbolt, and winter's chill. Because of this, I would assume it benefits from misery as well.<br><br></div>\r\n</li>\r\n<li>\r\n<div>I've yet to test with haste buffs, but I'd assume it receives them just like a water elemental does.<br><br></div>\r\n</li>\r\n<li>\r\n<div>The Val'kyr targets the mob that caused the proc (not based on your aggro).<br><br></div>\r\n</li>\r\n<li>\r\n<div>To get the most from the Val'kyr, be sure to stand 10-30 yards from target. If you're closer than 10 yards, the val'kyr will fly around a bit before getting into minimum range. (Once the minimum range is acquired, the val'kyr will usually never readjust if the target moves closer than 10 yards, tho I've seen it do this on occasion.) If 10-30 yards, the val'kyr will cast the first smite immediately upon summon. Further than 30 yards, the val'kyr will fly forward until in range. Any movement needed will eat away at the 30 seconds it's summoned.</div>\r\n</li>\r\n</ul>\r\n</blockquote>\r\n<p>...From a comment on WoWHead, which seems to have roughly accurateish data.</p>",
    "PostedDate": "2009-12-18T04:18:19.617-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]