[
  {
    "Id": "268425",
    "ThreadId": "78424",
    "Html": "<p>I note that profession buffs no longer appear in the buff list but are still being applied. Is there some reason a change was made to hide them in this fashion? I'd have thought that it would be better treating them similar to set bonuses, ie: they are visible but not directly changeable by the user through the buffs panel and only changeable by the profession drop downs.</p>",
    "PostedDate": "2009-12-17T02:47:04.317-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "268538",
    "ThreadId": "78424",
    "Html": "<p>I think I'm the source of that change. I was working on hiding said profession buffs and filed a patch. After working on it a bit, I discovered the problems you mentioned that didn't show up in my initial testing. I added several comments to the work item, but since I couldn't un-post the patch, it was committed anyway. Sorry! I test my patches much more thoroughly now. ^^</p>\r\n<p>Details in work item #15152 ( http://rawr.codeplex.com/WorkItem/View.aspx?WorkItemId=15152 )</p>",
    "PostedDate": "2009-12-17T09:04:41.497-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "268576",
    "ThreadId": "78424",
    "Html": "<p>That's a good point. ZD, since you posted those patches for us, do you think you are up to making another one that unhides them but makes them unselectable?</p>",
    "PostedDate": "2009-12-17T11:04:43.04-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "268594",
    "ThreadId": "78424",
    "Html": "<p>I'll work on it, but I'm not very familiar with the buffs system yet. I'll see what I can do.</p>\r\n<p>Anyone know why the buffs list gets generated so many times on character load? It looks like it starts out with the entire buff list and removes entries it doesn't think are relevant for future rebuilds. Somewhere in the character load process it removes the profession buffs because the character it is using to doesn't have profession data loaded yet. Changing professions manually seems to force it to re-generate from scratch. Maybe character profession data should be loaded earlier or a full buff rebuild event should be triggered when the profession data is loaded?</p>\r\n<p>I'm not entirely sure how to force disable buffs. I think I'll just do whatever the thing that enables Mining/Skinning does in reverse in the buff culling code.</p>",
    "PostedDate": "2009-12-17T11:47:58.283-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]