[
  {
    "Id": "268979",
    "ThreadId": "78570",
    "Html": "<p>I tried searching for this in the discussions but did not find anything so forgive me if I'm bringing up an old/already discussed subject.&nbsp; This, however, is something that really baffles me.&nbsp; Is it intended to not have any limit on the number of talent points you can assign to a build within RAWR?&nbsp; As an example, using the mage model, RAWR seems perfectly happy to let me use an 81/22/60 talent build.&nbsp; Unless there is some magic way I don't know about to level past 150, this just isn't possible.&nbsp; Considering how awesome this tool is in about every other respect, I find it really odd something like this has been overlooked.&nbsp; Is this intentional or am I just overlooking a setting or a check box somewhere or something?</p>",
    "PostedDate": "2009-12-18T09:05:48.49-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "269002",
    "ThreadId": "78570",
    "Html": "<p>This is definitely intentional.</p>",
    "PostedDate": "2009-12-18T09:59:39.987-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "269003",
    "ThreadId": "78570",
    "Html": "<p>Out of curiosity might I ask why?</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-12-18T10:01:51.79-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "269009",
    "ThreadId": "78570",
    "Html": "<p>Usability, here's 2 examples:</p>\r\n<p>If you are trying to spec out a Frost build and your points are currently in Arcane, we didn't want you to have to dump the other points just to get the frost ones in.</p>\r\n<p>Arms Warriors can have multiple variants of the same spec, Mace/Axe/Sword, being able to select all 3 at once in your talent tree makes it easier to compare a 2h Axe vs a 2h Mace.</p>",
    "PostedDate": "2009-12-18T10:14:51.76-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "269017",
    "ThreadId": "78570",
    "Html": "<p>Hrmm....okay.&nbsp; I guess I just don't see the logic in that.&nbsp; If you don't &quot;dump the other points&quot; anyway, you aren't going to be modeling your character correctly because you will have (or at least have the opportunity to) have more talent points selected in the tool than what you could possibly have selected in the game, and that would seem to defeat the whole purpose of the tool in the first place.&nbsp; The arcane points would need to be removed anyways if you wanted to get an accurate representation of what your character might look like in the game.&nbsp; Why you would purposefully want to have the ability to model a spec that has 75, 76 or however many points above the currently available 71 at max level is foreign to me.&nbsp; I suppose it's not difficult to self-check the math yourself to make sure you actually have 71 talent points allocated, it just seems to me that opens the gates up to potential modeling errors if someone isn't paying overly close attention.</p>",
    "PostedDate": "2009-12-18T10:30:27.72-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "269022",
    "ThreadId": "78570",
    "Html": "<p>Is user error Rawrs fault? I guess I just don't see the logic in that.</p>",
    "PostedDate": "2009-12-18T10:44:35.39-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "269025",
    "ThreadId": "78570",
    "Html": "<p>One could possibly argue that it indeed is when the potential error is a result of the tool not enforcing a hard limit set on what it's designed to model.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-12-18T10:48:50.59-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "269028",
    "ThreadId": "78570",
    "Html": "<p>Don't be silly, guys. Really. You intentionally can place more than 71 points, for convenience, and testing. If a user wants to actually plan their gear with 150 talent points, we don't care, they can.</p>",
    "PostedDate": "2009-12-18T10:56:09.12-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "269032",
    "ThreadId": "78570",
    "Html": "<p>I don't think I am being silly.&nbsp; I came here as a long time supporter/user of this tool but as a first time poster because I had a question about something that had plagued me for a long time.&nbsp; I get met with some fairly unhelpful replies and snippy attitudes and the bottom line answer is &quot;we don't care&quot;?&nbsp; Wow....I'd think you guys would greatly care that your tool would be as accurate as possible.&nbsp; I mean, going by this logic....I want to place a single point in the first tier of a talent tree and then skip all the way down to the bottom of that tree and select the &quot;51 point talent&quot; for convenience and testing sake.&nbsp; Why can't I do this??&nbsp; You enforce the minimum expenditure requirements for the individual tiers within each tree....but don't enforce the overall 71 point limit because it's more user friendly that way?&nbsp; No matter how you want to spin that....it just doesn't make sense to me.</p>",
    "PostedDate": "2009-12-18T11:05:26.337-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "269039",
    "ThreadId": "78570",
    "Html": "<p>A bit more detail on one of the situations that Jothay brought up above:</p>\r\n<p>The best example I can think of right now is in the Warrior Arms tree there are three different weapon specilization talents (Mace, Sword, and Poleaxe). In practice you should NEVER spec into more then one of these since you only have one weapon as an arms warrior. However, iIf you don't select all three in Rawr then you could miss a potential upgrade (for instance a polearm if you are currently sword specced). Yes, it may mean that once you get that item you need to re-spec in game to get the correct specilization talent, but whenever I use Rawr on my Arms Warrior I ensure that I am fully speced into all of the weapon specilizations.</p>\r\n<p>It can also be useful for theorycrafting about potential lvl 85 builds. Yes, blizz will be changing but not extending the talent trees before cat, but it can still be interesting to see what you can do with 5 more points.</p>\r\n<p>~Droid</p>",
    "PostedDate": "2009-12-18T11:36:34.273-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "269044",
    "ThreadId": "78570",
    "Html": "<p>Txice, this is what I'm talking about. It wasn't a silly initial question, the fact that we're still having this conversion is what's silly. There's no snippy attitudes, or lack of caring about you or your question.&nbsp;</p>",
    "PostedDate": "2009-12-18T11:49:28.287-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "269045",
    "ThreadId": "78570",
    "Html": "<p>To txice: remember that we are not customers.&nbsp; We are not doing the Rawr devs a favor by using their tool; they are doing us a favor by making it available.&nbsp; So if they don't cater to your questions&nbsp;the way you wanted&nbsp;then it's fair to be disappointed, but not angry or offended.&nbsp; (Sorry if I misinterpret your reaction, hard to tell with just text.)</p>\r\n<p>But more to the original topic of the thread: because of what Jothay/droidicus said I totally agree with the ability to spend more than 71 talent points.&nbsp; It might be nice to have some warning text appear somewhere when you do that, to ensure it's not by accident, but personally I'm not going to formally request such a feature, because again I'm not a paying customer and it's easy enough for me to add the&nbsp; 2 or 3 numbers in my head.</p>",
    "PostedDate": "2009-12-18T11:50:31.057-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "269048",
    "ThreadId": "78570",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>droidicus wrote:</strong><br>\r\n<p>However, iIf you don't select all three in Rawr then you could miss a potential upgrade (for instance a polearm if you are currently sword specced).</p>\r\n</blockquote>\r\n<p>This sounds even more confusing to me and actually not a behavior I'm seeing.&nbsp; You're suggesting that if your talent spec as a DPS warrior includes only one of the three specializations that the optimizer in the tool is going to automatically ignore any other type of weapon outside of what you are specialized in based on nothing more than the talents?&nbsp; If so I must say that this is contrary to what my tests with the tool show.&nbsp; With only &quot;poleaxe specialization&quot; selected I am presented with a list of weapons that also include swords and maces and marking several as available to the optimizer it actually picked a sword.</p>",
    "PostedDate": "2009-12-18T11:51:46.96-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "269050",
    "ThreadId": "78570",
    "Html": "<p>I think we have an optimizer warning in place for having too many/not enough talent points.</p>\r\n<p>Kavan, if we don't can you look at adding one? I know you have the check on Talent Spec comparison that it has to be a 71 pt build to be considered for comparison.</p>",
    "PostedDate": "2009-12-18T11:53:14.163-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "269051",
    "ThreadId": "78570",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>txice wrote:</strong><br>\r\n<p>With only &quot;poleaxe specialization&quot; selected I am presented with a list of weapons that also include swords and maces and marking several as available to the optimizer it actually picked a sword.</p>\r\n</blockquote>\r\n<p>Yes, you still see mace items in the list if you are Axe spec, but you arent seeing the benefit of Mace Spec (15% armor penetration with a mace equipped) when comparing an Axe to a Mace. THATs where the big difference comes from.</p>",
    "PostedDate": "2009-12-18T11:55:21.853-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "269054",
    "ThreadId": "78570",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>Jothay wrote:</strong><br>\r\n<p>I think we have an optimizer warning in place for having too many/not enough talent points.</p>\r\n<p>Kavan, if we don't can you look at adding one? I know you have the check on Talent Spec comparison that it has to be a 71 pt build to be considered for comparison.</p>\r\n</blockquote>\r\n<p>I get a warming that I've perhaps not selected any head items or neck items, or that I have no enchants selected, but nothing telling me I've gone past 71 talent points.&nbsp; If I have ample items and enchants selected the optimizer trucks right along warning free with more than 71 talent points selected.</p>",
    "PostedDate": "2009-12-18T12:03:17.093-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "269058",
    "ThreadId": "78570",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>Astrylian wrote:</strong><br>\r\n<p>Txice, this is what I'm talking about. It wasn't a silly initial question, the fact that we're still having this conversion is what's silly. There's no snippy attitudes, or lack of caring about you or your question.&nbsp;</p>\r\n</blockquote>\r\n<p>I don't think it's silly and your making statements like this reinforces my position.</p>",
    "PostedDate": "2009-12-18T12:11:13.75-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "269059",
    "ThreadId": "78570",
    "Html": "<p>Correct, there is no warning when you have &gt;71 talent points. That's a totally reasonable request, and one we've heard occasionally before; it's just so low priority, it never gets done.</p>",
    "PostedDate": "2009-12-18T12:11:15.263-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "269061",
    "ThreadId": "78570",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>Jothay wrote:</strong><br>\r\n<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>txice wrote:</strong><br>\r\n<p>With only &quot;poleaxe specialization&quot; selected I am presented with a list of weapons that also include swords and maces and marking several as available to the optimizer it actually picked a sword.</p>\r\n</blockquote>\r\n<p>Yes, you still see mace items in the list if you are Axe spec, but you arent seeing the benefit of Mace Spec (15% armor penetration with a mace equipped) when comparing an Axe to a Mace. THATs where the big difference comes from.</p>\r\n</blockquote>\r\n<p>Conceded and point duely noted....but this isn't an issue across all classes and specs.&nbsp; Though I can certainly understand that it might be an &quot;easier&quot; fix for this isolated case to allow more than 71 talent points to be selected, it would seem more appropriate in my mind to address this issue within the model itself.&nbsp; By allowing an easy workaround to one issue you've potentially opened the door to many others.</p>",
    "PostedDate": "2009-12-18T12:14:26.61-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "269062",
    "ThreadId": "78570",
    "Html": "<p>We've gotten more points like the OP of this thread than people actually saying equipping more than 71 pts caused them a problem.</p>",
    "PostedDate": "2009-12-18T12:19:06.447-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "269064",
    "ThreadId": "78570",
    "Html": "<p>I'll see about implementing some kind of warning about exceeding the real-world talent point limit when I work on the code next. I was thinking about putting a &quot;!&quot; or something in the build name thing before or after the (xx/xx/xx) thing, or perhaps turning the background of the build selector light red. How does that sound?</p>\r\n<p>Is there a variable somewhere I can read to get the maximum number of talent points or character level? I'd rather not hard-code it to 71. :)</p>",
    "PostedDate": "2009-12-18T12:24:26.083-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "269067",
    "ThreadId": "78570",
    "Html": "<p>I think that kind of visual right in the same window you're assigning the talent points is absolutely the best way to go, assuming a new user will understand what it means.&nbsp; Maybe some text like &quot;over limit&quot; instead of just a &quot;!&quot;?&nbsp; I know on my screen there's lots of real estate available.</p>",
    "PostedDate": "2009-12-18T12:35:32.54-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "269080",
    "ThreadId": "78570",
    "Html": "<p>There is use for this in terms of testing and experimentation.&nbsp; A point for not capping the entry of more than 71 points into the talent trees.</p>\r\n<p>There is use for this in terms of usability (ease of moving points around).&nbsp; A slight point for.</p>\r\n<p>There is use for this in terms of ease of comparison between items (Rogue weapon specs, Warrior weapon specs, etc.), and getting an accurate back-to-back comparison of items that would fall under different weapon classifications.&nbsp; A major point for.&nbsp; (As a DPS Warrior myself, it is immensely beneficial to see the comparison of different weapons when compared directly, instead of forcing the Optimizer to do my dirty work for me.&nbsp; This provides data that I would not be privy to were the talent points rigidly restricted to 71 within the program.)</p>\r\n<p>There is the possibility that people may put too many points into their spec without realizing that they've spent too many points.&nbsp; A point against.&nbsp; However, there are other solutions that allow for the pros listed above to still be available, while dealing with this potential issue.</p>\r\n<p>&nbsp;</p>\r\n<p>I completely agree with what Astrylian said about our attitudes in terms of response in this matter.&nbsp; This is not &quot;we don't care&quot;, this is &quot;we've discussed this topic before, and have made a conscious design decision to allow the entry of more than the available talent points into the trees, due to the sizeable benefits that come with such flexibility&quot;.&nbsp; There are earlier discussions on this topic, which you can search for an read to see what was said on the matter in the past.</p>\r\n<p>[Edit] Looking back over this thread, I see you've attempted to drudge up some of the older topics, without much success.&nbsp; I'll see if I can find some of the more prominent earlier discussions for you to look over.</p>\r\n<p>&nbsp;</p>\r\n<p>Now, concerning the stated concern of people unintentionally placing too many (or,to throw it into this matter at the same time, too few) talents, there are a few solutions that I propose.</p>\r\n<p>One: a check upon running the Optimizer that evaluates your talent point usage.&nbsp; If you are right on 71, nothing happens.&nbsp; However, if you are below or above the 71 point mark, a warning pops up, declaring if you're over or under the talent budget, and by how much in either direction.</p>\r\n<p>Two: a dynamic evaluation of your talent expenditure on the Talents pane itself.&nbsp; Either/both color coding (yellow for under, green for on target, red for above), on the talent dropdown box, the background, or possibly some dedicated program real estate, and/or a numerical representation (&quot;81/71 talent points spent&quot;, or whatever).</p>\r\n<p>The benefit is that these provide a clear indicator of how a character is set up, while still providing the flexibility to &quot;break&quot; the in-game limitations, for the reasons stated above.</p>",
    "PostedDate": "2009-12-18T13:19:23.75-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "269113",
    "ThreadId": "78570",
    "Html": "<p>I strongly support being able to overspend talent points, in particular for the rogue &amp; warrior weapon choices.</p>\r\n<p>On the other hand, it would be nice to get a &quot;81/71&quot;&nbsp; on the pane as I must confess it is a pain to have to add up the number of talents on each pane to see how many you have left.&nbsp;&nbsp; 51/20 is easy, but when you are playing around with a spread of talents across 3 panes, it would be nice to not have to think so hard :)</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-12-18T15:03:59.187-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "269114",
    "ThreadId": "78570",
    "Html": "<p>We'll just have to agree to disagree on the reasoning behind this.&nbsp; More than 71 talent points is currently assignable in the tool and it is what it is.&nbsp; I attempted to understand why this was so...I do not agree with any of the logic presented here as to why it is so...and we can leave it at that.</p>\r\n<p>In my mind there is simply no value what so ever to model, test, experiment or what ever else you might want to do with this tool against a configuration that is impossible to actually reproduce in game.&nbsp; To the DPS warrior situation specifically...you find this immensely beneficial...I see it as nothing more than a lazy workaround.&nbsp; If you want to see how a particular weapon stacks up depending on a particular specialization, move 5 talent points and compare.&nbsp; Again...points we'll obviously have to agree to disagree on but I'm glad you find this useful.</p>\r\n<p>You say I've attempted to &quot;drudge up some older topics, without much success&quot;, and quite frankly, I don't know what you are referring to.&nbsp; If you mean my original question about being able to assign more than 71 talent points, as I said, I searched the discussions using what I believed to be pertinent key words and found nothing relating to said topic, so I posted my question.&nbsp; If this topic is out there it's buried in some other discussion topic that isn't an obvious relation to this specific issue/point of discussion.&nbsp; On that note, I apologize I didn't take the time to read every single post of every single discussion here. Regarding anything else, I've not attempted to &quot;drudge up&quot; anything knowingly...I've simply responded to other posts with my opinions, thoughts and/or questions.</p>\r\n<p>It was clearly a mistake to come here.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-12-18T15:04:45.563-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "269115",
    "ThreadId": "78570",
    "Html": "<p>Wow. Uhh... What are you <em>talking</em>&nbsp;about, Txice?</p>\r\n<p>Like, I don't even understand where you're coming from, why you're responding this way, or what your problem is. Where are all these horrible rude responses that you're&nbsp;perceiving&nbsp;are being thrown at you? I don't even know what to say; there's nothing wrong, nobody's attacking you, and it certainly isn't a mistake to come here. People are being nothing but helpful to you. BrWarner says that it looks like you searched for old discussions and couldn't find anything, and that he'd try to find them for you... And you respond with this? Like... Does not compute.</p>\r\n<p>&nbsp;</p>\r\n<p>I strongly suggest that you re-read everything that's been said here, and find where you went wrong; somewhere along the line, you seem to have gotten the impression that people are against you, attacking you, being rude to you, or all manner of other nonsense, when nothing of the sort has happened.</p>",
    "PostedDate": "2009-12-18T15:09:13.98-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "269116",
    "ThreadId": "78570",
    "Html": "<p>Summary of the <em>actual</em>&nbsp;content of the thread, to make it easy:</p>\r\n<p>&nbsp;</p>\r\n<p>Q: You can have more than 71 talent points in Rawr.</p>\r\n<p>A: That's the intended design, to support a few weapon-specific specs, and also for convenience for all users.</p>\r\n<p>Q: But users may mistakenly use &gt;71 points and not realize it!</p>\r\n<p>A: We realize this, and intend to add a warning of some sort (when you're &gt;71pt), at some point, but it's low priority, and worth the tradeoff in the meantime.&nbsp;</p>",
    "PostedDate": "2009-12-18T15:17:03.81-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "269122",
    "ThreadId": "78570",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>Astrylian wrote:</strong><br>\r\n<p>Wow. Uhh... What are you <em>talking</em>&nbsp;about, Txice?</p>\r\n<p>Like, I don't even understand where you're coming from, why you're responding this way, or what your problem is. Where are all these horrible rude responses that you're&nbsp;perceiving&nbsp;are being thrown at you? I don't even know what to say; there's nothing wrong, nobody's attacking you, and it certainly isn't a mistake to come here. People are being nothing but helpful to you. BrWarner says that it looks like you searched for old discussions and couldn't find anything, and that he'd try to find them for you... And you respond with this? Like... Does not compute.</p>\r\n<p>&nbsp;</p>\r\n<p>I strongly suggest that you re-read everything that's been said here, and find where you went wrong; somewhere along the line, you seem to have gotten the impression that people are against you, attacking you, being rude to you, or all manner of other nonsense, when nothing of the sort has happened.</p>\r\n</blockquote>\r\n<p>Your perception of anything I've written as being &quot;horrible rude responses&quot; isn't any different than my perception of your responses being the same.&nbsp; From my chair, the insolence set in with TNSe's response and continued through to you telling me I was being silly for carrying on the conversation when all I was trying to do was understand something.&nbsp; This is not being &quot;nothing but helpful&quot; in my mind and I don't feel my tone has been one of being horribly rude nor do I feel anything I've responded with has been unjustified.</p>\r\n<p>I may have taken BrWarner's response to mean something different than you did and, well, I guess that's part of the problem with trying to communicate over the internet.&nbsp; Interpretations of what is meant will be different to different people.</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-12-18T15:49:28.82-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "269130",
    "ThreadId": "78570",
    "Html": "<p>I added the functionality I described earlier in Patch 4686.</p>\r\n<p>It colors the talent selector and even tells you how many points you are under/over the max.</p>\r\n<p>Now everyone can be happy. Yay! ^^</p>",
    "PostedDate": "2009-12-18T16:39:31.09-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "269134",
    "ThreadId": "78570",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>txice wrote:</strong><br>\r\n<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>Astrylian wrote:</strong><br>\r\n<p>Wow. Uhh... What are you <em>talking</em>&nbsp;about, Txice?</p>\r\n<p>Like, I don't even understand where you're coming from, why you're responding this way, or what your problem is. Where are all these horrible rude responses that you're&nbsp;perceiving&nbsp;are being thrown at you? I don't even know what to say; there's nothing wrong, nobody's attacking you, and it certainly isn't a mistake to come here. People are being nothing but helpful to you. BrWarner says that it looks like you searched for old discussions and couldn't find anything, and that he'd try to find them for you... And you respond with this? Like... Does not compute.</p>\r\n<p>&nbsp;</p>\r\n<p>I strongly suggest that you re-read everything that's been said here, and find where you went wrong; somewhere along the line, you seem to have gotten the impression that people are against you, attacking you, being rude to you, or all manner of other nonsense, when nothing of the sort has happened.</p>\r\n</blockquote>\r\n<p>Your perception of anything I've written as being &quot;horrible rude responses&quot; isn't any different than my perception of your responses being the same.&nbsp; From my chair, the insolence set in with TNSe's response and continued through to you telling me I was being silly for carrying on the conversation when all I was trying to do was understand something.&nbsp; This is not being &quot;nothing but helpful&quot; in my mind and I don't feel my tone has been one of being horribly rude nor do I feel anything I've responded with has been unjustified.</p>\r\n<p>I may have taken BrWarner's response to mean something different than you did and, well, I guess that's part of the problem with trying to communicate over the internet.&nbsp; Interpretations of what is meant will be different to different people.</p>\r\n</blockquote>\r\n<p>Dude... Really, seriously, truly, re-read what you think you've read. Example: I didn't say you had made any &quot;horrible rude responses&quot;. At all. There's nothing going on here that's getting misconstrued due to it being text. It's all plain and clear. We're all trying to help you out here, and you've even inspired ZD to implement the warning.</p>",
    "PostedDate": "2009-12-18T16:48:43.663-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "269136",
    "ThreadId": "78570",
    "Html": "<p>Patch Applied, though ZD, it only colors the backdrop when it's open, when it's closed you can't see the color (but the text works)</p>",
    "PostedDate": "2009-12-18T17:00:20.413-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "269137",
    "ThreadId": "78570",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>Astrylian wrote:</strong><br>\r\n<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>txice wrote:</strong><br>\r\n<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>Astrylian wrote:</strong><br>\r\n<p>Wow. Uhh... What are you <em>talking</em>&nbsp;about, Txice?</p>\r\n<p>Like, I don't even understand where you're coming from, why you're responding this way, or what your problem is. Where are <strong>all these horrible rude responses</strong> that you're&nbsp;perceiving&nbsp;are being thrown at you? I don't even know what to say; there's nothing wrong, nobody's attacking you, and it certainly isn't a mistake to come here. People are being nothing but helpful to you. BrWarner says that it looks like you searched for old discussions and couldn't find anything, and that he'd try to find them for you... And you respond with this? Like... Does not compute.</p>\r\n<p>&nbsp;</p>\r\n<p>I strongly suggest that you re-read everything that's been said here, and find where you went wrong; somewhere along the line, you seem to have gotten the impression that people are against you, attacking you, being rude to you, or all manner of other nonsense, when nothing of the sort has happened.</p>\r\n</blockquote>\r\n<p>Your perception of anything I've written as being &quot;horrible rude responses&quot; isn't any different than my perception of your responses being the same.&nbsp; From my chair, the insolence set in with TNSe's response and continued through to you telling me I was being silly for carrying on the conversation when all I was trying to do was understand something.&nbsp; This is not being &quot;nothing but helpful&quot; in my mind and I don't feel my tone has been one of being horribly rude nor do I feel anything I've responded with has been unjustified.</p>\r\n<p>I may have taken BrWarner's response to mean something different than you did and, well, I guess that's part of the problem with trying to communicate over the internet.&nbsp; Interpretations of what is meant will be different to different people.</p>\r\n</blockquote>\r\n<p>Dude... Really, seriously, truly, re-read what you think you've read. Example: <strong>I didn't say you had made any &quot;horrible rude responses&quot;.</strong> At all. There's nothing going on here that's getting misconstrued due to it being text. It's all plain and clear. We're all trying to help you out here, and you've even inspired ZD to implement the warning.</p>\r\n</blockquote>\r\n<p>LOL...and I am the one that needs to re-read??&nbsp; Look back at the quotes above and focus in on the bold text.&nbsp; Yeah...all pretty clear eh?</p>",
    "PostedDate": "2009-12-18T17:09:05.64-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "269141",
    "ThreadId": "78570",
    "Html": "<p>...sigh.</p>\r\n<p>Really? <em>Really? <strong>Really? </strong><span style=\"font-style:normal\">We have to teach you English now?</span></em></p>\r\n<p><em><span style=\"font-style:normal\"><br></span></em></p>\r\n<p>I said, &quot;Where are&nbsp;all these horrible rude responses&nbsp;that you're&nbsp;perceiving&nbsp;are being thrown at you?&quot;</p>\r\n<p>That's <strong>me</strong>, asking <strong>you</strong>, where the <em>horrible rude responses</em>&nbsp;are, that <strong>you</strong>&nbsp;think are being posted <strong>at you</strong>. That's <strong>not</strong>&nbsp;me saying you've made any <em>horrible rude responses</em>.</p>\r\n<p>&nbsp;</p>\r\n<p>There have been many times where users have accused us devs of being rude to them, and they've been right, to varying degrees. This, however, isn't one of them.</p>",
    "PostedDate": "2009-12-18T17:20:53.903-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "269144",
    "ThreadId": "78570",
    "Html": "<p>Yep...apparently you do on that one.&nbsp; I'll man up and admit I truly miss-read that part and made an ass of myself trying to point it out to boot. To try and save perhaps a tiny bit of face on this one though, prior to your original comment I never stated any response to me had been horribly rude either...those were your words.</p>\r\n<p>I will, however, stand by the rest.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-12-18T17:34:39.227-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "269152",
    "ThreadId": "78570",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>Jothay wrote:</strong><br>\r\n<p>Patch Applied, though ZD, it only colors the backdrop when it's open, when it's closed you can't see the color (but the text works)</p>\r\n</blockquote>\r\n<p>Huh, the bar is colored for me, but I'm using Mono. That's why I usually stay away from UI changes. :)</p>\r\n<p>I may have just put the coloring code in the wrong place, or altered the wrong property. I'm still learning these things.</p>",
    "PostedDate": "2009-12-18T17:58:05.81-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "269156",
    "ThreadId": "78570",
    "Html": "<p>Nah, the property is right, but in Windows the Styles Theme setup overrides it.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-12-18T18:09:00.533-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "269170",
    "ThreadId": "78570",
    "Html": "<p>Ignoring the last 10 posts or so, I'd like to make a point on the design and the direction of this very active project.</p>\r\n<p>The developers and project staff are creating a tool for the community.&nbsp; With any project, there must be a design vision, a collective understanding of what the tool's purpose and functionality will be, and how it will accomplish that goal.&nbsp; In the case of Rawr, the goal is to create a powerful, flexible, yet accessible interface for modeling and evaluating character performance within WoW, and through such analysis, push each character's setup to maximize its potential.&nbsp; There must be a holistic design in mind when creating such a comprehensive tool as Rawr, and to accomplish that, decisions and compromises must be made.</p>\r\n<p>Now, obviously there is always the chance that something may be unclear about its operation, either due to lack of textual explanation, an ambiguous visual indicator, or possibly just an unintuitive, unfocused design: a flaw in communication to the end user.&nbsp; In such cases, there are a few approaches to take to remedy such a flaw: Better documentation (from within and outside of the tool itself), better visual cues, or a more logical workflow would be some possible solutions.</p>\r\n<p>In the case of weapon specs, let me describe the alternate workflow you recommend, which is &quot;place the talents in one spec, and then replace them with another, making before and after comparisons&quot; (paraphrased, of course).&nbsp; I place 5 talent points in Poleaxe specialization, to determine the value of my current axe, and some potential, direct upgrades, through a few different gemming and gearing options.&nbsp; I write down my findings, for reference' sake.&nbsp; I then take 5 points out of that weapon spec (by first removing all of my points from Cruelty over in the Fury tree, so I can place points in Sword spec over in Arms, and then remove the 5 points from Axe spec, and then finally replace those 5 points in Cruelty.&nbsp; I then tweak the gemmings, some other talents, maybe a piece of gear to evaluate how Haste affects the Sword spec proc.&nbsp; I write down my findings, and repeat the arduous weapon-spec switching process to try out Mace spec.&nbsp; Now, seeing as how I'm ArP capped as Arms, and Mace spec provids ArP, I get to heavily adjust my gear and gemmings.&nbsp; I also notice that the best Mace has a truckload of Expertise on it, which I then tweak my other gear to evaluate and accommodate within my setup.&nbsp; I then write down my findings.&nbsp; I then compare those notes from three totally separate specs, and then get limited, if any, evaluative data from my experimentation.&nbsp; Time taken: ~20-30 minutes.&nbsp; Tool value received: moderate.&nbsp; Also requires notetaking for storing information between weapon specs.&nbsp; Overall, not a very satisfying experience.</p>\r\n<p>Here's the workflow I get with the current implementation:&nbsp; I activate Poleaxe, Sword, and Mace specs all together.&nbsp; I make broad weapon comparisons, across the wide span of weapon specialization effects (which affect both dynamic procs and cappable stats) all together, tweak my gear to watch all of their values adjust together, with a direct, side-by-side comparison.&nbsp; Change gear.&nbsp; Change trinkets.&nbsp; Change ArP levels, Exp levels, all that jazz, all while seeing realtime effects on direct weapon comparisons within the Comparisons chart.&nbsp; Time taken: 5-10 minutes, if I'm extensive.&nbsp; Tool value received: High; I get direct, dynamic weapon comparisons, and valuable evaluative data.&nbsp; Overall, a much more enjoyable and productive return on my time, with a whole lot more information to show for it.</p>\r\n<p>This is a HUGE boon to an Arms Warrior, with mutually exclusive weapon specialization talents, not just some &quot;lazy workaround&quot; (verbatim).&nbsp; Just because I personally make no use of the Batch Tools, doesn't mean that I think it shouldn't be available to those who gain evaluative data and usable cross-spec setup information.&nbsp; The design decision is that it benefits enough people to add value to the project as a whole.</p>\r\n<p>In this case, the developers and project head have deliberately decided on a functionality.&nbsp; There's agreement that we can do better in terms of interface improvements, and we're exploring other options for doing so, without reducing the value of the flexibility the current functionality offers.&nbsp; Either you say &quot;yes, I know I'm over my talent budget, I'm doing so intentionally, and I understand that I'm doing so at my own peril&quot;, or you say &quot;oh, whoops, I put 73 talents between the trees, I better look at dropping 2, let me see my choices&quot;.&nbsp; I (and the developers) are missing how adding a hard restriction on top of this helps further the goals of this program.</p>\r\n<p>I'm also missing how this affects you negatively.&nbsp;</p>\r\n<p>Also, understand that this is an open-source project.&nbsp; The source code is readily available (well, as soon as Codeplex fixes their stuff! ;D), and you are more than free to make a local build that adds features, takes away features, and make whatever local additions you like.&nbsp; You can create a talent tree that restricts you to 71 points, just like the Wowhead talent calculator, or the Armory calculator, or the in-game talent interface.&nbsp; You are totally welcome to create a version that has a Hello Kitty themed interface, and if that increases your enjoyment, productivity, or just a general return from the product, so much the better!&nbsp; We'd all be happy that you could tailor the project to your own liking, and that it brings you joy.</p>\r\n<p>However, that very Hello Kitty feature (please don't take this example as derogatory, it's only meant as a silly stand-in example) may not be something the developers decide to implement in mainline of the project.&nbsp; Similarly, the developers do not see the need for capping talent placement, and don't believe that it's necessary or beneficial to the broad userbase of the program.&nbsp; Realize that we're not saying it's a stupid idea, or denying that some users may find it an acceptable limitation.&nbsp; We're saying that after taking a look at the feature, we'd like it to stay as-is due to the value the feature adds, and perhaps add both visual indicators (as I noted in my last post), and possibly a can't-miss warning dialogue if one attempted to run the Optimizer on a character file that currently has more than 71 talents placed.</p>",
    "PostedDate": "2009-12-18T19:17:59.227-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "269181",
    "ThreadId": "78570",
    "Html": "<p>Point well made.&nbsp; In my own opinion, though, I honestly think you over complicate the &quot;issue&quot; in the specific example given. It's really not anything that most other classes and/or specs would have to do and I don't honestly believe it takes that long to make the changes you are referring to...but maybe it does...I actually don't have a warrior so I have no basis for comparison.&nbsp; That aside, I glad some folks are able to put the feature to good use.</p>\r\n<p>And frankly this doesn't affect me negatively and I don't believe I ever said it did.&nbsp; I don't personally agree with the reasoning given for why this feature was decided upon and I don't necessarily have to in order to understand why you decided to implement it.&nbsp; It's not my tool.&nbsp; I simply came here to ask a question and try to understand why the tool worked the way it worked.&nbsp; The post quickly derailed and took quite a negative tone, but I refuse to concede that it was all my doing.&nbsp; I truly believe some individuals with yellow backgrounds under their name over there on the left side of the page have some pretty poor customer relations skills and, in my opinion, played their part in that derailment process.&nbsp; But I digress...I played my part in the situation as well, made a mistake or two and won't try to hide from that.&nbsp; I will not, however, sit here and play the &quot;you started it!&quot; game so we can leave this all behind us and move on.&nbsp; Change or don't change the tool how you see fit.&nbsp; Which ever direction you decide to go I hope it works out well and that the users are pleased with what ever the end result might be.</p>\r\n<p>You guys design the tool however you see fit and I'll decide to use or not use the tool as I see fit.&nbsp; If I run across another question regarding a functionality of the tool I will keep my mouth shut and we shall never have to cross paths again.&nbsp; I did try to download the source code but, as you point out, was unable to for whatever reason.&nbsp; I actually did have my own tool for doing gear optimization for my druid prior to Wrath.&nbsp; I abandoned the project because, quite frankly, it was a pain in the rear to keep up with and I found this tool that did it for me...and I'm lazy so here we are.</p>\r\n<p>Fight the good fight, keep up the good work, pick your battles....and I'm done with this one.&nbsp; Thanks for your time.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-12-18T20:05:35.57-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "269185",
    "ThreadId": "78570",
    "Html": "<p>Aw man, I missed something big :( *grumbles*</p>\r\n<p>Anyway, my take on the whole matter is that, as the DPSWarr dev, BrWarner and droidicus are absolutely right. &nbsp;You can't use the optimize feature efficiently without going 5/5 in all three specs. &nbsp;You can't see the true value of 25-Tribute Mace vs 25-H FC Axe in the comparisons pane, or the direct upgrades pane, or the item dropdown box. &nbsp;You can't use &quot;Build Upgrade List&quot; across multiple weapon types. &nbsp;</p>\r\n<p>For those reasons alone, it's worth having as a feature.</p>",
    "PostedDate": "2009-12-18T20:43:37.227-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "269393",
    "ThreadId": "78570",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>ebs2002 wrote:</strong><br>\r\n<p>Aw man, I missed something big :( *grumbles*</p>\r\n<p>Anyway, my take on the whole matter is that, as the DPSWarr dev, BrWarner and droidicus are absolutely right. &nbsp;You can't use the optimize feature efficiently without going 5/5 in all three specs. &nbsp;You can't see the true value of 25-Tribute Mace vs 25-H FC Axe in the comparisons pane, or the direct upgrades pane, or the item dropdown box. &nbsp;You can't use &quot;Build Upgrade List&quot; across multiple weapon types. &nbsp;</p>\r\n<p>For those reasons alone, it's worth having as a feature.</p>\r\n</blockquote>\r\n<p>Yeah, I find it rather closed-minded to disagree with this feature.&nbsp; Without it life would be hell for Arms warriors.&nbsp; If you are PoleAxe spec all polearms/axes everywhere would be better than any other weapon.&nbsp; Now where in Rawr would it tell you that a Mace might be better.&nbsp; Optimizer would fail to even think about Maces, upgrade list the same.&nbsp;</p>\r\n<p>Yes you could run an optimize in PoleAxe spec, write down the final value, then rerun optimize again in another spec...It just means doing 3 times the work in 3 times the time when it could all be solved by allowing overspec.</p>\r\n<p>It warning you that you are overspecced would be good though, even in the talent pane.&nbsp; Maybe it turns the text red or puts stars or whatever.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-12-20T09:00:12.303-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "269394",
    "ThreadId": "78570",
    "Html": "<p>I've already applied the patch that tells you in the preset selector, where it says</p>\r\n<p>SpecName (35/13/12) x Points Under</p>\r\n<p>the dropdown also turns red when you are off on number of points</p>",
    "PostedDate": "2009-12-20T09:07:17.24-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]