[
  {
    "Id": "269246",
    "ThreadId": "78634",
    "Html": "<p>Is there a way to speed up the optimizing process? I realize there is alot of gear to go through but can we narrow the search to speed up the process or change any settings. I want the most accurate information but don't enjoying waiting 2hrs to see what the next best piece of gear is? i might be asking too much and will have to live with it but i want to make sure it isnt something i cant control first.</p>\r\n<p>Can you make it so that it doesnt check on, say greens and blues as well? Maybe that alone would save alot of time for me.</p>\r\n<p>&nbsp;</p>\r\n<p>thanks nitrax</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-12-19T09:17:18.903-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "269268",
    "ThreadId": "78634",
    "Html": "<p>I don't know if this will help with your particular problem or not, but check out <a href=\"http://rawr.codeplex.com/wikipage?title=GearOptimization&referringTitle=Documentation\">this page</a> (available from the &quot;Documentation&quot; link above) and pay special attention attention to the &quot;Available Gear&quot; section.&nbsp; It will correct at least one misunderstanding you have of the optimizer.&nbsp; If after reading all the documentation on the optimizer you still have a question, I suggest reading the posting guidelines closely, then coming back here to give more information about how you're setting things up when you see 2 hour optimize times, and which model you're using.</p>",
    "PostedDate": "2009-12-19T10:58:04.317-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "269274",
    "ThreadId": "78634",
    "Html": "<p>Yeah, it really shouldn't be taking that long. For the Optimizer, you should mark only a few items in each slot as available; only things that have a chance of being part of your optimal set. If you mean Build Upgrade List, you can apply filters to the main view, and the Build Upgrade List will only consider items matching those filters.</p>",
    "PostedDate": "2009-12-19T11:21:13.757-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "269281",
    "ThreadId": "78634",
    "Html": "<p>sorry i was refering to the Build Upgrade List.</p>\r\n<p>i think i just need to use the filter more on that. i am been loose on that because i had a few peices here and there sneak up on me as far as what was an upgrade that i didn't expect.</p>\r\n<p>but i think that is my only solution on that. just narrowing more down. i wish i could just take out green and blue quality pieces instead but we cant get everything we want =p</p>\r\n<p>the optimizer has been alot longer lately but i am sure its because legs and chest pieces with 3 gem slots. that takes a bit to optimize i am sure.&nbsp;</p>\r\n<p>just confirm or deny on what i said. i think just narrowing the search is what needs to happens just using the zone filter. i will let you know if that helps, if that seems to be my solution.</p>\r\n<p>thanks a ton for your time.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-12-19T12:07:02.25-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "269290",
    "ThreadId": "78634",
    "Html": "<p>I recommend liberally using the &quot;Filter by Item Level&quot; near the end of the default Filters, when prepping for a Build Upgrade List.</p>",
    "PostedDate": "2009-12-19T13:12:21.347-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "269351",
    "ThreadId": "78634",
    "Html": "<p>thanks a ton for the help guys. i have sped things up now. hope this helps others too.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-12-19T21:13:35.283-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]