[
  {
    "Id": "270016",
    "ThreadId": "78867",
    "Html": "<p>Are there any plans to allow switching between specs in future versions?</p>",
    "PostedDate": "2009-12-22T12:02:31.367-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "270019",
    "ThreadId": "78867",
    "Html": "<p>Spec swapping is already supported. If you're looking for something more, you'll have to clarify.</p>",
    "PostedDate": "2009-12-22T12:07:35.42-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "270032",
    "ThreadId": "78867",
    "Html": "<p>What I mean is, If you have a duel specced toon in WOW and you load from Armory, it loads the last spec you logged out in.&nbsp; Is it going to be possible to select the other spec and have all the gear and talents and such update, or will you need to update everything manually?</p>",
    "PostedDate": "2009-12-22T12:45:44.997-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "270035",
    "ThreadId": "78867",
    "Html": "<p>Gear, definitely not, that's not even provided by the armory, as gear isn't spec-specific. Talents, we could load the alt talent spec from the Armory, and save it as a preset, but you'd likely fill up a ton of presets that way.</p>",
    "PostedDate": "2009-12-22T12:52:02.917-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "270038",
    "ThreadId": "78867",
    "Html": "<p>I'm thinking in terms of the way Wow-Heroes and the Armory does it, you can switch back and for between you specs and all the gear that you have for that spec are updated.</p>",
    "PostedDate": "2009-12-22T12:57:02.573-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "270042",
    "ThreadId": "78867",
    "Html": "<p>Err... No? The Armory doesn't support what you describe. It looks like Wow-Heroes is making some guess based on gear it last saw you in when you were that spec.</p>",
    "PostedDate": "2009-12-22T13:19:54.943-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "270046",
    "ThreadId": "78867",
    "Html": "<p>Mis-spoke, sorry.&nbsp; You are correct Armory does not allow it.&nbsp; WOW-Heroes does, I'm not really sure how they're doing it, but from what I've seen it seems to be pretty accurate.&nbsp; I was just curious if Rawr was contemplating a similar feature.&nbsp; But you seem to have already answered that.&nbsp;&nbsp;Thank you very much.</p>",
    "PostedDate": "2009-12-22T13:36:06.95-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "270047",
    "ThreadId": "78867",
    "Html": "<p>Yeah, Wow-Heroes is just guessing based on what gear they last saw you in, with that spec. It's not anything the Armory provides, so isn't something we could use for Rawr.</p>",
    "PostedDate": "2009-12-22T13:37:00.063-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "270077",
    "ThreadId": "78867",
    "Html": "<p>Another problem of switching back and forth is you would likely need to load an entirely different model, and that's not light stuff. Might as well just save different character files and swap between them with the &quot;recent files&quot; menu thingy.</p>\r\n<p>For characters that have 2 of the same specs or specs that share a model (Pure DPS characters, Arms/Fury, Holy/Disc, TrashProt/BossProt), it would be kind-of cool to be able to store gear sets, but probably not worth the effort. You can already do the talent swap part.</p>",
    "PostedDate": "2009-12-22T14:55:17.137-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]