[
  {
    "Id": "270442",
    "ThreadId": "78991",
    "Html": "<p>Just an FYI, someone going around with the name of RawrGwindor is posting links to a repackaged Rawr on a lot of the fansites. The exe file is modified (probably a keylogger). The posts reference Rawr 2.3.3. Once again, just an FYI.</p>",
    "PostedDate": "2009-12-23T15:30:34.53-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "270445",
    "ThreadId": "78991",
    "Html": "<p>Is it time to start strong name signing Rawr, or providing a PGP / whatever hash of the downloads?</p>",
    "PostedDate": "2009-12-23T15:45:49.233-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "270467",
    "ThreadId": "78991",
    "Html": "<p>Please send me links asap. Everyone, do not download Rawr from anywhere besides THIS site.</p>",
    "PostedDate": "2009-12-23T17:31:30.043-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "270470",
    "ThreadId": "78991",
    "Html": "<p>I sent you a PM with the download link. Most of the threads have been taken down because they were spammed across the forums. I sent a heads up to WoR just in case, they removed the threads as spam-related but didn't seem too concerned about the download link.</p>",
    "PostedDate": "2009-12-23T17:46:05.7-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "270492",
    "ThreadId": "78991",
    "Html": "<p>Well, thats very much not me. &nbsp;Said user has created a profile on the MMO-Champ forums, Levva, can you destroy it before it gets a chance to post anything?</p>\r\n<p>&nbsp;</p>\r\n<p>Link to the MMO champ forum profile. <a href=\"http://www.mmo-champion.com/profile/?u=121027\">http://www.mmo-champion.com/profile/?u=121027</a></p>\r\n<p>The following site looks pretty shady in itself: <a href=\"http://wowinfoboard.com/?p=13798\">http://wowinfoboard.com/?p=13798</a></p>\r\n<p>WoR seems to have taken down the posts made (as did MMO Champ) but I'd like to see the actual accounts deleted. &nbsp;Does anyone have a contact at WoR that I could speak with about that?</p>",
    "PostedDate": "2009-12-23T20:53:27.843-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "270497",
    "ThreadId": "78991",
    "Html": "<p>Hey Gwindor,</p>\r\n<p>I just emailed community@curse.com when I saw the posts. Here is the reply I got if you want to reference it:</p>\r\n<p>&quot;Thanks ****. Luckily this is a legitimate post by RawrGwindor, but I'm deleting the threads anyway because the way they've gone about promoting it is simply spam and nothing else.&quot;</p>\r\n<p>I kinda laughed, seeing as the profile had just been created yesterday, and only made 4 total posts.</p>",
    "PostedDate": "2009-12-23T21:30:42.573-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "270510",
    "ThreadId": "78991",
    "Html": "<p>wow...</p>",
    "PostedDate": "2009-12-23T22:47:22.79-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "270523",
    "ThreadId": "78991",
    "Html": "<p>Obviously it would suck if it was a keylogger, but otherwise is it an issue if someone decides to release their own version of Rawr?</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-12-24T00:46:30.927-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "270543",
    "ThreadId": "78991",
    "Html": "<p>Well, this is obviously something malicious, otherwise they wouldn't be pretending to be us.</p>\r\n<p>But to answer the more general question of others releasing their own versions of Rawr... Yes and no. Rawr is open source, and its license says that it's OK for anyone to modify and re-release. However, we strongly prefer that nobody actually does that, as long as we're still actively developing Rawr, because it creates major confusion for users, and splits the development focus. Most importantly, there's no need or reason to do so; we're very active here, and most welcoming of anyone else contributing to Rawr, so anyone who does want to modify it is welcome to just contribute their changes to the main codebase, and let us release it. Everyone benefits, that way.</p>\r\n<p>&nbsp;</p>\r\n<p>Anyway, that's unrelated to what's going on here; this asshole is pretending to be us, posting virus-infected (probably, I haven't checked myself) copies of Rawr, trying to take advantage of our users. We're doing everything we can to stop the spread of this crap.</p>\r\n<p>&nbsp;</p>\r\n<p>Users, please tell all your friends, only download Rawr from this site.</p>",
    "PostedDate": "2009-12-24T02:07:40.577-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "270615",
    "ThreadId": "78991",
    "Html": "<p>Also, just for the sake of completeness, I'd like to mention you should always, always download open-source applications (or any other applications really) from their official download mirror. Also, don't trust a 3rd-party binary just because there's a source download next to it. You never know if they actually compiled it with <em>that</em> source.</p>\r\n<p>On another note, I've worked on <em>a lot</em> of open-source software in the past, and I have to say; this is quite possibly the most enjoyable development experience I've had. The development staff is really nice here. Not once have I had to <em>fight</em> with people's egos just to get a simple patch even <em>considered</em>. (not to mention patches get applied and released extremely fast. Try filing something on X.org or Launchpad. -_-) I don't get flamed in the discussion boards for posting ideas that may be a little silly and most of the time I even get useful replies free of ego-trip ranting! You guys are going a really great job. I'm sad that I need to stop when Rawr3 comes out. :(</p>\r\n<p>Oh, actually, I'm reminded. Rawr is under the Apache license? Does that have a clause about branding? If it does, you might be able to get this guy for infringing your license terms by not renaming his project to VirusRawr. ;)</p>",
    "PostedDate": "2009-12-24T09:15:15.48-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "270652",
    "ThreadId": "78991",
    "Html": "<p>Here here, ZDBiohazard. I can't wait to get to play with the WPF version - which will hopefully get fixed soon. (Won't compile for me in Blend) Rawr is really fun to work on!</p>",
    "PostedDate": "2009-12-24T13:19:46.963-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "428050",
    "ThreadId": "78991",
    "Html": "<p>Sorry to necro this thread but it appears Keyloggers are trying to get people to download unauthorized versions of RAWR on WorldofRaids.com's forum. I've already reported one of the four threads the guy (dwandurr is his username) made as well as the user himself.</p>\r\n<p>Since reporting both it appears the threads were deleted. but just throwing it out there that people are still trying to add keyloggers to the source code and upload unauthorized copies of the program. The real telling point is that he was hosting the file on filebin (or something like that) website and not here.</p>",
    "PostedDate": "2010-04-06T14:46:20.68-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "428118",
    "ThreadId": "78991",
    "Html": "<p>Indeed, those posts just went up on Curse too. Everyone please report any of those that you see. The *ONLY* place to download/use Rawr is on codeplex.com or elitistjerks.com.</p>",
    "PostedDate": "2010-04-06T19:36:50.21-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "428182",
    "ThreadId": "78991",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>markdall wrote:</strong><br>\r\n<p>Is it time to start strong name signing Rawr, or providing a PGP / whatever hash of the downloads?</p>\r\n</blockquote>\r\n<p>&nbsp;A bit of a moot issue for open source unfortunately, source is available and any malicious person can just add the code they want and recompile.<br><br>They can change a binary and then sign it also, it wouldn't be signed with the actual Rawr key (it doesn't even have to be signed), but they can make it appear that way, the bad part is that the very same people that would be most vulnerable to download the hijacked copy would also not know how to verify the files legitimacy.&nbsp; People that have been long time users of Rawr will get it from here and not have a reason to even bother trying to get it from anywhere else.&nbsp; The people at risk for such hijacks are the people not already using rawr, seeing the advertisement and thinking &quot;cool, I'll try it&quot;.&nbsp;</p>\r\n<p>Digitally signing software is really only going to be usefull if people change their computer settings to ONLY allow digitally signed binaries (verifiable/traceable to a trusted root CA) to be installed/executed on their PC's.&nbsp; But I don't see users doing this anywhere soon.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-04-07T00:46:38.9-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "484114",
    "ThreadId": "78991",
    "Html": "<p>http://www.youtube.com/watch?v=HfYiZ8J5Oug&nbsp; Most dangerously, the link to an offsite download in the uploader's notes of the video.</p>\r\n<p>Unfortunately I couldn't accurately reference the proper places to access Rawr, because apparently Youtube doesn't allow any non-youtube.com links in comments.&nbsp; Ugh.&nbsp; Anyways, please report the video, an/or uprate the comments I made.</p>",
    "PostedDate": "2010-08-24T06:26:58.28-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]