[
  {
    "Id": "270537",
    "ThreadId": "79012",
    "Html": "<p>Hi, I am having some difficulty understanding how does the mage cycle analyzer works for rawr.</p>\r\n<p>I am currently using v2.3.4</p>\r\n<p>talent specs: 57/3/11 deep arcane spec.</p>\r\n<p>I stimulated a minimal buff condition along with the analyzer, it pulls 5.5k dps</p>\r\n<p>i believe it has got to be my rotation, as im only pulling 4.8k on minimal buff conditions.</p>\r\n<p>my current rotation im using is AB + AB + AB +AB + MB. ( when missile bar is proc )</p>\r\n<p>Anyone able to&nbsp;teach me how to decipher it?</p>\r\n<p><a href=\"http://i57.photobucket.com/albums/g207/kainniarun/cycle.jpg\">Cycle.jpg</a></p>\r\n<p>any help is apperciated</p>",
    "PostedDate": "2009-12-24T01:45:48.563-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "270643",
    "ThreadId": "79012",
    "Html": "<p>If all you want to do is compare theoretical dps vs what you're achieving in practice then you don't need to use the cycle analyzer. Purpose of analyzer is to determine which cycles are optimal.</p>\r\n<p>For theoretical/practical comparison all you need to do is look at spell info list on the first tab. Find your cycle (based on your description that would be ABSpam04MBAM) and look at its dps. If this does not match your ingame data then something is most likely not set correctly unless you're just having bad luck with procs. When things don't match you should definitely look at your latency settings and buffs that are enabled. One buff that is easily forgotten about is Focus Magic (to disable that you have to set Focus Magic rate to 0 in options). Also note that the dps data in spell info is without cooldowns, only using passive procs.</p>",
    "PostedDate": "2009-12-24T12:02:03.41-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "270669",
    "ThreadId": "79012",
    "Html": "<p>Thanks Kavan,</p>\r\n<p>I get more to how it works.</p>\r\n<p>Appreciate loads.</p>\r\n<p>and a merry Xmas to you :)</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-12-24T18:43:44.85-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]