[
  {
    "Id": "270821",
    "ThreadId": "79094",
    "Html": "<p>I have been looking all over and I am unable to find out where you are able to adjust this. With my current equipment my mitigation points are roughly 30k behind my survival points. In most cases I should be focusing on mitigation then. Except for a druid, gemming wise, along with enchants we should be going for stamina rather than agi. Well, when I am looking through all my upgrades, it is showing DPS gear as BiS for rings and trinkets and such. As for gemming its telling me I should be putting 20 agi into all of my slots. Which isn't correct because to most druids gemming should go, 1x 10 agi 15 stam and the rest should be 30 stams. Unless you are a JC of course then it should be 51 stams. I am just wondering how to adjust the priority of each set of points. So its actually showing me tanking items rather than DPS. So, what I would need to do is create a priority of Survival &gt; Mitigation. Is this&nbsp;Possible?&nbsp;</p>",
    "PostedDate": "2009-12-26T06:30:25.37-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "270850",
    "ThreadId": "79094",
    "Html": "<p>You may have your setting set to a lower tier gear. In the option panel, you will see both Survival Soft Cap option and Target Damage (RAW) option. These tend to be defaulted to Tier 8 10-man settings. So if you are in ToC gear, then it is most likely saying that your are over the threshold to need to stack stamina. If you want to change just select the &quot;Custom&quot; drop down button and select the tier level you are working on. If you are working on ICC, then; for the time being; select the T9 Hard Mode settings until more definitive numbers can be inputed as an option. Also for ICC make sure you have the &quot;Chill to the Bone&quot; &quot;buff&quot; selected.</p>",
    "PostedDate": "2009-12-26T09:49:33.05-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "270860",
    "ThreadId": "79094",
    "Html": "<p>Alright. Thanks for the help. Although, I am not too sure if its information is correct. It is showing me that &quot;The Black Heart&quot; Is still the BiS besides the Unidentifiable Organ. &nbsp;I have talked to many people and it still shows that The Black Heart is not as good because the uptime on the buff is so little. So I think it might be wrong.</p>",
    "PostedDate": "2009-12-26T10:36:51.28-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "270862",
    "ThreadId": "79094",
    "Html": "<p>PLEASE don't take &quot;the highest on the current list&quot; as &quot;Best in Slot&quot;.&nbsp; The two have such totally, radically different meanings, and implications.&nbsp; What you see as the top on the list at the moment is the one that provides the most value, given the current fight conditions, and your current other gear, and only when replacing the current piece (including the specific gemming) with one other piece, assuming ALL other variables stay exactly the same.&nbsp; While the one on top <strong><em>can</em></strong> be the &quot;Best in Slot&quot; (meaning, the best available item you can put in that slot, given unlimited access to gear in every available slot), it oftentimes is not.&nbsp; While Rawr can certainly aid in determining the &quot;BiS&quot; setup for a given individual, given certain parameters, it does not assign an intrinsic value to certain items that say &quot;this item is always and forever better than all others, as it is a BiS item&quot;.</p>\r\n<p>There is, however, value to be gained by seeing where different items appear in the Comparisons chart.&nbsp; You possibly have too small of an EH pool, due to certain fight parameters that you are or are not setting, and are dying too quickly.&nbsp; Hinalover is completely right about (her?) analysis</p>\r\n<p>I wouldn't be too worried about Agility being given a high value, and subsequently, some &quot;DPS&quot; items being assigned a good &quot;tanking&quot; value for you in terms of rings and neckpieces, once you have the settings correct for the content you're gearing for.&nbsp; While Defense does help Bears, it is expensive in terms of itemization cost, given the meager benefits it provides, compared to the value it provides Warriors or Paladins.</p>\r\n<p>By the way, the Black Heart really is a rather good trinket.&nbsp; :)</p>",
    "PostedDate": "2009-12-26T10:52:40.547-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "270863",
    "ThreadId": "79094",
    "Html": "<p>Alright. Thanks for the help. I did get it setup so that its showing survival is &gt; mitigation. I guess things will sort itself out while I am getting upgrades. Thanks for all the help. :)</p>",
    "PostedDate": "2009-12-26T10:55:56.753-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "270866",
    "ThreadId": "79094",
    "Html": "<p>Glad to hear it.&nbsp; ;D&nbsp; And, I will say that setting up the tanking parameters is the arguably most difficult, and the most crucial settings in all of Rawr.&nbsp; Even little value changes can alter entire gearing approaches, depending on the individual case.</p>",
    "PostedDate": "2009-12-26T11:28:23.49-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "270893",
    "ThreadId": "79094",
    "Html": "<p>Yeah, so i've noticed. Some of my best pieces look like crap when I had the wrong setup. :\\</p>",
    "PostedDate": "2009-12-26T15:29:03.797-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "270899",
    "ThreadId": "79094",
    "Html": "<p>Happens to all of us when first starting out on the program. It's no biggy.</p>\r\n<p>And BrW, I'm a he. ;) Screenname is an old online user name I picked up back when I was still watching the anime show &quot;Love Hina.&quot; (I know; no originality). Just stuck with the name ever since.</p>",
    "PostedDate": "2009-12-26T16:30:46.203-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "270904",
    "ThreadId": "79094",
    "Html": "<p>Dang it.&nbsp; And I'm usually pretty good about being able to tell gender by voice.&nbsp; &gt;.&lt;&nbsp; On a totally unrelated note, you're on Uldum, right?&nbsp; Or was that somebody else I'm thinking of?</p>",
    "PostedDate": "2009-12-26T18:17:43.417-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "270926",
    "ThreadId": "79094",
    "Html": "<p>I was on Deathwing, but a few months back moved several of my main toons over to Crushridge.</p>",
    "PostedDate": "2009-12-27T00:27:10.71-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "270970",
    "ThreadId": "79094",
    "Html": "<p>That's what it was - I have a bunch of friends over on Deathwing.&nbsp; Small world.</p>",
    "PostedDate": "2009-12-27T08:01:39.837-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "270990",
    "ThreadId": "79094",
    "Html": "<p>Yea I was one of the mages in U N K N O W N/I N V I C T U S. Once the guild broke up, I decided to switch servers (that and I was quite tired of several members in Inertia)</p>",
    "PostedDate": "2009-12-27T09:32:44.15-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]