[
  {
    "Id": "271376",
    "ThreadId": "79260",
    "Html": "<p>Hi</p>\r\n<p>i get with the same char 2 tps values, one is 10k and the other 11,7k tps. All other values are the same. I checked this over and over again. Maybe someone can tell me what i overlook.</p>\r\n<p>&nbsp;</p>\r\n<p>I tanked with frostspec and a 2h weapon all the time. 2 Weeks ago i got 2 rimefangs and some expertise gear and tried out frost dual. Because Arsenal was down i used a saved copy of my char and changed gear gems glyphs and talents from hand. after that i saw 11,7k tps the only only buff was Horn of Winter. (standartsettings for rotation frost)</p>\r\n<p>Next day i imported the char from Armory and saw 10k tps. I exportet all stats and loaded the saved char (still 11,7k tps) exportet the settings and they matched. (same life armor ap eqiup and so on) I then checked glyph talent rotation settings and they are the same. The only differenz i can see is tps from 1,7k. The char is arlin from die silberne hand EU.</p>\r\n<p>Then I used an emty rawr and added all items talents professions glyphs from hand and get 11.7k tps.</p>\r\n<p>The only thing i can think is that the Armory returned the wrong weapon skill but i dont know if rawr used this or assumed that it is max.</p>\r\n<p>&nbsp;</p>\r\n<p>thank you for your help and sorry i made something wrong but i dont understand what</p>\r\n<p>Mike</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-12-29T02:28:58.87-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "271459",
    "ThreadId": "79260",
    "Html": "<p>Normally this kind of discussion should be handled in the Issue Tracker.&nbsp; I need to see the 2 different saved character files one for the 10k and the one for 11.7k.&nbsp; I can't tell from your description what might be causing the problem.&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>Thanks.</p>",
    "PostedDate": "2009-12-29T08:32:05.523-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "271536",
    "ThreadId": "79260",
    "Html": "<p>Thanks for the answer,&nbsp;I thought it is a user error not an issue with the program thats the reason why I post here.</p>\r\n<p>I&nbsp;have the 2 files but i cant insertit in this&nbsp;post (or i dont see the button) can i send you them per Mail ?</p>\r\n<p>&nbsp;</p>\r\n<p>Mike</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-12-29T13:36:44.637-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "271541",
    "ThreadId": "79260",
    "Html": "<p>There is no way to post files as part of discussions.</p>\r\n<p>Use the Issue Tracker button above and create a new issue.&nbsp; Include your details and the 2 XMLs.</p>",
    "PostedDate": "2009-12-29T13:47:49.507-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]