[
  {
    "Id": "271790",
    "ThreadId": "79393",
    "Html": "<p>I love the upgrade tool, but it seems to be producing results and that don't match what I see in the normal gear ranking lists for my character.</p>\r\n<p>My character is Charlimangy on Perenolde (US)</p>\r\n<p>For example, the upgrade tool puts in Brooch of the Wailing Night as a&nbsp;2766 point upgrade (!) for my Mark of the Unyielding when I run the tool. &nbsp;But viewing my character in the main app and looking at the Neck gear list it shows the Mark of the Unyielding at 9465 points overall and Brooch of the Wailing Night at 7919.</p>\r\n<p>I'm not doing much other than loading the character, checking off buffs for my 10-man raid, and then running Optimize... Build Upgrade List...</p>\r\n<p>Any ideas?</p>\r\n<div id=\"_mcePaste\" style=\"left:-10000px;top:0px;width:1px;height:1px;overflow-x:hidden;overflow-y:hidden\">27662766</div>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-12-30T11:45:57.497-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "271795",
    "ThreadId": "79393",
    "Html": "<p>Build Upgrade List takes into account other gear changes that can enhance the performance of that item, so it's not just going to be the 9465 - 7919 = 1546, it would be your current score 7919 against the adjusted item score of whatever that leaves it to 2766. Mouse over the item in the Upgrade List and it will show a list of item changes with it.</p>",
    "PostedDate": "2009-12-30T12:07:10.533-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "271796",
    "ThreadId": "79393",
    "Html": "<p>Rawr calculates things in terms of the big picture; your whole character. When you look at an item in the comparison charts, and see that it has a value of 1000, that means that the value of your whole character with that item equipped, minus the value of your whole character with that slot empty, is 1000. ie, that item contributes 1000 to your overall value. So if you compare that to another item in the same slot which is valued at 2000, the 2000 one is obviously better, because the overall value of your character is higher with it equipped.</p>\r\n<p>However, Rawr can also go a step further, using the Optimizer. It will (try to, anyway) find the best set of gear from everything you have available. And another step further is Build Upgrade List, which tries making more items available, and sees how much more you can get after optimizing again.</p>\r\n<p>So when you see a value of 1500 on an item on an upgrade list, it means, quite literally: <strong>The value of the optimal set of gear from everything you have available, with that item equipped, <em>minus</em>&nbsp;the value of your current gear.</strong>&nbsp;That's a very powerful and informative bit of information, as it's effectively the upgrade value of the item. ie, if I got this item, and reoptimized, how much would I improve? 1500. So if you're already hit capped, an item with hit on it may still be an upgrade, because it may allow you to swap out some other piece with hit on it, for a better piece without, resulting in a higher overall score in the end. However, take note that this calculation is compare to the value of your <strong>current</strong>&nbsp;gear. If your current gear is <em>not</em>&nbsp;optimized, then even your current gear can be an upgrade, since you can still optimize for it.</p>\r\n<p>In your case, it sounds like probably that's the issue; because you're starting out not optimized, items that you already have, or are worse than items you already have, have an upgrade value. In other words, optimize first.</p>",
    "PostedDate": "2009-12-30T12:09:14.603-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "271896",
    "ThreadId": "79393",
    "Html": "<p>Thanks for the quick response. Its working better now that I know to get an optimized set equipped first before doing upgrades.</p>",
    "PostedDate": "2009-12-30T21:04:09.827-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]