[
  {
    "Id": "272088",
    "ThreadId": "79471",
    "Html": "<p>Hi,</p>\r\n<p>&nbsp;</p>\r\n<p>is there any way to let the Tank Weapons stay available but make the Optimizer prefer the Slow-DPS Weapons? (for DW DK Frost Tank)</p>",
    "PostedDate": "2009-12-31T15:24:23.943-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "272094",
    "ThreadId": "79471",
    "Html": "<p>I'm not sure what you're looking for.&nbsp;</p>\r\n<p>Are you concerned that the suggested weapons are not appropriate for tanking with?&nbsp; Other than attack speed, what about a slow weapon do you feel gives you an advantage?&nbsp; Is this a threat concern vs. a survival or mitigation concern?</p>",
    "PostedDate": "2009-12-31T16:22:19.44-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "272096",
    "ThreadId": "79471",
    "Html": "<p>Parry haste perhaps?</p>",
    "PostedDate": "2009-12-31T17:11:58.963-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "272263",
    "ThreadId": "79471",
    "Html": "<p>Slower Weapons = More Damage on Obliterate ^^</p>",
    "PostedDate": "2010-01-01T15:19:48.277-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "272293",
    "ThreadId": "79471",
    "Html": "<p>Oblit TPS is such a small part of your total tanking score, I believe the balance is negligible compared to other values provided by other weapons.</p>",
    "PostedDate": "2010-01-01T19:54:33.78-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "272756",
    "ThreadId": "79471",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>Shazear wrote:</strong><br>\r\n<p>Oblit TPS is such a small part of your total tanking score</p>\r\n</blockquote>\r\n<p>&nbsp;I'm not sure what you mean. For DW Frost tank oblit is main skill. For me it is usualy #1 dps (mh + oh), so probably #2 threat (after RS).</p>\r\n<p>So Slow-DPS vs Fast-tanking is like threat vs survival. I don't think there is easy way to compare apples to oranges. Manatsu: if you have survival issues, go 2h - more stamina AND more agi/str will probably work better. If your healers don't go insane keeping you alive do what I do - change model to DPS-DK and see which weapons are better ;)</p>",
    "PostedDate": "2010-01-03T23:53:44.103-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "272981",
    "ThreadId": "79471",
    "Html": "<p>I agree with Manat and kazus.&nbsp; The whole reason Bliz gave us a 1-handed tank enchant was so that we could use DPS one handers instead of just regular tank weapons.&nbsp; This results in much bigger gains in threat and aggro management.</p>",
    "PostedDate": "2010-01-04T10:00:36.717-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "272988",
    "ThreadId": "79471",
    "Html": "<p>I'm not arguing the point of having DW tanking vs. 2H tanking. I was thinking that the difference in damage between a slower weapon and a faster weapon would be negligible in the grand scheme of things, but I realize that the whole point of this is to work on improving on those few percentage points. &nbsp; I'll look to see if there's any adjustments to the methods in the threat section that can be done in the context of a bug-fix rather than the re-write that I'm working on.</p>",
    "PostedDate": "2010-01-04T10:16:40.473-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]