[
  {
    "Id": "272167",
    "ThreadId": "79493",
    "Html": "<p>I am probably just being very very dense, but can someone explain to me why some of the new T10 pieces are placed below T9 ones in the sorting? I checked the two cheapest pieces, both in dps and overall ranking - same result.</p>\r\n<p>I was trying to see how would my toon be affected if I bought the cheapest two pieces of T10, which are gloves and shoulders, 60 frost emblems each. For DPS Warrior, both are itemised exactly in the same way their T9 equivalents were - the only differences are the set bonuses, and, of course, stat increases. Both T10 pieces have more of each stat, sometimes enough more to be compared to an extra epic gem or two...</p>\r\n<p>Yet to my surprise, rawr places lower dps and survival rating on both T10 items in question.</p>\r\n<p>I can't believe loosing 5% extra crit on Slam from T9 4-piece bonus is such a nerf compared to new T10-2 piece bonus, that getting T10 would actually be a downgrade; neither can I imagine pieces better in every aspect, higher iLevel and in same itemisation actually should rank lower.</p>\r\n<p>Someone? Anyone?</p>\r\n<p>HALP! &gt;_&lt;</p>",
    "PostedDate": "2010-01-01T06:17:36.047-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "272174",
    "ThreadId": "79493",
    "Html": "<p>The character file is <a href=\"http://files.legendofbong.co.uk/download.php?file=1297002504-thoorin-main.xml\">here</a> - just saved.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-01-01T08:20:13.84-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "272307",
    "ThreadId": "79493",
    "Html": "<p>I'm looking at your character file right now. &nbsp;A few things:</p>\r\n<p>1) If you go to Buffs -&gt; Set Bonuses, you'll see that the 2p10 is worth 65.53dps, and the 4p9 is worth 38.59dps. &nbsp;So you would indeed have a DPS increase dropping the 4p9 for the 2p10, set-bonus wise. &nbsp;And as you pointed out, the itemization is identical, so you'd have a DPS increase from the items as well. &nbsp;It's a no-brainer upgrade</p>\r\n<p>2) When you look at whether an item is an upgrade using the comparison chart or the slot dropdown, it will only tell you if it's a DIRECT upgrade. &nbsp;Getting the T10 gloves alone is not an upgrade for you, because it breaks your 4p9 and doens't give you the 2p10. &nbsp;Not until you can have both pieces at the same time is it an upgrade. &nbsp;In other words, looking at going from T9 gloves to T10 gloves, it's a downgrade. &nbsp;But if you equip the T10 shoulders first, then looking at the T10 gloves is a significant upgrade.</p>\r\n<p>3) Just a tip: you don't have any buffs set at all in your character file. &nbsp;This means you're only looking at how good the items are when you're soloing. &nbsp;To get accurate results, set the buffs based on whatever you expect to have most of the time (ie, if you raid 25mans you probably have 90%+ buff coverage; for a 10man you may have 40% coverage; etc). &nbsp;You don't even have Battle Shout selected :)</p>",
    "PostedDate": "2010-01-01T20:59:11.067-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]