[
  {
    "Id": "272767",
    "ThreadId": "79653",
    "Html": "<p>Is it possible to put in a priority set up on Rawr for Afflict 'locks as our rotation is more of priority then rotation, as well as situational. I mean we only should have to cast corruption once during any given fight, and should be casting drain soul when a target is below 25%. Also, with the advent of 3.3 fel puppy is the new succubus.</p>",
    "PostedDate": "2010-01-04T00:18:19.257-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "272786",
    "ThreadId": "79653",
    "Html": "<p>This is a brand new warlock module, so</p>\r\n<p>- pets are not active yet. This will be added back after I finish triple-checking the spell damage, coefficients, etc.</p>\r\n<p>- the new warlock module is already using a PriorityQueue, so once it completes the initial rotation, it will then begin casting spells in order of the next highest priority. Unfortunately you cant see this just yet, because I did not attach the combat simulation results to the events view. DrainSoul &lt; 25% and Decimation &lt; 35% will also be added soon.</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-01-04T01:06:12.923-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "272861",
    "ThreadId": "79653",
    "Html": "<p>:) thanks, I'll look forward to that</p>\r\n<p>&nbsp;</p>\r\n<p>My only other problem is that I can't seem to get the module to spit out numbers or gear upgrades with warlocks, but it works for every other class. . . . does this have anything to do with anything or just my system?</p>",
    "PostedDate": "2010-01-04T05:34:17.563-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "273016",
    "ThreadId": "79653",
    "Html": "<p>Haldir,</p>\r\n<p>At this time the module is in heavy development by ArPharazon, so there is a lot left to do, and at this time you will not see all of the correct values.</p>",
    "PostedDate": "2010-01-04T11:33:33.417-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "273106",
    "ThreadId": "79653",
    "Html": "<p>Okay, but I'm getting no values is what Im tryying to say</p>",
    "PostedDate": "2010-01-04T15:33:36.58-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "273110",
    "ThreadId": "79653",
    "Html": "<p>Absolutely no values at all?</p>\r\n<p>In that case, please post a new issue (in the tracker) and then attach your saved character profile so I can check it out.</p>",
    "PostedDate": "2010-01-04T15:50:17.737-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]