[
  {
    "Id": "273254",
    "ThreadId": "79779",
    "Html": "<p>So 2.3.5 fixed the over-valuation of agility that gave Mongoose a false high value... but Rawr.Cat is still suggesting Mongoose for me over Berserking. Just by a smaller margin now.</p>\r\n<p>This is correct? I'd be happy enough for it to be true, because it means my bear gear can share my best weapon (although Rawr.Bear keeps telling me Berserking is wunnerful, I shy away from that negative armor proc).</p>",
    "PostedDate": "2010-01-05T04:05:47.577-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "273272",
    "ThreadId": "79779",
    "Html": "<p>We (Astryl and I) tested the PPM on Mongoose, Berserking and Executioner before releasing 2.3.5</p>\r\n<p>We tested each for exactly 1 hour of time. &nbsp;This time was spent auto attacking a target dummy.</p>\r\n<p>We ensured that our haste was the same with each enchant (ie, I used a Twisted Visage, a Lotrafen, and a&nbsp;Journey's&nbsp;End, all of which have 0 haste) &nbsp;I had 431 haste for all 3 tests.</p>\r\n<p>The conclusion of our tests was that the Proc rate for Mongoose,&nbsp;Berserker&nbsp;and Executioner were all 1.0 PPM (as near as we could tell) &nbsp;These were the values that we input into the new version of Rawr. &nbsp;This was a change from the values that were previously in Rawr. &nbsp;We would like to test more, we had some... unusual data with Mongoose (two hours in a row, I maintained 1.36PPM) which we decided was simply good RNG and threw out and I'm sure we'll return to sitting at target dummies for all of our weekends once the weekend comes back :P</p>\r\n<p>&nbsp;</p>\r\n<p>In other notes: Mongoose is a very good enchant. &nbsp;Regardless of the agility which may or may not crit cap you, it has a PERCENT increase to haste. &nbsp;Not &quot;x rating&quot; a PERCENT. &nbsp;At high gear levels (when you cap crit, and arpen) you're really only left with Haste, and AP (in the form of str) to scale with. &nbsp;Haste gains alot of relative value at this point.</p>",
    "PostedDate": "2010-01-05T05:23:46.63-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "273299",
    "ThreadId": "79779",
    "Html": "<p>Neat! Thanks for the reply. Kinda hard to believe I'd be close to capping anything - I'm lagging behind a lot of my guild - but my bear set will definitely benefit. Mongoose FTW.</p>\r\n<p>Thank you guys for all the work!</p>",
    "PostedDate": "2010-01-05T06:50:30.46-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "273745",
    "ThreadId": "79779",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>Gwindor wrote:</strong></blockquote>\r\n<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\">we had some... unusual data with Mongoose (two hours in a row, I maintained 1.36PPM) which we decided was simply good RNG and threw out and I'm sure we'll return to sitting at target dummies for all of our weekends once the weekend comes back :P</blockquote>\r\n<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><br></blockquote>\r\n<p>Did the other tester show 1.0PPM then?</p>\r\n<p>&nbsp;</p>\r\n<p>in other news the following is up and running, hoping to have it cleaned up in a few hours, and hoping beyond hope that people will actually edit it in the years to come</p>\r\n<p>&nbsp;</p>\r\n<p>http://www.wowwiki.com/Feral_DPS_guide</p>",
    "PostedDate": "2010-01-06T04:58:25.623-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "274119",
    "ThreadId": "79779",
    "Html": "<p>Soooooo....</p>\r\n<p>What degree of confidence would you all say you have in Zerker and Goose being modeled correctly now?&nbsp; If I win a Distant Land tonight I don't want to spend several hundred gold on Goose if you guys are iffy on if it's right heh.</p>",
    "PostedDate": "2010-01-06T20:40:59.383-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "274126",
    "ThreadId": "79779",
    "Html": "<p>&nbsp;I put Mongoose on mine. Gwin reenchanted his 258 Lupine with Mongoose. We hate to jerk people around, so we're going to be doing more testing, but we're 'reasonably confident' in the current modeling being accurate. I would definitely enchant a new weapon with Mongoose, but I don't know if I'd reenchant a weapon that's already enchanted with Berserking quite yet.</p>",
    "PostedDate": "2010-01-06T20:57:12-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "274198",
    "ThreadId": "79779",
    "Html": "<p>Didn't drop so I have the luxury of waiting another week to see if the model changes :P.</p>",
    "PostedDate": "2010-01-07T01:25:44.763-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "274202",
    "ThreadId": "79779",
    "Html": "<p>Are you kidding? The model is *soo* much better, compared to looking at Lupine for another week. Then again, I'd probably feel the exact opposite, if I had gotten a 258 archon. Swallows are awesome.</p>",
    "PostedDate": "2010-01-07T01:29:56.227-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "274385",
    "ThreadId": "79779",
    "Html": "<p>I'm horde; Twins Pact amuses me.&nbsp; It's freaking gigantic.</p>\r\n<p>I also have a LIGHTNING SHOVELTUSKHEAD GO! Since I managed to pick up a second one for tank set.&nbsp; So with a regem I can go either way but...I'll stay Zerking for now I suppose and hope DL drops next week.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-01-07T08:42:50.06-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "274529",
    "ThreadId": "79779",
    "Html": "<p>Remodelling DBW in my own file as 3 different 30 second 315 second ICD procs with haste replacing ArP interestingly makes Rawr want to use Executioner.&nbsp;</p>\r\n<p>We'll see if this remains true with the true modeling of DBW when the new version is out.</p>\r\n<p>Actually....Scouregebane is better than anything else I think.&nbsp; Everything in ICC is undead no?&nbsp; I guess not gunship...maybe not the oozes in prof...</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-01-07T14:13:04.853-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "274532",
    "ThreadId": "79779",
    "Html": "<p>Executioner will probably be very good from the range of ~1000 passive to 1280 passive ArP. &nbsp; Once you start biting into its soft cap, though, its value will again diminish into obscurity.&nbsp;</p>",
    "PostedDate": "2010-01-07T14:43:05.37-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "274545",
    "ThreadId": "79779",
    "Html": "<p>Khanthal, that doesn't work. &nbsp;The game would assume that all 3 proc simultaneously, and then all three be down for 5mins, then all 3 proc again simultaneously. &nbsp;This could only really work if you set duration to 315sec. At 345secs, it will think you got 6 procs when you only would have gotten 4.</p>",
    "PostedDate": "2010-01-07T15:27:26.313-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "274546",
    "ThreadId": "79779",
    "Html": "<p>In 264 gear (not including heroic 10) Rawr's optimizer doesn't want to ArP cap me even if I tell it executioner is not available.&nbsp; Was rather interesting to me.&nbsp; It gems me hard into both ArP and hit/exp but doesn't quite get to cap on any of the three.</p>\r\n<p>I haven't done much with 277 gear but I suspect it can get me closer to cap and Exec will fall off in usefulness.</p>\r\n<p>Scourgebane still blows them all out of the water if things are undead.&nbsp; Gunship isn't, but that fight is a joke and I could always cannon...I wonder if Prof's oozes are.&nbsp; Wowhead only has bosses in it's Icecrown page.&nbsp; It also says the blood queen is a giant O.o...betting that's wrong :).&nbsp; Deathwhisper adds are only sometimes undead.&nbsp; Not sure about the healing-dragon-adds.&nbsp; Can't think of any other non-undead.</p>",
    "PostedDate": "2010-01-07T15:33:02.84-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "274548",
    "ThreadId": "79779",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>ebs2002 wrote:</strong><br>\r\n<p>Khanthal, that doesn't work. &nbsp;The game would assume that all 3 proc simultaneously, and then all three be down for 5mins, then all 3 proc again simultaneously. &nbsp;This could only really work if you set duration to 315sec. At 345secs, it will think you got 6 procs when you only would have gotten 4.</p>\r\n</blockquote>\r\n<p>My fight duration is the default which is 300 sec so I think it should be fine?</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-01-07T15:36:01.677-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "275123",
    "ThreadId": "79779",
    "Html": "<p>I'm pretty sure Putricide's adds are not classified as undead. &nbsp;Maybe if I get a 2nd 258 Lupine I'll throw Scourgebane on it to play around on fights like Deathbringer or Marrowgar.</p>",
    "PostedDate": "2010-01-09T05:40:52.39-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "275161",
    "ThreadId": "79779",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>Gwindor wrote:</strong><br>\r\n<p>I'm pretty sure Putricide's adds are not classified as undead. &nbsp;Maybe if I get a 2nd 258 Lupine I'll throw Scourgebane on it to play around on fights like Deathbringer or Marrowgar.</p>\r\n</blockquote>\r\n<p>It's an interesting question.&nbsp; Scourgebane is better by a large margin than any other enchant vs undead.&nbsp; So is not doing as good of DPS on a couple adds from a couple bosses worth the 99% rest of the time doing better DPS?</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-01-09T08:28:52.787-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "275222",
    "ThreadId": "79779",
    "Html": "<p>I guess it depends on where your priorities are. &nbsp;My guild's best attempt on Putricide was &gt;30%, so the primary focus is getting the adds down as quickly as possible. &nbsp;The DPS I do on putricide himself is kinda worthless to me :P &nbsp;Of course, once our DPS is solid on bursting down the green ooze before it blows up the first time, and we're instead wiping on P3 where I don't touch the green ooze, then I'd prefer the scourgebane.</p>\r\n<p>If I had two of the same weapon, I'd have one with each, and then hit a hotkey to swap my weapon while running to the ooze (since there is a downtime, the loss of the GCD isn't that bad).</p>\r\n<p>In other words, you follow the same mantra as in any other situation: gear/spec/glyph/enchant for the progression fight. &nbsp;My Arms spec didn't have Juggernaut for the first 6 bosses of ICC, Algalon, Mimiron Firefighter, or anything in TOC, because there weren't any situations where I needed to charge (well, maybe Marrowgar, but he was never &quot;hard&quot;). &nbsp;Now that Putricide is our progression fight, I'm speccing back into Juggernaut. &nbsp;Is my DPS lower on all those other fights? &nbsp;Yeah, but who cares? &nbsp;They're not progression, and so the only DPS that I care about is on Putricide.</p>",
    "PostedDate": "2010-01-09T13:35:27.397-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]