[
  {
    "Id": "273302",
    "ThreadId": "79796",
    "Html": "<p>New crit mechanics have come to light, that it seems that some people aren't yet aware of.</p>\r\n<p>We all know that bosses have a 4.8% crit suppression, and 24% of our white attacks are glancing blows. &nbsp;However, what was previously unknown was if you could stack enough crit or hit to overcome these values.</p>\r\n<p>For yellow attacks, they do not glance. &nbsp;The crit suppression can be overcome by extra crit value. &nbsp;Consider Overpower, an ability with a 50% bonus chance to crit. &nbsp;If I have 50% crit chance, and I'm hit/expertise capped, my total crit chance is 50% from my stats + 50% from the ability = 100%. &nbsp;If I'm attacking a boss, that value is decreased by 4.8%, meaning I will crit 95.2% of the time and will hit 4.8% of the time. &nbsp;If I increased my crit chance to 54.8%, then I will overcome the crit suppression, and wind up having 100% of my overpowers crit.</p>\r\n<p>For white attacks, the mechanics are different. &nbsp;Consider when I am hit/expertise capped, and have a 24% chance to glance and 76% chance to crit. &nbsp;My attack table against a lvl 80 would be 24% glance, 76% crit, and no hits/misses. &nbsp;Against a boss with crit suppression, I have 24% chance to glance, 71.2% chance to crit, and 4.8% chance to hit. &nbsp;So far, it's the same as yellows, right?</p>\r\n<p>But if I increase my crit to 80.8% to try to overcome the crit cap, my white attacks will still be 24% glance / 71.2% crit / 4.8% hit. &nbsp;Glance cannot be overcome, no matter what. &nbsp;That 4.8% crit suppression cannot be overcome, no matter what. &nbsp;So, in this case, 71.2% is my crit cap.</p>\r\n<p>The full formula for the crit cap is:</p>\r\n<p>100% - 24% glance - 4.8% crit suppression - %dodge - %miss (also factor in parry and block for frontal-attacking like tanks, Auriaya, some Twin Valks strats, etc).</p>",
    "PostedDate": "2010-01-05T06:54:09.477-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "273360",
    "ThreadId": "79796",
    "Html": "<p>I don't think hunter white shots glance?</p>",
    "PostedDate": "2010-01-05T08:34:57.55-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "273369",
    "ThreadId": "79796",
    "Html": "<p>If they don't glance, I'd assume that the rest of the mechanics (that the 4.8% crit suppression cannot be overcome) still applies. &nbsp;This probably isn't a realistic scenario for hunters, who are usually white hit capped -- I'd be shocked to see a hunter with over 95% crit, but I guess with multiple procs it's possible for a short period of time.</p>",
    "PostedDate": "2010-01-05T08:52:08.253-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "290308",
    "ThreadId": "79796",
    "Html": "<p>Note: recent EJ testing has shown that the crit depression CAN BE OVERCOME FOR WHITE ATTACKS, and that the previous data came from a bug in Recount where partial blocks were displaying as hits (see Issue #16255). &nbsp;I know that DPSWarr, EnhSham, and Cat had made changes from the initial testing that showed it could NOT be overcome. &nbsp;DPSWarr has reverted this change, but I don't think that cat or enhance have.</p>\r\n<p>If you can, try to get this change reverted ASAP so we have the correct info out for 3.2.9.</p>",
    "PostedDate": "2010-02-12T13:47:54.29-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]