[
  {
    "Id": "273368",
    "ThreadId": "79810",
    "Html": "<p>Does Rawr have any minimum character level requirements,&nbsp;i.e.&nbsp;can it be used for low level (35-40) characters?</p>\r\n<p>I have a level 37 Mage that is an Enchanter (275) and I want to raise enchanting to 325 which requires leveling to&nbsp;50. Since his primary role has been as a crafter, I haven't worried too much about his gear but now that I have to level him, I need better gear!</p>\r\n<p>Rawr seems to be the perfect tool to help me with this task but I was overwhelmed with gear I won't be able to use for 10s of levels. I also found that I have enchants on some of my gear that aren't in the enchant lists (because they are lower level enchants?).</p>\r\n<p>If this is outside the scope of the project, please let me know.</p>\r\n<p>Regards,</p>\r\n<p>Brad</p>",
    "PostedDate": "2010-01-05T08:51:53.627-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "273376",
    "ThreadId": "79810",
    "Html": "<p>This is outside of the scope of the project, primarily because of the rating scale. &nbsp;A 20 hit rating gem in a level 30's gear is worth a whole lot more hit than one in a level 80's gear, and using a hit rating formula that also requires character level slows down the program (I'm not even sure if the formula for all rating scales are well known). &nbsp;Additionally, you're right, we're not modelling all enchants due to performance, and our gear lists are cut off for this reason as well (although you could update your item db with any items you want).</p>\r\n<p>To be perfectly honest, there's not a whole lot of min-maxing that's worth your time at low levels. &nbsp;You level so fast (especially with heirlooms) and replace level 30 blues with level 35 greens within a few days anyway. &nbsp;By the time you figured out what to do in Rawr, you could've leveled up to the point of that information being obsolete anyway.</p>\r\n<p>Your best bet is to probably just use the &quot;Find an Upgrade&quot; through armory, or browse the loot drops from instances, if you want to plan what to do (although I've found that just using a QuestHelper or leveling guide works just as well through the lower levels).</p>",
    "PostedDate": "2010-01-05T09:08:44.757-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "273380",
    "ThreadId": "79810",
    "Html": "<p>Thank you for the quick response.&nbsp; I'd suggest that you add some documentation to both this web site and perhaps to the program itself when it downloads a character below a supported level.</p>\r\n<p>Regards,</p>\r\n<p>Brad</p>",
    "PostedDate": "2010-01-05T09:20:15.963-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "273513",
    "ThreadId": "79810",
    "Html": "<p>http://rawr.codeplex.com/wikipage?title=FAQ&amp;referringTitle=Documentation</p>",
    "PostedDate": "2010-01-05T14:47:51.413-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "273557",
    "ThreadId": "79810",
    "Html": "<p>Thanks for the pointer to the FAQ (note: there's a formatting error in the last question/answer).</p>\r\n<p>I was thinking that the home page should read something like:</p>\r\n<p>&quot;Rawr is a program for comparing and exploring gear for Bears, Cats, Moonkin, Healadins, Retadins, Mages, DPS Warriors, Protection Warriors, Trees, Hunters, Protection Paladins, Healing Priests, Shadow Priests, Enhancement Shamans, Warlocks, Rogues, Restoration Shamans, Elementals, and DPS &amp; Tank Death Knights <span style=\"color:#ff0000\">at the level cap</span> in the MMORPG, World of Warcraft. Rawr has been designed from the start to be fun to use, and helpful in finding better combinations of gear, and what gear to obtain.&quot;</p>\r\n<p>Or you could add a paragraph on the home page something like:</p>\r\n<p>&quot;Rawr only produces valid results for characters at the level cap. It was not designed to be used as a character leveling tool. The World of Warcraft Armory (link?) &quot;Find an Upgrade&quot; is more suited for this task.&quot;</p>\r\n<p>My thought on a program change would be a popup dialog when you load a character from the armory that's not at the level cap that says something like:</p>\r\n<p>&quot;Character is not at the level cap (or not level 80). Rawr results may not be (or are not) valid.&quot; (with an OK button).&nbsp;</p>\r\n<p>This discussion has been very useful and I'm not trying to take away from Rawr. I will use and recommend it for use with level capped characters. I just think that being more up front about what it does do is a positive addition.</p>\r\n<p>Regards,</p>\r\n<p>Brad</p>",
    "PostedDate": "2010-01-05T17:02:02.47-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "273560",
    "ThreadId": "79810",
    "Html": "<p>Heh, thanks for that typographical heads up!&nbsp; :)&nbsp; For some reason, I believe there is some overt &quot;max-level&quot; qualifiers all over the place.&nbsp; We'll see what we can do about maybe making this detail even more clear, given your experience.</p>",
    "PostedDate": "2010-01-05T17:11:17.45-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]