[
  {
    "Id": "274540",
    "ThreadId": "80116",
    "Html": "<p>I am trying to model the Nibelung proc for use in Rawr. Per my testing, the value of a proc is about 27,000 damage over 30 seconds. I've tried to input this in the editor as a straight 27,000 damage &quot;on spell cast,&quot; but it doesn't seem to actually change my listed DPS.</p>\r\n<p>For comparison, the damage from Reign of the Dead seems to come across fine, but when I put similar values in for the staff, it's not working.</p>\r\n<p>Quite possibly this is a user training issue -- could someone more familiar with how Rawr handles procs take a look at this?</p>",
    "PostedDate": "2010-01-07T15:05:33.263-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "274574",
    "ThreadId": "80116",
    "Html": "<p>When I tried modeling it on my mage, I discovered 2 things:</p>\r\n<p>1. Nibelung is a chance on spell hit.&nbsp; Reign of the Dead/Unliving is a chance on spell crit.&nbsp; Chance on spell hit does not function, but chance on spell crit does.</p>\r\n<p>2. Nibelung is 'holy damage.'&nbsp; Reign of the Dead/Unliving is fire damage.&nbsp; Holy damage does not function, but fire damage does.</p>\r\n<p><br>Modeling Nibelung as a 15,000 fire damage on spell crit proc seemed to do the trick.&nbsp; I adjusted the chance to proc to be a little higher to account for it being on crit instead of hit.&nbsp; It won't be an exact estimate, but it's not bad either.&nbsp; Obviously, the moonkin model might be different, but it's worth a shot.</p>\r\n<p>On a side note, how did you get your 27,000 number?&nbsp; Is it pre- or post-buff? I heard reports of ~1k damage every 2 seconds from various forums, so I estimated 15k damage, but this was before the recent buff.</p>",
    "PostedDate": "2010-01-07T17:59:07.45-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "274575",
    "ThreadId": "80116",
    "Html": "<p>This was a post-buff estimate. The chance to hit was increased, and the damage was increased.</p>\r\n<p>My estimate may be a little high -- I was looking over my logs and realized that (as a Moonkin) I had procced Earth and Moon already for a 12% damage buff.</p>",
    "PostedDate": "2010-01-07T18:02:23.567-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]