[
  {
    "Id": "274887",
    "ThreadId": "80205",
    "Html": "<p>I've gotten a few issues created lately where users are telling me that they are getting really odd recommendations for Gemming and/or are seeing very low DPS numbers. Each time I've found several factors that are DRASTICALLY affecting their files. It looks like many are not doing more than just importing their characters and expecting everything to be set up automatically. Sad to say, this is not correct. I've added a Troubleshooting section to the Rawr.Hunter model status page (<a title=\"http://rawr.codeplex.com/wikipage?title=Rawr.Hunter\" href=\"http://rawr.codeplex.com/wikipage?title=Rawr.Hunter\">http://rawr.codeplex.com/wikipage?title=Rawr.Hunter</a>). I'm duplicating this text in it's current state here for your benefit.</p>\r\n<h1>Troubleshooting</h1>\r\n<p>Before creating an issue regarding the Hunter model, please verify that the following has been done:</p>\r\n<ol>\r\n<li><strong>Enforce Gem Requirements</strong> is Checked. Meta's need their blue gems!</li>\r\n<li><strong>All</strong> of your gear is marked as available for the Optimizer per <a href=\"../wikipage?title=GearOptimization&referringTitle=Rawr.Hunter\">this page</a>.</li>\r\n<li>You have not marked <strong>too much</strong> gear as this slows things down. Fishing Hats should be left off!</li>\r\n<li>You have gone to the <strong>Buffs Tab</strong> and marked the <strong>Buffs</strong> that you usually run with. A 10 man should have about 60% coverage and a 25 man would be about 90-100% coverage.</li>\r\n<li>You have gone to the <strong>Options Tab</strong>, found the <strong>Pet Buffs</strong> Tab and marked <strong>buffs for your Pet</strong> (note that many buffs don't show on this pane as they are provided by the Hunter instead).</li>\r\n<li>You are importing a <strong>Level Capped</strong> Character (presently <strong>80</strong>)</li>\r\n<li>You have gone to the <strong>Options Tab</strong>, <strong>Rotations</strong> Sub-Tab and selected your <strong>Shot Priority Rotation</strong> (there are presets for different builds, new presets are coming and the ability to save your custom ones will also come in future versions)</li>\r\n<li>You have gone to the <strong>Options Tab</strong>, <strong>Pet Talents</strong> Sub-Tab and selected your <strong>Pet Family</strong> and their respective talents</li>\r\n</ol>",
    "PostedDate": "2010-01-08T10:55:44.85-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "274926",
    "ThreadId": "80205",
    "Html": "<p>I've been wondering for a while: Why isn't &quot;Enforce Gem Requirements&quot; checked by default? When would you /not/ want it checked?</p>",
    "PostedDate": "2010-01-08T12:11:01.553-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "274931",
    "ThreadId": "80205",
    "Html": "<p>That's been asked and answered. Astry gets too many emails about &quot;why does this item get more value than this one&quot; and it's because the blue gemming is activating the Meta. For Rawr3 it WILL be active by default.</p>",
    "PostedDate": "2010-01-08T12:21:25.073-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]