[
  {
    "Id": "276781",
    "ThreadId": "80706",
    "Html": "<p>I have a 4xT9 bonus that combines a mix of some 232 and 245s (Gloves, Chest = 232 and Shoulders/Head = 245)</p>\r\n<p>http://www.wowarmory.com/character-sheet.xml?r=Lightbringer&amp;n=Pisomojado</p>\r\n<p>I have enough frost's to purchase the T10 251 shoulders and gloves but Rawr has been telling me not to. I tried telling it that I also had 251 legs available since I will have the frosts for that soon enough but it still didn't want me to break my bonus.</p>\r\n<p>The 4xT9 bonus doesn't seem that strong (&lt;2%). I haven't examined the itemization of the T10 vs T9 pieces or what the DPS impact of the 2xT10 bonus is, but I thought it was worth getting a sanity check on the results -- especially since the 2xT10 bonus might be a little &quot;odd&quot; to model.</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-01-13T10:41:14.093-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "276844",
    "ThreadId": "80706",
    "Html": "<p>If you look at the left panel, and select &quot;Buffs&quot; from the dropdown (Buffs &gt; Set Bonuses, if that appears for you; not sure if that's DPSWarr specific or if it's global). &nbsp;You can then see the value for the various set bonuses. &nbsp;If it shows as 0, then it has yet to be modeled :( &nbsp;If the value of the 2pc T10 bonus is different from what you expect, please open an issue on our Issue Tracker, and be sure to attach your character file.</p>",
    "PostedDate": "2010-01-13T12:55:13.993-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "276865",
    "ThreadId": "80706",
    "Html": "<p>I will take a look to see what happens if I manually equip 2xT10.&nbsp;</p>\r\n<p>I was doing a bit of reading on some of the EJ threads and from what it sounds like Helm, Chest, and Shoulders of T10 are all itemized pretty well. T9 except the legs is also. I'm going to also see if Rawr will pick Helm/Shoulders or Chest/Shoulders as an upgrade. Forums say that 2xT9 + 2xT10 is better than 4xT9.</p>\r\n<p>I also read that the 4xT9 bonus was nerfed -- any idea if that has been included in the model?</p>\r\n<p>I also saw a post that 4xT10 bonus is being (or perhaps just was) changed....</p>",
    "PostedDate": "2010-01-13T13:43:10.09-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]