[
  {
    "Id": "277063",
    "ThreadId": "80790",
    "Html": "<p>Hey, ive been wondering if you can customize the comparisonwindow on the right side of the screen, so you only get 1 of each item (the best ofc), so you dont have 3-4 of the same item with dif gems.. Just want the best possible available. The list seems abit to long with multiples of the same item :)</p>",
    "PostedDate": "2010-01-14T03:24:58.867-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "277149",
    "ThreadId": "80790",
    "Html": "<p>http://rawr.codeplex.com/documentation</p>\r\n<p>&nbsp;</p>\r\n<p>Ok - that link isn't exactly newbie-friendly, but the answer is in there, I promix - I found it once.</p>",
    "PostedDate": "2010-01-14T07:13:56.537-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "277237",
    "ThreadId": "80790",
    "Html": "<p>Under gemming templates is a setting for the number of gemming options to show, which defaults to 3.</p>",
    "PostedDate": "2010-01-14T10:36:42.393-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "277648",
    "ThreadId": "80790",
    "Html": "<p>Edit:&nbsp; Bah!&nbsp; Alright, I thought this was accurate.&nbsp; It isn't, ignore it.</p>\r\n<p>\r\n<hr>\r\n</p>\r\n<p>Keep in mind though that this will also limit options - there's a reason multiple gemmings are the default.</p>\r\n<p>Let's say you have a ret paladin that is looking at a&nbsp; leg item with three sockets, one of each color.&nbsp; One gemming template will provide [unless I misunderstand the way it works]:</p>\r\n<p>STR&nbsp;&nbsp; STR&nbsp;&nbsp;&nbsp; STR</p>\r\n<p>While if you have two templates it might display</p>\r\n<p>STR&nbsp;&nbsp; STR&nbsp;&nbsp;&nbsp; STR</p>\r\n<p>STR&nbsp;&nbsp; STR/HIT&nbsp;&nbsp; STR/STAM</p>\r\n<p>or if you have three,</p>\r\n<p>STR&nbsp;&nbsp; STR&nbsp;&nbsp;&nbsp; STR</p>\r\n<p>STR&nbsp;&nbsp; STR/HIT&nbsp;&nbsp; STR/STAM</p>\r\n<p>STR&nbsp;&nbsp;&nbsp; STR/CRIT&nbsp;&nbsp; STR/STAM</p>\r\n<p>Now, the default of all STR gems looks pretty good; but what if the socket bonus is +8 STR?&nbsp; With epic gems, the effective DPS of the STR/CRIT and STR/STAM + Socket bonus might exceed the pure STR/no bonus option.&nbsp; It gets even better if you aren't hit capped by gear, since hit is rated so incredibly highly.</p>",
    "PostedDate": "2010-01-15T09:43:29.04-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "277663",
    "ThreadId": "80790",
    "Html": "<p>Karinda, I understand what you were trying to say but unfortunately your premise is faulty. We don't force it to just the 1 template. It shows the *highest dps* template after checking each one.</p>\r\n<p>So if 'STR STR STR' is highest gemming for that item it will show that but if 'STR STR/CRIT STR/STAM' is highest on another (for activating a Meta since that's the only way that would happen) then it would show that one.</p>",
    "PostedDate": "2010-01-15T10:04:38.147-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "277684",
    "ThreadId": "80790",
    "Html": "<p>Additionally, three seems to be a well-balanced number of default gemming templates, for my own personal usage at least.&nbsp; If you still find the Comparisons window too filled with information, consider looking at your item filters, and turn off all of the filters aside from those that you are actively considering for your current gear level and your potential upgrades for the immediate future.</p>",
    "PostedDate": "2010-01-15T11:03:32.517-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]