[
  {
    "Id": "277153",
    "ThreadId": "80829",
    "Html": "<p>The Trinket Spark of Hope should be noted as something to aid in sustained HPS due to it equaling a MP5 effect that scales with the amount of haste one has. However, looking at the graphs, it shows up as 0 for burst and 0 sustained; why?</p>\r\n<p>Also, for Althor's Abacus, is the healing proc added to the hps of the item, or just the SP?</p>\r\n<p>As an aside, is there an idea as to when the 2 and 4 T10 set bonuses will be added?</p>",
    "PostedDate": "2010-01-14T07:27:43.497-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "277470",
    "ThreadId": "80829",
    "Html": "<p>Spark of Hope does aid sustained HPS by about 578.6 HPS here. Most likely you are not seeing any increase in healing because you are expected to being able to run the entire fight without going out of mana.</p>\r\n<p>&nbsp;</p>\r\n<p>Althor's Abacus is added to the HPS of the item along with the SP.</p>\r\n<p>&nbsp;</p>\r\n<p>2/4pT10 for Healing is being looked into. Reason I'm not just adding it at face value is that I'm looking at peoples experience with it. Seems like 2pc is somewhere between horrible to slightly useful. I expect 4pc to gain a similar status. Implementing both bonuses directly into the model would right now vastly overvalue them.</p>",
    "PostedDate": "2010-01-14T23:04:06.14-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "277475",
    "ThreadId": "80829",
    "Html": "<p>any word on recursive support on trinkets. Specifically the Talisman of Volatile Power, which right now is only supporting to Crit on the trinket</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-01-14T23:48:35.037-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "277499",
    "ThreadId": "80829",
    "Html": "<p>Thats surely an annoying trinket. I need to think about it, as the Use combined with a Damaging spell hit proc giving a haste buff is kinda annoying to model. (As in, I think I'm going to have to forsake some accuracy for just having it work.) Most likely you can change it to a Use for stacks*rating for duration-5s and have it be fairly accurate. For normal that would be 8*57 = 456 haste rating over 15 seconds (instead of 20 seconds).</p>",
    "PostedDate": "2010-01-15T01:15:33.243-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]