[
  {
    "Id": "277987",
    "ThreadId": "81050",
    "Html": "<p>I saw this blue post today:</p>\r\n<p><a href=\"http://forums.worldofwarcraft.com/thread.html?topicId=22418707360&sid=1&pageNo=6#103\">http://forums.worldofwarcraft.com/thread.html?topicId=22418707360&amp;sid=1&amp;pageNo=6#103</a></p>\r\n<p style=\"padding-left:30px\">We changed the way PPM procs work to make sure many of the weapons and trinkets did their expected performance in Icecrown instead of proc'ing too much for some specs or classes or forcing players into unusual behavior to try and fish for the procs. This change also affected some older mechanics in the game too such as the Berserking enchant. For the most part the intent is that these systems all proc off of attacks and they are balanced with that assumption.</p>\r\n<p>Have we adjusted according to what the changes are? I have to admit since I play a tanking class I haven't been following, e.g., Rogue threads about testing what changes were actually made. However, did feel like perhaps we should take a look at it if we haven't already.</p>",
    "PostedDate": "2010-01-16T13:12:41.113-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "278006",
    "ThreadId": "81050",
    "Html": "<p>Well, Berserking and Mongoose and the like are included with their PPM based on just autoattacks. The change that was made is that several things no longer have a chance to proc these effects. That includes things like Ret holy dots, rogue poisons, etc. So this is up to the individual models to adjust their proc chance frequencies for.</p>",
    "PostedDate": "2010-01-16T14:46:25.303-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "278027",
    "ThreadId": "81050",
    "Html": "<p>Ok, as long as they are only talking about specific abilities being disabled then I suppose that's no issue for Warriors as I don't believe anything was changed.</p>\r\n<p>Just wasn't 100% certain if the community had identified any&nbsp;other &quot;general&quot; changes.</p>",
    "PostedDate": "2010-01-16T16:26:00.343-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "278049",
    "ThreadId": "81050",
    "Html": "<p>Basically, MeleeHit and PhysicalHit triggers were happening off of things that weren't weapon swings/damage, like Poisons, the Shadow Damage component of scourge strike, etc.</p>\r\n<p>As far as warriors are concerned, unless you were counting damage procs or deep wounds activates/ticks in your calculations, you're fine.</p>",
    "PostedDate": "2010-01-16T18:23:12.883-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "279094",
    "ThreadId": "81050",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>Astrylian wrote:</strong><br>\r\n<p>Well, Berserking and Mongoose and the like are included with their PPM based on just autoattacks. The change that was made is that several things no longer have a chance to proc these effects. That includes things like Ret holy dots, rogue poisons, etc. So this is up to the individual models to adjust their proc chance frequencies for.</p>\r\n</blockquote>\r\n<p>To clarify this, the calculated PPM was based on auto attacks but the modeled effect is by default factoring in all white and yellow hits right?</p>\r\n<p>The individual models may have added additional triggers if they wanted to (Cat probably didn't) based on the observed case that other effects used to proc it...but that isn't (and wasn't) part of the Rawr base model to factor these into up time?</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-01-19T10:32:40.717-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "279108",
    "ThreadId": "81050",
    "Html": "<p>Yes, that's all correct.</p>",
    "PostedDate": "2010-01-19T10:47:15.917-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]