[
  {
    "Id": "278443",
    "ThreadId": "81157",
    "Html": "<p>Hi everyone,</p>\r\n<p>I run a level 80 Druid and&nbsp;I have 4 main sets of gear.&nbsp;</p>\r\n<p>Cat, Bear, Tree and now boomkin, &nbsp;thanks to ICC's 4th boss! (Not gonna count the Feral &amp; caster PVP sets). All sets are over 5K Gear score.</p>\r\n<p>LOL, Respeccing back and forth alot, like the old days of one spec.&nbsp; Feral/Resto, balance/Resto, Feral/Balance</p>\r\n<p>(New user) I'm hoping Rawr is going to make it easier for me to figure out gear for my different specs.</p>\r\n<p>I was wondering if there is/will be a function in Upgrades that sorts upgrades by location..&nbsp; ie 10 man Togc has more upgrades. (also, the ability to compare across multiple specs would be nice :)</p>\r\n<p>Maybe a locations tab/option that would allow you to click/select locations&nbsp;and filter locations by upgrade for spec listings. Possibly even based on spec's/players gearscore/weight vs level of raid/dungeon (More efficient use of Dungeon/raiding time)..&nbsp; ie .. A Medium geared&nbsp;player - wants to know what gear to get, where to go next to get it.&nbsp; Obvoiusly ICC 25 heroic would all be upgrades, but the player isn't&nbsp;geared to do that.&nbsp;..&nbsp;&nbsp;&nbsp;Player runs the query and &quot;Badda-Bing-Badda-boom&quot;&nbsp; List has upgrades sorted by raid/dungeon lvl,&nbsp;&nbsp;</p>\r\n<p>Herioc FOS&nbsp;&nbsp;&nbsp;</p>\r\n<p>&nbsp;3 items,&nbsp;&nbsp; XXX&nbsp;&nbsp; XXX&nbsp;&nbsp; XXX (listed them on same row to save space)</p>\r\n<p>Heroic POS&nbsp;</p>\r\n<p>&nbsp; 1 item&nbsp;&nbsp; XXX</p>\r\n<p>etc. (Could possibly even have a spec/build field)</p>\r\n<p>Also, does it have an upgrade scale/gear option that could be used to determine best items that could be used for both Cat/bear or tree/boomer.</p>\r\n<p>Thanks,</p>\r\n<p>Mideran - Attempting to Master Druid &lt;Grin&gt;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-01-18T02:33:43.867-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "278552",
    "ThreadId": "81157",
    "Html": "<p>An interesting suggestion, but I don't see it coming in the near future. &nbsp;Your best bet would be to utilize the &quot;Filters&quot; extensively. &nbsp;Filter everything out but a few locations, then run &quot;Build Upgrade List&quot;.</p>\r\n<p>For multiple specs/characters where you are only using one gem/enchant for it (ie, an item that you may use in both balance and resto, or both cat and bear), look into using the Batch Tools. &nbsp;You can assign a weight to each character's score (if you want them all equal, make each one the same number). &nbsp;You can build an upgrade list from there to see what item gives you the biggest bang for your buck.</p>\r\n<p>The one thing we've talked about before that I *can* see us doing is enabling filters on the Build Upgrade List results window. &nbsp;So you can turn everything on, build the upgrade list once, then drill down to different locations and see what has the most that way.</p>",
    "PostedDate": "2010-01-18T08:34:19.333-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "278664",
    "ThreadId": "81157",
    "Html": "<p>You can also use Excel (or OpenOffice, or whatever).&nbsp; Build an Upgrade List, use the &quot;Export to CSV&quot; option, import that CSV into the spreadsheet software of your choice, and then organize by location.&nbsp; Sure, it might not be the more elegant solution given the process, but it should work fine for your purposes.</p>\r\n<p>However, now that I think about it, we don't grab instance info for items, do we?&nbsp; In other words, we mention the boss, but not the instance that is located in.&nbsp; Hrm.&nbsp; Ignore me.</p>",
    "PostedDate": "2010-01-18T14:50:14.363-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]