[
  {
    "Id": "279524",
    "ThreadId": "81447",
    "Html": "<p>I probably missed this option somewhere and didn't realize it.&nbsp; Is there a way to disable or set yourself what you want your hit % to be?&nbsp; I know with spell casters you can check misery and fake the 3% hit off that.&nbsp; But for Dual Wielders I noticed most of the optimizers will show trinkets and pieces that would put you at the 27% Dual Wield hit cap saying they are better than any item.&nbsp; I know there's probably a way to check each piece off and then run it through the slow optimizer.&nbsp; Just wondering if there's a way to do it in the side pane so you can get a more ideal thought on other pieces.</p>",
    "PostedDate": "2010-01-20T08:16:35.823-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "279549",
    "ThreadId": "81447",
    "Html": "<p>If you are dual wielding and we are showing that more hit would be better than otherwise to a certain point then it probably is.</p>\r\n<p>If you gave more info (like what model you are talking about), we could assist further.</p>",
    "PostedDate": "2010-01-20T08:56:11.517-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "279558",
    "ThreadId": "81447",
    "Html": "<p>Enhancement Shamans are one I know of for sure, from what I've seen Rogues as well as Fury Warrior.&nbsp; Enhancement shamans only want up to 14/17% hit and that is for their spell.&nbsp; Anymore hit than that and they are wasting itemization points since it only benefits Dual Wield slightly.&nbsp; Rogues cap their poisons then once they are there they stop.&nbsp; Fury Warriors cap up to 5%/8% then stop as their specials are capped.&nbsp; As far as I know every class hits a certain point then stops as capping for Dual Wield is unnecessary or so I've seen from the tons of posts I read.&nbsp; I've just now started experimenting with Frost DK's but I'm sure they would be in the same situation.</p>",
    "PostedDate": "2010-01-20T09:07:18.67-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "279566",
    "ThreadId": "81447",
    "Html": "<p>And in all these models it should be working properly are you saying that you are experimenting and ALL of these try to enforce the 27% hard hit cap when you run optimizes? (Note that the Comparisons list and Optimize are two different things).</p>",
    "PostedDate": "2010-01-20T09:16:59.833-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "279647",
    "ThreadId": "81447",
    "Html": "<p>For dual wield classes (at least Dual Wield DKs) if you select Chance to Miss as an optimizer requirement, and set it to 0%, the optimizer will attempt to optimize around the white hit cap and not the yellow hit cap.</p>\r\n<p>This could potentially yield and additional requirement choice for the optimizer to select from (such as Special Chance to Hit) to alleviate this issue.</p>",
    "PostedDate": "2010-01-20T11:47:35.603-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "279652",
    "ThreadId": "81447",
    "Html": "<p>It has done it in the optimizer and comparison window for me.&nbsp; If possible I'd like to know if there's way to adjust it in the comparison window as I use that one more to get a rough idea before going through the adjustments needed to go into the optimizer.&nbsp; Comparison window I just use as a quick and dirty &quot;wishlist&quot; without running the optimizer which will tell me if I had all the stars align and I had each piece I wanted :P</p>",
    "PostedDate": "2010-01-20T11:51:06.39-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "279691",
    "ThreadId": "81447",
    "Html": "<p>No, there isn't, if it really is a direct upgrade (even tho it's jut more hit) then it is a direct upgrade.</p>",
    "PostedDate": "2010-01-20T12:56:42.603-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "279695",
    "ThreadId": "81447",
    "Html": "<p>So your saying its fine even though it'll register a Hit Trinket &gt; trinket with actual stats.</p>\r\n<p>Example:</p>\r\n<p>[Mark of Supremacy] [Shard of the Crystal Heart] will come up being better for most classes that Dual Wield than [Needle-Encrusted Scorpion]</p>\r\n<p>I've noticed it on Enhancement Shamans, DK's who Dual Wield, Rogues and even Fury warriors.&nbsp; It will show it even if they are capped for Specials and/or whatever their recommended caps are.&nbsp; No one gears for DW hit cap unless it just happens to fall on a piece of gear that is an upgrade.&nbsp; The windows will show that its sometimes a 50-100+ dps increase over items like the example above.&nbsp; Either I'm doing something completely wrong for a long time now or I'm missing something.&nbsp; Unless recent tests have came out showing DW caps &gt; other stats I'm not sure what I'm missing from the equation.</p>",
    "PostedDate": "2010-01-20T13:02:02.483-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "279702",
    "ThreadId": "81447",
    "Html": "<p>Direct comparison, those items COULD be better than others even at the 8% cap, that's not telling you to go to the DW cap.</p>\r\n<p>Are you saying you are running the Optimizer and thats automatically going for the 27% DW cap (without setting any optimizer requirements)?</p>",
    "PostedDate": "2010-01-20T13:09:52.36-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "279707",
    "ThreadId": "81447",
    "Html": "<p>Its telling me that its better for a shaman who has 19% (+6% from talents) hit rating due to bad luck with trinkets.&nbsp; Its doing the same with a rogue who has 14.67% rating.&nbsp; What I'm trying to figure out is how hit trinket &gt; crit trinket when over hit cap and such.</p>\r\n<p>Yes its doing it in the comparison window and optimizer.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-01-20T13:18:49.46-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "279715",
    "ThreadId": "81447",
    "Html": "<p>Rogues want extra hit because poisons use Spell Hit and a Large portion of their damage DOES come from their really fast white DPS. Also, the Rogue model is out of date due to lack of Developer.</p>\r\n<p>Shamans want it to fulfill their Spell Hit numbers</p>\r\n<p>DW DK's similar to Shamans</p>\r\n<p>Any other dev's wanna chime in here?</p>",
    "PostedDate": "2010-01-20T13:35:33.053-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "280079",
    "ThreadId": "81447",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>Jothay wrote:</strong><br>\r\n<p>Rogues want extra hit because poisons use Spell Hit and a Large portion of their damage DOES come from their really fast white DPS. Also, the Rogue model is out of date due to lack of Developer.</p>\r\n<p>Shamans want it to fulfill their Spell Hit numbers</p>\r\n<p>DW DK's similar to Shamans</p>\r\n<p>Any other dev's wanna chime in here?</p>\r\n</blockquote>\r\n<p>Those would be fine and understandable if my post above didn't show their hit caps.</p>\r\n<p>Normal Melee hit cap = 8%</p>\r\n<p>Spell Hit Cap = 17% (most go to 14% to account for spriest/boomkin)</p>\r\n<p>Dual Wield Cap = 27%</p>\r\n<p>Now as about the rogue has 14.67% (481) melee hit rating which equates to 18.34% (481) hit rating all before talents.&nbsp; After talents they gain 5% to hit and poison attacks.&nbsp; This now brings their melee hit rating to 19.67% and their spell hit to 23.34% hit rating.&nbsp; Now according to Elitist Jerks (just sourcing them as that's what most guy by after their testing) it suggests that a rogue who specs for Precision (5% hit talent) that they want the following:</p>\r\n<table id=sorttable8386 border=0>\r\n<thead> \r\n<tr>\r\n<th><a href=\"http://elitistjerks.com/#\">Extra buffs or debuffs<span>&nbsp;</span></a></th><th><a href=\"http://elitistjerks.com/#\">Specials<span>&nbsp;</span></a></th><th><a href=\"http://elitistjerks.com/#\">Poisons<span>&nbsp;</span></a></th><th><a href=\"http://elitistjerks.com/#\">White<span>&nbsp;</span></a></th>\r\n</tr>\r\n</thead> \r\n<tbody>\r\n<tr>\r\n<td>None</td>\r\n<td>99</td>\r\n<td>315</td>\r\n<td>722</td>\r\n</tr>\r\n<tr>\r\n<td><a href=\"http://www.wowhead.com/?spell=33602\">Imp FF</a> or <a href=\"http://www.wowhead.com/?spell=33193\">Misery</a></td>\r\n<td>99</td>\r\n<td>237</td>\r\n<td>722</td>\r\n</tr>\r\n<tr>\r\n<td><a href=\"http://www.wowhead.com/?spell=33602\">Imp FF</a> or <a href=\"http://www.wowhead.com/?spell=33193\">Misery</a> &amp; <a href=\"http://www.wowhead.com/?spell=28878\">Heroic Presence</a> (draenei)</td>\r\n<td>66</td>\r\n<td>210</td>\r\n<td>689</td>\r\n</tr>\r\n</tbody>\r\n</table>\r\n<p>Next up is the Enhancement Shaman.&nbsp; Their hit rating is 19.95% (654) melee hit and 24.93% (654) spell hit rating before talents.&nbsp; After talents are factored in they sit at 25.95% melee hit rating (6% from DW Specialization) and 24.93% spell hit (No spell hit talents).&nbsp; From that alone they are 7-10% over spell hit cap but still wants them to reach that DW cap.&nbsp; Now as a member of the horde one would want to hit 368 hit rating as that would place them at spell hit cap.</p>\r\n<p>Death Knights are in the same boat as Shamans, however DK's only want to gear up to the 8% hit cap, take 3% spell hit from talents and the hit rating from Offhand talent in Frost.&nbsp; Other than that they do not want to go any higher than 8% as it affects very little or so from the posts I've read.</p>\r\n<p>Not sure if any of that helps in trying to portray what I'm saying.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-01-21T08:25:57.977-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "280119",
    "ThreadId": "81447",
    "Html": "<p>Could crit cap be figuring in these cases?</p>\r\n<p>I know as an Enhancement Shaman, once hit is providing white crit for every point as well as its usual benefit above spell cap, it becomes our best stat. I'm pretty sure rogues work the same way because more hit means more poison procs and if hit gives crit point for point it overtakes AP's DPS gain.</p>\r\n<p>Just a thought.</p>",
    "PostedDate": "2010-01-21T09:32:33.943-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "280120",
    "ThreadId": "81447",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>Lchaim wrote:</strong><br>\r\n<p>Could crit cap be figuring in these cases?</p>\r\n<p>I know as an Enhancement Shaman, once hit is providing white crit for every point as well as its usual benefit above spell cap, it becomes our best stat. I'm pretty sure rogues work the same way because more hit means more poison procs and if hit gives crit point for point it overtakes AP's DPS gain.</p>\r\n<p>Just a thought.</p>\r\n</blockquote>\r\n<p>Not sure -- The crit cap theory would be the first I've heard.&nbsp; Generally its Hit/Expertise Cap then you want Haste up until a certain amount which would in turn cause more Windfury's providing its not on cooldown at the moment as well as Maelstrom procs.&nbsp; Rogues I'm not sure of as I don't play one, but help out a rogue in our guild with info I've researched.&nbsp; Not sure how their poisons work, but I know if 3.3 they changed poisons for the offhand to proc the mainhand after 5 stacks, but that is all I know.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-01-21T09:35:36.517-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "280138",
    "ThreadId": "81447",
    "Html": "<p>Currently, the rogue model is being worked on, so it's numbers I believe may still be suspect.</p>\r\n<p>I notice you keep using 'up until' and 'only want'. &nbsp; That's not how it works sadly. &nbsp;What we kind of would need to know is what two trinkets you are actually talking about. &nbsp;If, say, you were comparing the Mirror of Truth to Pyrite Infuser, perhaps that extra 230 AP on the proc is out-weighing the 84 crit. &nbsp;Trying to compare trinkets off just static stats alone is always a bit wonky. &nbsp;And also, ArP procs are pretty much wasted on Enhance, if you are wondering why a 232 trinket is not even beating the 200 badge trinket, it's because it's armor pen. &nbsp;Now, the question I have for you, since you think that it's rating Hit even though you are past cap, Does it compare Needle Encrusted Scorpion as worse or better then Grim Toll? &nbsp;If it's worse then Grim Toll and you are sure that you are way past hit cap, that might be worth posting an issue in the issue tracker over with your character's XML. &nbsp;If not, I'd say it's valuing hit correctly, and it's the proc that's just that wretched.</p>",
    "PostedDate": "2010-01-21T09:57:08.243-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "280144",
    "ThreadId": "81447",
    "Html": "<p>Fury dev chiming in here.</p>\r\n<p>Hit and Expertise are your most valuable stats to soft-cap (expertise comes at 26 skill in the main hand, hit comes at 164 rating). &nbsp;Once you hit 26 expertise, expertise is completely worthless; nothing is dodged anymore (if you are in front of the boss sometimes, then it will still improve your dps slightly, but the best fix is to stand behind the boss).</p>\r\n<p>Hit, on the other hand, still retains SOME value past the soft-cap. &nbsp;Your specials are no longer missing, this is true, but your offhand swings are a major contributor to your rage, and thus to your heroic strikes. &nbsp;It isn't as strong as str/crit/arp in a vacuum (ie, if you were comparing a trinket with 100hit +1500ap proc, and 100crit +1500ap proc). &nbsp;But if you're looking across different ilvls of gear (like a 245 trinket with hit vs a 200 trinket with crit, ie 120hit +1300ap proc with 80crit +1000ap proc), it is possible that the hit trinket is better. &nbsp;You get 300 more AP on the proc, and even though hit is only 60% as strong as crit, you still are getting 50% more. &nbsp;120*0.6 = 72, so 120hit = 72crit. &nbsp;In the end, it winds up being 8crit vs 300 procced AP, and the Hit trinket wins.</p>\r\n<p>Make sense?</p>\r\n<p>Long story short, hit is weaker past the cap, but it's not worthless. &nbsp;If you are seeing something that looks wrong, post an issue and attach the character file and why you think it's wrong. &nbsp;We'll look at it and tell you whether you found a bug or explain why it's right.</p>",
    "PostedDate": "2010-01-21T10:17:10.04-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "280149",
    "ThreadId": "81447",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>antivyris wrote:</strong><br>\r\n<p>What we kind of would need to know is what two trinkets you are actually talking about. &nbsp;If, say, you were comparing the Mirror of Truth to Pyrite Infuser, perhaps that extra 230 AP on the proc is out-weighing the 84 crit. &nbsp;Trying to compare trinkets off just static stats alone is always a bit wonky. &nbsp;And also, ArP procs are pretty much wasted on Enhance, if you are wondering why a 232 trinket is not even beating the 200 badge trinket, it's because it's armor pen.</p>\r\n</blockquote>\r\n<p>As I posted above pretty much any trinket with +hit as the base stat is being valued as higher than any trinket with static stats.</p>\r\n<p>Such as Elemental Focusing Stone, Pyrite Infuser, Grim Toll, Shard of the Crystal Heart,&nbsp; Mark of Supremacy, to name a few are being valued higher than Mirror of Truth, Needle Encrusted Scorpion, Fury of Five Flights, Greatness.&nbsp; The only trinket I managed to see that would be above them all would be Herkuml War Token from the frost vendor.&nbsp; While ArP isn't the best stat to stack for an enhancement shaman it does not hurt them either when its some of the stats they can get due to it affecting their White Damage, Stormstrikes and Windfury procs.</p>",
    "PostedDate": "2010-01-21T10:21:18.433-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "280151",
    "ThreadId": "81447",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>ebs2002 wrote:</strong></blockquote>\r\n<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\">Hit, on the other hand, still retains SOME value past the soft-cap. &nbsp;Your specials are no longer missing, this is true, but your offhand swings are a major contributor to your rage, and thus to your heroic strikes. &nbsp;It isn't as strong as str/crit/arp in a vacuum (ie, if you were comparing a trinket with 100hit +1500ap proc, and 100crit +1500ap proc). &nbsp;But if you're looking across different ilvls of gear (like a 245 trinket with hit vs a 200 trinket with crit, ie 120hit +1300ap proc with 80crit +1000ap proc), it is possible that the hit trinket is better. &nbsp;You get 300 more AP on the proc, and even though hit is only 60% as strong as crit, you still are getting 50% more. &nbsp;120*0.6 = 72, so 120hit = 72crit. &nbsp;In the end, it winds up being 8crit vs 300 procced AP, and the Hit trinket wins.</blockquote>\r\n<p>From what you posted it makes sense and I was thinking along those lines.&nbsp; The Fury Warrior I haven't noticed it as much of an issue there's probably been a piece or two that was questionable.&nbsp; The Rogues/Enhancement Shamans are the ones I see it being the most wonky.</p>",
    "PostedDate": "2010-01-21T10:22:24.843-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "280173",
    "ThreadId": "81447",
    "Html": "<p>Do not trust <em>ANY</em>thing that comes out of the Rogue model right now.&nbsp; As we have no current Rogue developer, it is woefully out of date.&nbsp; To be more clear, <strong>Anything you see in the Rogue model should be taken as inaccurate until such time as we get a Rogue developer to bring the model back up to speed.</strong>&nbsp; The Rogue model very well may have this issue, in addition to its long list of other problems.</p>",
    "PostedDate": "2010-01-21T10:56:14.67-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "280695",
    "ThreadId": "81447",
    "Html": "<p>There was also a problem with Rawr.Enhancement quite some time ago now where it was valuing hit excessively; but that shouldn't be a problem unless you're running a woefully out of date version of Rawr.</p>\r\n<p>Assuming that's not the problem, from the trinkets you listed, the ones with hit tend to outperform the ones without hit for Enhancement Shamans. I've simmed most of them at one time or another and generally my best options from that list were Elemental Focusing Stone and Pyrite Infuser. Also unlike for most classes, Greatness is very underwhelming for an Enhancement Shaman; I've never seen it come out ahead of Pyrite Infuser.</p>",
    "PostedDate": "2010-01-22T11:16:41.167-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "280711",
    "ThreadId": "81447",
    "Html": "<p>I'm working on the Rogue model and have added this to my list of things to look into, but as Lchaim said hit is becoming worth more even when over the poison cap if you're at really high crit %s, I have no idea yet if this is modeled correctly in the Rogue model though :)</p>",
    "PostedDate": "2010-01-22T11:52:42.003-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]