[
  {
    "Id": "279532",
    "ThreadId": "81452",
    "Html": "<p>I've been having alot of trouble with missing items as well as general confusion.&nbsp; I wanted to look at &quot;Belt of Omission&quot; and it wasn't in the list.&nbsp; This is an item you can buy from vendors in dalaran with frost badges.&nbsp; Also, I don't know if this is true with all classes or just warlocks, the iLevel 251 items don't show up as well.&nbsp; These are the items you buy from the class vendor inside icecrown citadel.&nbsp; But the iLevel 264 upgrades that you buy with the iLevel 251 items plus a trophy are listed.</p>\r\n<p>The second part of my question has to deal with upgrades.&nbsp; When I select an item why is the list on the right and the optimize result so diffrent.&nbsp; I'll give you an example.&nbsp; I went ahead and bought the &quot;Belt of Omission&quot;.&nbsp; If I select it the list on the right tells me the best gemming configuration is 3 +23 spellpower gems.&nbsp; If I run the optimizer it tells me the best gemming configuration is 2 +12 spellpower/+10 haste and a +12 spellpower/+10 spirit gem.</p>",
    "PostedDate": "2010-01-20T08:29:35.2-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "279547",
    "ThreadId": "81452",
    "Html": "<p>http://rawr.codeplex.com/Thread/View.aspx?ThreadId=81362</p>",
    "PostedDate": "2010-01-20T08:54:32.2-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "279553",
    "ThreadId": "81452",
    "Html": "<p>Thanks, sorry I didn't see that.&nbsp; Where do you set it so that those special items will show up.&nbsp; Can you give me some insight on my second question as well.</p>",
    "PostedDate": "2010-01-20T09:00:04.097-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "279555",
    "ThreadId": "81452",
    "Html": "<p>Filters are in the Upper Right side of the screen, on the same bar as the Chart Selector.</p>\r\n<p>Because the Optimizer is trying to maximize your gear considering all of your restraints, the comparisons window is just a direct &quot;this config does better in this slot, regardless of other slots major changes&quot;</p>",
    "PostedDate": "2010-01-20T09:02:56.123-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "279774",
    "ThreadId": "81452",
    "Html": "<p>Just a note that for the Mage build, the following chest item is missing from the database:&nbsp; Mord'rethar Robes, a rare level 232 drop from the Devourer of Souls in Heroic Forge of Souls.&nbsp; My filters are appropriately set, as I was informed a couple of days ago about them.&nbsp;&nbsp; You can find this item on Thottbot or in the Armory, so I suspect it is listed most everywhere.&nbsp; It would be nice to see it in the database to compare it with gemmed chests such as the level 226 Conqueror's Kirin Tor Tunic.&nbsp; I will put it on and see what happens to Rawr with it on.</p>\r\n<p>Having doned it, I now see that the robes are inferior to the Kirin Tor piece I am currently wearing.&nbsp; Had I know that, I would have passed on the item while in the instance and allowed someone else to take it.&nbsp; Way it goes.</p>\r\n<p>I don't know if it happens, but it would be nice if the Rawr software were designed to upload new pieces of equipment to the database when they are encountered.&nbsp; Just a thought.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-01-20T16:31:43.5-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "279776",
    "ThreadId": "81452",
    "Html": "<p>If you dont have it (even in the Item Editor) then just add the item manually.</p>",
    "PostedDate": "2010-01-20T16:34:35.81-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "279817",
    "ThreadId": "81452",
    "Html": "<p>To make sure that an item isn't hiding in some weird filter, you can make a new filter called &quot;all&quot; and leave all the criteria as they appear.&nbsp; That way, if you select that filter it will show absolutely everything (except maybe the BoP crafted filtered stuff or the iLvl filtered stuff).</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-01-20T18:47:58.773-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]