[
  {
    "Id": "280201",
    "ThreadId": "81614",
    "Html": "<p>How do I keep it from putting gems in my gear during optimization?&nbsp; I've selected no gems and no enchants.&nbsp; My gear is all crap right now and as a level 80 I don't want to spend 2000 gold putting gems in my level 70 spellfire/spellstrike gear.&nbsp; I want those pieces to be considered during optimization but only as they stand right now, without putting expensive gems in.&nbsp; Does anyone know?</p>",
    "PostedDate": "2010-01-21T11:49:13.85-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "280214",
    "ThreadId": "81614",
    "Html": "<p>First of all, what kind of gem costs 500g?!?!&nbsp; Anyways, this is easily solved - go to the Gemming templates and deactivate the &quot;Epic&quot; gems, in favor of the &quot;Rare&quot; gems.&nbsp; Accordingly, pull up the Comparisons &gt; Gems &gt; Normal, and select all applicable Rare gems.</p>",
    "PostedDate": "2010-01-21T12:22:29.947-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "280249",
    "ThreadId": "81614",
    "Html": "<p>lol.&nbsp; you're right, not 500 gold.&nbsp; I meant to say 500g worth of gems.&nbsp; Thanks for the help.&nbsp; I had been adjusting gems in the comparisons list but didn't know about the gemming templates.&nbsp; That took care of the problem.</p>\r\n<p>&nbsp;</p>\r\n<p>Thanks again.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-01-21T13:26:04.613-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "280294",
    "ThreadId": "81614",
    "Html": "<p>Actually, speaking of Gemming templates, is there a way to have the regular graphs find the best gemming without using templates like the optimizer does? I assume it uses the templates to save time, but what if time isn't really an issue? Can it at least be an option?<br> If I want to exclude certain rare/expensive cuts from the lists, it is very annoying to practically re-create the entire list of gems minus a few in the custom section. (Since you can't actually tell which gems are what in the built-in list to selectively disable) &gt;.&gt;</p>\r\n<p>On my server, our faction has such a low population that even now some of the more exotic epic gem cuts can cost 400-500 gold. :\\</p>",
    "PostedDate": "2010-01-21T15:35:47.383-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "280298",
    "ThreadId": "81614",
    "Html": "<p>Templates are there for performance reasons. Saying time isn't an issue isn't really realistic. If time isn't an issue, you absolutely should be using the optimizer, and upgrade lists.</p>",
    "PostedDate": "2010-01-21T15:48:05.027-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "280335",
    "ThreadId": "81614",
    "Html": "<p>Ok, I still don't have this worked out.&nbsp; I go and uncheck the gems in the gemming template, including optimize, and it inserts +39 spell power gems into my level 70 Gladiator gear in the optimization results, even though none of the +39 spell power gems are checked in the template.&nbsp; If I uncheck all the gems, all of the items (clothing items) in comparisons disappear, even ones that don't have slots.&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-01-21T18:07:05.99-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "280341",
    "ThreadId": "81614",
    "Html": "<p>You missed the part about gems marked available. The optimizer will use all gems that are 'available'. That means any gems explicitly marked available on the Gems charts, or any gems in any active gemming templates. You've taken care of the gemming templates, but you still have the epic gems explicitly marked available. Goto the Gems &gt; Normal chart, and unmark them.</p>",
    "PostedDate": "2010-01-21T18:27:51.223-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "280349",
    "ThreadId": "81614",
    "Html": "<p>Thanks for the replies.&nbsp; There is absolutely nothing in Gems &gt; Normal.&nbsp; The list has no items on it.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-01-21T18:45:34.39-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "280363",
    "ThreadId": "81614",
    "Html": "<p>As we've posted in just about every single thread in the last week, it seems, check your filters.</p>",
    "PostedDate": "2010-01-21T20:15:21.31-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "280766",
    "ThreadId": "81614",
    "Html": "<p>With regard to the gemming templates, I have noticed that several of the models have a massive number of templates.&nbsp;&nbsp;&nbsp; Some of them are obviously not needed, such as all MP5 gems in the hunter module.&nbsp;&nbsp; If the templates are there to speed things up, then surely having so many must kind of defeat the purpose.&nbsp;&nbsp;&nbsp; Seeing the templates only need to be roughly accurate (as they are only used in the comparison pane) and aren't used when using Rawr properly (Optimising &amp; Building Upgrade Lists) then it might be worth reducing the number of templates in the models to speed things up a little.</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-01-22T15:23:32.253-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "280771",
    "ThreadId": "81614",
    "Html": "<p>Absolutely correct; some of the model devs have missed the point of gemming templates, and put in a ton of useless ones. We try to resolve that where we can.</p>",
    "PostedDate": "2010-01-22T15:35:35.23-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]