[
  {
    "Id": "280989",
    "ThreadId": "81816",
    "Html": "<p>I wanted to go through and mark off gear I have or thats available to my character for the optimizer... couple of things I think must be do-able but I just can't find the button or option to do it.</p>\r\n<p>1) Is there no way to &quot;select all&quot;... for example, I have access to all the enchants, gems or glyphs... be it via the AH or my own professions... checking off each one is a pain</p>\r\n<p>2) I may have a couple helms or pants available via drops and looking through the list to add all my possible equipment is a bit tedious, I am thinking there would be a way to search the list for the name I need and then check it or some kind of active filter that I can start typing the name and equipment that doesn't match would dissapear from the list... sorta like how wowhead works...</p>\r\n<p>seems like functionality that should be present but maybe they are not... am I missing them or is Rawr?</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-01-23T23:13:25.513-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "280991",
    "ThreadId": "81816",
    "Html": "<p>1) nononononononononono, selecting everything hurts WAY more than it helps. You should only mark available what you expect to actually use (the top or top couple of enchants depending on the slot, not all of them)</p>\r\n<p>2a) If you don't already have the item, you shouldn't really mark it available or it will try to use it. If you want to see how much of an upgrade that item is, click the name and select Evaluate Upgrade from the dropdown, this runs a baby optimize of that item against your available gear to see it's total value over current (if any).</p>\r\n<p>2b) You can sort the lists alphabetically, but you can not actively filter the comparisons window. We are working on this feature (as in it's there, but hidden because there's a focus problem we need to resolve first).</p>",
    "PostedDate": "2010-01-23T23:22:14.367-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "280992",
    "ThreadId": "81816",
    "Html": "<p>lol, well now an &quot;unselect all&quot; button would be handy :)</p>",
    "PostedDate": "2010-01-23T23:37:16.52-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "280993",
    "ThreadId": "81816",
    "Html": "<p>nvm</p>\r\n<p>&nbsp;</p>\r\n<p>ty for help :)</p>",
    "PostedDate": "2010-01-23T23:40:05.023-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]