[
  {
    "Id": "280969",
    "ThreadId": "81814",
    "Html": "<p>&nbsp;</p>\r\n<div id=\"ctl00_ctl00_MasterContent_Content_ReleasePanelOrderingContainer_ReleaseNotesPanel\" style=\"margin-top:1em;margin-right:0px;margin-bottom:1em;margin-left:0px\">\r\n<table style=\"width:663px\" border=0 cellspacing=0 cellpadding=0>\r\n<tbody>\r\n<tr>\r\n<td>\r\n<div style=\"margin-top:0.7em\">\r\n<div id=\"ctl00_ctl00_MasterContent_Content_ReleasePanelOrderingContainer_ReleaseDescriptionPanel\" style=\"width:663px\">\r\n<div><span id=\"ctl00_ctl00_MasterContent_Content_ReleasePanelOrderingContainer_ReleaseDescriptionLiteral\">\r\n<div>We're working on the Warlock model. When you harass our developers, is&nbsp;<strong>slows down</strong>&nbsp;progress, not speeds it up. Contrary to what you may believe, the changes recently have not made Rawr.Warlock any worse. It was entirely broken before (though you may not have known it). Now it's almost entirely accurate and fully functional, with the obvious exception of it missing pets.&nbsp;<strong>Again, we did not 'break' Rawr.Warlock</strong>. Pet support is coming soon. Until then, Rawr.Warlock is not any worse than it was before. If you insist upon wasting our time with discussions, PMs, issues, and reviews about it, at least set your CodePlex account to allow receiving e-mails, so that we can do so.</div>\r\n</span></div>\r\n</div>\r\n</div>\r\n</td>\r\n</tr>\r\n</tbody>\r\n</table>\r\n</div>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-01-23T18:23:23.527-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "280971",
    "ThreadId": "81814",
    "Html": "<p>&quot;Good news everyone&quot;&nbsp; /putricide-voice</p>\r\n<p>Pets are 95% complete - was hoping to have it ready for today, but I have a 10man ICC raid this afternoon, +25man this evening, so it will only be late tonight/sometime tomorrow.</p>",
    "PostedDate": "2010-01-23T18:42:38.017-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "281010",
    "ThreadId": "81814",
    "Html": "<p>Good news and ty:D and good luck with the professor had him down to 17% on our best attempt last night is a hard fight</p>",
    "PostedDate": "2010-01-24T03:22:02.17-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "281011",
    "ThreadId": "81814",
    "Html": "<p>Nice, btw how would I go about contribute code to Rawr, I've never touched c#, but I could do easy(?) stuff like modeling trinkets and glyphs.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-01-24T03:28:27.38-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "281044",
    "ThreadId": "81814",
    "Html": "<p>I dont know if im doing something wrong but since 3.3 rawr doesnt work for my warlock. I have just downloaded last version, my gearscore is 5600+ and i do around 9k dps in raid and 5k dps without buff. I have just configured it and it says 2401 dps, 3149 with all buffs. I cant configure it to cast life tap or dark pact so spirit doesnt give all the bonus.</p>\r\n<p>Am I doing anything wrong or the module is just broken?</p>\r\n<p>PD: I only downloaded my char from the armory and then i set up the priotity list</p>\r\n<p>PD2: cant modify the fight lenght</p>",
    "PostedDate": "2010-01-24T06:39:27.583-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "281084",
    "ThreadId": "81814",
    "Html": "<p>When are we allowed to post any issues or bugs we find with the Warlock module?</p>\r\n<p>I was mildly insulted when posting on the issue tracker after following the guidelines and don't really care for it.</p>",
    "PostedDate": "2010-01-24T09:32:16.737-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "281098",
    "ThreadId": "81814",
    "Html": "<p>Presumably with 2.3.9 when ArPharazon has posted the last of the changes needed to make the model fully functional.</p>",
    "PostedDate": "2010-01-24T10:20:31.463-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "281103",
    "ThreadId": "81814",
    "Html": "<p>Ok, i just wanted to know if any other warlock was able to make the model functional. I thought that all the changes but the pets one were applied in last patch cause i couldnt use rawr since 3.3. I used a lot before the patch giving me the 6-8k dps i got in raid but now... imposible to have results over 4k.</p>\r\n<p>If all the changes are going to be applied in 2.3.9 ok, if they have already been applied (except pets), then i dont know how to configure it.</p>",
    "PostedDate": "2010-01-24T10:29:48.347-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "281118",
    "ThreadId": "81814",
    "Html": "<p>One major point of confusion is the screen that lists combat events being blank. That's not broken, it's just obsolete. We don't use that screen anymore, and will be removing it soon.</p>",
    "PostedDate": "2010-01-24T11:42:53.097-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "281240",
    "ThreadId": "81814",
    "Html": "<p>Hey guys - let's read the rest of the threads out there.....we know the lock module is broken and they are working on it - hopefully it will be up in the next day.&nbsp; Remember this is a donation based program - and yes I have donated.</p>",
    "PostedDate": "2010-01-24T20:34:03.11-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "281485",
    "ThreadId": "81814",
    "Html": "<p>I love Rawr, and I thank you all for doing such a wonderful job on the program.&nbsp; I would like to know about the warlock module a little though.&nbsp; It seems to me that although the combat events doesn't work, it still doesn't accurately reflect dps.&nbsp; I can never get it to show my lock doing over 2.5k. Not sure if I'm doing something wrong with&nbsp;the spell priority, or if the module is just still having problems.&nbsp; Any information would be greatly appreciated... Thank you</p>",
    "PostedDate": "2010-01-25T09:38:54.61-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "281508",
    "ThreadId": "81814",
    "Html": "<p>Just thought I'd add a word of encouragement to ArP. Thanks for working on the module, I really miss it but I know it will be worth the wait. And don't let people get you down, just remember that&nbsp;most of us out here really appreciate what you're doing, the people who&nbsp;moan are usually just the ones with the loudest voices, not the majority.</p>",
    "PostedDate": "2010-01-25T10:40:01.523-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "281581",
    "ThreadId": "81814",
    "Html": "<p>Shmory, please refer to Astry's comment just above about the combat events in particular.</p>",
    "PostedDate": "2010-01-25T14:09:07.55-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "281880",
    "ThreadId": "81814",
    "Html": "<p>Guys,</p>\r\n<p>Rawr isn't really a DPS modeler so to speak.&nbsp; It's a relative gear comparison tool.&nbsp; If you're using it in a nonrelative predictive way, you're using it wrong.&nbsp; I've been lurking these threads for a long time waiting for the new model to come, and I'm amazed at how many people don't know where Rawr should fit in their min/maxing.</p>\r\n<p>Rawr has been broken because the pets were missing, that's it.&nbsp; The challenge this presents is in planning tier pieces that affect our pets' abilities.&nbsp; That set aside, all other things are equal and the gear modeler works just fine.&nbsp; It has never shown accurate numbers.&nbsp; When I first started using it, it was giving me a value of 6k DPS in T8 &amp; i200.&nbsp; Now it kicks back on the lower end.&nbsp; It's all relative, though, see?&nbsp; You can still use it to plan your gear; you just have to be a little manual about your pets when they're not included.</p>\r\n<p>TLDR: use Simcraft as a predictive/recursive DPS plot.&nbsp; Use Rawr to help you choose your gear.&nbsp; Conversely, don't change your stats in simcraft one at a time to model gear sets, and don't rely on Rawr to spit out your actual DPS.</p>",
    "PostedDate": "2010-01-26T08:06:31.483-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "281897",
    "ThreadId": "81814",
    "Html": "<p>Taus is right, to an extent. &nbsp;I never expect results from any Rawr DPS model to coincide with a parse, even a patchwerk-style fight -- WoW is RNG, and humans are fallible. &nbsp;People make less than optimal decisions at times, procs sometimes line up, etc.</p>\r\n<p>However, the ultimate goal is to get the numbers -close-, and with good reason. &nbsp;For one, it's called &quot;DPS&quot;, not &quot;Score&quot; or anything like that. &nbsp;Also, when the DPS is close to an actual parse, it makes the numbers more believable. &nbsp;After all, we're assigning real Damage values to abilities based on input parameters.</p>\r\n<p>TLDR: Agreed that a difference on order of 10% (ie real DPS being 8k and rawr reports a number between 7200 and 8800) is fine, that's within the bounds of the RNG/Player mistakes on a short (under 20min) fight. &nbsp;</p>\r\n<p>Disagree that a gross difference between Rawr's reporting and actual DPS is fine. &nbsp;We should strive to make the reported number be optimal DPS assuming perfect play, and I personally consider any gross difference as a bug in the model.</p>\r\n<p>Final word: ArPharazon is doing what he can to fix the warlock model in his free time. &nbsp;Seriously, the complaints are just wasting your energy and our time. &nbsp;Wait for ArPh to pronounce the warlock module in a beta state before filing bugs. &nbsp;It's in Alpha right now, and not meant to be used.</p>",
    "PostedDate": "2010-01-26T08:59:01.383-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "281911",
    "ThreadId": "81814",
    "Html": "<p>Thanks for the follow-up ebs.&nbsp; I didn't mean to imply that a large difference was 'acceptable,' but just the fact that as far as I understand the way that Rawr parses vs. the way that simcraft parses just means that Rawr will never be ideal over simcraft for those purposes, and simcraft will never be ideal over Rawr for gear planning.&nbsp; It's okay to use one over the other.&nbsp; I think my main point was that, with a little bit of work on the part of the user, Rawr is still totally usable for the purpose it was designed for.</p>",
    "PostedDate": "2010-01-26T09:30:57.427-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "282139",
    "ThreadId": "81814",
    "Html": "<p>I've noticed that the &quot;Target Level&quot; setting has stopped working. My warlock isn't my main and I generally use rawr to optimize my non-raid alts for 5man heroics, so I find the ability to tell rawr to adjust values for a level 82 boss extremely valuable. This function doesn't exist in some other class models but it has existed in the Warlock model for a long time and it would be a great shame to lose that functionality. Is there any chance of it being fixed to work again, or is it planned for that functionality to be removed completely?</p>\r\n<p>edit: Keeping in mind that level 82 is not only the 5man heroic boss cap but also the PvP cap, I would think that a great number of primarily PvP-oriented players might appreciate this functionality being a bit more global as well (I realize that this might be a bit complicated given that different people maintain different class/spec models).</p>\r\n<p>edit2: After further testing, it appears as though it is running the calculations properly when looking at the hit rating portion of the Stats screen, but it doesn't seem to take it into consideration in either the relative stat screen or the actual item list screens. To see if you can duplicate the behavior that I am seeing, Demonique on The Scryers is the warlock that I am currently working with in it.</p>",
    "PostedDate": "2010-01-26T21:30:50.227-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "282153",
    "ThreadId": "81814",
    "Html": "<p>Level 82 is considered the PvP cap? wha? It was my understanding that LvL 80 was the PvP cap. Thus the reason that you need 5% hit to be hit capped for PvP. I could be wrong considering I don't pvp (partly because I suck at pvp in general).</p>",
    "PostedDate": "2010-01-26T22:34:33.823-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "282156",
    "ThreadId": "81814",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>Hinalover wrote:</strong><br>\r\n<p>Level 82 is considered the PvP cap? wha? It was my understanding that LvL 80 was the PvP cap. Thus the reason that you need 5% hit to be hit capped for PvP. I could be wrong considering I don't pvp (partly because I suck at pvp in general).</p>\r\n</blockquote>\r\n<p>This mostly comes into play in Alterac Valley where the Horde and Alliance captains and generals are effectively level 82 raid bosses.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-01-26T22:42:07.093-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "282260",
    "ThreadId": "81814",
    "Html": "<p>Also a lot of racials have extra chance to be missed by spells and attacks (NE/BE etc), which means you need extra hit to compensate.</p>",
    "PostedDate": "2010-01-27T03:29:26.53-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "282378",
    "ThreadId": "81814",
    "Html": "<p>Great work guys!<br>I really look forward to see your improvements.</p>\r\n<p>And to all you whiners out there:<br>It's not like you have to pay any licence fee for using Rawr.<br>To have the same expectations on the support of a freeware software as on a software you pay $$$$$ for is just daft.<br>If you like Rawr - donate.<br>If not - don't donate.<br>But please be nice to the devs who spend their spare time coding Rawr. &nbsp;</p>",
    "PostedDate": "2010-01-27T08:09:11.483-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "286155",
    "ThreadId": "81814",
    "Html": "<p>first of all, thank you for all the effort put on Rawr</p>\r\n<p>any news on the progression of the Rawr.Warlock model? as stated by ArPharazon pets were on 95% as at January 24.</p>\r\n<p>when should we expect the model to be functional again?</p>\r\n<p>I am looking forward to hearing from you.</p>\r\n<p>Thanks in advance</p>",
    "PostedDate": "2010-02-05T03:07:14.87-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "287777",
    "ThreadId": "81814",
    "Html": "<p>Still waiting for an answer :P</p>",
    "PostedDate": "2010-02-09T11:50:40.847-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "287794",
    "ThreadId": "81814",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>DogshitTaco wrote:</strong><br>\r\n<p>Great work guys!<br>I really look forward to see your improvements.</p>\r\n<p>And to all you whiners out there:<br>It's not like you have to pay any licence fee for using Rawr.<br>To have the same expectations on the support of a freeware software as on a software you pay $$$$$ for is just daft.<br>If you like Rawr - donate.<br>If not - don't donate.<br>But please be nice to the devs who spend their spare time coding Rawr. &nbsp;</p>\r\n</blockquote>\r\n<p>Agreed.&nbsp; On the other hand, there's benefits to open source development - one of which is communication with the programmers.&nbsp; Personally, while it seems that I stress out sometimes over &quot;needing it NAO!&quot;, I'm fine with the &quot;it takes as long as it takes&quot; - as long we have some knowledge of why it's taking so long.</p>\r\n<p>Consider this; we're by and large all medium to hardcore raiders and/or pvpers.&nbsp; We consider Rawr to be a tool we use for our gameplay, which means that we consider the people making it useful to our guild/raid.&nbsp; When people don't post to say &quot;sorry, I can't make it!&quot; it gets old/frustrating; this is the same way.&nbsp; AFAIK, ArP could be failing to make progress because he was hit by a car, arrested, murdered, had his computer blow up, or some other catastrophic issue that would force another developer to step in- or he may just be busy.&nbsp; While we may not hear what's going on in the case of a catastrophe, it might help soothe us to know that he's busy trying to prep for a good valentine's day with his wife/girlfriend/boyfriend/harem/whatever.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-02-09T12:26:50.51-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "288454",
    "ThreadId": "81814",
    "Html": "<p>@zeluz<br>I did a couple of optimizations with DPS Rating as the calculation to optimize for my affli spec, and it was ok. I changed the gear available for optimizer, and it did pick the best choises imo. The dps was about 1k lower than I have on the training dummies, but thats ok. I don't need Rawr to show me the exact DPS increase/decrease down to the decimals, I only need it to show me if another combination of gear gives me more or less DPS.</p>\r\n<p>@Karindra<br>Being a developer myself, and seeing some of the posts here I don't blame the guys if they get fed up and just drop the development of Rawr.<br>I would have.&nbsp;<br>The benefit of communicating with the programmers is not tied to open source development, it is many times vital for a company that makes it's money on software. If they don't make software the customers want, they will perish. The company where I work have close contact with it's customers. The customers give a lot of good(and bad) input, and we deliver what they want (most of the time ;) ). And we make a lot of money.&nbsp;<br><br>I code addons for my guild on my spare time, just for fun. <br>And here's the benefit of open source development:<br>If I don't feel up for coding, I don't code!&nbsp;<br>If some jerk tells me that I am taking to long time to update the addon to the latest patch and he needed to click the 'load out of date addons', I can choose to not update the addon until the following patch. Or even better, I update my own toc and tell him that I have made a later version with a lot of improvements, but I am not releasing it because he is a jerk! ;)<br>Of course I do not actually exercise any of those benefits, but I could if I wanted to... :)&nbsp;</p>\r\n<p>I agree that it would be nice to know what's going on, and if there is any estimate for the next update. However, as you said Karindra: Rawr is an open source project... ^^</p>\r\n<p>Cheers! :)</p>",
    "PostedDate": "2010-02-10T13:35:02.277-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]