[
  {
    "Id": "281126",
    "ThreadId": "81859",
    "Html": "<p>Is it assumed that the optimizer is going to make me 540 def or equivalent? Reading this post http://rawr.codeplex.com/Thread/View.aspx?ThreadId=68747 I think thats what may have happened to me... I have a 226 pvp cape that it told me to swap out for my current 200 iLvl PVE cape, as well as some other changes but the end result is my def is 536. Is it safe to assume the ressilence on my PVP cape is making up the difference for me, so that even though im not at 540 I am in fact uncritable for heroics? I thought I would add to the optimizer that a requirement would be to keep Def at 540 but there is not def (or def rating) option in the drop downs... hence why I ask if it is assumed that rawr is keeping that value as a priority when using the TankDK preset. (I optimized using the &quot;overall&quot; rating default setting.)</p>\r\n<p>Is there a chart anywhere that shows how much resilience mitigates how much crit? (If that is indeed what happened to me)</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-01-24T12:06:50.353-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "281144",
    "ThreadId": "81859",
    "Html": "<p>Correct. The optimizer requirement you're looking for is &quot;Chance to be Crit &lt;= 0&quot;. You don't <em>reall</em>y<em>&nbsp;</em>care about defense capping, you care about anti-crit capping.</p>",
    "PostedDate": "2010-01-24T12:43:44.857-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "281151",
    "ThreadId": "81859",
    "Html": "<p>Also note that on the TankDK, depending on the fight conditions, def will provide value via avoidance, so when you have the gear available it may even stack you past soft cap.</p>",
    "PostedDate": "2010-01-24T12:58:27.047-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "281208",
    "ThreadId": "81859",
    "Html": "<p>Ty guys! Great program and great peeps. My bro loves rawr too.</p>",
    "PostedDate": "2010-01-24T16:21:05.96-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]