[
  {
    "Id": "281687",
    "ThreadId": "82008",
    "Html": "<p>In this Priest module isn&acute;t an option for uptime of BORROWED TIME &nbsp;(which give 25% haste for 5 seconds). &nbsp;I have an uptime of borrowed Time of about 90% - 95%.</p>\r\n<p>I think this missing option, makes the Statweighting of Rawr FALSE.</p>",
    "PostedDate": "2010-01-25T21:16:07-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "281706",
    "ThreadId": "82008",
    "Html": "<p>Even with an uptime of 90-95% that does not mean every cast is hasted with 25%. As an example, if you cast PWS-FH, only 50% of your casts are hasted by 25%. If you cast PWS-PrM/Penance-FH, 67% are hasted and so on.</p>\r\n<p>&nbsp;</p>\r\n<p>Borrowed Time is modelled, just try changing how many points you have in the talent and you will see. (Also make sure your role contains Power Word: Shield).</p>",
    "PostedDate": "2010-01-25T23:06:26.057-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "281714",
    "ThreadId": "82008",
    "Html": "<p>Additionally, Rawr doesn't use stat weights.</p>",
    "PostedDate": "2010-01-25T23:25:26.093-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "281875",
    "ThreadId": "82008",
    "Html": "<p>@TNSE: &nbsp;borrowed Time is only consumed when you CAST a Spell, not by Instants, an neither by Channeled spells. Your second example will have an 100% uptime of BT not 67%</p>\r\n<p>PWS on a target gives me borrowed time for 5 seconds until i CAST a spell. PrM is instant which means is doesn&acute;t consume BT then you cast Penance which is CHANNELED this &nbsp;NOT consume BT so after this BT is still up, then you cast Flash only the flash consumes BT.</p>\r\n<p>And as a DisziRAIDhealer, you not heal the raid with Flash al the Time, you spent PWS on as many Members of the Raid as possible and hold PrM and Penance on CD. this gives you a BT uptime of about 90% and more. &nbsp;with an haste of about 300 an BT up and Raidbuffed is the Diszi at the softcap. After that point Haste is only good for greater Heal and PoH, and both heals are not so good and not often casted by an Diszi. Rawr says OH NO YOU NEED MORE HASTE. But as RAIDHEALER much more hast then 300 isn&acute;t good.</p>\r\n<p>I used the Diszi-RAID Role the castlist of this role is PWS Penance PrM PWS and Flash this castlist would have a 100% uptime of BT by the way:-D</p>\r\n<p>&nbsp;</p>\r\n<p>@Astrylian:</p>\r\n<p>&nbsp;</p>\r\n<p>ok i used a wrong word. I mean that Rawr doesn&acute;t count BT correct, &nbsp;Rawr wants me to get about 600 Haste as Diszi, and this isn&acute;t good for a DisziRAIDhealer. &nbsp;with an high uptime of BT Rawr should take crit, spell or manareg higher than haste, but rawr didn&acute;t do that.</p>",
    "PostedDate": "2010-01-26T07:43:43.8-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "281924",
    "ThreadId": "82008",
    "Html": "<p>Errrrr.... It's been a while since I played my disc priest, but... Are you sure about that? Pretty sure Borrowed Time lasts until you cast your next spell, of any type, not just one with a cast time. Instants and Channels still use up Borrowed Time, I believe. That said, again, it's been a while since I played my disc priest; TNSe will know for sure.</p>",
    "PostedDate": "2010-01-26T09:56:52.993-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "281935",
    "ThreadId": "82008",
    "Html": "<p>You are right Burle17, and that is how Rawr implements Borrowed Time.</p>\r\n<p>&nbsp;</p>\r\n<p>If you cast (simple example), Power Word: Shield and then a Flash Heal, you will gain the buff after casting the PWS. So over 100 repeats of this (PWS-FH-PWS-FHx99), you will have an uptime of Borrowed Time equal to (Global Cooldown-1)/GCD or 99/100 = 99%. That is what you are seeing in the Combat Log. (First cast is not hasted)</p>\r\n<p>However, only 50% of your actual casts are hasted with Borrowed Time. The initial PWS is not hasted. The Flash Heal after the PWS is Hasted. The next PWS is not hasted and so it goes on. So only 50% of your casts are hasted.</p>\r\n<p>&nbsp;</p>\r\n<p>When it comes to a more complex example with PWS-(PrM or Penance or Renew or another PWS)-FH, you are right, only the FH will consume the Borrowed Time. Still, that means only 2 out of every 3 casts are hasted. Yet you would still have a very high uptime on Borrowed Time.</p>\r\n<p>&nbsp;</p>\r\n<p>As long as you only cast PWS-PWS-PWS-PWS-PWS you will more or less get Borrowed Time on every cast. But I have not included such a plain model by default as it would deemphasize haste greatly, disallowing you the ability to react with other things.</p>\r\n<p>&nbsp;</p>\r\n<p>The way it ends up working, is that the more spells cast are cast with BT buff, the less value haste gets.</p>",
    "PostedDate": "2010-01-26T10:15:47.46-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "282136",
    "ThreadId": "82008",
    "Html": "<p>@Astrylian:</p>\r\n<p>&nbsp;</p>\r\n<p>Yes i am^^ BT lasts 5 second or until you CAST a spell. For Example a PWS on the Tank than a Penance und a GREATER HEAL would be a good Combo penance is hasted bei BT and the Greater Heal too. After the Greater Heal BT is gone away^^</p>\r\n<p>&nbsp;</p>\r\n<p>@TNSe:</p>\r\n<p>&nbsp;</p>\r\n<p>&auml;hm pws isn&acute;t hasted???? &auml;hm pws is INSTANT no need for any haste when you cast pws. After the 1. pws BT becomes UP and your GCD gets benefit from BT (be me down from 1,2x to 1,0). &nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>However, only 50% of your actual casts are hasted with Borrowed Time. The initial PWS is not hasted. The Flash Heal after the PWS is Hasted. The next PWS is not hasted and so it goes on. So only 50% of your casts are hasted.</p>\r\n<p>Hmm 50% of the casts that don&acute;t have a NEED of BT are not hasted. (but the reduce of the gcd for 25% are good for these instants).</p>\r\n<p>&nbsp;</p>\r\n<p>But I have not included such a plain model by default as it would deemphasize haste greatly, disallowing you the ability to react with other things.</p>\r\n<p>&nbsp;</p>\r\n<p>HMM and i think this makes Rawr not good for DISZI&acute;s. Why do i think so???</p>\r\n<p>1. which ability to react with other things???? diszihelaer in Raids casts PWS prM on cd Penance on CD und perhaps Renew this makes about 95% of the hole combat. When i must use Greater Heal oder FH or PoH i lose a lot of Healpower.</p>\r\n<p>2. Deemphasize haste. ok haste for an Holy is strong, but haste beyond about 300 is for a diszi simple useless (ok not useless when you cast greater PoH or not so much PWS but if a diszi do this it&acute;s a bad Diszi). Haste for Diszis not Deemphasize meens Rawr counts haste incorrect.5</p>\r\n<p>This was the reason why i want an Option for the uptime of BT a diszi who have lets say BT only 50% up needs more haste as a diszi (for example me and i&acute;am not alone^^) who have BT up for 95%.</p>\r\n<p>&nbsp;</p>\r\n<p>P.S. i tryed to make my own castlist in Rawr with Custom Role but it seems to work buggy. &nbsp;For example 1 FH, 1 Penance, 1 PrM (4 Targets) and 4 PWS gives me a sustained Value of 154. Make i something wrong?</p>\r\n<p>And a second question how is the PWS Glyph &nbsp;(20% instantheal of the absorbvalue of PWS) counted in Rawr? Rawr tells me that my PWS has a Value of about 79xx &nbsp;is this WITH the Glyphheal (i don&acute;t think so) or without?</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-01-26T20:50:32.747-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "282138",
    "ThreadId": "82008",
    "Html": "<p>Yeah, like I said, I haven't played my Disc priest, so wasn't sure about it.</p>\r\n<p>However, I am definitely sure that instants benefit from Haste. You thinking that instants don't benefit from haste... Yeah, that's pretty wrong.</p>",
    "PostedDate": "2010-01-26T21:18:55.47-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "282254",
    "ThreadId": "82008",
    "Html": "<p>Custom Role expects a full fight. Go check your log, and use it to fill in the missing information, like fight length, amount of abilties used and so on.</p>\r\n<p>Glyph of PWS is not included in the PWS value, just like Divine Aegis is not included in the FH/GH/Penance etc. values.</p>\r\n<p>&nbsp;</p>\r\n<p>You react with Penance and PWS. Penance can be hasted more than Instants as it has a longer cast time, which means haste still has some value even after BT+Haste gives 1s GCD.</p>\r\n<p>&nbsp;</p>\r\n<p>You cast Power Word: Shield. (1.5s cast)<br>You gain Borrowed Time.<br>You cast Flash Heal (1.5s/1.25 = 1.2s cast)<br>Borrowed Time fades.<br>You cast PWS. (1.5s cast)<br>You gain BT.<br>You cast FH. (1.2s cast)<br>BT fades.<br>You cast PWS. (1.5s cast)<br>You gain BT.<br>You cast FH. (1.2s cast)<br>BT fades.</p>\r\n<p>&nbsp;</p>\r\n<p>Do you see above how only every other spell is 1.2s, and every other spell is 1.5s? That means only 50% of your casts benefit from BT. Lets add in other things.</p>\r\n<p>&nbsp;</p>\r\n<p>You cast PWS. (1.5s cast)<br>You gain BT.<br>You cast Penance. (2s/1.25 = 1.6s cast)<br>You cast FH. (1.5s/1.25 = 1.2s cast)<br>BT fades.<br>You cast PWS. (1.5s cast)<br>You gain BT.<br>You cast Prayer of Mending. (1.5s/1.25 = 1.2s cast)<br>You cast FH. (1.2s cast)<br>BT fades.<br>You cast PWS. (1.5s cast)<br>You gain BT.<br>You cast Renew. (1.5s/1.25 = 1.2s cast)<br>You cast FH. (1.2s cast)<br>BT fades.</p>\r\n<p>&nbsp;</p>\r\n<p>This time 2 out of 3 spells cast benefit from Borrowed Time.</p>\r\n<p>&nbsp;</p>\r\n<p>In both examples, you are close to 99% uptime on Borrowed Time.</p>\r\n<p>&nbsp;</p>\r\n<p>Take some time and play with the tooltip of Flash Heal ingame when you have Borrowed Time or not, and you will see that any spell with a cast time will consume BT. Using FH's tooltip you can see what your Global Cooldown will look like.</p>",
    "PostedDate": "2010-01-27T03:21:57.03-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "282417",
    "ThreadId": "82008",
    "Html": "<p>&nbsp;</p>\r\n<p>@Astrylian:</p>\r\n<p>&nbsp;</p>\r\n<p>Instants don&acute;t benefit from haste when you CAST them, however they benefit from haste from the shorter GCD that you can cast the next instant. But if i cast an SINGLE instant PWS haste is for that single PWS complet USELESS (until the GCD is Ready for the PWS^^).</p>\r\n<p>&nbsp;</p>\r\n<p>@TNSe:</p>\r\n<p>ok thanks that would help me a lot i think.</p>\r\n<p>&nbsp;</p>\r\n<p>Is Glyph of PWS includet in Rawr in any other Way? If not this would be a big mistake in my opinion. The PWSGlyphheal counts by me for about 25% to 30% of my TOTAL Healing^^.</p>\r\n<p>Is Divina Aegis includet in Rawr in another Way? If not its a mistake too in my opinion, because the additional &aacute;bsorb when you crit (even through PWSGlyph^^) means that you must heal &nbsp;that shielded Char not so much.</p>\r\n<p>You right, PWS and Penance interact. &nbsp;But Penance has a too high CD (which is not affected by haste^^) that you can say &quot;oh penance still benefits from Haste OK I MUST HAVE MORE HASTE&quot; 1% haste (or 32,89 hasterating) meens penance second tick is 0,01 sec faster and the 3. tick too. In a Fight with 8 Mins length and a&nbsp; Penance with a cd of 8 seconds, you can cast &nbsp;Penance max 60 times. 1% haste (after the softcap is reached through BT) is worth 0,6 seconds faster Tick 2 (the first tick is instant) and 0,6 seconds for the 3. Tick together you are 1,2seconds faster in 8 Mins. Not really that much^^ Sorry my opinion af haste still is: Haste is quiet useless when you reach the hastesoftcap with BT up. And i think other Diszi&acute;s share my opinion.</p>\r\n<p>Your first example:</p>\r\n<p><br>You cast Power Word: Shield. (1.5s cast) &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Why 1,5 seconds ??? pws is instant when the gcd is free pws is Immidiatelly on the target<br>You gain Borrowed Time. &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;correct and with BT up the gcd is also hasted<br>You cast Flash Heal (1.5s/1.25 = 1.2s cast) &nbsp; &nbsp; &nbsp; correct and with the hasted GCD the gcd is ready when flash is finished.<br>Borrowed Time fades. &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;correct<br>You cast PWS. (1.5s cast) &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;again why 1,5 seconds??? gcd was ready above so no need to wait for pws and pws is again IMMIDIATELLY on the target<br>You gain BT. &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;correct and again the gcd is also hasted<br>You cast FH. (1.2s cast) &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; correct an again the gcd is ready when the flash is finished<br>BT fades. &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; correct<br>You cast PWS. (1.5s cast) &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;again why 1,5 seconds???? gcd was ready so no need to wait for pws and pws is again immidiatelly on the target<br>You gain BT. &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;correct &nbsp;and again gcd is also hasted<br>You cast FH. (1.2s cast) &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; correct an again gcd is ready when flash is finished<br>BT fades. &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; correct</p>\r\n<p>you see all spells are hasted through bt and all pws benefit from bt because the gcd is always ready in your example. In my opinion this is an uptime of BT of 100%^^</p>\r\n<p>&nbsp;2. Example</p>\r\n<p>You cast PWS. (1.5s cast) &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; why??? when gcd is ready pws is instant and immidiatelly on the target<br>You gain BT. &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; correct and gcd is also hasted<br>You cast Penance. (2s/1.25 = 1.6s cast) &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;correct and gcd is still hasted<br>You cast FH. (1.5s/1.25 = 1.2s cast) &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; correct an gcd is ready when flash is ready<br>BT fades. &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; correct<br>You cast PWS. (1.5s cast) &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;agan why 1,5 seconds??? gcd was ready so no need to wait for pws and pws is immidiatelly on the target<br>You gain BT. &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;correct and gcd is hasted too<br>You cast Prayer of Mending. (1.5s/1.25 = 1.2s cast) correct and gcd is still hasted<br>You cast FH. (1.2s cast) &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; correct and gcd is ready when flash finished<br>BT fades. &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; correct and you have an ready GCD at this time<br>You cast PWS. (1.5s cast) &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;why??? gcd is ready no need to wait for pws so pws is immidiatelly on the target &nbsp;<br>You gain BT. &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;correct and hasted gcd<br>You cast Renew. (1.5s/1.25 = 1.2s cast) &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;correct and gcd is still hasted<br>You cast FH. (1.2s cast) &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; correct and pcd is ready when flash finished<br>BT fades. &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; correct and pcd is ready at thi time</p>\r\n<p>Again all casts are hasted by BT, and all instants benefits from the hasted gcd through BT. In my opinion this is an 100% uptime of BT in this example.</p>\r\n<p>&nbsp;</p>\r\n<p>And in this example additional haste (which your rawr module says its good) would have only for 1 Penance a little bit benefit (a very little benefit). So by 8 of 9 Spells haste would be pretty useless (raidbuffed an with talents and equip of course).</p>\r\n<p>You see haste is after softcap not as good as you intent for Diszi as RAIDhealer (for Tankheal or Holy haste is better after rating of 300 of course). So it would be better to deemphasize haste for Raiddiszis than this not to do.</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-01-27T10:08:27.397-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "282456",
    "ThreadId": "82008",
    "Html": "<p>Please, Burle17, try things out, and observe the results. Yes, all of these things are implemented, and as far as we can tell, working properly. Nothing you've posted shows that anything is not calculated correctly, or accounted for.</p>\r\n<p>&nbsp;</p>\r\n<p>And again, <strong>instant spells apply their effects immediately, but they still take up time. For all of our purposes, they have a cast time of however long the GCD is, so they definitely are affected by haste.</strong></p>\r\n<p>&nbsp;</p>\r\n<p>You keep saying things like...</p>\r\n<p style=\"margin-top:1em;margin-bottom:1em;padding-left:30px\"><em>You cast PWS. (1.5s cast) &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;again why 1,5 seconds???? gcd was ready so no need to wait for pws and pws is again immidiatelly on the target</em></p>\r\n<p style=\"margin-top:1em;margin-bottom:1em;padding-left:30px\"><em>you see all spells are hasted through bt and all pws benefit from bt because the gcd is always ready in your example. In my opinion this is an uptime of BT of 100%^^</em></p>\r\n<p style=\"margin-top:1em;margin-bottom:1em\">No, really, the PWSs <strong>are not hasted</strong>. The GCD is ready when you cast PWS, but PWS still has a GCD, which is effectively its cast time, and <strong>it is not hasted.</strong></p>",
    "PostedDate": "2010-01-27T11:42:15.643-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "282458",
    "ThreadId": "82008",
    "Html": "<p>Spell Haste doesn't just improve the cast time of the spell. &nbsp;It also makes the GCD faster (up to 1sec). &nbsp;So the (1.5s cast) for PW:S is more that it takes 1.5s before you can do anything AFTER it. &nbsp;Because the haste from Borrowed Time doesn't do anything to the PW:S GCD.</p>\r\n<p>00.0 GCD free</p>\r\n<p>00.0 Cast PW:S, gain BT, next GCD is at 01.5</p>\r\n<p>01.5 Cast FH, 1.2s cast, next GCD is available at 02.7. &nbsp;BT fades</p>\r\n<p>02.7 Cast PW:S, gain BT. &nbsp;Next GCD is at 4.2</p>\r\n<p>&nbsp;</p>\r\n<p>Even though it's &quot;instant&quot;, you have to wait 1.5secs before casting another spell. &nbsp;Rawr doesn't care if the spell lands before or after 1.5secs, it only cares how much time it took out of the encounter for you to cast that spell.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-01-27T11:47:58.373-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "282942",
    "ThreadId": "82008",
    "Html": "<p>@Astrylian:</p>\r\n<p>&nbsp;</p>\r\n<p>No, really, the PWSs are not hasted. The GCD is ready when you cast PWS, but PWS still has a GCD, which is effectively its cast time, and it is not hasted.</p>\r\n<p>&nbsp;</p>\r\n<p>OK GCD is Ready you make PWS shild is immidiatelly on the target (ok let&acute;s say about 0,1 second later due to Latency). &nbsp;At this point the new GCD startet AND BT comes up. Through the haste benefit of BT the GCD lowers down from 1,5 seconds to 1,2 seconds. &nbsp;i never say pws is hasted through BT i say pws has no need to be hasted by BT (or hasterating) only &nbsp;the GCD AFTER that PWs has a need for haste.</p>\r\n<p>&nbsp;</p>\r\n<p>@ebs2002:</p>\r\n<p>00.0 Cast PW:S, gain BT, next GCD is at 01.5 &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &auml;hm NO next gcd is at 1.2 in my opinion by my Diszi but i check this out the next time i can<br><br>01.5 Cast FH, 1.2s cast, next GCD is available at 02.7.  BT fades</p>\r\n<p>&nbsp;Even though it's &quot;instant&quot;, you have to wait 1.5secs before casting another spell. &nbsp; &nbsp; Yes the GCD, but when you cast pws you gain BT an this lowers also the GCD.</p>\r\n<p>In my opinion the sentence of TSNe &nbsp;&quot;But I have not included such a plain model by default as it would deemphasize haste greatly, disallowing you the ability to react with other things.&quot; is not good for a diszi.</p>\r\n<p>Haste is good of course, but after the point where the gcd is at 1,0 sec raidbuffed and with BT up haste is not so good, because it can only react with (greater heal which disziRAIDhealer not often use, divine Hymn (i hope this is the correct translation^^) which is not so important, and PoH which is also not so important) Penance. but to say yeah penance still benefits from haste so i must stack haste for that isn&acute;t good .</p>\r\n<p>I think that rawr should deemphasize haste by DISZIRAIDHEALER , after the softcap is reached.</p>\r\n<p>&nbsp;</p>\r\n<p>And again the question how are divine aegis and pwsglyph are includet in rawr?</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-01-28T13:25:52.53-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "282945",
    "ThreadId": "82008",
    "Html": "<p>Burle, go read this entire thread again, actually think about what all of it means, and then come back.</p>",
    "PostedDate": "2010-01-28T13:30:04.54-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "283005",
    "ThreadId": "82008",
    "Html": "<p>Please forgive me if I'm wrong or if this isn't helpful, but I believe I see the crux of the issue here: Burl think that a PW:S cast will apply BT and shorten its OWN GCD, whereas ebs believes it will NOT shorten its OWN GCD.</p>",
    "PostedDate": "2010-01-28T14:58:54.703-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "283142",
    "ThreadId": "82008",
    "Html": "<p>HINT: It won't.</p>\r\n<p>With 0 haste, and the BT talent, starting from scratch, cast a PW:S. Its GCD will be 1.5sec, not 1.2sec.</p>",
    "PostedDate": "2010-01-28T21:38:27.91-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "283221",
    "ThreadId": "82008",
    "Html": "<p>Divine Aegis is included in Rawr. It increases the value of Critical Heals by 10/20/30%.</p>\r\n<p>PWS Glyph is included in Rawr. It counts as a heal based on the amount potentially absorbed by PWS.</p>\r\n<p>&nbsp;</p>\r\n<p>Borrowed Time does NOT haste the PWS that gave you the buff. That means if you do not have BT, you will have a full duration GCD on that PWS.</p>\r\n<p>&nbsp;</p>\r\n<p>0:00.00 You cast PWS. (1.5s cast, because you do not yet have BT buff.)<br>0:00.00 You gain BT. (This does not apply until next spell.)<br>0:01.50 You cast Penance (2s cast, but you have BT buff, so its really 2s/1.25 = 1.6s, but it does not consume BT).<br>0:03.10 You cast Flash Heal (1.5s cast, but you have BT buff, so its really 1.5s/1.25 = 1.2s, but it consumes BT, so next spell will not be BT hasted).<br>0:03.10 BT fades. (Next spell does not get BT Haste)<br>0:04.30 You cast PWS. (1.5s cast, because you do not yet have BT buff.)<br>0:04.30 You gain BT. (This applies to next spell)<br>0:05.80 You cast Prayer of Mending (1.5s cast, but you got BT buff, so really 1.5s/1.25 = 1.2s. Does not consume BT).<br>0:07.00 You cast FH. (1.5s/1.25 = 1.2s. Eats BT.)<br>0:07.00 BT fades.</p>\r\n<p>&nbsp;</p>\r\n<p>So as you see, Haste benefits any spell that is not cast with BT active. BT only affects NEXT spell. I hope this helps explain, because if this doesn't explain I'm at a loss at what will :)</p>",
    "PostedDate": "2010-01-29T01:35:32.01-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "283558",
    "ThreadId": "82008",
    "Html": "<p>@TNSe:</p>\r\n<p>Divine Aegis is included in Rawr. It increases the value of Critical Heals by 10/20/30%. &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; Ok thank you.</p>\r\n<p>PWS Glyph is included in Rawr. It counts as a heal based on the amount potentially absorbed by PWS. &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; Ok again thank you. &nbsp;:-D</p>\r\n<p>Borrowed Time does NOT haste the PWS that gave you the buff. That means if you do not have BT, you will have a full duration GCD on that PWS.</p>\r\n<p>&nbsp;</p>\r\n<p>OK you have right i was wrong, i thought bt hasted the PWS that gave BT, i&acute;am sorry.</p>\r\n<p>&nbsp;</p>\r\n<p>So as you see, Haste benefits any spell that is not cast with BT active. BT only affects NEXT spell. I hope this helps explain, because if this doesn't explain I'm at a loss at what will :)</p>\r\n<p>Yes it helped^^.</p>\r\n<p>&nbsp;</p>\r\n<p>But because of my way of healing (spam pws on everybody in the Raid like a crazy Donkey^^) i have an higher uptime of BT than i think is thought in your rawr module, so i get a little bit less haste as rawr recommended for me^^. I think i try out the custom role next time.</p>",
    "PostedDate": "2010-01-29T20:55:44.01-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "283598",
    "ThreadId": "82008",
    "Html": "<p>Yes, you are correct. I play DISC in raids myself, and I have had 6% spell haste from gear through entire ToC. Anything more has felt like a waste. Why? Because I kept on hitting PWS all the time. In ICC however I many times have to toss out a FH resetting my BT. (Spikes on Marrowgar, random people in the Death n Decay on boss 2, all the time on Airship battle, keeping 10% physical damage reduction up on tanks/debuffs, people with disease on Rotface, (I go shadow on 2 final bosses that wing and Blood Council.) So its less PWS spamming than before, because I often save PWS to situations where people are in actual risk of going dead.</p>",
    "PostedDate": "2010-01-30T03:23:40.883-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "283621",
    "ThreadId": "82008",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>TNSe wrote:</strong><br>\r\n<p>Yes, you are correct. I play DISC in raids myself, and I have had 6% spell haste from gear through entire ToC. Anything more has felt like a waste. Why? Because I kept on hitting PWS all the time. In ICC however I many times have to toss out a FH resetting my BT. (Spikes on Marrowgar, random people in the Death n Decay on boss 2, all the time on Airship battle, keeping 10% physical damage reduction up on tanks/debuffs, people with disease on Rotface, (I go shadow on 2 final bosses that wing and Blood Council.) So its less PWS spamming than before, because I often save PWS to situations where people are in actual risk of going dead.</p>\r\n</blockquote>\r\n<p>&nbsp;100% correct. I have at the moment about 12% haste and i won&acute;t go higher (or much more higher^^)</p>",
    "PostedDate": "2010-01-30T05:12:13.467-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]