[
  {
    "Id": "284176",
    "ThreadId": "82708",
    "Html": "<p>I am completely new to DK system, so I d like to ask something.... Didn t find any simillar discusion.</p>\r\n<p>Death Knights in RAWR seems to be designed only for Stamina gems and items. Even if you are under Defence Capacity, it says that it s much better to get +24 stamina (blue) gem then for example +12 stamina +8 dodge (purple = red, right one to the socket), which would mean you will get +6 stamina per socket bonus and gain +18 stamina +8 dodge vs +24 stamina.</p>\r\n<p>&nbsp;</p>\r\n<p>Thep oint is, is this correct ? Are DKs just mana pits, with 60k hp where you get hit with every second hit for 30 ? (Just example)</p>\r\n<p>&nbsp;</p>\r\n<p>Why isn t mittigation (parry, dodge...) above survival (stamina...) ?</p>",
    "PostedDate": "2010-02-01T02:25:16.357-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "284310",
    "ThreadId": "82708",
    "Html": "<p>On some level, this is true, DKs feel &quot;squishier&quot; than our shield-bearing brethren.&nbsp; I have heard this from all of my healers, even when comparing with similarly or slightly less geared Pally tanks in my guild.&nbsp; That's not to say that STA is the end-all-be-all.&nbsp; The default formula's that I'm using do not mathematically work out defense as being required before going on.&nbsp; So in order to gear that way, you want to enter in the optimizer: &quot;% Chance to be Crit &lt;= 0&quot; as a secondary option.&nbsp; Also I would like you to look at the mouse-over tool tips for different scores: Survival, Mitigation, and Threat.&nbsp;</p>\r\n<p>Survival speaks to you should have &quot;enough&quot; of this so that you don't die too quickly.&nbsp; Generally this is how much unmitigated damage you could take before dying.</p>\r\n<p>Mitigation is how you avoid/mitigate damage, and depending on the volume and types of damage that are coming in, will determine what will help here.&nbsp; This is how you extend your time to live.&nbsp; When the experimental switch is enabled, this number looks at first glance, really low.&nbsp; The difference is that in the experimental code, this is Average Damage Mitigated Per Second.&nbsp;&nbsp; It is now at the same scale as Threat, but that makes it look low compared to survival, since most tanks can handle 3-6+ seconds of being beat on by the boss before dying.&nbsp;&nbsp; I'll be adding a time multiplier for this value in a near future release to help balance it out.&nbsp;</p>\r\n<p>There is no right answer for how much survival vs. mitigation you need, and in what forms.&nbsp; Some may prefer to stack mitigation, others esp. at EJ say that Stamina/survival is the only thing to stack.&nbsp; Some like the main tank in my guild, mix it up.&nbsp; That is why there are so many ways to tweak the kinds of numbers in the TankDK module.&nbsp; Each adjustment means something real or representative for changing conditions in the game.</p>",
    "PostedDate": "2010-02-01T09:12:44.08-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]