[
  {
    "Id": "285120",
    "ThreadId": "82969",
    "Html": "<p>Hello,</p>\r\n<p>I am just wondering if I am missing something about this program.&nbsp; I've been using it for my mage for awhile now, and it keeps saying that items that are 258 are better than 277 level items.&nbsp; In specific I am referring to the heroic ToGC armor, vs. the new ICC armor (even the heroic stuff).&nbsp; Also, there seems to be a lot of gear in ICC that drops that Rawr doesn't say is an upgrade for me, but when I do a manual comparison in-game, it's better in almost every single stat.&nbsp; Is there something I'm just not aware of, or not using the tool properly?</p>\r\n<p>&nbsp;</p>\r\n<p>Thanks in advance!</p>",
    "PostedDate": "2010-02-02T21:54:45.23-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "285125",
    "ThreadId": "82969",
    "Html": "<p>You're most likely missing the fact that by only swapping one item you're breaking set bonuses without getting the T10 one. Switch two at the same time to see a more relevant comparison.</p>",
    "PostedDate": "2010-02-02T22:03:29.327-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "285129",
    "ThreadId": "82969",
    "Html": "<p>Okay, thanks for the response; I think that is what I'm doing.&nbsp;</p>\r\n<p>Next question then.&nbsp; I've been using this program by having it open when I play, and when a piece of loot drops, I pull up the slot in question and compare to whether it has a higher DPS score than what I currently have equipped in that slot.&nbsp; This is where I'm getting the idea that the old stuff is rated higher than the new.&nbsp; Is this an incorrect way of using the program?</p>",
    "PostedDate": "2010-02-02T22:12:02.99-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "285138",
    "ThreadId": "82969",
    "Html": "<p>Direct comparisons charts doesn't reflect caps properly (if you are over hit cap and your current gloves are not giving you hit then another glove on that chart with hit will be lower in value in that the extra hit is useless).</p>",
    "PostedDate": "2010-02-02T22:31:11.17-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "285562",
    "ThreadId": "82969",
    "Html": "<p>In other words, there's a better way.&nbsp; Find the item in the Comparisons pane, right-click it, and select &quot;Evaluate Upgrade&quot;.&nbsp; This will run a quick Optimize, with the item in question marked as available.&nbsp; If the item is an upgrade, the resulting dialogue will show both the upgrade value, and the set of gear that it fits in.&nbsp; If it's not an upgrade, it will show as an upgrade value of 0.&nbsp; Warning - make sure that your current set is Optimized.&nbsp; Otherwise, you're comparing an un-Optimized set, versus an Optimized one, in addition to the added item, which will skew the valuation.</p>\r\n<p>&nbsp;</p>\r\n<p>[edit] Typo.</p>",
    "PostedDate": "2010-02-03T16:28:59.873-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]