[
  {
    "Id": "285973",
    "ThreadId": "83200",
    "Html": "<p>I've spent the better part of 4 hours trying to find a way to filter out the trophy of the crusades from the triumph emblem. I've done searches on the forums here as well as google and though I've found people discussing moving the trophy filter to the token filter, that was back in mid december so I'm not sure if anything is still going on for this or not. Simply put, is there a way to, and how do I create a filter to show only gear that can be purchased with emblems of triumph? I currently have no means to raid and get any of the gear that requires the trophies. Any assistance on this matter will save my brain from melting and be greatly appreciated.</p>",
    "PostedDate": "2010-02-04T14:14:38.62-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "285986",
    "ThreadId": "83200",
    "Html": "<p>I currently have a custom filter of this sort for my local version:</p>\r\n<ol>\r\n<li>Tools -&gt; Edit Item Filters -&gt; [New Filter]</li>\r\n<li>Your new blank filter will be a the bottom of the list.</li>\r\n<li>Setup a name for it like &quot;Disable Trophy&quot; </li>\r\n<li>Put in the pattern dialog: &quot;Trophy&quot; w/o the quotes.</li>\r\n<li>Uncheck &quot;Additive Filter&quot;</li>\r\n<li>[OK]</li>\r\n</ol>\r\n<p>Now that you have the filter on your list, when looking at badge loot for example:</p>\r\n<p>Disable all filters except for [Special Currency] -&gt; [Emblems of Triumph] and [Disable Trophy]</p>\r\n<p>This will give you a list of only Emblem gear that will be purchasable w/o Trophies.&nbsp;</p>",
    "PostedDate": "2010-02-04T14:54:38.587-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "286269",
    "ThreadId": "83200",
    "Html": "<p>Thank you so much Shazear! Works great =D And keep up the good work really appreciate all the time and effort that goes into Rawr just to min/max my warlock/shaman/warrior/mage/priest!</p>",
    "PostedDate": "2010-02-05T07:43:59.85-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]