[
  {
    "Id": "286300",
    "ThreadId": "83272",
    "Html": "<p>I'm showing that Mourning Malice is the highest threat weapon for main hand in the database. Is that valid information?</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-02-05T08:39:12.21-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "286320",
    "ThreadId": "83272",
    "Html": "<p>For which model?&nbsp; Threat can be different between the different tank models.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-02-05T09:20:17.857-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "286332",
    "ThreadId": "83272",
    "Html": "<p>It's for the prot paladin model, but if using in the ret pally model, what's the generated threat ? I would like to get a sense of whether I'm impacting my tank's ability to hold aggro.</p>",
    "PostedDate": "2010-02-05T09:51:42.533-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "286364",
    "ThreadId": "83272",
    "Html": "<p>Two-hand weapon for a prot paladin? Does it make any sense?</p>",
    "PostedDate": "2010-02-05T11:14:52.857-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "286380",
    "ThreadId": "83272",
    "Html": "\r\n\r\n<div class=Section1>\r\n\r\n<p class=MsoNormal>That’s not the point.</p>\r\n\r\n<p class=MsoNormal> </p>\r\n\r\n<p class=MsoNormal>I’m trying to determine if the threat generated by\r\nMalice is really as high as the rating infers. I use it as Ret, but if it’s\r\ngenerating that much aggro, am I pulling from my tank? In other words, is the\r\nthreat rating being shown by Rawr accurate? This is a 213 epic 2h weap that\r\nout-threats 277 epic weaps. See what I’m saying?</p>\r\n\r\n<p class=MsoNormal> </p>\r\n\r\n</div>\r\n\r\n",
    "PostedDate": "2010-02-05T12:16:58.85-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "286381",
    "ThreadId": "83272",
    "Html": "<p>Uhhh... what? Like, not even sure what you're trying to compare.</p>\r\n<p>Are you trying to use the Prot Paladin model to determine how much threat you'd do with different weapons, as a Ret pally? Cause uh, that's pretty silly... Use Rawr.Retribution for Retribution, and Rawr.ProtPaladin for Protection. Trying to use the other one is totally wrong.</p>",
    "PostedDate": "2010-02-05T12:21:28.223-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "286387",
    "ThreadId": "83272",
    "Html": "<p>Let me give you the scenario that I'm trying to work through so you understand why I'm doing this.</p>\r\n<p>I'm in an instance as ret, using my rotation, plus malice. Next thing I know, I'm pulling aggro big time with just a regular rotation. I switch to titansteel bonecrusher, no more aggro. So, yes, Malice is better than tsbc, but I'm trying to find out via Rawr what sort of threat I'm generating when using Malice in DPS. Can the tool show that data in the ret spec?</p>\r\n<p>Thanks for the time!</p>",
    "PostedDate": "2010-02-05T12:34:46.257-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "286418",
    "ThreadId": "83272",
    "Html": "<p>Your threat as ret is purely related to the amount of damage you are doing.&nbsp; So if you are having less threat problems with the Bonecrusher then it is either because your tank has lifted his game or you are doing less damage.&nbsp;&nbsp; There is no inherent extra threat in a weapon just extra damage. &nbsp; Your job is to maximise your damage without pulling agro, if you are getting close to the tank then you can either stop DPS for a while (as a druid this has happened to me before) or use Hand of Salvation on yourself (pretty sure you can do that).</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-02-05T14:02:54.81-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "286419",
    "ThreadId": "83272",
    "Html": "<p>No, the Retribution model is not designed to show your threat output. However, if you are out-threating your tank there's not much you can do without compromising your DPS. The best thing is to find out what the Tank is doing wrong and fix them.</p>",
    "PostedDate": "2010-02-05T14:06:13.493-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "286423",
    "ThreadId": "83272",
    "Html": "\r\n\r\n<div class=Section1>\r\n\r\n<p class=MsoNormal>Ok, that helps a bit – the diff between the two weaps\r\nisn’t that great, but the STR bonus is. I’m just going back to what\r\nI was asking about RAWR. If the threat is specific to the damage done, why does\r\nRawr have such a vast diff in threat for Malice? Doesn’t seem possible to\r\nme unless I’m missing the hits on TPS around expertise, AP, etc. I appreciate\r\nthe thoughts. This probably is one I can continue on the blizz bbs, but I have\r\nto say, I’m still concerned that the TPS data/calc for Malice in Rawr may\r\nbe a bit off ;)</p>\r\n\r\n<p class=MsoNormal> </p>\r\n\r\n<p class=MsoNormal>Thanks folks</p>\r\n\r\n<p class=MsoNormal> </p>\r\n\r\n</div>\r\n\r\n",
    "PostedDate": "2010-02-05T14:13:49.053-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "286425",
    "ThreadId": "83272",
    "Html": "<p>You are comparing Apples with Oranges... or rather more specifically Red Apples with Green Apples.</p>\r\n<p>Looking at the Prot model if you put a 2h weapon in it's going to throw things off because it's not designed for a character all stacked out in DPS Gear and a 2h DPS Weapon and then only swapping to a 1h DPS Weapon, of course the threat values are going to look totally different.</p>\r\n<p>See, now that's the other problem, you were comparing Malice, a 2h weapon to Bonecrusher, a 1h weapon.</p>",
    "PostedDate": "2010-02-05T14:28:26.16-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "286430",
    "ThreadId": "83272",
    "Html": "<p>You would also not be able to determine your TPS using a Retribution spec in the ProtPaladin model. &nbsp; The model assumes you are using a ProtPaladin rotation, which would not be accurate considering you wouldn't even have one of the talents needed for a standard 969 Protection rotation.</p>",
    "PostedDate": "2010-02-05T14:48:38.04-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "286431",
    "ThreadId": "83272",
    "Html": "<p>No, I'm pretty sure he's comparing Turnips and Zimbabwe.</p>",
    "PostedDate": "2010-02-05T14:49:23.147-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "286480",
    "ThreadId": "83272",
    "Html": "\r\n\r\n<div class=Section1>\r\n\r\n<p class=MsoNormal>Nah, not that. Maybe grape and cherry. Wines.</p>\r\n\r\n<p class=MsoNormal> </p>\r\n\r\n<p class=MsoNormal>I got the answer I want from the blizz forums. Malice’s\r\nhuge STA and that bit of EXP is biting into my tank’s threat; and our\r\ntank is under-geared.</p>\r\n\r\n<p class=MsoNormal> </p>\r\n\r\n</div>\r\n\r\n",
    "PostedDate": "2010-02-05T18:37:38.83-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "286481",
    "ThreadId": "83272",
    "Html": "<p>...what? Don't know what the blizz forums told you, but that's totally wrong.</p>\r\n<p>Stamina doesn't change your threat one bit.</p>\r\n<p>Exp only changes your threat by simply doing more damage. Same with anything else. The only thing you're going to do to reduce your threat, is to reduce your damage, which you can do without gimping your gear by just slowing your attacks when you get high on threat.</p>",
    "PostedDate": "2010-02-05T18:40:50.997-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "286494",
    "ThreadId": "83272",
    "Html": "<p>Crap.. Whatever the TS 2H mace is. Anyway, that's what I am trying to understand - how does the model work in Rawr. The boss doesn't care if I am spec'd to tank when I am DPS'ing. Only what the math says my threat is. So your info here helps me make sense of the thing. Thanks.</p>",
    "PostedDate": "2010-02-05T19:47:08.953-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "286573",
    "ThreadId": "83272",
    "Html": "<p><span style=\"font-size:10pt;font-family:Arial;font-weight:Normal\">That's ok. The other two guys got what I was trying to sort out. Meant to say STR not STA, but dmg = threat is the best answer, and it's the tank's job to outthreat DPS but if he can't then I need to do a better job on reducing dmg. I misunderstood what the two models in RAWR actually do, so I have a much better under standing now.<br><br>That said, can you explain this? All other arguments aside, if I am a prot pally and for some unknown reason I use malice as a tank, why is its threat so much higher than all other weaps? Does the model only account for 1h plus shield? Just curious at this point...<br><br>Signed,<br>Turnip in Zimbabwe<br></span></p>",
    "PostedDate": "2010-02-06T05:56:08.953-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "286621",
    "ThreadId": "83272",
    "Html": "<p>If you're a tank and equip a 2hander (such as malice), you threat would be much higher because you will be doing much more damage (weapon damage from 2handers &gt; weapon damage from 1handers). Now you'll also be a very bad tank since you'll be getting hit more and for more damage than you would be using 1h + shield, but you'll be doing much more damage.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-02-06T09:43:31.313-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "287453",
    "ThreadId": "83272",
    "Html": "<p>This is one of those &quot;facepalm&quot; posts.</p>",
    "PostedDate": "2010-02-09T00:21:45.723-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "287823",
    "ThreadId": "83272",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>phasmy wrote:</strong><br>\r\n<p>This is one of those &quot;facepalm&quot; posts.</p>\r\n</blockquote>\r\n<p>No kidding.</p>\r\n<p>Scottpal, the weapon is showing with massive threat because it is, well, a beast.&nbsp; All 2hand weapons will show up that way.&nbsp; Paladins cannot tank with 2h weapons, so it's invalid.</p>\r\n<p>The Prot model assumes the use of Righteous Fury and the associated talents, boosting threat 90% [unless it's changed since BC, when I last paid attention to it] compared to ret.&nbsp; There is simply no comparison.</p>\r\n<p>If you are pulling regularly from your tank, there's a few things you can do.</p>\r\n<p>-get a better tank</p>\r\n<p>-reduce your damage output [swapping weapons would help immensely, since weapon DPS is a large part of this]</p>\r\n<p>-accept that you can tank heroics in ret gear/spec</p>\r\n<p>-See that symbol in your spellbook that has two hands reaching out to push against each other / triangle in a circle?&nbsp; Cast that on yourself every once in a while.</p>\r\n<p>-Wait for the tank to get threat.&nbsp; Speaking as a tank, 90% of threat issues are caused by overeager DPS deciding that &quot;well, the tank pulled, that means he has aggro&quot;.&nbsp; Not true.&nbsp; Personally, it takes me 1-2 seconds to acquire aggro&nbsp; most of the time, but every once in a while I have rage issues [all dodges don't provide enough rage] and it can take me up to 5 seconds to actually be able to hit them, longer if the DPS immediately runs in and AoEs [mother****ing Divine Storm!], since if I don't get hit I don't generate threat.&nbsp; It's not as bad with paladin tanks - they start with a &quot;full&quot; threat bar - but it's still less than pleasant if they miss with their first attack.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-02-09T13:16:06.91-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "287869",
    "ThreadId": "83272",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>scottpal wrote:</strong><br>\r\n<p><span style=\"font-size:10pt;font-family:Arial;font-weight:Normal\">That said, can you explain this? All other arguments aside, if I am a prot pally and for some unknown reason I use malice as a tank, why is its threat so much higher than all other weaps? Does the model only account for 1h plus shield? Just curious at this point...<span style=\"font-family:'Segoe UI', 'Microsoft Sans Serif', Arial, Geneva, sans-serif\"><span style=\"font-style:normal\"><span style=\"font-family:Arial\"><em><br></em></span></span></span></span></p>\r\n</blockquote>\r\n<p>Yes, the model only accounts for 1h plus a shield. &nbsp;If you equip a 2-hander in Rawr, the model is not smart enough to realize this and is still going to try to do a 969 rotation... two abilities of which involve using a shield, and one ability of which requires a 1-handed weapon. &nbsp;Rawr thinks you can still use those abilities and scales your threat much higher than it would be in game, when you only have two of the five abilities from the rotation available. &nbsp;In short, Rawr.ProtPaladin is not accurate when using 2-handed weapons.</p>\r\n<p>I don't even know what a prot paladin rotation would be without a shield. &nbsp;All you'd have is judgement and consecration in addition to your seal and white damage.</p>",
    "PostedDate": "2010-02-09T15:01:58.123-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "287873",
    "ThreadId": "83272",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>roncli wrote:</strong><br>\r\n<p>I don't even know what a prot paladin rotation would be without a shield. &nbsp;All you'd have is judgement and consecration in addition to your seal and white damage.</p>\r\n</blockquote>\r\n<p>&nbsp;</p>\r\n<p>A scenario that is asinine to even bother considering.</p>\r\n<p>&nbsp;</p>\r\n<p>I think rawr assumes a certain basic understanding of game mechanics.</p>",
    "PostedDate": "2010-02-09T15:13:59.003-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "287878",
    "ThreadId": "83272",
    "Html": "<p>I</p>\r\n<p>It may be valid to say that the defect in ProtPally is that 2H should not be on the valid items list.</p>",
    "PostedDate": "2010-02-09T15:18:32.943-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "287882",
    "ThreadId": "83272",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>Shazear wrote:</strong><br>\r\n<p>It may be valid to say that the defect in ProtPally is that 2H should not be on the valid items list.</p>\r\n</blockquote>\r\n<p>As far as I know it isn't, but Rawr doesn't dequip an item when you change models to one that can't wear an item on the paper doll. So when he's switching from Ret to Prot, its keeping all his items active. When he manually changes the item over to a 1h/shield the currently equippe item would disappear fromteh list (unless it has a green diamond).</p>",
    "PostedDate": "2010-02-09T15:32:42.633-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "287895",
    "ThreadId": "83272",
    "Html": "\r\n\r\n<div class=Section1>\r\n\r\n<p class=MsoNormal>For those of you showing a little decency in the thread (in\r\nother words, not being juvenile), thanks. I’m not a long time player and\r\nI am still learning. This is my first L80 toon. Did you pick up on that?\r\nThought you might.</p>\r\n\r\n<p class=MsoNormal> </p>\r\n\r\n<p class=MsoNormal>I ran the gear I have from armory through, switched to Prot\r\nto see if I could understand the main hand item threat not realizing that all\r\nthe other stuff from my toon was being run through the Rawr model and creating\r\nthe theoretical threat number. Fine. Also did not quite get that as DPS, TPS and\r\nDPS have a lot of similarities.</p>\r\n\r\n<p class=MsoNormal> </p>\r\n\r\n<p class=MsoNormal>Second bit here, when I switch to the Prot model, there is\r\nno rotation noted – is that a default built into the model that can be\r\nchanged at all? I’d like to keep working on my tank spec along the way.</p>\r\n\r\n<p class=MsoNormal> </p>\r\n\r\n<p class=MsoNormal>Thanks for the positive feedback, and keep up the good work\r\nRawr team.</p>\r\n\r\n</div>\r\n\r\n",
    "PostedDate": "2010-02-09T16:06:58.9-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "287931",
    "ThreadId": "83272",
    "Html": "<p>There's a rotation, take a look at Elitist Jerks, Tankspot and Maintankadin for more information.&nbsp; IIRC it's a cycle of 9 and 6 second cd abilities, commonly called 9/6/9.&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-02-09T17:00:55.59-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "287976",
    "ThreadId": "83272",
    "Html": "\r\n\r\n<div class=Section1>\r\n\r\n<p class=MsoNormal>Thanks. I know what the rotation is, but I don’t see\r\nit in Rawr.</p>\r\n\r\n<p class=MsoNormal> </p>\r\n\r\n</div>\r\n\r\n",
    "PostedDate": "2010-02-09T17:40:18.793-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "288002",
    "ThreadId": "83272",
    "Html": "<p>Why are you looking for it in Rawr? (Seriously asking)</p>\r\n<p>There's only one rotation, all Prot Pallies use it, it's clearly known everywhere, it doesn't change... If it varied by your gear, it'd be appropriate to show in Rawr.</p>",
    "PostedDate": "2010-02-09T19:25:39.26-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "288221",
    "ThreadId": "83272",
    "Html": "<div>\r\n<p><span style=\"font-size:11.0pt;font-family:'Calibri','sans-serif';color:#1F497D\">Just for comparisons, using different glyphs, gear, etc. Wasn&rsquo;t sure what the fluctuations might be. Higher DPS = more threat, plus RF buff and the talents makes for a great tank.</span></p>\r\n<p><span style=\"font-size:11.0pt;font-family:'Calibri','sans-serif';color:#1F497D\">&nbsp;</span></p>\r\n<p><span style=\"font-size:11.0pt;font-family:'Calibri','sans-serif';color:#1F497D\">What&rsquo;s better for the tanking role, druid or pally?</span></p>\r\n</div>",
    "PostedDate": "2010-02-10T05:56:10.097-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "288287",
    "ThreadId": "83272",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>scottpal wrote:</strong><br>\r\n<div>\r\n<p><span style=\"font-size:11.0pt;font-family:'Calibri','sans-serif';color:#1F497D\">...Higher DPS = more threat...</span></p>\r\n<p><span style=\"font-size:11.0pt;font-family:'Calibri','sans-serif';color:#1F497D\">&nbsp;</span></p>\r\n</div>\r\n</blockquote>\r\n<p>Actually, this isn't necessarily true.&nbsp; I mean, overall it is, but if you graph DPS &gt; Threat it not all spells scale at the same linear rate.&nbsp; Some spells have innate modifiers that will boost the threat%*Damage.&nbsp; (Yes, I know, I'm being a bit pedantic).</p>\r\n<p>As for &quot;better&quot;...&nbsp; personally, I don't think any class is currently &quot;the one&quot; to use.&nbsp; Druids have a little more health overall, but less damage reduction and worse &quot;oh shit!&quot; survival options [compare Ardent Defender to Survival Instincts].&nbsp; Each has strengths and weaknesses, though some are better for some things than others and they are certainly better balanced than BC tanking [You want me to do Magisters with a BEAR?&nbsp; LOL!].</p>",
    "PostedDate": "2010-02-10T08:13:23.303-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "288358",
    "ThreadId": "83272",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>Astrylian wrote:</strong><br>\r\n<p>Why are you looking for it in Rawr? (Seriously asking)</p>\r\n<p>There's only one rotation, all Prot Pallies use it, it's clearly known everywhere, it doesn't change... If it varied by your gear, it'd be appropriate to show in Rawr.</p>\r\n</blockquote>\r\n<p>&lt;cough, cough&gt;</p>\r\n<p>Bull.</p>\r\n<p>http://maintankadin.failsafedesign.com/guides/theorycraft/969-and-fcfs-rotation-theory</p>\r\n<p>I mean, I agree that 969 is absolutely the way to go while doing main tanking - but looking at this, I'm not sure I see an absolute reason FCFS could not be used to boost threat in certain situations [ie, waiting for your turn as tank on a boss, tanking &quot;trash&quot; like Precious/Stinky [level 80 mobs, that hit less] or while sitting there taking saber lashes on Marrowgar].&nbsp; Add in over-geared tanks mana-starving themselves in Heroics that may want to say &quot;screw the defenses, I want threat!&quot;&nbsp; Add to that differing circumstances [perhaps prioritizing Exorcism/Holy Wrath higher in some situations dealing with undead] and you have yourself options.</p>\r\n<p>That said, I'd argue that on a priority list getting the rotation shifting working for Paladins is probably somewhere near knitting them a nice sweater; it's not worth the time and effort, since 969 is fine 99.99% of the time.&nbsp; But there's a difference between 99.99% of the time and what you said.</p>\r\n<p>Hell, while I don't THINK it would matter enough to be important, I for one would love to see what kind of survivability I could get with a FCFS/threat rotation - if my tank was a paladin.&nbsp; He isn't, so I get stuck with my only method of making the healers work harder being Bressing while tanking [shoulda heard the reaction of the raid leader when I ressed someone while tanking Jaraxxus-25..]</p>",
    "PostedDate": "2010-02-10T10:12:12.673-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]