[
  {
    "Id": "286489",
    "ThreadId": "83318",
    "Html": "<p>As an example, I currently have Idol of Lunar Fury which Rawr rates as BiS for me.&nbsp; ElitistJerks speaks strongly of the Idol of Lunar Eclipse.&nbsp; The latter is rated lower in the list by Rawr with a DPS loss of over 200 points.</p>\r\n<p>How can I trust either source when they disagree?&nbsp; EJ is highly respected for metrics and likewise I respect Rawr.</p>\r\n<p>This is only one instance of many as I seek to improve my character.&nbsp; Please help me see through this fog.</p>\r\n<p>&nbsp;</p>\r\n<p>Thank you,</p>\r\n<p>Eldorann / Antonidas</p>",
    "PostedDate": "2010-02-05T19:17:12.693-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "286490",
    "ThreadId": "83318",
    "Html": "<p>Is it BiS at your current gear or against EJ's actual BiS list? There's a big difference.</p>",
    "PostedDate": "2010-02-05T19:22:22.897-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "286597",
    "ThreadId": "83318",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>Jothay wrote:</strong><br>\r\n<p>Is it BiS at your current gear or against EJ's actual BiS list? There's a big difference.</p>\r\n</blockquote>\r\n<p>When I click the gear-piece on my character slot, Rawr displays the Idol of Lunar Fury at the top of the list.&nbsp; Hench it should be BiS.&nbsp; In general, EJ recommends the Idol of Lunar Eclipse over the the Idol of Lunar Fury.</p>\r\n<p>I ask the question at the foundation of the issue.&nbsp; When Rawr and EJ disagree on recommendations, who do I trust?</p>\r\n<p>&nbsp;</p>\r\n<p>Eldorann / Antonidas</p>",
    "PostedDate": "2010-02-06T08:32:09.47-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "286603",
    "ThreadId": "83318",
    "Html": "<p>People on EJ like to theorycraft these &quot;Dream Team&quot; gearsets that 99% of the WoW playerbase will never completely put together. Usually they start doing this when the content that drops the items and the items themselves aren't completely implemented yet. They are understandably concerned with figuring out absolute max performance with best possible gear on a level with that available to the top 100 most-progressed guilds.</p>\r\n<p>Regular players such as me and you see these idiotically-named &quot;Best-In-Slot&quot; castles in the sky and think that anything not on that list then obviously must not be worth spending dkp or karma or rolling on.</p>\r\n<p>If you're one of those 1% of players who can reasonably expect to gather every single item they could possibly want for their mainspec in a specific tier of content before the next content is out - then by all means, follow the &quot;BiS&quot; list crowd and avoid upgrades that could help you but aren't on the list while you're collecting the listed gear, and then possibly be optimal after you're done, just in time for the next raid instance.</p>\r\n<p>Or - you can trust Rawr to figure out what's best for YOU. Right NOW. In YOUR situation. Based on YOUR available gear, YOUR available raidbuffs/debuffs - keeping in mind that Rawr has limitations.</p>\r\n<p>...Such as not being all that for dynamic fight analysis (yet), occasionally not immediately modelling a newly-released item mechanic correctly - or an item mechanic that keeps changing, like Nibelung or Deathbringer's Will. It'll take a bit of time until stuff like that is correctly modelled.</p>\r\n<p>Final analysis:</p>\r\n<p>Educate yourself on Rawr's model and items. Understand why people on EJ do what they do with these lists. Then make an informed decision taking into account all available data.</p>",
    "PostedDate": "2010-02-06T08:47:44.653-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "286647",
    "ThreadId": "83318",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>eldorann wrote:</strong><br>\r\n<p>When I click the gear-piece on my character slot, Rawr displays the Idol of Lunar Fury at the top of the list.&nbsp; Hench it should be BiS.</p>\r\n</blockquote>\r\n<p>That's where your assumptions started going awry. Just because it's at the top of the list for your current character, as it presently stands, does not mean it's a BiS item per the lists posted on EJ. It means that that item would give your character the most benefit for what you have set up. If you were to move stats around and drop Hit Rating, that would certainly change what showed as top of the list on various slots as that would change what items give you the most DPS.</p>",
    "PostedDate": "2010-02-06T10:54:26.783-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "286691",
    "ThreadId": "83318",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>eldorann wrote:</strong><br>\r\n<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>Jothay wrote:</strong><br>\r\n<p>Is it BiS at your current gear or against EJ's actual BiS list? There's a big difference.</p>\r\n</blockquote>\r\n<p>When I click the gear-piece on my character slot, Rawr displays the Idol of Lunar Fury at the top of the list.&nbsp; Hench it should be BiS.&nbsp; In general, EJ recommends the Idol of Lunar Eclipse over the the Idol of Lunar Fury.</p>\r\n<p>I ask the question at the foundation of the issue.&nbsp; When Rawr and EJ disagree on recommendations, who do I trust?</p>\r\n</blockquote>\r\n<p>Jothay answered the first part, Lunar fury is the biggest upgrade to your current gear/talents.&nbsp; If you change out all your other gear to other things it may no longer be the best item.</p>\r\n<p>The answer to your &quot;core&quot; question is however different.&nbsp; BiS lists are silly.&nbsp; Those items are BiS in those slots <span style=\"text-decoration:underline\">IF AND ONLY IF</span> you have <span style=\"text-decoration:underline\">all the other items</span> in <span style=\"text-decoration:underline\">all the other slots</span>.&nbsp; So really BiS lists are not terribly useful except in very long term gear planning decisions.</p>\r\n<p>Rawr will advise you about what the best move for your character is NOW.&nbsp; EJ tends to try to answer the question &quot;What is the best set I can possibly have if I had everything&quot;.&nbsp; You can answer that question in Rawr too but it's not as simple.&nbsp; The models may also vary a little but that's neither here nor there and can't be easily quantitatively measured.</p>",
    "PostedDate": "2010-02-06T14:59:44.673-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "287199",
    "ThreadId": "83318",
    "Html": "<p>I'm impressed so many people replied to this topic without actually taking the time to look at the items and answer his real question: which idol is better, and what should he trust in this specific instance (as opposed to generalizing about particular discussions which they may not have even read). &nbsp;<br><br>Lunar Fury is a chance on moonfire damage of putting up 200 crit rating, and doesn't stack. &nbsp;If it works like the feral idols, it should be worth somewhere in that neighborhood (i.e. it's designed to be active most of the time, although not guaranteed).&nbsp;</p>\r\n<p>Lunar Eclipse is a 5-stack of 44 crit rating that builds from moonfire/IS periodic damage, and stacks up to 5 times, resulting in a total of 220 crit rating.</p>\r\n<p>With the same stat being increased and (to my knowledge) gear level having no impact on the uptime of these items, BiS/non-BiS shouldn't be a factor here.&nbsp;</p>\r\n<p>Now, not knowing how the moonkin model works in any way (i.e. if they average the startup time for Lunar Eclipse, how much downtime Lunar Fury has, whether there are planned &quot;interruptions&quot; that can be set), Lunar Eclipse should have a clear edge over &nbsp;Lunar Fury in a 5-minute stand-and-DPS type of fight, regardless of gear level. &nbsp;(At any gear level, I'm assuming, you'll want MF or IS in your cycle). &nbsp;</p>\r\n<p>Way to completely not answer his question and instead frame it as an &quot;us against the world, and we're always right&quot; situation. &nbsp;</p>\r\n<p>So-- is Eldorann choosing a setting which sets up Lunar Fury to have an advantage, or is the Lunar Eclipse idol bugged?&nbsp;</p>",
    "PostedDate": "2010-02-08T08:43:41.48-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "287220",
    "ThreadId": "83318",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>Allev wrote:</strong><br>\r\n<p>I'm impressed so many people replied to this topic without actually taking the time to look at the items and answer his real question: which idol is better, and what should he trust in this specific instance (as opposed to generalizing about particular discussions which they may not have even read). &nbsp;<br><br>Lunar Fury is a chance on moonfire damage of putting up 200 crit rating, and doesn't stack. &nbsp;If it works like the feral idols, it should be worth somewhere in that neighborhood (i.e. it's designed to be active most of the time, although not guaranteed).&nbsp;</p>\r\n<p>Lunar Eclipse is a 5-stack of 44 crit rating that builds from moonfire/IS periodic damage, and stacks up to 5 times, resulting in a total of 220 crit rating.</p>\r\n<p>With the same stat being increased and (to my knowledge) gear level having no impact on the uptime of these items, BiS/non-BiS shouldn't be a factor here.&nbsp;</p>\r\n<p>Now, not knowing how the moonkin model works in any way (i.e. if they average the startup time for Lunar Eclipse, how much downtime Lunar Fury has, whether there are planned &quot;interruptions&quot; that can be set), Lunar Eclipse should have a clear edge over &nbsp;Lunar Fury in a 5-minute stand-and-DPS type of fight, regardless of gear level. &nbsp;(At any gear level, I'm assuming, you'll want MF or IS in your cycle). &nbsp;</p>\r\n<p>Way to completely not answer his question and instead frame it as an &quot;us against the world, and we're always right&quot; situation. &nbsp;</p>\r\n<p>So-- is Eldorann choosing a setting which sets up Lunar Fury to have an advantage, or is the Lunar Eclipse idol bugged?&nbsp;</p>\r\n</blockquote>\r\n<p>Actually, the reason why there haven't been replies asking that question is pretty easy to figure out. &nbsp;The original poster brought it across as a 'case in point' to the question of 'What happens when EJ and Rawr disagree?'. &nbsp;</p>\r\n<p>If he/she brought it across as 'The T9 200 crit idol is showing as Lower then the T10 220 Crit idol, what could be causing this?' &nbsp;in which we would reply with 'This sounds like a possible error, post in the issue tracker with your character XML and as much detail as you can put in it.</p>\r\n<p>How you ask a question is almost always more important then the actual question.</p>",
    "PostedDate": "2010-02-08T09:44:56.567-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "287239",
    "ThreadId": "83318",
    "Html": "<p>Speaking from personal experience - my Main from T8 - T9 was a druid, and my wife's main is a paladin - I very quickly came to the conclusion that Idol/Libram/totem procs and usefulness are generally very poorly handled by Rawr [though, to be honest, I'm not entirely certain how well they can be modeled in general; the most useful ones tend to be the more situational buffs].&nbsp; Quite frequently, the idol suggested by Rawr was not just in the &quot;not the best I have&quot; category, it was in the &quot;almost completely worthless&quot; category.&nbsp; [e.g., Idol of the Wastes &gt; Idol of Terror, for tanking/overall, tanking/mitigation and tanking/survival].&nbsp; Ret Paladins have something similar; depending on the fight and other gear there are two to four different librams they can use [as I recall one is DS, one is Judgement, one is Seal of Command, can't remember the last one.]</p>\r\n<p>(and before someone says &quot;but the idol of terror is BC, it must be worse!&quot; - it was BiS pre-General Vezax for tanks, since Agi &gt; Str.&nbsp; The one off of General was a direct upgrade.)</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-02-08T10:24:53.97-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "287268",
    "ThreadId": "83318",
    "Html": "<p>The actual questions asked were &quot;How does Rawr relate to ElitistJerks when it disagrees about gearing?&quot; and&nbsp;&quot;How can I trust either source when they disagree?&quot;. &nbsp; Perhaps all the posters trusted in both EJ and Rawr to be right at that very instance, so the assumptions between them must have disagreed. &nbsp;There was no commentary on &quot;you can trust Rawr because X&quot;, there was only &quot;you must have looked at a BiS list on EJ, and those have these limitations.&quot; &nbsp; Which works when you're juggling stat caps, but isn't at all true when the limitations don't apply to the situation. &nbsp;And when the error is far out of proportion with reality. &nbsp;</p>\r\n<p>In other words, their method was to say &quot;you can trust them because you're probably the weak link,&quot; &nbsp;when it's likely in this situation that Rawr doesn't have the right stats for those items.</p>",
    "PostedDate": "2010-02-08T12:00:28.017-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "287301",
    "ThreadId": "83318",
    "Html": "<p>Eldorann,</p>\r\n<p>I do not get the results you indicate. &nbsp;Try refreshing both of those idols from WoWHead.</p>\r\n<p>It should be noted that the Idol of the Lunar Eclipse is too powerful in Rawr due to it being assigned TWO separate stacks of 5x 44 crit. &nbsp;I have noted this in the existing issue 16170. &nbsp;The fact that you are seeing Idol of Lunar Fury higher seems to point to the fact that your data is not current.</p>\r\n<p>Easy enough. :)</p>",
    "PostedDate": "2010-02-08T13:38:57.26-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "287315",
    "ThreadId": "83318",
    "Html": "<p>Having just downloaded a fresh 2.3.8, the default item cache includes a big fat &quot;no enchant.&quot; on Lunar Eclipse. &nbsp; So data in the release wasn't current.&nbsp;</p>\r\n<p>Refreshing from Wowhead gives it two stacks instead of one, as you mentioned.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-02-08T14:18:23.133-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "287366",
    "ThreadId": "83318",
    "Html": "<p>Parsing and modelling of the item has been fixed in commit 46372. The 2.3.9 release will properly show it with one effect that operates on both triggers.</p>\r\n<p>This change also showed it at BiS when I made a dummy 264+ toon.</p>",
    "PostedDate": "2010-02-08T16:49:24.097-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]