[
  {
    "Id": "286509",
    "ThreadId": "83323",
    "Html": "<p>Hi,</p>\r\n<p>Been exploring RAWR and decided to use it to upgrade my Bear gear.&nbsp; I've been previously stacking STAM gems everywhere I can, and now with RAWR I'm switching to AGI over STAM (slowly).&nbsp; Anyway, I'm in the process of upgrading my gear and came across a belt upgrade suggested by RAWR that has me puzzled.&nbsp; I'm currently wearing 'Sharp-Barbed Leather Belt' and looking at the list with filters set to gear I can expect to get, I notice that 'Belt of the Twilight Assassin' is listed above 'Relentless Gladiator's Belt of Triumph', yet to my unskilled eye that belt should provide better mitigation than the Assassin belt.&nbsp; It both has a built in socket, which will give +20 more AGI and even starts with more AGI.&nbsp; Why would this belt be rated lower for mitigation than the Assassin belt?</p>\r\n<p>Wowhead comparison link here <a title=\"http://www.wowhead.com/?compare=41833;45829\" href=\"http://www.wowhead.com/?compare=41833;45829\">http://www.wowhead.com/?compare=41833;45829</a>.</p>\r\n<p>I'm hoping to get a better understanding of how RAWR weights its items so I can make informed decisions...</p>\r\n<p>Thanks!</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-02-05T20:49:13.193-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "286512",
    "ThreadId": "83323",
    "Html": "<p>Expertise, Hit, and AP. They all improve Savage Defense. But more importantly, Expertise reduces parry hastes, thus reducing the damage you take. If you're fighting a boss that doesn't parry haste, uncheck that box on the Options tab.</p>",
    "PostedDate": "2010-02-05T20:57:20.863-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "286513",
    "ThreadId": "83323",
    "Html": "<p>Ah ha!&nbsp; I knew there was a reason -- forgot all about Savage Def... I'll have to look up Parry Haste - thats a new term.</p>\r\n<p>Ok, so I now know more about Parry Haste - if I'm mainly tanking 5 mans, then this is something I need to turn off, right?</p>\r\n<p>Thanks for the quick feedback!</p>",
    "PostedDate": "2010-02-05T20:59:04.48-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "286515",
    "ThreadId": "83323",
    "Html": "<p>I'm not sure if 5man bosses parry haste or not. Regardless, the extra threat will probably be more valuable in 5mans anyway.</p>",
    "PostedDate": "2010-02-05T21:36:53.773-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "287783",
    "ThreadId": "83323",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>Astrylian wrote:</strong><br>\r\n<p>I'm not sure if 5man bosses parry haste or not. Regardless, the extra threat will probably be more valuable in 5mans anyway.</p>\r\n</blockquote>\r\n<p>5 man bosses afaik do have a chance to parry haste.&nbsp; Most hard-normal-hitting raid bosses do not [Thorim and Koralon for example].&nbsp; Also, hit/Expertise cap for 5 mans is minimal compared to Raids, since there's a smaller level difference.&nbsp; If you only tank 5 mans, 22 expertise is plenty.&nbsp; If you tank 10/25 mans, go for 26 minimum and make sure you never beat 56 [but don't gear heavily towards expertise past 26].&nbsp; Hit, take it where you can but don't stress over it; a miss is rarely a wipe [except taunts, gogo glyphs].&nbsp; For raiding MT, gear for survival &gt; all.&nbsp; For Heroics, gear Threat&gt;All+100kSurvival [at least, those were the settings I use].</p>\r\n<p>http://maintankadin.failsafedesign.com/forum/index.php?f=6&amp;t=25841&amp;rb_v=viewtopic</p>\r\n<p>It looks like the parry-haste discussion will be changing to a new thread soon if it hasn't already, but that covers the theory.</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-02-09T12:06:55.05-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]