[
  {
    "Id": "287099",
    "ThreadId": "83500",
    "Html": "<p>Hi, I just read the License, but my english is not so great, I was hoping anyone could clarify for me.</p>\r\n<p>I just made an own version of Rawr, I could contribute the code I made in patches instead, but it's pretty much fail haxx code, first time coding in c :)</p>\r\n<p>The version I made is optimized for affliction warlocks, some changes is made to the UI and rawr.base.</p>\r\n<p>I wount claim any authorship for this version, mostly doing this for myself and for the fun.</p>\r\n<p>So i'm wondering if it's ok to post the source code on this site?</p>",
    "PostedDate": "2010-02-08T04:33:23.817-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "287215",
    "ThreadId": "83500",
    "Html": "<p>You might as well just submit a bunch of patches anyway. The devs might find some nifty stuff to implement, and the worst that could happen is they don't. Give it a try. :)</p>\r\n<p>Before you do that though, you should try to separate as many changes as possible into separate patches so it's easier to figure out what you changed.</p>",
    "PostedDate": "2010-02-08T09:26:21.877-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "287394",
    "ThreadId": "83500",
    "Html": "<p>Please do not release/link altered version of Rawr. Rawr is open-source, and we welcome additions. Please post your changes via the Patch page of the Source Code tab. We'll get it integrated into the main release.</p>",
    "PostedDate": "2010-02-08T19:27:43.137-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "287772",
    "ThreadId": "83500",
    "Html": "<p>Yes yes yes please post patches for people to review/implement.&nbsp; The base/true Rawr Warlock model has been hosed up to unusability status for all precision purposes* for months, and while ArP has been working on it he's unresponsive and/or slow enough [RL intrudes, I am sure] that the 95% complete pet-code [per his post 1/23] hasn't been completed afaik.&nbsp; More hands/eyes = good.</p>\r\n<p>&nbsp;</p>\r\n<p>*Precision purposes:&nbsp; Sure, it's good enough right now to build general upgrade lists.&nbsp; What I like to know is the &quot;ideal&quot; set for each spec.&nbsp; Since pet criticals and stats are vitally important to at least two specs I use [rdps demo and destro], the current model can only provide my personal best DPS and not my pet/raid's [that is, does increasing my spellpower by x plus my crit by y beat the loss of haste of z, keeping in mind the bleedover of spellpower and crit to my pet and his ability to proc extra crits/spellpower for myself and others based on his spellpower?]</p>",
    "PostedDate": "2010-02-09T11:45:20.393-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]