[
  {
    "Id": "289112",
    "ThreadId": "84470",
    "Html": "<p>Granted this is a GREAT tool, it has done wonders for my DPS spec, but my UH tank spec is my secondary spec and I am really not sure which settings i should be setting to what, unfortunatly the tooltips aren't all that new user friendly (well at least to me)</p>\r\n<p>&nbsp;</p>\r\n<p>I am wondering what my seetings SHOULD be set at to produce my upgrades list for Lootplanner.</p>\r\n<p>&nbsp;</p>\r\n<p>Any help here would be very much appriciated.</p>\r\n<p>&nbsp;</p>\r\n<p>Also as a Jewel crafter. setting up the gemming templates is comfusing me aswell.&nbsp; read the guides here but am still perplexed.</p>",
    "PostedDate": "2010-02-11T03:59:52.507-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "289735",
    "ThreadId": "84470",
    "Html": "<p>This is not as easy of a question as just saying put these settings in and go.&nbsp; And I agree that I don't have the best tooltips on the options panel as I could, but let me try to give you some guidance here:</p>\r\n<p>In 2.3.8, I'm using the following settings:</p>\r\n<ul>\r\n<li>Threat weight: 1</li>\r\n<li>Survival weight: 1</li>\r\n<li>Boss Attack speed: 2.0 - 2.5</li>\r\n<li>Inc Physical damage: 30k - 60k</li>\r\n<li>Magic Frequency: 20 - 30 </li>\r\n<li>Magic Damage: 10k</li>\r\n<li>Bleed Tick rate: 2 - 3</li>\r\n<li>Bleed Damage: 2k</li>\r\n<li>Parry Haste Enabled.</li>\r\n</ul>\r\n<p>Rotation:</p>\r\n<p>Take the default unholy rotation, and then adjust it to make it match your playstyle and set the type to Custom.</p>\r\n<p>However, these settings are going to be shifting quite a bit come 2.3.9 as there's a pretty significant bug that I just fixed, by finalizing the &quot;experimental&quot; code and making that the method for mitigation valuation.&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-02-11T08:55:06.213-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "289742",
    "ThreadId": "84470",
    "Html": "<p>Excellent... thanks for your help... it was the concept of &quot;weight&quot; that was throwing me, &quot;and the settings aswell TBH&quot;&nbsp; hopefuly now I should be able to get a relevant optimization and upgrade list :)</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-02-11T09:18:35.68-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "289749",
    "ThreadId": "84470",
    "Html": "ICC inc damage should be in the 100k range",
    "PostedDate": "2010-02-11T09:42:58.247-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "290028",
    "ThreadId": "84470",
    "Html": "<p>Thanks guys.. I've now got a nice looking upgrades list for my Tank :)</p>\r\n<p>&nbsp;</p>\r\n<p>on a slightly unrelated topic (doesnt deserve it's own thread) Are there plans in the works to amke a RAWR 'lite' ? Ii.e. select your role from a limited number of options and it will do pretty much the same thing (i.e. just Tank, DPS etc or Healer in each particular class?) because it strikes me as being an AWESOME tool but to use it effectively you have to know a lot more about the mechanics than your average player cares to learn.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-02-12T02:07:45.757-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]