[
  {
    "Id": "290536",
    "ThreadId": "85289",
    "Html": "<p>When I examine my character in Rawr, an Elemental Shaman, do the point values for each listed piece of equipment, including potential upgrades, accurately reflect that piece of equipment's value relative to all other pieces I might acquire?&nbsp; For example, I have the Frost Emblems to acquire the Frost Witch's Hauberk (Gear Score: 457, Rawr Score: 841.16--Rawr Scores assume the best available enchant and gemming, but not necessarily optimized for what my character could be doing, such as 25-man raids) to replace the Firestrider Chestguard (GS 365, RS 535.25).&nbsp; I also could acquire the Waistband of Despair (GS 370, RS 882.08) to replace the Windchill Binding (GS 289, RS 521.07).&nbsp; The net increase for the chest piece is GS 92 and RS 305.91.&nbsp; The net increase for the waist piece is GS 81 and RS 361.01.&nbsp; Thus, according to GS, the best current choice with my available emblems is the chest piece, but if I can consider the relative value of Rawr points to hold across different types of gear, then the best choice according to Rawr would be the waist piece.</p>\r\n<p>Should I go with the relative Rawr score for making this kind of comparison selection, or should I stick with Gear Score.</p>\r\n<p>I would appreciate feedback on this issue from knowledgeable individuals.</p>\r\n<p>&nbsp;</p>\r\n<p>Thanks.</p>",
    "PostedDate": "2010-02-13T15:04:14.767-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "290538",
    "ThreadId": "85289",
    "Html": "<p>What the Gearscore Addon represents has nothing to do with how Rawr evaluates gear. Rawr does an individual calculation of what your character would be with said item.</p>",
    "PostedDate": "2010-02-13T15:11:49.913-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "290545",
    "ThreadId": "85289",
    "Html": "<p>Yeah, Gearscore is entirely irrelevant for gearing. It has absolutely no bearing on your performance, so you shouldn't consider it at all when choosing gear. What matters is the actual stats on the items, which is what Rawr handles.</p>",
    "PostedDate": "2010-02-13T16:18:57.607-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "290546",
    "ThreadId": "85289",
    "Html": "<p>Perhaps I need to clarify my question.&nbsp; I appreciate the revelation that Gear Score is not particularly useful, and that comes as a bit of a surprise to me.&nbsp; However, the main thrust of my question dealt with the relative value of Rawr Equipment Points across equipment types.&nbsp; Consequently, and using the example above, should I assume that the waist is relatively more beneficial to me (because of the greater amount of Rawr score for the waist that I appear to gain) at this point in my gear inventory than the chest.&nbsp; Thanks.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-02-13T16:26:11.01-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "290547",
    "ThreadId": "85289",
    "Html": "<p>Really, Gear score is in absolutely no way indicative of the performance benefit of a piece of gear. The score you see in Rawr is the actual benefit of the piece of gear (or buff, gem, whatever). It's the amount of performance that you would gain by equipping that item (compared to having no item in that slot).</p>",
    "PostedDate": "2010-02-13T16:53:09.777-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "290549",
    "ThreadId": "85289",
    "Html": "<p>Okay, I'm not sure what you mean when you use the term &quot;Gear Score.&quot;&nbsp; I was probably in error for ever including the Gear Score from the Gear Score addon in the discussion in the first place.&nbsp; When you use the term Gear Score, are you referring to the Rawr Calculation?&nbsp; If you are, then I think your answer to my question is a &quot;NO,&quot;:&nbsp; one cannot compare the relative value of different types of equipment (e.g., waist versus chest) by using the values generated by Rawr.&nbsp; Is this true?</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-02-13T17:12:35.007-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "290551",
    "ThreadId": "85289",
    "Html": "<p>Put it this way. You're an elemental shaman.&nbsp; To perform well, you would thus need&nbsp;stats such as spellpower, haste, crit.</p>\r\n<p>Rawr will do exactly that. It will &quot;extract&quot; the stats that are most beneficial to your class and specc and compare items based on that. The end result is that if Rawr says an item is better, it means you'll be better at doing your class/spec role. which is dps.</p>\r\n<p>&nbsp;</p>\r\n<p>Now gearscore, just evaluates items on their own. It doesn't care what class or spec you are.&nbsp; An ilevel 277 item will end up giving you a lot of gearscore, even if it's totally unsuited for your class/spec. It will even tell you an item for enhance spec is &quot;better&quot; for you.&nbsp; It'll boost your GS, but it won't make you do more damage.</p>",
    "PostedDate": "2010-02-13T17:17:56.51-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "290554",
    "ThreadId": "85289",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>ReddGator wrote:</strong><br>\r\n<p>Okay, I'm not sure what you mean when you use the term &quot;Gear Score.&quot;&nbsp; I was probably in error for ever including the Gear Score from the Gear Score addon in the discussion in the first place.&nbsp; When you use the term Gear Score, are you referring to the Rawr Calculation?&nbsp; If you are, then I think your answer to my question in a &quot;NO, one cannot compare the relative value of different types of equipment (e.g., waist versus chest) by using the values generated by Rawr.&nbsp; Is this true?</p>\r\n<p>&nbsp;</p>\r\n</blockquote>\r\n<p>Errr... No.</p>\r\n<p>&quot;Gear Score&quot; = An addon, and website (wow-heroes). It's entirely useless, and should not be used for gear decisions.</p>\r\n<p>Rawr is a tool to evaluate and compare gear. It accurately calculates the value of gear based on the benefit it provides to whatever performance your class/spec does (ie, DPS in your case). It absolutely should be used for gear comparison and selection.</p>",
    "PostedDate": "2010-02-13T18:06:57.96-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "290555",
    "ThreadId": "85289",
    "Html": "<p>So, the answer to my question appears to be that in addition to being able to ascertain that an item I'm wearing is better or worse than another item of the same type (i.e., one chest piece compared to another chest piece), I can also use Rawr to ascertain the relative value of different types of equipment.&nbsp; Consequently, because my aggregate Rawr score increased more by replacing the waist item rather than the chest item, I would benefit the most by using my Frost emblems to get the new waist item.&nbsp; Thank you.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-02-13T18:17:24.983-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "290558",
    "ThreadId": "85289",
    "Html": "<p>Yep, absolutely correct. However, do keep in mind that they cost different amounts of frost badges. You may want to compare the improvement per frost badge. You can do that via Tools &gt; Cost &gt; Load Frost Emblem Costs, then goto the Direct Upgrades By Cost chart.</p>",
    "PostedDate": "2010-02-13T18:32:08.68-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "290567",
    "ThreadId": "85289",
    "Html": "<p>Glad to obtain final resolution.&nbsp; Thanks.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-02-13T19:43:27.823-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "292136",
    "ThreadId": "85289",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>ReddGator wrote:</strong><br>\r\n<p>So, the answer to my question appears to be that in addition to being able to ascertain that an item I'm wearing is better or worse than another item of the same type (i.e., one chest piece compared to another chest piece), I can also use Rawr to ascertain the relative value of different types of equipment.&nbsp; Consequently, because my aggregate Rawr score increased more by replacing the waist item rather than the chest item, I would benefit the most by using my Frost emblems to get the new waist item.&nbsp; Thank you.</p>\r\n<p>&nbsp;</p>\r\n</blockquote>\r\n<p>As Astrylian said earlier in the thread, the Rawr score (main panel) tells you how &quot;good&quot; an item is compared to having nothing in the slot. &nbsp;It doesn't consider making any changes in any other slots.</p>\r\n<p>Note that an item that would really be an upgrade, may not look like an upgrade in the main panel. &nbsp;It might cause you to lose a meta-gem bonus (easily fixed in another slot), or move you significantly above or below some target-stat value (for Moonkin, this might be the hit cap) that could be repaired with minor changes in other slots.</p>\r\n<p>The Upgrade list is a better tool for looking at upgrades. &nbsp;Mark your available items (in addition to your equipped items). &nbsp;The Upgrade list tells you how good a potential upgrade is if you get it, and are willing to make adjustments in other slots (say switch to an available neck with more hit, to make up for loss of hit on the new piece).</p>\r\n<p>Even the values in the Upgrade list only consider acquiring one piece of gear at a time. &nbsp;Trees have fairly strong 4-piece bonuses, and fairly weak 2-piece bonuses. &nbsp;If I have 4t9, buying a single piece of t10 might not be an upgrade, even though buying four pieces would be a significant upgrade. &nbsp;Since Rawr only looks at upgrading one piece at a time, it might not give me a path to 4t10.</p>",
    "PostedDate": "2010-02-18T05:27:36.153-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]