[
  {
    "Id": "290657",
    "ThreadId": "85329",
    "Html": "<p>Hi, I was checking out the rawr retribution model today and I came across a couple of things that didn't seem to be correct. First of all I was wondering why Victor's Call shows a value of 0 for dps. I know im over the expertise cap, but it also has a 20 second attack power buff on it. Second I was wondering why the Weeping gauntlets are rated so low for dps. It does not make any sense at all, it shows a dps rating of 222.14 for them. They have 122 strength (102 + 20 from gem), 49 crit, and 66 haste. There is no way the dps on these gloves should be this low no matter what gear you are wearing. There are many blue gloves rated above it also. I have full 25 man raid buffs included in the dps also.</p>",
    "PostedDate": "2010-02-14T13:19:19.72-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "290664",
    "ThreadId": "85329",
    "Html": "<p>1) Do a refresh on the item Victor's Call, you dont have the proc on the item.</p>\r\n<p>2) Something ELSE on your char is making that item (gloves) fail for you</p>",
    "PostedDate": "2010-02-14T14:19:10.51-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "290808",
    "ThreadId": "85329",
    "Html": "<p>1) trinkets with a stacking type Proc were not implemented until recently.&nbsp; There is code for it in 2.3.9 so it should at least show 'something' as value, although it's possible the actual valuation is still wrong. I'll have to check into the actual implementation/results it's spitting out now.</p>\r\n<p>2) The only obvious reason I can think of off the top of my head is that you are way below hitcap and rawr is currently rating pretty much every other item with hit higher than the weeping gauntlets. If not then probably something else is wrong.&nbsp; Try making a new character and loading from armory, see if that fixes things.&nbsp; If that still doesn't help, an armoury link or your character.xml file would help diagnose the issue.</p>",
    "PostedDate": "2010-02-15T05:07:43.207-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]