[
  {
    "Id": "291340",
    "ThreadId": "85552",
    "Html": "<p>I am wondering if/when we will see the soft cap added for T10 content. &nbsp;I found some previous posts saying to use 300k/100k. &nbsp;but I am wondering if this is truly the numbers people have decided on? &nbsp;As a bear tank, Rawr is starting to change my gemming to agi with the 4piece 264 set bonuses... &nbsp;Thought?</p>\r\n<p>&nbsp;</p>\r\n<p>Thanks!</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-02-16T10:40:58.88-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "291347",
    "ThreadId": "85552",
    "Html": "<p>well, I was the one who said to use 265k for normal 25 ICC and 300k for Heroic 25 ICC. However, I've also noticed the need to run straight agility if I turn off the ICC buff. With all buffs in full 277 gear, if I turn off ICC debuff, it basically wants me to go straight agility, no matter how high or how hard the boss hits. I've set survival cap to 350k, and 200k boss attack power and even in 277 gear, it's agility. Odd if you ask me.</p>",
    "PostedDate": "2010-02-16T10:50:49.78-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "291349",
    "ThreadId": "85552",
    "Html": "<p>Honestly, this isn't really something the Rawr boards can help you figure out.&nbsp; There really isn't a &quot;soft cap&quot; that should be in rawr, just a point where for survival [or overall, or mitigation, or even I suppose EH though I don't think that's mathematically possible at the current gear level] the dodge/armor/crit from Agi outweighs the extra health from stam.&nbsp; At that point, it becomes a matter of &quot;do I want to stack stam so when I do get hit twice in a row without heals I can survive, or do I want to stack agi so I can reduce the incoming damage instead?&quot;.</p>\r\n<p>My personal thought?&nbsp; Stam stam stam, unless you can break 100k health with SI up.</p>",
    "PostedDate": "2010-02-16T10:53:57.81-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "291399",
    "ThreadId": "85552",
    "Html": "<p>@Hinalover - I agree, this is actually what prompted my question. &nbsp;I am worried that by setting the custom cap at those levels, rawr is not accurately computing the correct gems/enchants/etc.</p>\r\n<p>@Karindra - Thank you for the post, my question was more of a request for the T10 content to be added in the drop down.</p>\r\n<p>ilvl 277 (tier) gear yields roughly 52k HP with full Agi gems/enchants... We have learned with the ICC debuff Dodge is valued significantly less than Stam... Rawr is saying otherwise though</p>",
    "PostedDate": "2010-02-16T13:18:58.18-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "291403",
    "ThreadId": "85552",
    "Html": "<p>At 277 gear, your Stam value *should* drop with the inc damage value appropriately set for ICC 25/25H. Because Stam does have that drop-off point.</p>\r\n<p>The ICC Debuff only delays the point where Dodge becomes awesome again because you are getting hit a lot more often and need more Stam for the survivability. Once you are over that Stam hump, Dodge (and the rest) should resume their normal values.</p>",
    "PostedDate": "2010-02-16T13:23:30.74-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "291459",
    "ThreadId": "85552",
    "Html": "<p>Any rough guesses where that Stam hump is? &nbsp;52k... 54k... ?</p>",
    "PostedDate": "2010-02-16T15:04:18.44-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "291507",
    "ThreadId": "85552",
    "Html": "<p>It's very subjective. For me and my guild (quite good healers), I'd use 300k for Normal, 350k for Heroic. Guessing on the Heroic one, since we're not quite to Heroics yet; hopefully this week.</p>",
    "PostedDate": "2010-02-16T17:04:33.757-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "291750",
    "ThreadId": "85552",
    "Html": "<p>This thread reminds me of a question I've had.&nbsp; I THOUGHT the survival &quot;cap&quot; had to do with the amount of un-avoided damage you could take before dying.&nbsp; But if that were correct changing dodge would not affect anything to do with survival (since dodge is avoidance).&nbsp; So my question is, how does that really work?&nbsp; (Please feel free to slap me and point me to a link if the info already exists.&nbsp; Searching the&nbsp;discussions for &quot;survival&quot; quickly discouraged me by the&nbsp;very large&nbsp;number of results.)</p>",
    "PostedDate": "2010-02-17T08:38:13.247-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "291781",
    "ThreadId": "85552",
    "Html": "<p>Mouse over the survival stat for a description of what it means.</p>\r\n<p>In <em>most</em>&nbsp;circumstances, dodge has no impact on survival. There are, however, 2 odd exceptions to this. When you have The Black Heart or Unidentifiable Organ, you get significant survival procs from getting hit, which means that dodge indirectly affects survival, a little bit.</p>",
    "PostedDate": "2010-02-17T09:46:10.48-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "291803",
    "ThreadId": "85552",
    "Html": "<p>My guild got a prot pally recently. As with all new members of the guild, I ask them what they think about Rawr. &nbsp;The number one complaint I've heard from tanks is that the Soft-Cap mechanic isn't very intuitive. &nbsp;We should at the very least have default settings for 25man ICC tanking and 25man Heroic ICC (but still maintain editing these values beyond the presets for advanced users)</p>\r\n<p>Also, when talking to the Prot Pally, he had no idea what I was talking about when I mentioned the Survival Softcap setting, and I realized that Rawr doesn't model this for Prot Paladins. &nbsp;Why is that?</p>",
    "PostedDate": "2010-02-17T10:50:10.857-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "291805",
    "ThreadId": "85552",
    "Html": "<p>Ahh I see.&nbsp; I'm surprised that &quot;little bit&quot; affects gemming so much.&nbsp; I'll play with it again when I get home, but I remember my gems going from agility with stam for socket bonuses to stam with agility for bonuses as I toggled that ICC debuff.</p>\r\n<p>Also, what's the theory behind including procs in the survival score?&nbsp; I thought the idea behind it was calculating how long you'd live in the unlucky, worst-case scenarios.</p>",
    "PostedDate": "2010-02-17T10:51:11.21-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "291809",
    "ThreadId": "85552",
    "Html": "<p>The 'little bit' really shouldn't affect gemming. If you're sure the survival softcap isn't involved, post your character file.</p>",
    "PostedDate": "2010-02-17T10:57:37.213-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "291856",
    "ThreadId": "85552",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>ebs2002 wrote:</strong><br>\r\n<p>Also, when talking to the Prot Pally, he had no idea what I was talking about when I mentioned the Survival Softcap setting, and I realized that Rawr doesn't model this for Prot Paladins. &nbsp;Why is that?</p>\r\n</blockquote>\r\n<p>AFAIK, Survival Soft Cap is only implemented in Rawr.Bear.</p>",
    "PostedDate": "2010-02-17T12:39:59.183-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "291951",
    "ThreadId": "85552",
    "Html": "<p>Upon further inspection, the Black Heart is indeed the culprit.&nbsp; I'm just right at the soft cap, so that small difference in survival affects my gems.&nbsp; Glad to have that explained.&nbsp; On a related note, I would like to repeat my previous question: should procs really be considered in the survival score?&nbsp; I would have expected it to be worst case, meaning my trinkets aren't proc'ing and I'm not dodging.&nbsp; Hmm - not sure if parry haste should be considered in some way, but theoretically that could really make a worst-case scenario worse!</p>",
    "PostedDate": "2010-02-17T17:38:32.733-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "291969",
    "ThreadId": "85552",
    "Html": "<p>And I'll repeat my previous answer: Yes and no. Technically, no, but these burst survivability items commonly are especially useful in the situation where you want max survivability (especially the ones that are on use, where you can pop them for the part of the fight that you need the max survivability for, like enrages, etc). We plan to add a slider on the options tab for &quot;Value of Burst Threat&quot;, with values of &quot;None&quot; on the left, &quot;Averaged&quot; in the middle, &quot;Full&quot; on the right, and smoothly interpolating between those 3. Currently, it's effectively locked on Average.</p>",
    "PostedDate": "2010-02-17T18:48:10.29-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "291972",
    "ThreadId": "85552",
    "Html": "<p>I'm sorry to make you repeat yourself.&nbsp; I still cannot find where you said that before, but that's no matter now.&nbsp; I can definitely see including on-use items for survival, if you're in a fight where you can predict the dangerous parts, and those parts are more spaced out than your cooldowns.&nbsp; I'm more concerned with on-proc trinkets, over which you have no control.&nbsp; Will there be any way to distinguish between those?</p>\r\n<p>Also, I assume you mean something more like &quot;Value of Burst Survivablity&quot; or &quot;Avoidance&quot; or &quot;Mitigation&quot;?</p>",
    "PostedDate": "2010-02-17T19:03:12.693-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "291974",
    "ThreadId": "85552",
    "Html": "<p>Err, yeah, &quot;Value of Burst Survivability&quot;. And I didn't say it here, but other similar threads; np. You can control on-proc trinkets too, BTW, it's just a bit tricky. :) &nbsp;&nbsp;</p>",
    "PostedDate": "2010-02-17T19:13:41.743-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "292201",
    "ThreadId": "85552",
    "Html": "<p>I can see it now, &quot;Why did you blow your cooldowns BEFORE the enrage?&quot;&nbsp;&nbsp; &quot;I was hoping to avoid getting hit so my Black Heart would have a better chance of proc'ing during the enrage ...&quot;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-02-18T07:42:02.007-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "292278",
    "ThreadId": "85552",
    "Html": "<p>Haha. I was more talking timing taunts to line up the cooldowns, and offsetting it from the start. :)</p>",
    "PostedDate": "2010-02-18T09:48:21.037-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "359069",
    "ThreadId": "85552",
    "Html": "<p>Hi, this is my first post here and I wanted to say what a great tool Rawr is for bears.</p>\r\n<p>I was searching the issues and forums to find out why Agility was being over-valued for my druid tank (something I'd never seen before) and found this post. Changing the setting for the survival soft cap made all my gems line up like I expected instead of recommending all +20 Agility gems.</p>\r\n<p>I've saved that setting now, but I think it would be awesome to have the defaults for ICC added.</p>",
    "PostedDate": "2010-02-21T21:15:59.33-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]