[
  {
    "Id": "291909",
    "ThreadId": "85713",
    "Html": "<p>I've noticed what appears to be an issue with the optimizer and the &quot;additional requirements&quot; field.&nbsp; However, this may also be a problem with me, or be completely unrelated, or something else!&nbsp; The long and short of it is this: I select my gear, gems, enchants, and so forth, and then run the Optimizer, with &quot;Overall Rating&quot; as the primary optimization, and &quot;Miss Chance &lt;= 0.0&quot; as the only &quot;additional requirement.&quot;&nbsp; Consistently, the calculated gear is below the soft hit cap -- sometimes by over a hundred points.&nbsp; Am I doing something wrong?&nbsp; Is this functionality not supported/broken/etc.?</p>\r\n<p>(Yes, this does apply to a Warlock.&nbsp; I realize this might introduce complications, but while I'm aware inaccuracies might show up in the Optimizer, I haven't seen anything to suggest that stat optimization doesn't work.)</p>\r\n<p>Thanks!</p>",
    "PostedDate": "2010-02-17T14:51:12.21-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "291929",
    "ThreadId": "85713",
    "Html": "<p>Pure casters don't have soft hit caps.&nbsp; Melee do, because some abilities are spells, some are white attacks and some are special attacks; all casters use the same hit% [17%] to aim for.</p>\r\n<p>First thing to check, are you considering the buffs tab?&nbsp; If you have Misery or IFF checked, it will aim for 14% hit [roughly 368].&nbsp; If you are Affliction or otherwise using Suppression, that would also account for it.</p>",
    "PostedDate": "2010-02-17T16:34:49.687-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "291938",
    "ThreadId": "85713",
    "Html": "<p>Yep, Affliction, with 3/3 Suppression.&nbsp; That's why I used the term 'soft cap,' since Suppression is going to be making up some of that difference.&nbsp; However, it's generating optimized gear/gem/enchant specs (with all relevant gems and enchants marked as available) with a hit rating of around 240, rather than the target 368.&nbsp; This is coming from the pre-existing gear, which had a hit rating of 310.</p>\r\n<p>The only buffs I leave checked are Fel Armor, Grand Spellstone, and Fel Intelligence (+Improved Felhunter).&nbsp; None of those affect hit, as far as I know, so the Optimizer should be trying to shoot for 368...and yet is generating gear with substantially below cap hit rating.</p>\r\n<p>Edit: Have changed the thread title to clear up the 'soft' confusion.</p>",
    "PostedDate": "2010-02-17T17:02:00.947-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]