{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Bear",
      "DisplayName": "Rawr.Bear"
    },
    "ClosedComment": "User misconception about survival soft cap",
    "ClosedDate": "2011-01-09T12:53:43.403-08:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "What I have in mind as some configurable parameters where the user can define whatever kind of softcap they like. Say: 160000 Health, or to always be hit capped, or a minimum amount of expertise (24 ? 26 ?).\n \nI'm not sure how difficult this would be to implement, probably \"not-easy-at-all\". But right now, if you want to stay hit capped, the only parameter you can configure is threat value, which will also boost expertise value. Considering that on 10man, very often the tank needs to interrupt, hit becomes more important. Also, there are some health requirements for a few fight (which probably are already taken care of by the boss handler, but still ...)\n \nWith this, the user can take the configuration a little bit further than pure theorycraft, and set up what is important for him and his raid group (lets say a particular healer style).",
    "LastUpdatedDate": "2013-05-16T05:19:08.16-07:00",
    "PlannedForRelease": "Rawr 4.0.14 Beta",
    "ReleaseVisibleToPublic": true,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2011-01-08T09:17:21.31-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Feature Request.Bear] Custom Softcaps",
    "Type": {
      "Name": "Feature",
      "Id": 1
    },
    "VoteCount": 1,
    "Id": 19625
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Survival Soft Cap is already a feature (and a very important one that you should definitely be using).\r\nYou already can add an optimizable requirement pertaining to Avoided Attacks %. I'll soon be adding one for Avoided Interrupts %.",
      "PostedDate": "2011-01-08T11:58:32.107-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Astrylian, yes, I know most of what I want can be achieved some other way. However, even with Avoided Attacks %, it still doesn't separate hit and expertise (although we will probably get that with Avoided Interrupt).\r\nOn the other hand, doesn't the Survival Soft Cap includes other things besides Health ? That is the way I understand it in any case.\r\nAnd you probably noticed, I'm trying to fine tune my bear to some very specific points. This might be outside the scope for Rawr, but who knows ... maybe other people want to do it too",
      "PostedDate": "2011-01-08T14:19:08.523-08:00",
      "Id": -2147483648
    },
    {
      "Message": "I think you misunderstood something.\r\n\r\nYes, Avoided Interrupts % is hit rating, and I already said is coming. There is no reason to cap exp and not hit.\r\n\r\nThere is no reason to care about HP in a way that you would want to soft cap it; it is Survival that you actually care about. That's what I'm trying to tell you; you think that you want to softcap HP, but you don't; providing that feature would be a disservice to users.",
      "PostedDate": "2011-01-08T15:19:50.943-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Oh, I understand you Astrylian, no worries about that. I'm gearing toward agility as I should and all that.\r\nMy point is not that \"I must have 160000 HP\". What I want is something that says \"after 160000 HP, stamina should be valued even less\". Maybe I didn't express myself right.\r\nThe way I see it, for the current content, the more HP you have, the less stamina is worth. I mean, do you see any reason to get ANY stamina when you already have 160K HP ? After that point, even crit is better for me. Or mastery. I know that Survival Softcap already takes care of most of that, specially when I use the specific Boss Models (which rock, by the way, amazing job). I can get anything I want with Rawr (except the Interrupts %, which is coming) as it is now if I focus on an specific boss fight. However, I'm not in a highend raiding guild. Heck, we are still 7/12 right now, so I can't afford to gear for an specific fight. (Why am I not discussing this with you on EJ forum is another mistery lol)\r\n\r\nOn the other hand, I can see your point about having something like that being a disservice for users. Having something that will be useful for borderline cases like mine, but is confusing (not to say dangerous) for all the others users is not something good for Rawr.\r\n\r\nThe Avoided Interrupts % change will solve 99% of my problems, and I'm happy for it. As for the rest, it is of marginal importance to say the least, so you can close this one. Thank you.\r\n",
      "PostedDate": "2011-01-08T17:53:44.39-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-01-09T12:51:57.833-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-01-09T12:53:43.403-08:00",
      "Id": -2147483648
    },
    {
      "Message": "\"What I want is something that says \"after 160000 HP, stamina should be valued even less\"\"\r\n\r\nThat's exactly what the Survival Softcap is for. You're looking at it in terms of \"HP\", but you should be looking at it in terms of Survival, since that includes HP *and* constant damage reduction from Armor and talents. That's what actually matters, not the HP.",
      "PostedDate": "2011-01-09T12:58:47.257-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-03-17T19:44:00.98-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-03-17T19:44:12.333-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:26:31.883-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:19:08.16-07:00",
      "Id": -2147483648
    }
  ]
}