{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Base",
      "DisplayName": "Rawr.Base"
    },
    "ClosedComment": "Declined&#58;&#42; That would be a bunch of work to duplicate development strings, which we don&#39;t want to do more than we are already for Rawr2, Rawr3.Silverlight and Rawr3.WPF&#42; Taking the Icons out of the downloadable zip file would just mean that they have to be downloaded on program start, which makes that take A LOT longer for end users. Users with slow connection would be required to wait several minutes between individual changes in some cases.",
    "ClosedDate": "2010-01-19T09:56:39.5-08:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "I was wondering if it's possible to make available a barebones version of Rawr alongside every release.  The only place where icons of spells is useful is in the talent tree, to quickly identify talents.  Loading the item icons isn't particularly helpful to me, nor is the background for the talent trees (granted, that's like 30 pics).  Colorful icons imported from WoW is nice, but it's just artwork, and provides little information to me about gear.\n \nSuggestion:\nMaybe just have really simple icons that show that you have equipped a piece of equipment in that slot, with the ilvl in the middle.  And the icon shows what type (cloth, leather, mail, plate) of equipment is used.",
    "LastUpdatedDate": "2013-05-16T05:22:16.94-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2010-01-19T09:44:59.153-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Feature Request] Rawr w/o extraneous icon & pic files",
    "Type": {
      "Name": "Feature",
      "Id": 1
    },
    "VoteCount": 1,
    "Id": 15986
  },
  "FileAttachments": [],
  "Comments": []
}