{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Base.Items",
      "DisplayName": "Rawr.Base.Items"
    },
    "ClosedComment": "Both features can be accomplished with present code",
    "ClosedDate": "2010-08-27T18:51:22.57-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "I think a nice feature would be an emblem guide that lets you filter currency (honor points, conquest, valor, triumph, frost, etc...) and find the most valuable upgrades per emblem cost.  Like even if the Glyph of Indomitability provides a bigger increase than Thassarian's Handguards of Conquest, the latter may provide a larger increase vs. cost, and - since eventually I'm gonna get both anyways, I'd like to be sure I'm gearing up in the fastest way possible.  This is obviously much more important for Frost Gear too.\n \nI'd also like to see a feature - maybe an option on the upgrade list or something - that shows the best in slot items for whatever filters I've selected.  I don't care if Heroic Drak'Tharon Keep has the third best belt, I'm not gonna farm for that.  I guess maybe kind of like the Optimizer, but that goes through everything I've filtered.\n \nGreat program guys, keep up the good work!",
    "LastUpdatedDate": "2013-05-16T05:20:04.787-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2010-08-19T11:53:46.29-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Feature Request.Items] Emblem Guide",
    "Type": {
      "Name": "Feature",
      "Id": 1
    },
    "VoteCount": 1,
    "Id": 18522
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Your first request is already implemented, see the Direct Upgrades / Cost chart",
      "PostedDate": "2010-08-19T12:09:45.78-07:00",
      "Id": -2147483648
    },
    {
      "Message": "And the second request is covered by the Build Upgrade List.",
      "PostedDate": "2010-08-19T20:08:21.357-07:00",
      "Id": -2147483648
    },
    {
      "Message": "And the second request is covered by the Build Upgrade List.",
      "PostedDate": "2010-08-19T20:08:25.24-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Oh awesome! I didn't know about the Direct Upgrades/Cost Chart, that's just what I was looking for.  \r\nAs for the second request, I meant something that shows ONLY the BiS gear for my filters, so I can get a compact list of gear that I need to acquire.  (I'm not really gonna go out of my way for dungeon drops that aren't BiS)",
      "PostedDate": "2010-08-20T02:27:55.767-07:00",
      "Id": -2147483648
    },
    {
      "Message": "BiS changes depending on your definition of the term.  Are you looking for BiS in terms of the gear you currently have marked available?  Are you looking for BiS in terms of all gear available ingame?  The definition of the term changes the output.\r\n\r\nRegardless, the Build Upgrade List (not the standard Optimize routine) is your most likely bet.  Set the filters, then run a Build Upgrade routine.  It will take all of the gear you currently have marked as available into account, and find how each piece of gear (including those that aren't marked as available, but are shown under your active filters) rates, if you were to run an Optimize with just that one additional piece of gear marked available.  It's an accurate method of determining real upgrades FOR YOUR PARTICULAR CHARACTER, because BiS for an ultimate gearset may not be the best for your gear availability.  Hence the whole point of Rawr.  :P",
      "PostedDate": "2010-08-20T02:57:21.723-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Much like BrWarner pointed out \"BiS\" is a very subjective term. If you are looking for the best possible item in each individual slot then I recommend using any reliable theorycraft website, particularly elitistjerk.com. Rawr (for most circumstances) is not desingd as a BiS finder but rather what works best in combination with other items. I will use Hunters as an example; the 2T9 bonus is significantly better than the 4T10 bonus eveen to the point of beating out 2 iLvl 264 items sometimes. As individual pieces, two T9.5 pieces (Hand and Legs 'of Triumph) will not be BiS on any list yet IAW Rawr combining them for the 2T9 bonus is an upgrade from Logsplitters and Draconic Bonesplinters by 12 DPS (without changing my other gear). \r\nAs for your statement about the belt from Heroic DTK, if you arent going to farm those types of items (Heroic Dungeons, Uldaur, Naxx, or whatever), then make sure you deselect those in the items filters that way the Build Upgrade List will not consider those items.",
      "PostedDate": "2010-08-20T18:49:58.467-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-08-27T18:51:22.57-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-09-08T16:10:16.55-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-09-08T16:10:57.833-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-03-17T19:34:03.147-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:27:41.26-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:20:04.787-07:00",
      "Id": -2147483648
    }
  ]
}