{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.RestoSham",
      "DisplayName": "Rawr.RestoSham"
    },
    "ClosedComment": "After exhaustive &#40;literally&#41; checking of many in-game and self-created items with Haste and Crit at equal amounts and &#43;-10 or so points, haste items continue to be at the bottom.  Leaving as is as it seems the best choice currently.  Should any other issue where a haste item is recommended way above a non-haste item, AND you are going oom, don&#39;t hesitate to post.  &#40;keep in mind, if one item has no MP5 and little int with haste, and item 2 has massive MP5 and Int plus some haste, item 2 might soar to the top.  It&#39;s not because of haste, it&#39;s the other stats.&#41;",
    "ClosedDate": "2010-02-03T05:02:34.49-08:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "This issue corresponds to http://rawr.codeplex.com/Thread/View.aspx?ThreadId=82467\n \nWhen your shammy is mana-limited in a fight, haste still is being valued as long as you have the Improved Water Shield talent.  I suspect it's because the shammy's mana pool is determined as if s/he can chain cast for the entire fight proc'ing that talent, instead of only proc'ing off the casts until OOM.\n \nOne possible fix could be to account for Improved Water Shield as a reduction in spell cost, rather than an addition to the mana pool.",
    "LastUpdatedDate": "2013-05-16T05:22:02.317-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2010-01-29T20:12:03.62-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[RestoSham] Haste & OOM",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 16169
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "The value from haste is not only from Improved water shield.  Extra Procs from trinkets and Insightful Earthsiege are also giving it value.  If you added it as a cost reduction, it would still give haste a value because it is allowing you to cast more spells.  Albeit, the value is so low it won't match something like Intellect or MP5 if you are that under-geared so trying to reduce it from it's minor value to even lower is a moot point.",
      "PostedDate": "2010-01-31T00:24:00.657-08:00",
      "Id": -2147483648
    },
    {
      "Message": "But my point is that when you are limited my mana instead of time haste does NOT let you cast more spells, because you go OOM after the same number of casts.",
      "PostedDate": "2010-01-31T12:13:40.62-08:00",
      "Id": -2147483648
    },
    {
      "Message": "I believe I see where the actual error is.  However, I'm not sure if fixing it will really cause that much of a change in gear listing.  If you are OOM, is Haste gear being put above other gear?  ",
      "PostedDate": "2010-01-31T15:22:48.96-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-01-31T15:58:50.907-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Nope, it is not.  Although I'm a little suspicious of suggesting icewalker over vitality.",
      "PostedDate": "2010-02-01T20:18:45.663-08:00",
      "Id": -2147483648
    },
    {
      "Message": "I think it's valuing the 12 crit higher then the 5 mp5.  However, here is where, at least me personally, deviate 180 from my model.  I will never, ever ever ever ever, use anything other than Tuskarr's Vitality.  On ANY character.  Ever.  Except maybe a ret pally or holy pally with the movement talent, or a feral/bear druid with the movement talent, but that's it.  It's World of Dont-stand-in-it-craft, and getting out of things or to things faster, in my mind, will ALWAYS be better then an extra 12 crit or 5 mp5.",
      "PostedDate": "2010-02-01T21:32:15.7-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Only 2 models actually handle time in movment, DPSWarr and (I think) Mage. If you dont have a racial or class ability, you should have a boot speed enchant, ignore all other selections.",
      "PostedDate": "2010-02-01T21:47:58.51-08:00",
      "Id": -2147483648
    },
    {
      "Message": "I remember the math a long time ago for Enhancement Shaman being worked out over at EJ, and I belive it's still on the TTT for enhance.  That said, closing this tomorrow if I can't find any case where haste is eating other stats alive in an OOM situation.",
      "PostedDate": "2010-02-02T04:00:41.7-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Just remember not to tweak the model to achieve what you believe to be proper output. If the calculations are accurate, the output will be correct automatically, and sometimes the answer really isn't what you expect.\r\n\r\nOh yeah, speed enchant FTW! I'm the only person in my guild that understands why it's better than anything else. -_-\r\n\"Hw u run so fast Lara LOL\" \"Hax. Definitely hax.\"\r\n",
      "PostedDate": "2010-02-02T08:57:50.607-08:00",
      "Id": -2147483648
    },
    {
      "Message": "I think I'll take that advice (about Tuskar's).  Thank you.  :)",
      "PostedDate": "2010-02-02T10:33:53.163-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-02-03T05:02:34.49-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-09-08T14:59:00.707-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:30:08.093-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:22:02.317-07:00",
      "Id": -2147483648
    }
  ]
}