{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "This has been discussed multiple times and rejected.",
    "ClosedDate": "2011-11-13T10:06:11.5-08:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "Probably suggested a lot though I couldn't find it using Search so I came up with these images:\nhttp://img38.imageshack.us/img38/5366/modelselection.png\nhttp://img577.imageshack.us/img577/7475/statweights.png\n \nThere would be a stat weight module for every class I suppose, stat weights could be imported from SimulationCraft results (copy+paste perhaps).\nTrinkets and other effects would have their procs averaged out by uptimes, etc.\nOther things such as (non-stat) set bonuses should have weight values editable via the item editor tool, or by a separate tool window opened from a button below the stat caps area that lists all items with bonuses that are of questionable weights. Of course these weights are user editable and possibly pre-set to relative to main attribute (such as strength) = 3.0000. Determining this value could take some extra theorycrafting from the community but should work somewhat nicely as tools like Simulationcraft usually output your main attribute as somewhere between 2.8 to 3.6 from my personal experience.\nAlmost every feature of Rawr should work with it, and it should be quite easy to implement!\n \nThis would very much certainly help for Rawr usage when certain modules are incomplete and totally wrong such as the death knight dps model and warlock model!\n \nAlso, there should be support for multiple caps of the same stat (ex. hit weight: 2.2; hit -> at least -> 601 -> overcap weight: 1.2; hit -> at least -> 1400 -> overcap weight: 0)\n \ninb4 terrible idea",
    "LastUpdatedDate": "2013-05-16T05:17:18.43-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2011-11-12T13:12:50.577-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "Stat Weight Models",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 21778
  },
  "FileAttachments": [
    {
      "FileId": 5436,
      "FileName": "statweights.png",
      "DownloadUrl": ".\\5436"
    }
  ],
  "Comments": []
}