{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Base.Items",
      "DisplayName": "Rawr.Base.Items"
    },
    "ClosedComment": "Implemented.",
    "ClosedDate": "2009-12-10T19:56:00.437-08:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "Ok this is me being lazy but what if there was an option where I can put I had x number of badges, what would be my best options to use them?\n \nfor example, should I purchase the head piece, a trinket and a ring or should I go for Chestpiece and shoulders? I can't buy them all at once so whats my best option?  With all 5 pieces there are so many possible variations its mind boggling or should I just go by score and not worry about it?",
    "LastUpdatedDate": "2013-05-16T05:23:25.167-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2009-11-13T10:52:48.737-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Feature Request.Items] Number of Badges best option to buy list",
    "Type": {
      "Name": "Feature",
      "Id": 1
    },
    "VoteCount": 2,
    "Id": 14797
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "We've been asked this before and determined it would not be best for our users to add such a function. You are welcome to make the comparisons yourself though. Search for this topic in Discussions.",
      "PostedDate": "2009-11-13T11:25:53.99-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Your best option would be to use the Upgrade list feature and see whichever item is highest on that list.",
      "PostedDate": "2009-11-14T12:00:33.867-08:00",
      "Id": -2147483648
    },
    {
      "Message": "There are so many possibilities its difficult to add something useful. This would only apply to very limited amount of gear. To be honest rather than the developers trying to add in badges/trophy's etc is it really so difficult for you to look at the item and divide the dps by the cost. The one with the highest dps per badge cost is the one to go for.",
      "PostedDate": "2009-11-16T09:12:53.85-08:00",
      "Id": -2147483648
    },
    {
      "Message": "This is actually something that it's currently not possible to do with Rawr, but could be added. It would be an alternative to upgrade list that would work in the following way. There would have to exist a way to specify \"cost\" to items. This should best be something generic that allows you to enter things like dkp cost or anything you want, possibly with a way to generate costs from source info as in badge cost. We'd also need a way to specify which items are of interest, best first pass is everything with nonzero cost. Then just run a normal optimize with currently available items + items of interest and an additional hard constraint on total cost of currently nonavailable items. Main benefit of having this compared to upgrade list is that it goes beyond the greedy hill climbing approach and can take into account synergies of several items at the same time.",
      "PostedDate": "2009-11-17T16:32:48.95-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-11-21T19:34:55.47-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-12-10T19:56:00.437-08:00",
      "Id": -2147483648
    },
    {
      "Message": "What I'd like is some sort of item upgrade order. For example, you have five pieces of tier 10. Which two pieces would give you the biggest upgrade now for the 2pc bonus? As of now I have to run optimizer on every 2piece permutation of those five items. Add in the rings/trinkets and it becomes a huge hassle.",
      "PostedDate": "2009-12-11T08:19:46.493-08:00",
      "Id": -2147483648
    },
    {
      "Message": "I use rawr to get a list of the next upgrades that I need for all slots. Optimizer works great to tell me what those items should be, but it doesn't tell me the order to get them. Some upgrades are big and some are not so big. Just the ability to order the optimized set by dps or overall or whatever stat the user would like would be really helpful. It can answer questions like whether to spend the 35 badges for the shoulder piece or save 15 more for the chest. Which would yield more benefit during the upgrade process.",
      "PostedDate": "2009-12-23T08:43:23.71-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-09-08T16:10:16.55-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-09-08T16:13:40.12-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-03-17T19:29:29.873-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:31:49.757-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:23:25.167-07:00",
      "Id": -2147483648
    }
  ]
}