{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Base.Optimizer",
      "DisplayName": "Rawr.Base.Optimizer"
    },
    "ClosedComment": "The option that we could implement is already done, the option that we can&#39;t ... we can&#39;t",
    "ClosedDate": "2010-07-02T14:52:24.51-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "Jothay told me that each issue should have its own item to handle it better so i split my old topic in smaller pieces.\n \nhttp://elitistjerks.com/f76/t68951-retribution_updated_3_3_a/\n \n[Quote]\n \n[Glyph of Seal of Vengeance]\nWe now have the option of glyphing for 10 expertise! This glyph grants exactly what it says, 10 expertise (82 rating, 2.5%) when using our primary dps seal. This is a decent option if you are under the expertise cap or if you want to use other stronger items in place of expertise items. It's worth noting that if you benefit from even half of the expertise (example, glyph puts you at 31 expertise) it is more dps than the exo glyph. The main benefit of this glyph is a lot of freedom in gear choices, as you can drop weaker expertise pieces.\n \n[Glyph of Exorcism]\nAn option if you are naturally expertise capped, or perhaps for pvp. This glyph is worth ~50 dps, and as noted above you can gain more from using freed itemization on non-expertise gear.\n[/Quote]\n \nThe Optimize-dialog gives you the choice to select food, flasks, talent specs, and talents, additionally.\nBut how will it deal with the choice between several glyphs? In this case its a matter of expertise which one will give you more.\nHow about adding an option to consider glyphs but not the rest of the talent.stuff in the optimize.process?",
    "LastUpdatedDate": "2013-05-16T05:22:11.163-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2010-01-22T05:28:17.973-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Feature Request.Optimizer] Split Glyphs to its own option in the Optimizer",
    "Type": {
      "Name": "Feature",
      "Id": 1
    },
    "VoteCount": 2,
    "Id": 16041
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Currently glyphs are taken from the talent presets. So as long as you create a talent preset with each combination of glyphs that you want to consider you'll get the desired results when optimizing with talent spec optimization enabled.",
      "PostedDate": "2010-01-22T16:28:57.19-08:00",
      "Id": -2147483648
    },
    {
      "Message": "How about rotation ?\r\nIn the article on elitistjerks, i saw that depending on gear a different rotation might be better.\r\nAdding an option to optimise gear &rotation (out of the list you can enter) at the same time might be useful",
      "PostedDate": "2010-03-15T12:49:25.99-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Rotations are completely dependent per model, there would be no way to create a global option for this that would actually work.",
      "PostedDate": "2010-03-15T13:28:45.423-07:00",
      "Id": -2147483648
    },
    {
      "Message": "and if you did a unique solution for retribution pallys?",
      "PostedDate": "2010-03-16T15:06:42.817-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-07-02T13:57:06.677-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-07-02T14:52:24.51-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-03-17T19:34:03.147-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:30:18.84-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:22:11.163-07:00",
      "Id": -2147483648
    }
  ]
}