{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "",
    "ClosedDate": null,
    "CommentCount": 0,
    "Custom": null,
    "Description": "Rawr fetched my PC's gear from the WoW armory, but two items do not have any icons or data, except for the gems in the slots. The gear is for the Paladin Protection spec:   the Protector's Trillium Waistguard (98615) and the Protector's Trillium Legguards (98606).\n\nWhen I look at the Edit panel for each one, it shows the item ID number and hardly anything else. I visited Wowhead to find each of the two items, and the item ID number reported by Wowhead is the same as the one shown in the Edit panel. It does not make sense that Rawr evidently cannot download the data for these two items. \n\nSo, what use is the \"Edit\" Panel? Am I supposed to read the individual data items from the \"tooltip\" and other data presented by Wowhead, then transfer it to the Rawr form?\n\nThen what? I don't see a single button of any kind which tells Rawr to \"start optimizing the gear\" .... or whatever I am supposed to be able to do with it. \n\nFurther, the second time that I ran Rawr, one trinket, the mainhand weapon and the shield were also missing. Dunno how to get Rawr to show what it showed before, and why would it fail to do that? \n\nAs I write, Rawr is not responding. It seems to have crashed while attempting to get the data for the Protector's Trillium Waistguard from Wowhead. Or maybe it was trying to get the data for the respective gems. Which is to say, I can never tell what Rawr is doing, since, most of the time, it doesn't seem to be doing anything at all. It mostly just ignores any attempt that I make to get it to do something, until it eventually seems to try to do what I wanted it to do four or five attempts previously.\n\nThis computer has a 64-bit AMD Phenom II X4 910e CPU (i.e., four cores, each running at 2.65 GHz.) and 8 GB of system memory. That is plenty of power, but Rawr's antique character is just too much for it to handle, I guess. Should we be running it in the context of the Windows 7 \"compatibility\" feature(s)? \n\nI've never used Rawr before. Frankly, I am not inclined to spend a lot of time and effort trying to use it. The UI is about as user-hostile as it can get. For example, the \"Welcome to Rawr 4\" is displayed in a structure meant for -error dialogs- (!).  What a great way to make a first impression!  \n\nSuffice it to say that Rawr is not a Windows program, it is a program that Windows will execute, when it gets a round tuit. There is a wealth of detail organized ad-hoc in various places, but the meaning or use of most of it is a mystery.  There is no evidence of any \"master plan\", a design conceived from the top-down, just an assemblage of bits and pieces. It reminds me of Acronis True Image \"Home\" .... it will take you forever and a day to figure out how to get to make an ordinary file backup, and you will need God's loving help you if you must use it to restore anything.",
    "LastUpdatedDate": "2014-07-29T03:43:34.597-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2014-05-15T00:54:00.893-07:00",
    "Status": {
      "Name": "Proposed",
      "Id": 1
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "Items Not Found on Wowhead",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 1,
    "Id": 25471
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "I managed to get those [Items Not Found on Wowhead] to work by editing said item and filling in the stats, item icon, source etc.  with the item editor. The item would then properly show once you do a reload current character from battle.net with forced refresh enabled while wearing said item.",
      "PostedDate": "2014-07-29T03:43:34.597-07:00",
      "Id": -2147483648
    }
  ]
}