{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.RestoSham",
      "DisplayName": "Rawr.RestoSham"
    },
    "ClosedComment": "",
    "ClosedDate": null,
    "CommentCount": 0,
    "Custom": null,
    "Description": "I have multiple issues with the RestoSham model.  All of them taken together combined with the recommendations to my character that go against accepted wisdom, at least to some degree, cause me to not have a lot of faith in the output of this model.\n \nMeta gems:\n* Revitalizing Shadowspirit and Revitalizing Skyflare are ranked identically, I'm assuming based on the 3% crit heal effect, with no differentiation based on the fact that one is 54 spirit and one is only 22 spirit.\n* Bracing, Burning, Ember, and Forlorn Shadowspirit are all ranked identically, I'm assuming based on the 54 Intellect, with no differentiation based on their secondary effects.\n* This trend continues on down the meta gem list, with all the 21 Intellect metas grouped, all 54 crit metas grouped, etc.\n \nTrinkets:\n* Trinkets are ranked identically based on their primary stat, without regard to their secondary effects: all the 458 Intellect trinkets the same, all the 433 intellect trinkets the same, all the 403 Intellect trinkets the same, etc.\n* In at least one case in every tier of grouping, this results in DPS trinkets being ranked identically with healing trinkets.\n \nOptions:\n* Burst/Sustained Style choices still list the old HW/LHW spells.\n \nEnchants:\n* Power Torrent not an available option for MH enchants.\n \nOffhand items:\n* Ledger of Revolting Rituals is available only to Priests & Druids.\n \nSet bonuses:\n* I'm wearing three pieces of T13, but I'm not getting credit for 2pc on the Buffs pane.\n \nI assume all the above issues apply to everyone.  With specific application to me, I question that the recommendation is to pull virtually everything out of Spirit and lean so hard on Crit.  I have found no examples of raiding Resto Shaman who are running at the 1600-1700 Spirit level that Rawr is recommending for me.  The fact that Rawr is leaning so far away from Spirit makes the meta gem issue all the more ironic, since Burning Shadowspirit is pretty much -the- gem to have at this point and Rawr still wants me wearing a Spirit meta.  The distaste for Spirit is so strong that Rawr prefers the Elemental legs or hat to the Resto pieces, despite that either one of those Resto pieces would complete my 4pc.\n \nRawr is the best thing going for ease of use, versatility, and giving the right answer, as far as I'm concerned.  Unfortunately, in this case the several issues I've listed here have caused me to lose faith in this particular model.",
    "LastUpdatedDate": "2014-03-07T18:42:01.207-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2011-12-19T21:59:48.773-08:00",
    "Status": {
      "Name": "Proposed",
      "Id": 1
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[RestoSham] Multiple issues",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 21943
  },
  "FileAttachments": [
    {
      "FileId": 5506,
      "FileName": "eli.xml",
      "DownloadUrl": ".\\5506"
    }
  ],
  "Comments": [
    {
      "Message": "'most' of above will be fixed when the new model goes live, however, I would move the off-hand item to a possible nother issue, it could be the item cache hasn't been updated with the class restrictions.",
      "PostedDate": "2011-12-22T09:49:20.777-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:23:57.73-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2014-03-07T18:42:01.207-08:00",
      "Id": -2147483648
    }
  ]
}