{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "",
    "ClosedDate": "2011-12-11T16:11:20.203-08:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "I keep my items with JC gems marked with purple diamonds so Rawr doesn't try to move them around, and it usually works.  In this case, my relic slot has a +67 int gem, and is marked with a  purple diamond.  I got a new belt, so I opened the file in Optimizer, check the Override Reenchant and Reforge buttons, but NOT Regem, max Thoroughness, max Rounds and ran it.\n \nI've run it at least a dozen times, and every time, it tries to move the JC gem from the Relic slot to the new belt.  The new belt has two red slots + a prismatic buckle, the relic of course has a single prismatic.  Sometimes it replaces the relic slot with a purple, sometimes with an Inferno ruby (and regems my hat), but the result is always numerically the same: it goes from 14357.74 > 14384.69.  In not a single round has it left the relic gem alone.\n \nWith the restriction on the relic, and looking at the results it's giving me, I would expect that it would put that purple or red gem into the prismatic on the belt, and leave the restricted relic alone.  Doing so would be mathematically the same result, and would obey my desire to not remove the JC gem.",
    "LastUpdatedDate": "2013-05-16T05:17:15.45-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2011-12-07T08:47:18.313-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "Optimizer ignoring purple diamond mark",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 21885
  },
  "FileAttachments": [
    {
      "FileId": 5478,
      "FileName": "eli.xml",
      "DownloadUrl": ".\\5478"
    },
    {
      "FileId": 5485,
      "FileName": "eli2.xml",
      "DownloadUrl": ".\\5485"
    }
  ],
  "Comments": [
    {
      "Message": "Another example, this file is eli2.xml.  Got a new ring.  Current relic marked with a purple diamond.  Opened in Batch Optimizer, check Override Reenchant and Reforge, NOT Regem, max Thoroughness, max Rounds.\r\n\r\nTen runs, every single one, instead of putting an Inferno Ruby in the new, ungemmed ring, and leaving the relic alone, it tries to move the JC Chimera's Eye from the relic to the new ring, and put an Inferno Ruby in the relic.\r\n\r\nNumerically the same, and I can change it manually, but it's a frustrating hassle to have to do so.\r\n\r\nAny ideas?",
      "PostedDate": "2011-12-08T16:42:53.717-08:00",
      "Id": -2147483648
    },
    {
      "Message": "You have it marked with both a purple AND green diamond, but you can't tell that because the purple mark hides the green mark (not sure why you can mark with both in the first place).  Shift-click it to see what I'm saying.  Then click to remove the green, then shift-click again to put the purple back.",
      "PostedDate": "2011-12-09T04:38:26.873-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Ah, holy schnikes.  Xemno, thank you so much.  Once again \"rawr isn't working right\" turns out to be operator error.\r\n\r\nI recently shortened my lists by changing \"Top Gemmings to Show\" from (default) 3 to 1.  When you show 3, it's easy to see you have both purple and green marked for the same item, and you can turn off the green.  When you only show 1, green is hidden under purple and causes \"apparent\" failure.  I think I'll split the difference and \"Show 2\"...  Shorter lists than 3, but avoids the double diamond pitfall of 1.\r\n\r\nAt the rate I'm getting new gear, this has been a very frustrating past few days.  Thank you again for helping me figure it out, and proving once again that \"RAWR IS BROKEN !@#$%\" usually actually means \"You're doing it wrong.\"",
      "PostedDate": "2011-12-09T07:16:19.19-08:00",
      "Id": -2147483648
    },
    {
      "Message": "The reason for allowing purple and green diamond is the following scenario. Imagine you have an item gemmed with an epic gem, but think them in general too expensive/rare and for regemming you only want to enable blue gems. In that case you'd purple diamond the epic gem version and also green diamond to allow it to regem with normals.",
      "PostedDate": "2011-12-11T16:11:15.04-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-12-11T16:11:20.203-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:24:04.463-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:17:15.45-07:00",
      "Id": -2147483648
    }
  ]
}