{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Base.ItemFilters",
      "DisplayName": "Rawr.Base.ItemFilters"
    },
    "ClosedComment": "Correct, we won&#39;t be &#34;fixing&#34; this",
    "ClosedDate": "2011-03-17T09:37:16.787-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "Filtering is horribly slow - its like pulling teeth when you want to categorically remove items from an upgrade list that you aren't committing to getting anytime soon, for example.\n \nI thought that the filtering lag may have been addressed by using the Desktop version, unfortunately not.",
    "LastUpdatedDate": "2013-05-16T05:18:27.37-07:00",
    "PlannedForRelease": "Rawr 4.1.0",
    "ReleaseVisibleToPublic": true,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2011-03-15T13:01:11.91-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[ItemFilters] Selecting Filters is slow",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 20242
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Uhh, can you give me some example scenarios where filtering is slow? As well as a character file to test against?",
      "PostedDate": "2011-03-15T13:05:05.277-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-03-15T13:05:44.69-07:00",
      "Id": -2147483648
    },
    {
      "Message": "BTW, making the WPF version again isn't an improvement. It is a secondary avenue of working with Rawr that's actually worse in a lot of ways except raw performance. See my posting about the differences between the two to see why.",
      "PostedDate": "2011-03-15T13:08:53.28-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Main problem here is on the direct upgrades pane.   Clicking a filter on my work PC takes 2-4 secs each item I select or deselect.    My good PC at home doesn't see this anywhere near as much.\r\n\r\n",
      "PostedDate": "2011-03-15T15:14:37.787-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Example scenario:\r\n- New install, first load.\r\n- Import non-raiding Level 80 toon.\r\n- Go to Direct Upgrades view.\r\n- Uncheck Heroics filter.\r\n- Get coffee.\r\n\r\nGenerally gets better the shorter the Direct Upgrades list is, but not by much - so that means if there were less upgrades from its current gear or enough categories filtered.\r\n\r\n",
      "PostedDate": "2011-03-15T20:38:37.683-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Seriously?? SERIOUSLY?? You are complaining about the speed of what is the 3rd slowest action you can do in Rawr because you didn't think that maybe its because the Direct Upgrades chart is processing every single slot at once.\r\n\r\nHere's a tip, don't do that. Try jumping to another chart like the relative stat values, set your filters up then jump back.",
      "PostedDate": "2011-03-15T21:12:35.443-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-03-15T21:13:10.3-07:00",
      "Id": -2147483648
    },
    {
      "Message": "I was just cussed for using the application as provided to me.  Weird.\r\nAnd, you closed the issue by admitting its a problem, but one that you don't have the nuts to address.\r\n\r\nNo wonder you switched to Microsoft technology - you'll be right at home.\r\n\r\nNo, seriously, I mean SERIOUSLY... why on earth would you need to recalculate every slot when the user is manipulating filters.  I mean wouldn't the calculations be done by that point, i.e. when the view is first displayed?  All values calculated, now just show/hide based on filter choice?  Smells like bad design, but that's just me.\r\n\r\nAnd this wasn't a problem with the old desktop app - just since you've moved to Silverlight.  I'm not saying Silverlight is a problem, but just using it as a point-in-time reference for you.  I dunno why - you've already demonstrated you won't be fixing it.\r\n\r\n*sigh*\r\n\r\n",
      "PostedDate": "2011-03-16T14:08:48.73-07:00",
      "Id": -2147483648
    },
    {
      "Message": "\r\n\r\n\n\n** Closed by Jothay 3/15/2011 9:13 PM",
      "PostedDate": "2011-03-17T09:06:33.52-07:00",
      "Id": -2147483648
    },
    {
      "Message": "See previous comment.  Didn't know I could reopen.\r\n\r\nJust wanted to say that they're still slow. :D\r\n",
      "PostedDate": "2011-03-17T09:06:34.98-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-03-17T09:37:16.787-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:25:39.8-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:18:27.37-07:00",
      "Id": -2147483648
    }
  ]
}