{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Bear",
      "DisplayName": "Rawr.Bear"
    },
    "ClosedComment": "Unable to reproduce, these were probably issues due to the earlier beta state of Rawr3 and have been fixed",
    "ClosedDate": "2010-07-03T12:41:25.037-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "The Stats tab of the Bear module of the Rawr 3 Web page does not seem to be working when loading in a character from the armory. The module tries to run the calculations but none of the calculations are able to be shown (There is no numbers shown next to the tag for each line). Because this is happening, the possible items that appears if you try to manually change the items from their respected icons does not appear. This tab does seem to work fine if a saved file is loaded.\n \nAlso; and this could be part of the issue in the previous paragraph; the buff tab is not loading when loading in a character from the armory.\n \nI'm loading in from my feral druid who I logged out in my Tanking set/spec (Deldruid on Crushridge). I do have the 245 Ony Feral helm so I'm not sure if that is affecting it. Nor am I sure if it is also affected by the Triumph badge shoulders (the non-tier triumph shoulders). When I tried hovering over them, it said \"Failed - [Arg_KeyNotFound]\" under the enchant. However it was able to load the non-tier triumph shoulders when I loaded up my Kitty saved file.\n \nOtherwise everything so far is working fine with this module. The Option tab seems to be working fine though if it's possible to have the drop down expanded by default (they are minimized on first load in.\n \nThe only thing that got me confused for a bit is the change from \"Right-Clicking\" to \"Shift-Left-Click\" to remove a talent point from the Talent tree.",
    "LastUpdatedDate": "2013-05-16T05:23:32.31-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2009-11-05T23:57:34.883-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Bear] Issues with the Bear module",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 14640
  },
  "FileAttachments": [],
  "Comments": []
}