{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.DPSWarr",
      "DisplayName": "Rawr.DPSWarr"
    },
    "ClosedComment": "fixed",
    "ClosedDate": "2009-10-12T11:26:48.11-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "I am trying to do some optimizations and upgrade list builds, and the calculation speed in the DPSWarr module is SIGNIFICANTLY worse in 2.2.20 then it was in 2.2.19. It is taking almost 10 minutes for a single maximum-thoroughness optimization cycle, and after letting the upgrade list process work for an hour it was less then 10% done. I have not checked any other modules, so I don't know if this is limited to the DPSWarr module or not.\n \n~Droid",
    "LastUpdatedDate": "2013-05-16T05:24:01.323-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2009-10-06T23:44:52.32-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[DPSWarr] Significant speed degradation between 2.2.19 and 2.2.20",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 14345
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "DPSWarr is simply doing alot more than it previously was. We're working on optimizing it's performance, though.",
      "PostedDate": "2009-10-07T00:14:00.583-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Droid,  Arms or Fury?  You should know by now you need to tell us, because they're two separate calculation models.  Also, including a character file will help us nail it down.  I know that I haven't seen anything like that for fury (I was getting up to 20% in the upgrade list in 20mins of watching youtube videos last night before bed :P), but it really could depend on a number of factors.\r\n\r\nA few unavoidable changes: uptime on haste/crit procs are iterative, no way around it.  We can't do special effect uptimes without knowing your haste first.  This is a definite degrade in performance.",
      "PostedDate": "2009-10-07T07:39:33.747-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Sorry ebs, you are of course correct. I was having the problem with Arms, if other people aren't seeing it then I will upload my character profile tonight when I get home. Also, I do not have any haste or crit procs on my character currently.\r\n\r\nMy main concern is that the performance on my character is now (subjectively) worse then it was back when we started the optimization effort a few months ago. I really don't want to have to start doing upgrade lists on a 4-processor workstation again.",
      "PostedDate": "2009-10-07T08:58:37.32-07:00",
      "Id": -2147483648
    },
    {
      "Message": "I'll see if I can't do some profiling on Arms today.  I did a quick once-over of it a few days ago, showing all items and just toggling on/off the \"Enforce Gemming Requirements\" and there was no measurable delay that I could find.  I just tried it again with a different character, and I'm seeing a pretty big delay, so we shouldn't need a profile uploaded.",
      "PostedDate": "2009-10-07T09:34:03.92-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-10-07T11:09:00.207-07:00",
      "Id": -2147483648
    },
    {
      "Message": "I'm not going to close this just yet, because there's still some work to be done, but check out 2.2.21.  A lot of perf increases should have gone in.",
      "PostedDate": "2009-10-07T21:04:46.26-07:00",
      "Id": -2147483648
    },
    {
      "Message": "2.2.21 is significantly better, but it warms my heart that you are going to continue working on it :-D",
      "PostedDate": "2009-10-07T21:59:09.97-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-10-12T11:26:48.11-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-09-08T16:08:54.537-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:32:37.493-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:24:01.323-07:00",
      "Id": -2147483648
    }
  ]
}