{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Base",
      "DisplayName": "Rawr.Base"
    },
    "ClosedComment": "Closing... wtf",
    "ClosedDate": "2010-06-29T16:41:59.46-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "I don't see this anywhere in other threads.  If it is there somewhere can you point me towards it?\nLaunched once but failed when opening a saved character\nSecond launch wouldn't get past the rawr launch screen without the below error\n \nEventType : clr20r3     P1 : rawr.exe     P2 : 2.3.17.0     P3 : 4bf0f1e3     \nP4 : mscorlib     P5 : 2.0.0.0     P6 : 4a7cd8f7     P7 : 1a34     P8 : 4a     \nP9 : system.argumentexception \n \nviewing contents of error report doesn't let me copy data...  \nadded the system.net info to the rawr.exe.config file there doesn't appear to be a system.net on the pc after running it\ndeleted rawr folder and redownloaded and extracted\nerror occurs very shortly after the SpecialCache.bin file is generated initially",
    "LastUpdatedDate": "2013-05-16T05:20:38.073-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2010-05-22T21:37:12.963-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Base] Encountered problem and needs to close",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 17780
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Any time you ever see \"encountered a problem and needs to close\", that indicates some problem outside of Rawr's code. A reinstall of the .NET Framework, along with virus scans, is the best we can suggest in that case.",
      "PostedDate": "2010-05-22T22:27:00.883-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Whatever.  Seems that the issue was not \"Some problem outside of Rawr's code\" since apparently a fix is already approved.  Nice snide comments from you in that thread too BTW... seems to be a pattern.  You are relying on volunteers to debug code and just lost one.  BTW I remaged a PC this morning and loaded SP3 Net4 and rawr only to confirm the issue.  Theres a few hopurs of life I won't get back and theres a tester that is willing to do just that which you won't get back.  Good luck with your software.  I hope you can come to terms with your anger issues.",
      "PostedDate": "2010-05-23T09:56:14.143-07:00",
      "Id": -2147483648
    },
    {
      "Message": "...what are you talking about? What 'fix' is already in? Are you confusing me for someone else?\r\n\r\nYeah, I pretty much have no idea what you're talking about.",
      "PostedDate": "2010-05-23T10:20:33.327-07:00",
      "Id": -2147483648
    },
    {
      "Message": "And I do make some snide comments occasionally, but I don't see anywhere I made any to you... Again, wtf are you talking about? Sorry you're frustrated with the problems you're having, but it doesn't change any of the facts of the situation that I can tell.",
      "PostedDate": "2010-05-23T10:23:02.857-07:00",
      "Id": -2147483648
    },
    {
      "Message": "http://rawr.codeplex.com/Thread/View.aspx?ThreadId=213168",
      "PostedDate": "2010-05-23T11:54:11.53-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Yeah, I still don't see the issue with any of that.",
      "PostedDate": "2010-05-23T12:26:21.78-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Also, you may have missed it, but we're all volunteers around here.",
      "PostedDate": "2010-05-23T12:51:17.107-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Yes but you are the only one that is consistently abusive and dismissive in your replies to others.  Either way, I bid you adieu.  If you can't see the relationship between the two threads I don't know what to tell you.  Good luck with the project.  It really is an excellent program and does tend to work far far FAR more often than not.  It is truly something to be proud of.",
      "PostedDate": "2010-05-23T14:47:46.67-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Rodger, you're actually NOT helping.  No stack trace, no attachments, so you did some black-box testing and found there is some generic problem.  HELL, you didn't even mention OS, or what version of NET you might be using.  Some of us on the team have access to resources like different OS iterations and such to help track down issues.  If you want to keep raw images of your OS, then feel free to get some software like Ghost or similar that allows of such things.  ",
      "PostedDate": "2010-05-23T15:00:24.78-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Yeah, I pretty much don't know what Rodger's talking about. I must be missing something. Yeah, I'm snide with people who waste our time and are rude. But all I see is some complaint of an issue, without giving all the details, and some mystical 'I fixed it, it was your fault' sort of thing. He's not even in that thread, unless I'm blind.",
      "PostedDate": "2010-05-23T17:57:41.517-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-06-29T16:41:59.46-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-09-08T16:32:01.283-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-03-17T21:30:15.273-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:28:22.173-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:20:38.073-07:00",
      "Id": -2147483648
    }
  ]
}