{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Warlock",
      "DisplayName": "Rawr.Warlock"
    },
    "ClosedComment": "Significant user misconceptions, please repost with an actual issue AND your character files if the links Astry provided don&#39;t help you.",
    "ClosedDate": "2010-08-02T08:38:00.383-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "I have recently run the optimiser and can't figure out why 'Sash of Ancient Power' has a better resulting score than 'Braid of the Salt and Fire' for a demonology focused warlock.  I have seen many examples like this where the relative gear scores based on item level do not seem to be  represented correctly.  What about having 2 bars for each item instead of just the one (attached to each other of course).  \n \nThe top half, as you already have it and the bottom half a color coding system that indicated which stats are contributing to the score (associated number inside as well).  Maybe also information about the coefficient or weighting that you are using for each stat so we can see its relative importance compared to others. This will help both and and experienced players see the effect of stats toward their gear score and make your tool have a unique feature.",
    "LastUpdatedDate": "2013-05-16T05:20:11.853-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2010-08-02T01:16:29.103-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Warlock] Haste Issues",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 18349
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "You seem to have some pretty significant misconceptions about how Rawr works. Check out the readme, and wiki articles. Most of what you're describing doesn't exist in Rawr, precisely because it *is* inaccurate. There are no stat values or weights, and individual stats do not have value on their own within an item. Only the whole character is valued, and the effect that different items have on that whole character.\r\n\r\nIn your specific case, read the wiki article about \"I don't understand why...\". It'll quite likely answer your question, and if it doesn't, tell you how to post so that we actually are able to help you (we can't at all from this sort of post).",
      "PostedDate": "2010-08-02T01:47:41.413-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Best guess:  you're under hitcap.\r\nThe sash gets you closer to the hitcap and thus is a bigger DPS improvement than an item with seemingly better stats but no hit at all.\r\n\r\nAlso: the sash has 2 sockets, so actual stats can get a lot closer than you think...  Wild guess... Rawr suggests to use a SP+Hit gem ? this would proove my above assumption.",
      "PostedDate": "2010-08-02T06:48:31.55-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-08-02T08:38:00.383-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-09-05T15:43:00.093-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:27:50.223-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:20:11.853-07:00",
      "Id": -2147483648
    }
  ]
}