{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "This is a Firefox and Silverlight issue, not a Rawr issue. Please post this to either&#47;both of their help desks",
    "ClosedDate": "2011-01-14T15:50:47.323-08:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "You are most likely already aware of this, but when using Firefox (v 3.6.13) with the privacy settings set to \"Never remember history\", the web based version of Rawr does not work.\n \nAn error message stating that there is not enough memory is given.  I read something about checking to see if there was an exception for firefox in Silverlight settings, however that does not resolve the issue.\n \nChanging the privacy settings to \"Remember history\" does resolve the issue.  If history is being remembered then a Silverlight popup requesting memory shows up and the program gets its needed resources.\n \nI doubt there's anything you can do to make the web version work under firefox with \"never remember history set\", but I think it would be good to make a note in a FAQ or something somewhere that you need to change that setting to get the program to work.\n \nedit - the error in question is:\n\"Rawr does not have permission to create a Storage Cache which is necessary to run the program.\"\n \nand it occurs immediately after the program finishes loading to 100%",
    "LastUpdatedDate": "2013-05-16T05:19:01.59-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2011-01-14T12:01:04.79-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "Firefox Problem (Error on start; not enough memory)",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 19705
  },
  "FileAttachments": [],
  "Comments": []
}