{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Base",
      "DisplayName": "Rawr.Base"
    },
    "ClosedComment": "Rawr 4.0.15 Released 01&#47;09&#47;2011",
    "ClosedDate": "2011-01-09T19:54:00.06-08:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "I installed the offline version awhile back, tried to load it through silverlight and I got the same old error as always, I figured by now there must have been an update, so I check the browser version and what do ya know, a new version loads up. I clicked the install offline button and nothing happens. I uninstalled silverlight and reinstalled, figured maybe the old rawr data needed to be cleared first, but it's a no-go. the button is dead, it does absolutely nothing.",
    "LastUpdatedDate": "2013-05-16T05:19:17.097-07:00",
    "PlannedForRelease": "Rawr 4.0.14 Beta",
    "ReleaseVisibleToPublic": true,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2011-01-02T06:36:12.293-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Base] Install offline doesn't work",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 3,
    "Id": 19516
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Same issue here. My offline version is stuck on v 4.0.12, and the website v 4.0.14b won't install offline.",
      "PostedDate": "2011-01-02T06:57:59.91-08:00",
      "Id": -2147483648
    },
    {
      "Message": "If you already have it installed offline then of course the button doesn't work, its already installed. If the offline one doesn't tell you that it has updated about a minute after launch, right click and say remove application. Then go back to the browser one and try the install again.",
      "PostedDate": "2011-01-02T07:40:42.83-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-01-02T14:00:05.377-08:00",
      "Id": -2147483648
    },
    {
      "Message": "I have not been able to have Rawr4 update itself ever since it came out of Alpha. Each time the online version is updated I have to un-install offline version then wait ~30 minutes before the systems will let me re-install the latest version.",
      "PostedDate": "2011-01-02T15:39:08.37-08:00",
      "Id": -2147483648
    },
    {
      "Message": "What works for me is to go to Programs and Features and uninstall Rawr making sure that all browser windows are closed before I do so.\r\n\r\nAfter this uninstall I open the Rawr website in IE (doesn't always seem to work right with Firefox).  Then the install offline button works.  If it doesn't I close and reopen IE and retry.  Works the second time always if not the first.",
      "PostedDate": "2011-01-03T00:43:56.09-08:00",
      "Id": -2147483648
    },
    {
      "Message": "My understanding is that the offline SL version is suppose to be able to update itself once a new version is released but I have mis-understood things like this before.",
      "PostedDate": "2011-01-03T00:53:18.73-08:00",
      "Id": -2147483648
    },
    {
      "Message": "It is supposed to update itself:\r\n1) You launch the program\r\n2) After about a minute or two you should see a dialog stating Rawr has updated itself and at your convenience to close and reopen it to see the updated version\r\n3) Close program\r\n4) Reopen it\r\n5) See the new version number in the bottom corner\r\n\r\nIf this isn't happening for you we need to find out what is specific about your system setup that could be preventing it from checking to see if there is a newer version. Things like Proxies, lack of Internet Connection, etc",
      "PostedDate": "2011-01-03T10:51:56.097-08:00",
      "Id": -2147483648
    },
    {
      "Message": "To further complicate the matter, I don't have an offline installation, and just wanted to get one, and the button doesn't work for me either. Perhaps this issue is more complex than the original post poses.",
      "PostedDate": "2011-01-04T02:36:39.91-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-01-04T02:39:06.52-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-01-06T08:34:24.907-08:00",
      "Id": -2147483648
    },
    {
      "Message": "One of the devs found that on his system, when he previously had an install offline but had already uninstalled it, the record was not removed from the silverlight registry properly. He manually removed the entry and then was able to install fine.",
      "PostedDate": "2011-01-06T09:31:13.68-08:00",
      "Id": -2147483648
    },
    {
      "Message": "I was able to install 4.0.14.0b fine after manually right-click-uninstalling 4.0.12.0 first. I still don't know why 4.0.12.0 never updated automatically. I would highly recommend a \"Check online for updated version\" button to make this update process more explicit (even if just to make reproducing bugs easier).",
      "PostedDate": "2011-01-09T00:39:19.437-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Marking this fixed as there are several solutions posted and they have also been included in the program as an alert to the user when they are doing it wrong.",
      "PostedDate": "2011-01-09T18:38:51.533-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-01-09T19:54:00.06-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:26:42.523-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:19:17.097-07:00",
      "Id": -2147483648
    }
  ]
}