{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Base.Items",
      "DisplayName": "Rawr.Base.Items"
    },
    "ClosedComment": "",
    "ClosedDate": "2009-12-14T19:17:54.19-08:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "2.2.20\nMerlins Robe is not under Crafted\n \n2.2.19\nDrape of Bitter Incantation is Missing or not in the correct filter.\nBlade of the Silver Disciple 245 is missing\n \n2.2.18\nBoots of the Mourning Widow 245 was in the wrong filter. Adding it manually via \"Edit item\" worked.\nAbyssal Rune is listed as \"Trash Drop\" is that correct?\nIllustration of the Dragon Soul is under 10 man instead of 25\nScale of Fates is under 10 man instead of 25\nFlare of the Heavens is under 10 man instead of 25\nGrasps of Reason is under 10 man instead of 25\nConductive Seal is under 10 man instead of 25.\nMerlins Robe ist not under Crafted Tailoring, only Crafted\nI think tons of Ulduar (hm?) items are in the 10-man filter instead of the 25 man filter.\nWowhead is correct on most of these btw.",
    "LastUpdatedDate": "2013-05-16T05:24:47.007-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2009-08-18T00:36:57.18-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Items] List of Missing / Miss-Sorted",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 13905
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Twins Gear is not in the correct filters, some of it is missing.",
      "PostedDate": "2009-08-25T02:24:52.053-07:00",
      "Id": -2147483648
    },
    {
      "Message": "2.2.14 Faction Champion Loot looks ok.",
      "PostedDate": "2009-08-31T05:29:55.177-07:00",
      "Id": -2147483648
    },
    {
      "Message": "2.2.14 Boots of Fiery Resolution are missing",
      "PostedDate": "2009-08-31T05:31:01.617-07:00",
      "Id": -2147483648
    },
    {
      "Message": "2.2.14 Rapture is missing",
      "PostedDate": "2009-08-31T05:31:58.843-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Run a Load possible upgrades from Wowhead/Armory then Update from Wowhead/Armory.",
      "PostedDate": "2009-08-31T05:33:53.25-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Thanks, I'll do that.\r\nWould be neat though if they already came with the 2.2.14 zipfile.",
      "PostedDate": "2009-08-31T06:45:35.21-07:00",
      "Id": -2147483648
    },
    {
      "Message": "The default cache that comes with releases gets a new load pulled straight out of Wowhead I believe, which may have some discrepancies with what comes from the Armory. Unfortunately there are so many items we can't just walk through them all and verify each item before a release.",
      "PostedDate": "2009-08-31T06:54:20.617-07:00",
      "Id": -2147483648
    },
    {
      "Message": "2.2.14 Reign of the Unliving 's Proc isn't set yet.",
      "PostedDate": "2009-08-31T22:57:36.17-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-09-02T22:00:43.703-07:00",
      "Id": -2147483648
    },
    {
      "Message": "I updated the ticket for 2.2.14",
      "PostedDate": "2009-09-02T22:01:00.8-07:00",
      "Id": -2147483648
    },
    {
      "Message": "They are parsed correctly however.",
      "PostedDate": "2009-09-03T04:25:22.687-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-09-03T12:52:01.077-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-09-04T01:21:53.9-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Updated",
      "PostedDate": "2009-09-04T01:22:31.227-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-09-06T07:42:10.18-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-09-06T10:25:03.73-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-09-06T10:30:15.153-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-09-06T10:37:39.18-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-09-06T10:44:09.557-07:00",
      "Id": -2147483648
    },
    {
      "Message": "updated for 2.2.15",
      "PostedDate": "2009-09-09T09:04:30.503-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-09-09T11:29:57.77-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Updated.",
      "PostedDate": "2009-09-12T09:55:48.713-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Thanks. I've gone through most of these... A couple were filter errors, fixed those. A couple seemed to already be fixed. The resto seemed to be just bad data from Wowhead/Armory. Like Armory doesn't have drop data on Boots of Fiery Resolution or Grasps of Reason, and Wowhead says they drop on 10M, not 25M.",
      "PostedDate": "2009-09-12T12:08:11.033-07:00",
      "Id": -2147483648
    },
    {
      "Message": "So it's wowheads error not yours? I guess I'll have to file a bug report there then ^^\r\nOn the wowhead site I can't even find where it states if an item is 10 oder 25... ",
      "PostedDate": "2009-09-12T15:09:39.053-07:00",
      "Id": -2147483648
    },
    {
      "Message": "On the page for a boss, it'll have multiple tabs of data, \"Normal Drops\", \"Heroic Drops\", \"Comments\", etc.",
      "PostedDate": "2009-09-12T15:12:35.333-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Ah ok. Boots of Fiery Resolution is listed under \"Hard mode loot\"->Heroic. I think that's 25man ?",
      "PostedDate": "2009-09-12T15:51:18.277-07:00",
      "Id": -2147483648
    },
    {
      "Message": "updated... I think there are still many items under 10 instead of 25.",
      "PostedDate": "2009-09-14T13:43:01.71-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-09-14T14:13:11.737-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-09-16T23:17:37.807-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-09-17T12:21:31.753-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-09-18T11:35:15.937-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-09-18T11:44:16.883-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-09-18T11:55:30.25-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-09-19T10:54:45.027-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-09-21T22:36:20.78-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-09-21T22:38:18.663-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-09-21T22:51:18.697-07:00",
      "Id": -2147483648
    },
    {
      "Message": "I think most of these are still wrong in 2.2.18",
      "PostedDate": "2009-09-23T00:41:46.273-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-09-25T05:13:08.247-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Updated for 2.2.19.\r\nYay Onyxia Loot :-D\r\n\r\nI left the 2.2.18 Missing Items in there that I haven't tested yet with 2.2.19",
      "PostedDate": "2009-09-25T05:14:34.57-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-09-25T05:15:19.407-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-09-26T08:04:11.03-07:00",
      "Id": -2147483648
    },
    {
      "Message": "I've posted a forum post on wowhead asking for specific 10/25 and 10/25 heroic flag http://www.wowhead.com/?forums&topic=122103&p=1425495 perhaps others adding their support to this request would be useful. Having this flag would greatly assist us setting up filters on items.",
      "PostedDate": "2009-10-02T02:27:19.947-07:00",
      "Id": -2147483648
    },
    {
      "Message": "I have been working hard on the filters, and most of the data that is imported from Wowhead/Armory is good information for sorting, but there are a lot that just don't have enough info to sort. I have added the ? and ?? markers into the filter system, they address issues of where your best bet for the sortable information is. But some things just get messed up depending on where you get your information from. I will use the \"Drape of Bitter Incantation\" as an example:\r\n\r\nWowhead reports it as - \"Found in Argent Crusade Tribute Chest in Heroic Trial of the Crusader (10)\"\r\n       Well this makes it very easy for the filters. First it can see that it is \"Trial of the Crusader\", next it can see that it is \"(10)\" ten man, then it notes it to be \"Heroic\", and finally that it is part of the \"Argent Crusade Tribute Chest\". Easy to sort and lots of information.\r\n\r\nArmory reports is as - \"Found in Argent Crusade Tribute Chest in Trial of the Crusader\"\r\n       While it is good information, it is not as detailed as the first. The Filter notes that it is \"Trial of the Crusader\" and that it is NOT \"Heroic\", this causes it to go to the 10 man, if it had found it to be \"Heroic\" in this case it would have moved it up to 25 man due to the way the Armory differentiates 10 man and 25 man. Next the only other information it has is that it is part of the \"Argent Crusade Tribute Chest\", and sorts it according to the information available.\r\n\r\nEnd result is:\r\nThey both get sorted to \"Tier 9 Raids (10)\" - \"Trial of the Grand Crusader\" - \"Tribute Chest\". The filters are still able to keep up with the information as it is, they are good filters, question is, \"Am I sorting them into the wrong place?\"\r\n\r\nAs it is right now, I am not in ten man raids, so I really don't get to see these filter in action for those raids, just yet.\r\nIf the information is being sorted wrong, please let me know, and I will do my best to fix them...\r\n\r\nThanks...",
      "PostedDate": "2009-10-02T08:02:29.627-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Addressing my previous statement, I forgot to indicate that this will be in the next patch. As it stands right now with the v2.2.19 filters you do not have the same filters as I do. So you can now look forward to having a more powerful filter and when you have them, then you can let me know if there are any future problems with them.\r\n\r\nTill then, just look forward to v.2.2.20...\r\nHope you will like them much better...\r\n\r\nLOL... (<--- insert Evil Laugh here)",
      "PostedDate": "2009-10-02T08:18:09.467-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Great to see that your looking at the filters, cool!\r\n\r\nIn your mentioned case of Drape of Bitter Incantation I guess you'd better do what wowhead tells you to do and not what armory says... Too bad armory doesn't have HC/nHC Information NOR(?) 10/25 ?? :-(",
      "PostedDate": "2009-10-02T09:14:53.96-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Well the Armory does have better information for PVP gear, so it is a trade off...\r\n\r\nGood thing is once you get it all sorted out, it stays that way until you \"Update the Item Cache\" from Wowhead or the Armory...\r\n\r\nHopefully they both will get better information in the future...",
      "PostedDate": "2009-10-02T12:00:56.61-07:00",
      "Id": -2147483648
    },
    {
      "Message": "And if you change the code of  \"Update Itemcache\" so that it uses both the armory and wowhead? Meaning that for example it doesn't work if one of them is offline?",
      "PostedDate": "2009-10-03T02:57:44.907-07:00",
      "Id": -2147483648
    },
    {
      "Message": "We don't need to change that code, if one is offline, use the other, or wait until it's back online. (referencing specifically the 'Update Item Cache from x....' function)",
      "PostedDate": "2009-10-03T11:30:39.43-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Hm... but if I understood MTRazer correctly \"Update Item Cache from Armory\" would insert Drape of Bitter Incantation into 10 man normal mode instead of 10 man heroic. Therefore my Idea is that you should always check both sources when Updating Item Cache, instead of just the Armory.",
      "PostedDate": "2009-10-04T00:22:27.81-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Or you could use armory exclusively for PVP Gear, and wowhead exclusiveley for PVE Gear. (MTRazeR wrote that armory has better information for PVP gear while wowhead has better information for PVE Gear)",
      "PostedDate": "2009-10-04T00:27:05.107-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Yes, but not 100%. After you \"Update the Item Cache\", a small amount o the data will be hard to filter and would be better to refresh from the other source. There is also a smaller amount of the data that just has no usable information from either source. The use of the refresh would be to see if the other information is any better. An example would be if you just finished an update and you look at the info on a piece of armor and it says \"Drops from  in \", well that is not very useful at all. But to aid you in determining what source to use will be two new filter option that will suggest what source to use. Basically since both sources word thing differently, the filter would list the option to refresh from the other source, an even this is not 100%, but it will be up to the user to determine if they keep refreshing the same item back and forth over and over, that just maybe there is no usable information from either sources. Still on a better note, the information on the servers change and get updates, so it is possible that the information will become available in the future. The idea is to just keep checking from time to time, and until then if you see an item that may be of interest to you, search the web for other information and write a note of your own. ",
      "PostedDate": "2009-10-04T08:01:45.237-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-10-08T09:54:39.737-07:00",
      "Id": -2147483648
    },
    {
      "Message": "The new weapons from Onyxia are being filtered out of upgrade listings for melee due to their having no stats. Both versions of Vis'kag and Gutgore are not showing. Also I am unable to find a physical damage proc to use for Vis'kag.",
      "PostedDate": "2009-10-15T01:54:48.203-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-12-14T19:17:54.19-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-09-08T16:19:37.49-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:33:32.88-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:24:47.007-07:00",
      "Id": -2147483648
    }
  ]
}