{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "",
    "ClosedDate": "2011-07-15T04:02:18.72-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "Been using RAWR for awhile now. I just downloaded 4.2.1 RAWR. I was wondering why the drastic change from Haste to Mastery. I was 1600+ Haste, now its telling me to go to 1600+ Mastery, and my Haste is down to 1300+ when I did what Optimize told me to do. I lost alot of DPS on my stat board in-game. Is there an issue going on I haven't found at the website or is this for real?",
    "LastUpdatedDate": "2013-05-16T05:17:37.93-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2011-07-12T21:33:29.087-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "Mage Haste/ Mastery Change in RAWR 4.2.1",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 21154
  },
  "FileAttachments": [
    {
      "FileId": 5148,
      "FileName": "Brutalgnomeb4optomize.xml",
      "DownloadUrl": ".\\5148"
    },
    {
      "FileId": 5149,
      "FileName": "brutalgnomeafteroptomize.xml",
      "DownloadUrl": ".\\5149"
    }
  ],
  "Comments": [
    {
      "Message": "There was no change that I am aware of. Please attach the character xml where you see this.",
      "PostedDate": "2011-07-12T21:33:59.75-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-07-12T22:19:27.643-07:00",
      "Id": -2147483648
    },
    {
      "Message": "This was before Optomize",
      "PostedDate": "2011-07-12T22:19:30.077-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-07-12T22:21:31.37-07:00",
      "Id": -2147483648
    },
    {
      "Message": "this is after",
      "PostedDate": "2011-07-12T22:21:32.65-07:00",
      "Id": -2147483648
    },
    {
      "Message": "The before was from 4.1 Optomization, the after is from 4.2. Same gear.",
      "PostedDate": "2011-07-12T23:52:47.777-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Sorry for the misspell. It was 4am when I did this.",
      "PostedDate": "2011-07-13T09:27:23.707-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Can you let me know if it's ok to reference the Optimize? I put back some haste and it's still telling me to take my 15.77% Haste and 15.30 Mastery, and change it to 13.95% Haste and 16.56 Mastery? That is even more Haste lost from my Optimizing on the 4.1 RAWR which was 17.74% Haste and 13.93% Mastery, after Optimizing on 4.1. Thus my concern.",
      "PostedDate": "2011-07-14T14:22:22.417-07:00",
      "Id": -2147483648
    },
    {
      "Message": "What do you mean by referencing the optimize?\r\n\r\nI'll try to take a look at this today. Do you remember which exact version of Rawr you used for your last optimization? Do you mean 4.1.06 or something even older? Because if it was that old quite a lot of things could be the reason for a change.",
      "PostedDate": "2011-07-14T17:11:56.327-07:00",
      "Id": -2147483648
    },
    {
      "Message": "I mean, is it ok to rely on it still. I still don't understand the drastic switch to Mastery. Can I Optimize with confidence?",
      "PostedDate": "2011-07-14T17:59:52.08-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Most likely the latest Version of 4.1. I kept it up to date. I just feel like I'm casting like a Fire Mage now, real slow, and when I chnage to the latest Optimize my DPS drops alot in the stat board. I mean 17% haste down to 13% to me, is dramatic.",
      "PostedDate": "2011-07-14T18:10:11.093-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Ok I looked at the situation and this is what is happening.\r\n\r\nIn 4.1 version the optimized solution was very volatile in the sense that all 3 stats, haste, mastery and crit had almost the same value. The latest version had a major fix for int procs, which was enough to slightly separate the stats for you. They're still very close, but mastery is in the lead, which is why the optimizer made those changes.\r\n\r\nOne thing I noticed is that in the Buffs tab you're missing quite a lot of buffs, specifically mana regen ones. This won't make a big difference, just a general observation that you should mark those buffs that you generally have available, even if you don't have them 100% of the time.\r\n\r\nI would say you can still rely on the optimizer results. The before optimize one shows 19323.82 dps for me and the one after 19338.47 dps, so in practice you shouldn't see much difference even though there is a large swing in the stats because they have so similar value for you. When you say that your dps drops a lot in the stat board, what do you mean by that?",
      "PostedDate": "2011-07-14T19:09:07.41-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Thank you very much! You guys are doing a great service here.",
      "PostedDate": "2011-07-14T19:54:33.983-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Stat Board- In-game in Caracter Tab/ Stats/ DPS.\r\nThanks again for your help. RAWR has always been a great Tool for me, as well as many members in our guild, and friends in game.",
      "PostedDate": "2011-07-14T21:50:22.79-07:00",
      "Id": -2147483648
    },
    {
      "Message": "If you mean the dps under Ranged on character sheet in game that is your wand dps, shouldn't base any decisions on that.",
      "PostedDate": "2011-07-14T23:52:50.523-07:00",
      "Id": -2147483648
    },
    {
      "Message": "You are correct, and I feel stupid, lol. All this time I was watching that, not thinking it was my wand. DUH! I re-optimized again, everythings back to normal. Thnx for all your time and help on such a small matter. ",
      "PostedDate": "2011-07-15T00:29:37.46-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-07-15T04:02:18.72-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:24:37.347-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:17:37.93-07:00",
      "Id": -2147483648
    }
  ]
}