{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "Fixed.",
    "ClosedDate": "2009-09-17T13:06:30.9-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "I just got blessed to using Rawr 3.0. I understand it's unfinished. However I notices on my Mac, both under Safari 4 and Firefox 3.5.1, that gear list don't show the diamond to click to mark available gear.\n \nWithout this feature, the optimizer is basically useless and Rawr looses a lot of interest.\n \nI can see three possible explanations:\n \n- diamonds are not implemented yet. This is fine and understandable at this early stage\n- items are marked as available in a different manner in 3.0 than in 2.x\n- there is a bug, possibly Mac-specific, possibly Snow Leopard specific...\n \nI could not find which searching the tracker.",
    "LastUpdatedDate": "2013-05-16T05:24:45.727-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Medium",
      "Severity": 100,
      "Id": 2
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2009-08-19T07:42:51.967-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "Rawr3: No diamond to check available gear",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 2,
    "Id": 13917
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Where can I get Rawr 3?",
      "PostedDate": "2009-08-19T08:24:21.21-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-08-19T08:24:34.197-07:00",
      "Id": -2147483648
    },
    {
      "Message": "To anyone that asks the same question as zMilamber:\r\n\r\nRawr3 is in alpha stage, not even beta. Many things have not been implemented in Rawr3 yet, especially the Options panels for most models. We do not want general users going into Rawr3 and trying to use it as it's not ready for general use yet.\r\n\r\nWith regards to jdmuys's stated issue:\r\n\r\nI'll leave that to one of the guys working on Rawr3 to answer.",
      "PostedDate": "2009-08-19T08:34:49.733-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-08-19T11:14:24.69-07:00",
      "Id": -2147483648
    },
    {
      "Message": "This is a mac specific bug in Silverlights image processing, the control is implemented but Silverlight is displaying the image as blank on the Mac. There are a few other isntances of Silverlight displaying images oddly. Like in the talent prereq arrows where they will show a white background in Silverlight, where every other image editor will show them as a transparent background.",
      "PostedDate": "2009-08-19T11:17:01.503-07:00",
      "Id": -2147483648
    },
    {
      "Message": "OK then. I tried to click \"blindly\" to where I think the invisible diamonds should be. Despite many attempts, I could not manage to see any change. So it seems the bug also affects the green diamonds, not only the white ones. Having no way to see whether/which items are marked as enabled makes it a cumbersome experience to use Rawr 3.0.\r\n\r\nWhat would be a workaround?\r\n\r\n- Would changing the diamond image(s) help? Is the bug really 100% understood, as in \"which kinds of images would trigger the bug and when?\"\r\n\r\n- Would changing the window background color to some sort of light grey make the white diamonds visible?\r\n\r\nHow would I try any of the above suggestions? Do I need a development environment and which one? (I am a programmer - only on Mac, not on Windows).\r\n\r\n\r\n",
      "PostedDate": "2009-08-20T05:46:42.297-07:00",
      "Id": -2147483648
    },
    {
      "Message": "jdmuys, nobody's suggesting that it stay that way; of course it's terrible and makes it unusable.",
      "PostedDate": "2009-08-20T08:50:02.143-07:00",
      "Id": -2147483648
    },
    {
      "Message": "(We'll have to fix it on our side, unless Silverlight magically fixes it somehow)",
      "PostedDate": "2009-08-20T08:50:22.603-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-09-17T12:26:37.533-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-09-17T13:06:30.9-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-11-22T19:56:47.293-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:33:31.05-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:24:45.727-07:00",
      "Id": -2147483648
    }
  ]
}