{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Warlock",
      "DisplayName": "Rawr.Warlock"
    },
    "ClosedComment": "No longer a known issue in 2.3.14.",
    "ClosedDate": "2010-04-11T20:31:31.343-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "I decided to reload my toon from the armory today to see if something in my existing xml file was causing the warlock haste issue and I came upon an interesting finding.  By selecting certain buffs, MP5 gems give a negative score.\n \nI loaded Isosmall from Proudmooe via the armory.  I selected Slot: Gems > normal > all normal (since I wanted to see when haste started giving negative results).\n \nI started selecting the buffs I use in the raid (top to bottom): Sanct Ret, Imp Moon, Bloodpact/improved, AI, BOW/improved, moonkin, totem of wratch, divine spirit, fort/improved, motw/improved, BoK, etc\n \nAfter setting each buff, I would scroll to the bottom of the normal gems window to verify that haste had not gone negative.  Once I reached BoK, I had gems with negative values, but they wer the MP5 gems.  \n \nI then attempted to find a minimum set of buffs that would make the gems go negative and that is what is attached in the xml file.  The minimum set of buffs I found was Improved BoW, Divine Spirit, Improved MOTW and BoK.  With those selected, the MP5 gems give a negative value.  If you unclick any of the buffs, the gems are no longer negative.",
    "LastUpdatedDate": "2017-11-27T11:00:43.22-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2009-10-29T09:06:46.96-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Warlock] MP5 Giving Negative Scores",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 2,
    "Id": 14578
  },
  "FileAttachments": [
    {
      "FileId": 2424,
      "FileName": "iso-new.xml",
      "DownloadUrl": ".\\2424"
    }
  ],
  "Comments": []
}