{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Moonkin",
      "DisplayName": "Rawr.Moonkin"
    },
    "ClosedComment": "Not an issue",
    "ClosedDate": "2010-12-22T04:21:32.003-08:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "http://elitistjerks.com/f47/t66856-druid_balance_pve_updated_cataclysm_release/#Stats :\nCritical strike rating:\n179.28 crit rating gives 1% to crit. With Moonfury and a Chaotic Skyflare Diamond, crits with most of our our main spells do 2.09 times the damage of non crits. Because crit gives a lower rating conversion than haste, and we no longer have a meaningful haste cap, crit is substantially weaker than haste.\n \nI have Cluster of Stars not reforged with Gem [Chaotic Shadowspirit Diamond] in meta socket and [Reckless Ember Topaz] in yellow socket (bonus is better than 20 Int)\nBest upgrade it says reforge 64 Haste into Hit and have [Potent Ember Topaz] in yellow socket. That Gem can't be right according to the Theorycrafting Think Tank thread above.",
    "LastUpdatedDate": "2017-11-27T11:00:19.5-08:00",
    "PlannedForRelease": "Rawr 4.0.12 Beta",
    "ReleaseVisibleToPublic": true,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2010-12-21T07:45:48.79-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Moonkin] Crit Stat Weight Wrong",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 19388
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Attach a character file.  Also, you should be aware that Crit vs. Haste is close enough that it does depend on the amount of each that you have.  Since Rawr doesn't use static stat weights, it's possible that you over-stacked haste and it would be more beneficial for you to pick up some extra crit.",
      "PostedDate": "2010-12-21T09:27:01.537-08:00",
      "Id": -2147483648
    },
    {
      "Message": "You have given nowhere near enough info to work out what you are seeing as a problem. Rawr DOES NOT USE rating one stat above another. Rawr calculates the damage done by each ability and adds up the damage. To see how something changes it swaps out one thing for another and does ALL the calculations again, if its more dps its rated higher if its less its rated lower. No relative stats values in sight.\r\n\r\nSo in order to assist with your issue rather than explaining theorycrafting to some of the people who wrote the articles you are quoting, instead please attach your character file and explain what it is you are seeing and what you expect to see instead. For instance are you trying to work out best stats for raiding or for heroics since its recommending you get hit capped it suggests you haven't got the options setup for what you are trying to do. In that case because you aren't capped then all the other stats become somewhat fluid.\r\n\r\nRemember that the EJ theorycrafting articles assume you know what you are doing and have reached the hit caps already since you say that is not the case then its likely you will get results that differ from the EJ theory. Until you are in raiding ready quality gear with hit cap met it is not wise ignore the theorycrafting basics in that article.\r\n\r\nIt might be of course that there is an issue with the moonkin model however without providing your character.xml file we cannot tell.",
      "PostedDate": "2010-12-21T09:33:27.45-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Ah, I finally found the \"issue\".  Rawr is suggesting Potent gems because Haste has a negative effect on your mana usage.  Crit, while a weaker stat, does not make you burn your mana faster.  If you are sorting/optimizing based on Overall rating (and particularly if you have your fight length turned way up, as I do), it will suggest Crit as a way to increase your DPS while not impacting your longevity.  This is by design; if you really want to burn through your mana pool in 2 minutes flat, by all means, sort by Burst Damage and rock out in straight Haste.",
      "PostedDate": "2010-12-21T11:10:35.04-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-12-21T16:25:00.74-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Dopefish, is there an actual issue here or just a serious misconception on the user's part about how Rawr works? ie- Was there something you actually needed to fix here?",
      "PostedDate": "2010-12-21T16:26:03.573-08:00",
      "Id": -2147483648
    },
    {
      "Message": "This is a user issue.  Rawr.Moonkin is working as intended.  I left it open for a while so the person who reported it could see the responses; now I'm closing.",
      "PostedDate": "2010-12-22T04:21:17.423-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-12-22T04:21:32.003-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-05-20T23:03:27.03-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:26:58.583-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:19:29.01-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2017-11-27T11:00:19.5-08:00",
      "Id": -2147483648
    }
  ]
}