{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "The issue with ranged items and enchants has been resolved for next release. For any other remaining problems please open a new issue.",
    "ClosedDate": "2012-10-20T19:05:44.167-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "Hello and good morning from Denmark!\n\nFirst I want to thank you guys for this great program and the 5,0,1 update.\n\nI do have a slight problem thought - when I load my mage it wont let me use my mainhand (Torch of the Celestial Spark 10 man normal). I got it marked with the green markers like normal, but somehow it doesn't work. It wont let me assign any enchant to it either, which is probably just because rawr doesn't think I have a mainhand equipped. \n\nMaybe its just me who missed something, and if I did I hope you can enlighten me :)",
    "LastUpdatedDate": "2013-05-16T05:16:58.033-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2012-10-19T02:30:29.92-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "Mainhand missing",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 23520
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Something seems to be off, yes. I'll have to investigate a bit more what is the root cause.",
      "PostedDate": "2012-10-19T04:48:31.47-07:00",
      "Id": -2147483648
    },
    {
      "Message": "As a workaround try changing weapon type to a two-hand by editing the item.",
      "PostedDate": "2012-10-19T04:49:12.097-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Editing the wand to staff or dagger didn't work, still got the message: \"the following currently equipped items are not available - Torch of the Celestial Spark is not available - would you like to make them available and continue with the optimization?\" Pressing \"yes\" doesn't do anything, and the window keeps popping up.",
      "PostedDate": "2012-10-19T05:40:56.703-07:00",
      "Id": -2147483648
    },
    {
      "Message": "You'll need to change both item type and item slot to get it to work.",
      "PostedDate": "2012-10-19T12:23:14.41-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Ye changing the wand to a mainhand and 1 hand sword did the trick and it now loads without problems. I ran the optimizer tool and found that some of the items got wrong stats - the crafted JC offhand had to low hit, and to low mastery and the caster ring from Galleon Ring of the Wretched Flame was not made unique. I thought RAWR loaded the items from armory and wowhead ,and therefor would have the right stats. Am i supposed to go over all my items and check the stats? ",
      "PostedDate": "2012-10-20T05:51:02.617-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Just a fast note: the ring from Galleon is not unique, but rawr wants me to equip two of it, so I had to change it to unique. Maybe that's something you could look into. And i also want to say thanks for being so helpful with my problems :)",
      "PostedDate": "2012-10-20T06:37:18.243-07:00",
      "Id": -2147483648
    },
    {
      "Message": "It is the same issue with Hunters. Since we don't have a ranged slot anymore, we use our bows, guns and xbows in the mainhand slot. I've made the changes you suggested and it has worked, but I would imagine you will need to come up with a more permanent solution for hunters and casters. There is one issue with editing these weapons as main hands rather than ranged, in that we can't use ranged enchants on them, i.e. scopes.",
      "PostedDate": "2012-10-20T15:36:58.36-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Yes, this is just a workaround, we're working on a permanent fix.",
      "PostedDate": "2012-10-20T16:49:10.21-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2012-10-20T19:05:44.167-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:23:34.94-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:16:58.033-07:00",
      "Id": -2147483648
    }
  ]
}