{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Base.ItemFilters",
      "DisplayName": "Rawr.Base.ItemFilters"
    },
    "ClosedComment": "This issue has been open for 60&#43; days without response. If this is still an issue, please resubmit with current files and references to the versions affected.",
    "ClosedDate": "2009-09-16T17:07:32.213-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "I'm having periodic problems with filtering where quest items aren't showing up as expected.  For example, Metallic Headband of Simm'onz imports from Wowhead (http://www.wowhead.com/?item=25820) with the following source data: \"Reward from [66g3] Forge Camp: Annihilated in Unknown - 3518\".  If I understand the Quests filter correctly, it should display any itme with \"Reward from\" in the source field.  I haven't edited the filters at all with this version.  I've experienced the issue with multiple versions of Rawr on multiple computers.  Any idea if this is a bug or something I'm doing wrong?\n \nThank you for putting so much effort into a highly useful tool.",
    "LastUpdatedDate": "2013-05-16T05:25:10.157-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2009-06-30T16:42:22.517-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[ItemFilters] Trouble with Filters",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 13575
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Is it perhaps being filtered out by another filter that you have turned off? ie, Burning Crusade, for example?",
      "PostedDate": "2009-06-30T17:45:02.69-07:00",
      "Id": -2147483648
    },
    {
      "Message": "I considered that, but there's nothing in the source text that matches anything in the Burning Crusade filter.  I even enabled all filters and I still don't see this item.\r\n\r\nI forgot to mention originally that I am working in the Retribution Paladin module, and I do have Mail equipment selected.  I just noticed that this particular item's stats are Int, SP, and mp5.  Is there logic in the Ret module that is filtering out this item based on those stats?  That would explain this example, but I know I've run across this with other pieces of TBC gear as well.  If so, I'll have to go back and narrow my search parameters to see if I can find a more appropriate example.",
      "PostedDate": "2009-07-01T08:16:56.43-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-09-16T17:07:32.213-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-03-17T19:05:05.29-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:34:02.51-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:25:10.157-07:00",
      "Id": -2147483648
    }
  ]
}