{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "",
    "ClosedDate": "2009-09-16T17:00:19.94-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "I'll be just talking about issues that I've noticed while working with RAWR 3.0. I will not get into subjects such as \"Filters are not showing,\" \"I cannot edit item gemming,\" or \"Loading from Armory is not working.\" These are things I understand need work on and you guys have already plans for. I will describe a few issues I've noticed, mostly cosmetic.\n \n1) This is something that is not directly under your control but could be an issue when you guys implement RAWR3. Currently, Silverlight 3 Developer does not support IE8. I installed IE8 a week or so ago, and earlier installed today Silverlight 3. However, Silverlight 3 could not be registered with IE8. It worked fine with Firefox and Crome though. Silverlight 2 works fine with IE8 but not 3 (since I had 2 installed already).\n \n2) Scrolling not implemented - If I hover over say the listing of the items, I cannot use my mouse scroll button to scroll threw the listing\n \n3) Unable to view the results at the bottom. I know in the stand-alone, you have say the DPS, TPS, Mitigation, Survivability, HPS, etc at the bottom. So far it doesn't look like there is a way to do that unless you add a Javascript function to post in the window info bar (the section that say if you hover over a link, it says what the address of the bar is at the bottom).",
    "LastUpdatedDate": "2013-05-16T05:25:12.72-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2009-06-21T16:22:07.097-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "Current Rawr3 Alpha Issues",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 13519
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "1) Make sure you're installing the Silverlight 3 itself, not the Silverlight 3 Toolkit; it does fully support IE8.\r\n2) Good point, will try to get that done.\r\n3) Aye, thinking about the best way to do that; perhaps javascript, perhaps an extra bar in the bottom, or perhaps in the menu bar.",
      "PostedDate": "2009-06-21T16:27:17.007-07:00",
      "Id": -2147483648
    },
    {
      "Message": "As for filters not showing. There is no default ItemFilter.xml placed on the server at the moment. So filters are working, they just start empty.",
      "PostedDate": "2009-06-21T19:13:34.993-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-09-16T17:00:19.94-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-09-09T15:53:05.327-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:34:05.347-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:25:12.72-07:00",
      "Id": -2147483648
    }
  ]
}