{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Base",
      "DisplayName": "Rawr.Base"
    },
    "ClosedComment": "Declined Feature Request. This would be telling players to play suboptimally",
    "ClosedDate": "2010-09-08T13:26:37.237-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "I've got a Runed Ring of the Kirin Tor, the highest tier Kirin ring for Str-Melee DPS.  If you've seen or have one of these rings, you know it's quite a financial investment to some people.  Playing around with the DPSDK module today, the Optimizer is recommending to replace the ring with something else...in my case, I have a Purloined Wedding Ring that it would like to see me use instead.  Because I value my Kirin Tor ring for the money invested + the free hearth to Dala, I'd rather just config Rawr to play around with my other ring slot instead, if there's a viable upgrade to it.  Because the ring slot is unique in that both slots share the same pool of available items, is there a way to say 'lock-in' wrong of the ring slots so that the Optimizer will ignore it and just tweak around with the other?",
    "LastUpdatedDate": "2013-05-16T05:19:58.44-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2010-08-30T06:28:56.91-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Base] A way to 'lock-in' rings",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 18623
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Uh... No. You realize that you can still carry the Kirin'tor ring with you, and use it to hearth, but use another ring for combat, right?\r\n\r\nBasically you're asking if Rawr can help you suboptimally optimize yourself, which is definitely no.",
      "PostedDate": "2010-08-30T09:57:27.093-07:00",
      "Id": -2147483648
    },
    {
      "Message": "or to put it another way, just do not mark as avaialbe any ring that is better than the Kirin tor ring. - and use Rawr as normal other than that.",
      "PostedDate": "2010-08-30T14:05:28.543-07:00",
      "Id": -2147483648
    },
    {
      "Message": "No, don't do that. Just play optimally. Don't choose to play suboptimally for no reason.",
      "PostedDate": "2010-08-30T14:38:50.157-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-08-30T14:46:50.523-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-09-08T13:26:37.237-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:27:34.2-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:19:58.44-07:00",
      "Id": -2147483648
    }
  ]
}