{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Base.ItemFilters",
      "DisplayName": "Rawr.Base.ItemFilters"
    },
    "ClosedComment": "While technically relevant, the proposed Request is invalid. Model devs need to put in better bad item filtering. An option where users could select individual stats and remove them would be cause for a pattern of bad choices by users, aka things we wouldn&#39;t want them to be doing.",
    "ClosedDate": "2010-11-20T20:47:46.16-08:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "I would like you to include filters for physical type and caster type items.\nI have not tried all modules but I do use the moonkin, bear, dpsdk, and tankdk models.\nIncluding these filters, or an internal \"type of items listed\" category would make the item comparison list much shorter, and I believe would speed up optimizations a little.\n \nFor example: in the moonkin model, weapons and items that are obviously meant for physical dps (agility, strength and attack power;  no spell power, intellect or spirit) are included.  The reverse is true for the bear model and similarly for both dk models.\n \nI think an option in the \"types of items listed\" menu would be best, but item filters in the list would work too.",
    "LastUpdatedDate": "2013-05-16T05:21:53.613-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2010-02-13T11:38:33.087-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Feature Request.ItemFilters] New item filters for caster vs physical",
    "Type": {
      "Name": "Feature",
      "Id": 1
    },
    "VoteCount": 1,
    "Id": 16337
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "I read the posting guidelines.  While this thread there was no options box to the right.  After creating it, the work item details box is there but I've been unable to change the type, component, or release information.",
      "PostedDate": "2010-02-13T11:43:02.797-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Root Problem: Some models aren't adding in better 'bad item' filtering",
      "PostedDate": "2010-02-13T14:45:48.453-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Just a note:  If those filters get too smart, I'd like a way to turn them off.  The way I commonly use Rawr:\r\n\r\n1) I have a \"Gear\" model where I maintain my available gear.  Often, but not always, I update this from Character Profiler.\r\n2) I use that as the basis for Batch Optimize or Batch Progressive Optimize, that updates my Bear, Cat, Moonkin, and Tree optimal sets.\r\n\r\nFor this to work, the \"Gear\" model needs to be able to see both Caster equipment and Feral equipment.   An alternative would be the ability to update only available gear from the character profiler.  I don't want it to mess with my equipped gear, glyphs, or talents.",
      "PostedDate": "2010-02-18T05:52:07.833-08:00",
      "Id": -2147483648
    },
    {
      "Message": "For me, since I have no plans on making a Paladin, I delete out the caster plate stuff manually.  Only have to do it once, and it makes optimizing/upgrading lists generate a lot faster.",
      "PostedDate": "2010-02-18T08:18:32.353-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-03-03T14:17:02.46-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Would it be possible to improve the \"types of items listed box\" to also have a section for excluding certain stats.   This then would not need to be done on a per-model basis - although each model would have defaults set like they do now for only showing cloth items or not showing weapons that class can't use.\r\n\r\n",
      "PostedDate": "2010-03-03T14:28:54.06-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-07-02T13:56:54.617-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-07-02T14:49:46.53-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-07-02T15:27:08.427-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-11-20T20:47:46.16-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-11-22T19:56:47.293-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-03-17T18:49:40.763-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-03-17T19:05:05.29-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:29:58.127-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:21:53.613-07:00",
      "Id": -2147483648
    }
  ]
}