{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "",
    "ClosedDate": "2011-06-05T17:17:36.74-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "In the attached file, you can see recommendations on the rings to reforge from Dodge to Parry on one ring, and from Parry to Dodge in the other ring. It is totally understandable that one needs to balance Dodge & Parry slightly, while following any slight scaling for Parry's importance, for example, but in this specific case, the reforges recommended give [almost] equal results (44 and 45), so it does look almost funny to many people. Not that I care about opinion when numbers are giving answers, but the issue here twofold: 1. I want to make sure that this is normal behavior even if the difference in the clashing reforges is just one point, and 2. I want to be able to give reasonable justifications to anyone who asks me and then gets to know that I'm using Rawr for optimizing my gear; in other words, I want to contribute to a better reputation for Rawr rather than justify these 2 reforges on the rings by vague answers or beating around the bush.\n \nMany thanks for anyone taking the time to explain.",
    "LastUpdatedDate": "2013-05-16T05:17:52.85-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2011-05-27T03:25:22.76-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[ProtPaladin] Almost equal dodge to parry and vice versa reforging",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 20860
  },
  "FileAttachments": [
    {
      "FileId": 4985,
      "FileName": "Rings_dodge_to_parry_vice_versa.xml",
      "DownloadUrl": ".\\4985"
    }
  ],
  "Comments": [
    {
      "Message": "Situations like these are just a matter of numbers, the optimizer was looking for a higher number and found it that way. If you don't want to waste gold on doing that reforge, undo those two reforges in Rawr and just leave it alone.",
      "PostedDate": "2011-05-27T09:02:38.133-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Thank you for explaining, Jothay. If they were weapon reforges, I might've been interested in saving the cost, but as far as I remember, ring reforges aren't that costly, so it was purely a matter of confirming that it's correct optimization and understanding how to explain it to people. Looking for a higher number & finding it that way sounds simple and straightforward enough to me. Thank you again.",
      "PostedDate": "2011-05-28T01:27:36.82-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-06-05T17:17:36.74-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:24:56.463-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:17:52.85-07:00",
      "Id": -2147483648
    }
  ]
}