{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Rogue",
      "DisplayName": "Rawr.Rogue"
    },
    "ClosedComment": "I hadn&#39;t updated the avoided attacks display yet, fixed in the next release.The DPS calculations are correct in the current version though.",
    "ClosedDate": "2010-02-17T02:31:01.863-08:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "I loaded up a friend's Rogue to take a look at some things.  He is using the Mark of Supremacy and has a 700 hit rating (under white cap by 22) and 199 expertise rating resulting in a Avoided Attacks of 0.431% (0.431% dodge, 0% miss).  We were discussing trading out his trinket and I picked Herkuml's War Token, which dropped his hit rating to 572 (now below white hit cap by 150), but the calculated Avoided Attacks did not update and remained at 0.431%.  So first question is whether the Avoided Attacks was correct in the first place with 22 under white cap equating to 0% misses, and the second question is why didn't the Avoided Attacks increase as we dropped well below white cap?  I assume that with this calculation not working correctly that it is somewhat over-valuing the potential DPS increase of the trinket swap.  Any ideas?\n \nHinalover said: This does sound like a bug. If you can post your friend's character file in the Issue Tracker tab, please create a new issue and upload your friends' character file so that we can see what is going on. It does sound like the program is not taking into effect White crit cap, and only working with Yellow crit cap.",
    "LastUpdatedDate": "2013-05-16T05:21:52.52-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2010-02-14T08:30:26.703-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Rogue] Hit and Expertise Caps need checked",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 16350
  },
  "FileAttachments": [
    {
      "FileId": 2949,
      "FileName": "Deadstimpy.xml",
      "DownloadUrl": ".\\2949"
    }
  ],
  "Comments": []
}