{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Cat",
      "DisplayName": "Rawr.Cat"
    },
    "ClosedComment": "",
    "ClosedDate": "2009-10-19T16:53:36.327-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "Ok this is confusing the hell out of me. I was getting some over-inflated numbers on my previous version saved file so I decided to use the Character Profiler mod to create a profile on my druid. I create it and import it just fine. Says that my dps should be about 6.6k dps before any buffs were aplied. I go to the optimizer and tell it to run (added in some armor pen gems into the mix to evaluate just in case but that is not needed for this). Once it's done it tells me to get rid of my T8 Helm and legs and replace them with the T7.25 Helm and Legs I still have for prosterity in my bank. I know the 2 piece on both the T8 and the T9 are real good but I was under the impression that the T8 2-piece (chance to proc more clearcasting) was better than the T7 2-piece (4 more seconds on rip). It also told me to switch out my Grim Toll for the Greatness card which I was thinking about doing in the first place but I really liked the ArP proc on it so I was hesitant on doing so.\n \nJust to be sure, I imported my character from the Armory and it told me with buffs (Fort, Mark, Kings, and Endless Rage I added the second check box [my druid is an alchemist and the Ast has yet to apply the Alchemy distiction yet]) I should be 7.6k dps. I added in the Greatness card, and the T7.25 helm and chest into the optimizer and it told me to only upgrade my Greatness card, not my Helm and Chest.\n \nI went back into my Character Profiler file and checked the EXACT same buffs that the Armory Import file has and it was giving me the same results and that my top-end dps should be 7k even dps.\n \nSo something is giving screwbally numbers. I am not sure if it's the added number of items it's evaluating is messing up the DPS points or what but Armory Import is not showing the same info that the Character Profiler is showing.\n \nCharacter: Deldruid\nServer: Crushridge",
    "LastUpdatedDate": "2017-11-27T10:59:31.57-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2009-10-17T23:41:09.38-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Cat] Armory Import calculations is not lining up with what the Character import Calculations",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 14469
  },
  "FileAttachments": [
    {
      "FileId": 2374,
      "FileName": "Armory import.xml",
      "DownloadUrl": ".\\2374"
    },
    {
      "FileId": 2375,
      "FileName": "Character Profiler.xml",
      "DownloadUrl": ".\\2375"
    },
    {
      "FileId": 2376,
      "FileName": "CharacterProfiler.lua",
      "DownloadUrl": ".\\2376"
    },
    {
      "FileId": 2377,
      "FileName": "Character Profiler Pre-Optimization.xml",
      "DownloadUrl": ".\\2377"
    },
    {
      "FileId": 2378,
      "FileName": "Armory import Pre-Optimization.xml",
      "DownloadUrl": ".\\2378"
    }
  ],
  "Comments": [
    {
      "Message": "Adding Character Profile XML.",
      "PostedDate": "2009-10-17T23:41:45.46-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-10-17T23:41:46.827-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Adding CharacterProfiler mod saved file",
      "PostedDate": "2009-10-17T23:42:42.853-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-10-17T23:42:53.21-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Err... I'm sorry, I don't understand your issue. The who character files you attached have different DPS because they have different gear. They're not going to line up, if you're wearing different gear in them. And I don't understand what [Ast has yet to apply the Alchemy distiction yet] means. There's Mixology buffs available as improvements to the flasks.",
      "PostedDate": "2009-10-18T00:38:26.617-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Four things\r\n\r\n1) If you use the import characterprofiler.lua file that I attached and then imported my character then you will see the difference in DPS from the get go.\r\n2) The Character Profiler when optimized wants me downgrade my T8 to my T7 gear for the rip instead of the free procs for Clearcasting while the Armory import does not want me to downgrade (when given the same two items to look at).\r\n3) I listed the XML files to show the difference after optimization. I listed the Character Profiler and my Character info to show what they would come up with BEFORE Optimization. I will manually upload a \"pre-optimized\" file for you if you so wish.\r\n4) What I meant with mixology was that I BELIEVE Jothy implemented in the Armory import the ability recognize Alchemy as a profession. I'm just saying you have yet to have the kitty module to take advantage of armory import ability (this is a lesser problem than the different dps but I did want to point that out).",
      "PostedDate": "2009-10-18T09:38:57.63-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-10-18T09:38:59.28-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Uploading a Pre-optimized armory file",
      "PostedDate": "2009-10-18T09:39:21.297-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-10-18T09:39:22.433-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Forgot to do this with the Armory import Pre-Optimization. If you turn off all buffs you can see that the Armory import will give you 5k DPS, while the Character Profiler, which has it's debuffs automatically turned off will give a 4.5k dps",
      "PostedDate": "2009-10-18T10:58:27.463-07:00",
      "Id": -2147483648
    },
    {
      "Message": "1) The character loaded from characterprofiler.lua is yet *another* set of gear. Of course the DPS is going to be different.\r\n2) Then something else is different. Just because you have the same tier pieces marked available in both files, doesn't mean that some other items aren't different, and affect the value of the set bonuses. Also, remember that items are marked available only with their specific gemming/enchanting in Character Profiler imports, while equipped items are fully available in Armory imports.\r\n3) Yeah, we need to see the character files that appear identical, yet yield different DPS, in order to identify where they're actually different.\r\n4) Ah, automatically setting Mixology on Armory import, gotcha... Fixed for next version.",
      "PostedDate": "2009-10-18T11:58:18.12-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Looking at the two 'Pre-Optimization' files you posted (and removing all the buffs from the Armory one), they provide different DPS (and of course different optimization results), because the Armory one is glyphed, and the CharacterProfiler one is not. So fix the glyphs. After applying the same glyphs to the CP file, both give identical DPS results.",
      "PostedDate": "2009-10-18T12:13:25.62-07:00",
      "Id": -2147483648
    },
    {
      "Message": "/facepalm\r\n\r\nDidn't think to check the check glyphs. I saw that my talents transfered over just didn't think to look at the glyphs. Thanks Ast.",
      "PostedDate": "2009-10-18T14:11:37.103-07:00",
      "Id": -2147483648
    },
    {
      "Message": "I think the Character Profiler not importing Glyphs correctly is already listed in another issues",
      "PostedDate": "2009-10-18T15:57:45.177-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-10-19T14:13:19.18-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-10-19T16:53:36.327-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-03-17T20:33:04.973-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-05-20T22:45:40.733-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:32:20.87-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:23:47.947-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2017-11-27T10:59:31.57-08:00",
      "Id": -2147483648
    }
  ]
}