{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "Closed as I've now done the work needed WITHIN Rawr. The Rawr.Enhance module has been overhauled to make it more accurate as well so win/win.",
    "ClosedDate": "2009-02-25T09:41:13.877-08:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "I would like to request that the data that is available in the cut & paste options ie: str, agi, int, crit, ap, spellpower etc etc be added as a section to the save file in XML format. This would allow DPS simulators such as EnhSim http://enhsim.wikidot.com/ to import the stats and do accurate dps analysis for the Enhancement Shaman.\n \nThis would allow use of Rawr to import Armory data and checking item upgrades - exporting to test on simulator - swapping items and re-exporting and testing again.",
    "LastUpdatedDate": "2013-05-16T05:26:35.04-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2008-12-24T05:44:55.297-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "XML Save file additional data requested",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 5,
    "Id": 12206
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Rawr is not intended to work with other tools such as EnhSim; it's intended to be a replacement for them for most users. Rawr.EnhSham just isn't up to the same quality as EnhSim yet.",
      "PostedDate": "2008-12-24T16:44:58.943-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2008-12-24T18:14:02.287-08:00",
      "Id": -2147483648
    },
    {
      "Message": "I KNOW its not intended to work with them. However if the save file included the same data as the cut n' paste then we would be able to import the Rawr data into EnhSim.\r\n\r\nThe idea is simple. Rawr is fantastic for being able to swap out kit and see what changes that makes to your stats. EnhSim is fantastic at simulating what dps those stats should produce. EnhSim is a pain to configure if you change a single item as you have to change all the stats eg: trying out different OH weapons you need to adust all the knock on effects. Rawr ALREADY does this calculation. \r\n\r\nSo if we could export the data Rawr produces (which is in the cut n paste block) to the XML then a trivial conversion app which I have already written would be able to take the data and make an EnhSim config file. So users could use Rawr to select gear and EnhSim to get a detailed dps breakdown. At present its very messy to do as the data is not present in the saved character file.\r\n\r\nThis would also help other classes with data for their spreadsheets.",
      "PostedDate": "2009-01-08T03:02:37.72-08:00",
      "Id": -2147483648
    },
    {
      "Message": "While Rawr is intended to replace it, I don't see why it couldn't play nice with other tools. Having summary data in the XML would make it easier for many tools to import and compare against the Rawr results. Working well with others is important even if you're the best... true in kindergarten, true in programming.",
      "PostedDate": "2009-01-08T10:59:45.847-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-01-08T11:06:21.423-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-01-19T11:57:33.487-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-02-07T04:03:16.33-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-02-25T09:41:13.877-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:35:57.7-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:26:35.04-07:00",
      "Id": -2147483648
    }
  ]
}