{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "Closing this as a rejected request, too generic and improperly worded. Please resubmit for the specific model and change you are requesting. If multiple models, please make the same request per model &#40;meaning create multiple tickets&#41;.",
    "ClosedDate": "2010-08-18T13:59:31.33-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "I was wondering if there could be a standard time before out of mana for all the applicaple mana users out there, and i know there are ones for some of them, but like enhance shammies it'd be good to know for example the effect getting improved stormstrike would be, or maybe for a ret pally how much getting their replenishment talent is worth, and obviously having it be affected by whatever buffs you have on and stuff.",
    "LastUpdatedDate": "2013-05-16T05:20:06.05-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2010-08-16T18:17:45.34-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "OOM option",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 18496
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "uhhh, the oom time in each model should be set up against how much mana you are using in your rotation vs how much you have.... why would we make it a set time?",
      "PostedDate": "2010-08-16T19:04:14.057-07:00",
      "Id": -2147483648
    },
    {
      "Message": "That is, depending on the variables, one set of gear could last 5 minutes or 15 minutes.  It depends on the fight, the ability usage, the target(s), etc.  Saying \"you will last for 5 minutes irregardless of variables\" is naive.  I mean, even in your request, you say A) that you'd like OOM to be a standard, flat number across the board, and then go on to say B) that you'd like to have it affected by variables.  You can't have both - it's dependent on the variable output, plain and simple.\r\n\r\nNow, what WOULD be good is an output of how long a given model is lasting, instead of having to guess based on the model's recommendations.",
      "PostedDate": "2010-08-16T20:49:03.633-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Hunter does that, tells you seconds to OOM",
      "PostedDate": "2010-08-16T21:53:07.1-07:00",
      "Id": -2147483648
    },
    {
      "Message": "For enhance shaman, Levva has specifically hard coded out the mana modelling.  This was because it wasn't playing nice with something (been a while so can't quite remember).  Here is an issue item that has it mentioned (http://rawr.codeplex.com/workitem/15905).",
      "PostedDate": "2010-08-17T00:31:55.56-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Retribution doesn't model mana.  The reasoning/motivation is explained in the Retribution FAQ.\r\nShort version: Ret doesn't OOM when played right.",
      "PostedDate": "2010-08-17T05:13:31.653-07:00",
      "Id": -2147483648
    },
    {
      "Message": "i like BR's solution, anyway it could happen?",
      "PostedDate": "2010-08-17T20:16:25.873-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Like Jothay alluded to, it's model-specific.  Each model that uses mana and can potentially run out of it would need to implement an output of the 'Time to OOM', as it's not something that can happen from and/or is appropriate for the base, program-wide level of code.",
      "PostedDate": "2010-08-17T23:59:46.557-07:00",
      "Id": -2147483648
    },
    {
      "Message": "In other words, if you see a model that does not output the Time to OOM, and you believe it would be useful, please open a feature request ticket for that particular model.",
      "PostedDate": "2010-08-18T00:00:59.57-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-08-18T13:59:31.33-07:00",
      "Id": -2147483648
    },
    {
      "Message": "jesus christ you people piss me off, \"too generic, improperly worded\", you go to all the fucking trouble to create an awesome program such as Rawr, and you don't even standardize a basic function Such as \"Time to OOM\" I mean, how many collective brains does it take to figure out that there are people out there that are curious about how much time they have doing continuous rotations before they are OOM FOR EVERY MANA USER, taking into account all the applicable variables (talents, buffs, etc...) take your \"specific model\" request and shove it!\r\nI didn't respond to any of these comments because they had jackshit for relevance to my original posts, and I wasn't going to deign to answering to the rabble of stupid mouth breathers that answered this! godamn you fucktards!!!",
      "PostedDate": "2010-08-18T21:08:39.11-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Have a nice day",
      "PostedDate": "2010-08-18T23:34:13.503-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Hahaha",
      "PostedDate": "2010-08-20T10:02:44.963-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-09-05T19:56:42.27-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:27:42.743-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:20:06.05-07:00",
      "Id": -2147483648
    }
  ]
}