{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Elemental",
      "DisplayName": "Rawr.Elemental"
    },
    "ClosedComment": "Old issue.",
    "ClosedDate": "2009-08-09T17:30:41.81-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "THANK YOU for creating an elemental shaman build!!  Now then... I'm horribly inadequate when it comes to the technical stuff but let me see if I can make enough sense to describe the problem I'm having.  \n \nI've seen my shaman's number's on recount and I know my Lava Burst Crits top out at about 9,000 dmg. When I load my character from armory, without even placing a single raid buff on her, it seems to think they do 12k-14k damage. (Mistariah Earthen Ring US if you want to try loading her up). It also seems to think my chain lightning crits for 10k (its more like 6.3k). Oddly enough, it reports lightning bolt at 5k when it does closer to 7k max. Something seems really wrong with the formula.\n \nOn a really weird note. When I ran an optimization to include tier 7 bonus from (4) set (+10% dmg for lava burst crits) it says my lava burst will now do 48,000 dmg from crits. WOAH. Now I know something is seriously wrong! =P hahaha.\n \nThere might be other things that are off but those are the ones I noticed right off the bat. Thanks for all you do!",
    "LastUpdatedDate": "2013-05-16T05:26:06.533-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2009-03-05T23:17:38.873-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Elemental] Crit Damage Incorrect",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 12761
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Please verify if you still get this problem with the 2.2.0b3 release or any later version.",
      "PostedDate": "2009-03-06T05:59:32.917-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Awesome! I checked out the 2.2.0b3 build and it looks like the numbers are a *lot* more in line. I don't expect anything to be perfect but the numbers are at least realistic now =)  (lightning bolt and chain lightning are still reporting about 500-1000 too low on the high crit end compared to what my actual numbers are...)\r\n\r\nI'm curious about how the build weighs \"stuff\" too. I was hoping to use rawr to figure out the best hit gear to use versus the best damage gear but it seems to want hit rating at 100% (even if the other gear may end up bringing me more dmg). It's the classic does \"missing\" x% of the time end up being less damage than critting y% more of the time? I was hoping it might simulate those numbers. Plus it seems to pick gems at random rather than remotely matching them up to their socket color or considering the bonus attached to that socket :-/ So I'm still doing a lot by hand.\r\n\r\nAll-in-all a very useful tool. The best program I've found thus far for my simulation checks.",
      "PostedDate": "2009-03-06T19:31:49.12-08:00",
      "Id": -2147483648
    },
    {
      "Message": "I also forgot to question if it weighs +crit as +mp5 or not. Clearcasting is *huge* for elemental shaman and mana regen.",
      "PostedDate": "2009-03-06T19:33:10.04-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Rawr is designed to do everything you describe. Yes, hitting more really is worth that much.",
      "PostedDate": "2009-03-06T23:16:31.793-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Rawr doesn't pick gems at random, but applies predefined gemming templates. Often it is better just to use for example a spell power or a +hit gem, especially if we're talking about a blue socket.\r\nIt works like this. It calculates how much damage you would do in a fight, including talents, glyphs, trinkets and the resulting value is used to compare gear. Of course, if you don't go out of mana, crit may increase mp5 but this won't show up. If you do go out of mana, you'll see that clearcasting is much more important.",
      "PostedDate": "2009-03-07T01:56:51.437-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-08-09T17:30:41.81-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-09-08T14:10:40.29-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-09-08T14:15:57.597-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:35:18.317-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:26:06.533-07:00",
      "Id": -2147483648
    }
  ]
}