{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Hunter",
      "DisplayName": "Rawr.Hunter"
    },
    "ClosedComment": "",
    "ClosedDate": "2010-01-19T08:18:20.383-08:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "When I run optimizer for my BM hunter it recommends replacing a 10agi/10crit gem with a 10agi/10hit gem yet I am well over the hit cap (96 points over to be exact).  Is this a bug or am I missing something?",
    "LastUpdatedDate": "2013-05-16T05:22:17.7-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2010-01-19T06:23:42.52-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Hunter] Hit Cap",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 15981
  },
  "FileAttachments": [
    {
      "FileId": 2813,
      "FileName": "Brorantum.xml",
      "DownloadUrl": ".\\2813"
    }
  ],
  "Comments": [
    {
      "Message": "Notes from your Char File:\r\n* You have no Hunter Buffs, these will drastically affect your file.\r\n* You have no Pet Buffs, these will drastically affect your file.\r\n\r\nWhen I ran the optimize, it replaced your Trinket which has 128 hit on it with corren's chromium blasted which has no hit. It's trying to make up the difference. Operating as designed.",
      "PostedDate": "2010-01-19T08:17:58.933-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-01-19T08:18:20.383-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Ok...now I see, I missed the loss of hit from the trinket swap, thanks.  I know very little about buffs, can you direct me to a good site where I can learn?  Mostly I just passively receive them as part of a raiding party without giving special thought as to which I get.  I also left them off because my experience has been that most of the time I get a different set of buffs depending on who is in the party and which raid we are running.  I do routinely give my pet a food buff, Spiced Mammoth Treats.",
      "PostedDate": "2010-01-19T09:40:54.847-08:00",
      "Id": -2147483648
    },
    {
      "Message": "1) Go into Options > General Settings and check Display Buff Sources\r\n2) Make a list of what classes are in your normal raiding party (and what specs too, MM Hunter and BM Hunter are going to give diff raid buffs)\r\n3) Walk thru the Buffs Pane top to bottom, and check buffs provided by players in your list\r\n4) Pick the Food, Potions and Flasks you normally use as well. There are comparisons charts that can show you which are the best for you.",
      "PostedDate": "2010-01-19T12:49:42.293-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:30:25.107-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:22:17.7-07:00",
      "Id": -2147483648
    }
  ]
}