{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.TankDK",
      "DisplayName": "Rawr.TankDK"
    },
    "ClosedComment": "",
    "ClosedDate": "2009-08-30T03:40:58.43-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "Another note to self.\nThe talents are only partially integrated into the 3 Subpoint values.  Not all of the talents show any effect when looking at the value.  So I need to write code for all those that matter, and more matter than are currently implemented.  \n \nAlready Started on this.",
    "LastUpdatedDate": "2013-05-16T05:25:23.467-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2009-05-28T19:38:25.633-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[TankDK] Refactor/Reevalutate the Talent integration",
    "Type": {
      "Name": "Task",
      "Id": 2
    },
    "VoteCount": 1,
    "Id": 13366
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Noticed that the expertise from Veteran of the Third War is not registered in the stats tab (works like it should with Tundra Stalker and Rage of Rivendare).",
      "PostedDate": "2009-05-29T03:09:42.187-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Lot of talents not factored in: Imp Frost Presence for mitigation, Vampiric Blood for Survivability, Will of the Necropolis, Scent of Blood and Two Handed Weapon Spec for threat.\r\n\r\nJust a few examples.",
      "PostedDate": "2009-05-29T06:54:39.65-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Yup... in my checked out files, I have V3W, and ImpFrost, and 2hSpec.  I'll be working on the others here over the weekend when I take breaks from work-work.  ",
      "PostedDate": "2009-05-29T12:33:05.023-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Looking at TankDK in 2.2.6, it seems as if the value of mitigation has dropped drastically. The module is suggesting threat upgrades over mitigation upgrades at a much higher level than it has in the past. This does seem partially attributed to the haste change, as the relative values table shows it as the second best stat after stamina. The value of dodge and parry seem to have plummeted. I know some changes were being made to the module for mitigation/survival, but was this the intended result?\r\n\r\nAnother thing noticed is that Armor Pen seems to now be taken into account for threat purposes, although maybe not totaled on the character sheet.",
      "PostedDate": "2009-06-05T06:58:53.72-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Yes, the mitigation values and such have changed, and at this point I can't say that it was an intended consequence.  Working on Talent integration and such, I'm also working on both expanding functionality and cleaning up at the same time, and it's entirely possible that I'm introducing issues in each of these releases.  I just got the Armor mitigation to what matches more what I expect.  Dodge is a bit better, parry is way off.  So that would cut into mitigation quite a bit.  So it's a slow and steady process that may just require me breaking down and cutting through the whole calculation area with a torch.  \r\n\r\nI did get some support in a patch that I need to evaluate, and it may help balance some of these numbers.  ",
      "PostedDate": "2009-06-05T10:44:05.563-07:00",
      "Id": -2147483648
    },
    {
      "Message": "It appears as if the bonus from frost presence is being applied to Bonus Armor as well as normal Armor, which is heavily skewing the results of Survival value.",
      "PostedDate": "2009-06-07T13:41:31.413-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Update: Right now the talent suggested in the Optimizer is totally F'd up.  \r\nThis needs to be finished in order to make that part work.\r\nThe shot rotation needs to be finished in order to finish much of this work.",
      "PostedDate": "2009-06-15T17:05:12.623-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Checked in a base set of changes for Shot Rotation and MANY of the talents.  However, some of them are still broken.  Leaving this open to finish Talent work.",
      "PostedDate": "2009-06-19T21:14:08.097-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-08-26T09:36:31.84-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Completed: At revision: 36326  \r\n",
      "PostedDate": "2009-08-27T11:41:25.413-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-08-30T03:40:58.43-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:34:17.733-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:25:23.467-07:00",
      "Id": -2147483648
    }
  ]
}