{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.TankDK",
      "DisplayName": "Rawr.TankDK"
    },
    "ClosedComment": "The feature has been implemented for the base product. ",
    "ClosedDate": "2010-11-19T19:16:15.76-08:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "Originally Posted by txice1971  View Post\nFirst, thanks Shazear for the work on the TankDK model. Noticing something under the buffs section that stood out to me regarding both Ebon Plaguebringer and Crypt Fever. The first thing I noticed I already read you had addressed. Checking/unchecking Crypt Fever in the buffs tab didn't change any values for me, but noticed in a different post that you indicated if you are spec'd into Crypt Fever it's already included. Something I didn't see addressed yet, however, is that both Ebon Plaguebringer and Crypt Fever in the buffs tab only seem to be able to reflect max value for both. In my current build I only have 2/3 Ebon Plaguebringer but if I check the box for this in the buff tab, the tooltip is seems to assume the talent is maxed and is indicating I'm getting a 13% bonus when I am really only going to get a 9% bonus (assuming of course I'm trying to model a scenario where I'm the only DK with this talent and only one in the group providing the buff). Same for Crypt Fever assuming that the talent is maxed and providing the full 30% buff. Is there any way to somehow compensate for the possibility of the different levels of these buffs assuming the talents may not be maxed out?\n \nYes, it's true that when the buff is checked, it's assuming a full stack. Also the buffs pane comes from the base model, so I'll see what I can do about reading in the buffs, and then checking with what you currently have. I can do a check to see if the buff is checked, and you're speced into it at all, then assume only the levels that you provide to the group.",
    "LastUpdatedDate": "2013-05-16T05:22:30.817-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2010-01-08T10:42:04.79-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[TankDK] Crypt Fever on Buff pane vs. Talents.",
    "Type": {
      "Name": "Task",
      "Id": 2
    },
    "VoteCount": 1,
    "Id": 15794
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "We already have an open feature request for Rawr3 that will allow for Variable talent levels, which will fulfill this request.",
      "PostedDate": "2010-01-08T10:59:42.283-08:00",
      "Id": -2147483648
    },
    {
      "Message": "*Variable talent levels that affect Buffs",
      "PostedDate": "2010-01-08T11:00:05.67-08:00",
      "Id": -2147483648
    },
    {
      "Message": "ok... then postponing for Rawr3, but not closing to ensure that I test this case.",
      "PostedDate": "2010-01-08T13:12:53.327-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-01-14T16:14:59.27-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-11-19T19:16:15.76-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-03-17T19:56:52.25-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:30:42.797-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:22:30.817-07:00",
      "Id": -2147483648
    }
  ]
}