{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Warlock",
      "DisplayName": "Rawr.Warlock"
    },
    "ClosedComment": "User misconception",
    "ClosedDate": "2009-09-17T12:11:26.797-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "I'm a warlock and after upgrading to 2.2.16 from 2.2.13 I ran the optimizer multiple times. I use maximum thoroughness, and usually run it more than once just to make sure it doesnt come up with something it hadn't considered before (short of a gem swap between two items with an equal socket layout).  Everything looked fine...no alterations recommended.\n \nOnce I get a few new pieces of gear I will run the optimizer option that creates an upgrade list.  I did this and noticed something odd. At the bottom of my upgrade list I noticed items that I already had. They even had the green diamond checked next to them.  And they were old items too, things like heroic emblem items (Ward of the Violet Citadel).\n \nFirstly, these items wouldn't be an upgrade over what I currently had on and secondly, I had just run the optimizer more than once to verify that I had everything laid out well.\nThe only consistent thing I did notice was that the items that it listed in the upgrade list that I already possessed all didnt give an overall dps value that was more than 1 dps greater than what I was currently wearing.  \n \nFor example,  lets say my dps rating was 4510. In the upgrade list there were about 10 items where the dps rating was like 4510.34, 4510.78, 4510.87,etc...  within this list of 10 items were 3 items that it said that I had.\n \nIm at work now, but I will run everything again tonight and upload files if necessary.  Has anyone else noticed a similar issue?",
    "LastUpdatedDate": "2013-05-16T05:24:22.29-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2009-09-14T12:31:34.937-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Warlock] Haste Issues",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 14152
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "The optimizer tells you the following:\r\nBy equipping this item, along with the optimal set of gear to go along with it from what you have available, you can increase your DPS by X.\r\n\r\nPay very close attention to what that says. It's very possible for an item you already have available to produce a result where X>0, when your current gear is not optimal. Typically, if you see items in an upgrade list which you already have, that means you don't have the current optimal gear on. ie, Optimize first.",
      "PostedDate": "2009-09-14T22:18:32.043-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-09-17T12:11:26.797-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-09-05T15:33:48.927-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:33:03.16-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:24:22.29-07:00",
      "Id": -2147483648
    }
  ]
}