{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Cat",
      "DisplayName": "Rawr.Cat"
    },
    "ClosedComment": "",
    "ClosedDate": "2010-07-02T11:37:01.827-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "Today I finally got the Stormchops recipy, I created one for the Outland Gourmet achievement and went to a mob to see what it does. Without using any attack and just standing in front of the mob I noticed Black Magic going up. I waited a bit and I can confirm that Stormchops procs Black Magic. Thing is, you can't have your buff food up and have Stormchops up :( So this extra chance to proc Black Magic + a tiny bit of damage(buffed by raid buffs?) has to be more valuable than 40arp.\n \nStormchops procs are pretty random so I have no idea how you can check the value of increased Black Magic uptime via Stormchops but I thought I should let you know.",
    "LastUpdatedDate": "2017-11-27T10:59:36.67-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2010-06-25T06:12:46.787-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Cat] Stormchops proc'g Black Magic",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 18078
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Neat. I'll look into that. Additionally, Feral Charge can proc BM too, though I doubt I'd try to model that.",
      "PostedDate": "2010-06-25T10:10:40.713-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Some additional info on using Stormchops:\r\n\r\nNormal damage: 15 - 35\r\nCrit damage: 25 - 50\r\n\r\nIt can hit a maximum of 2 targets.\r\nIt can proc Black Magic twice within a minute. I know the data is extremely limited but in 2 periods of 3min I had 4 and 6 procs of Black Magic by doing nothing but standing in front of 2 Winterfall mobs and letting the Stormchops zap them.\r\nSofar I haven't seen it cause even a single Omen clearcast proc. I'll keep testing for this because I read on wowhead that it did proc Clearcast for a shaman.",
      "PostedDate": "2010-06-25T11:31:46.73-07:00",
      "Id": -2147483648
    },
    {
      "Message": "2 more times 3 min 2 targets, 5x BM\r\nSeems to proc BM with a very high chance. Everytime the internal cooldown was over the first zap would get BM back up around 90% of the time, the other times the second zap would do it and I had 1 unlucky miss streak where it took 5 zaps to get BM back up after internal cd was over.",
      "PostedDate": "2010-06-25T12:39:50.927-07:00",
      "Id": -2147483648
    },
    {
      "Message": "It seems to proc BM less often on just 1 target which was to be expected.\r\n3 times 3 min only 1 target, 4x 3x 4x BM\r\n\r\nStill not a single Omen clearcast proc.",
      "PostedDate": "2010-06-25T13:13:15.043-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Black Magic also procs from the caster form Faerie Fire, not the feral versions.",
      "PostedDate": "2010-06-25T14:22:18.283-07:00",
      "Id": -2147483648
    },
    {
      "Message": "I tried a few combat logs, and I'm not sure if there is a delay  in the proc, or what\r\n\r\nhttp://www.megaupload.com/?d=CEMUE95J",
      "PostedDate": "2010-06-25T16:49:04.173-07:00",
      "Id": -2147483648
    },
    {
      "Message": "With all the stuff you alread do, the main limiting factor of BM is the ICD.  As soon as the ICD is over it'll proc within seconds.\r\nStormchops might add a few more triggerable events.  But eating a Haste food would do the same.\r\nOverall, the DPS lost by not having a proper food buff will be a bigger DPS loss than the few milliseconds sooner on average the BM proc would go off.\r\n\r\nIf you stand there, on your own, doing nothing at all, then yes, it'll proc BM.  Go actually DPS a few mobs and count how many procs actually happen off the stormchops and not off your other abilities.  You could be doing a lot of time on the mob/dummy before you see that happening.",
      "PostedDate": "2010-06-28T08:50:15.157-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Yeah, napkin math easily says it's not worth using Stormchops. But it is interesting to know at least. (I won't be bothering to model it)",
      "PostedDate": "2010-06-28T09:47:18.35-07:00",
      "Id": -2147483648
    },
    {
      "Message": "it's a gimmick food, mainly used for funzies. It has some use for the turkey achievement in Howling Fjords.  If it was even close to being best food for any class, I'm sure blizzard would nerf it next patch. :-D",
      "PostedDate": "2010-06-29T01:00:55.737-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Ye I figured as well, losing proper food buff is too big a loss which Stormchops can't make up for. I can see some use out of it for aoe situations where you just use Swipe and still get BM procced but than again, you will have to re-eat food buff after every aoe trash pack and who cares about thrash anyways. Still is was fun for me to see Stormchops for the first time :P",
      "PostedDate": "2010-06-29T09:35:40.3-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-06-29T17:20:34.89-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-07-02T11:37:01.827-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-05-20T22:45:40.733-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:28:06.28-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:20:24.243-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2017-11-27T10:59:36.67-08:00",
      "Id": -2147483648
    }
  ]
}