{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "Working as intended",
    "ClosedDate": "2009-12-27T18:44:48.277-08:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "I am noticing that gems do not appear in the correct \"grants the most DPS\" order. With the file that I am uploading change the gem in the cloak. The highest suggestion is Quick Kings Amber. However with that example I start out with, a Stark Ametrine (the second gem to be suggested), I have 8202.56 DPS points. When I change it to the Quick king's Amber that score drops to 8197.22. Meta gem still active, socket bonus is not however (socket bonus is active with the stark ametrine). I also made sure that DPS was the sorting method.",
    "LastUpdatedDate": "2013-05-16T05:22:52.523-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2009-12-19T08:24:29.33-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "Gems not appearing in correct DPS order.",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 15533
  },
  "FileAttachments": [
    {
      "FileId": 2660,
      "FileName": "Current Target.xml",
      "DownloadUrl": ".\\2660"
    }
  ],
  "Comments": [
    {
      "Message": "I can confirm that socket bonuses are not being taken into account for the \"Equip Custom Gemming\" interface.",
      "PostedDate": "2009-12-19T09:04:52.487-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Well, right, the little dialog to equip a custom gemming isn't intended to take socket bonuses or even metagem bonuses into account.",
      "PostedDate": "2009-12-19T11:22:57.57-08:00",
      "Id": -2147483648
    },
    {
      "Message": "It is confusing to users though Astrylian. My fix to at least discount the equipped gem has helped a lot and wasn't difficult to implement, so it might not be that difficult to fix this. However I'd suggest we see how Rawr3 handles this rather than trying to fix it for Rawr2.",
      "PostedDate": "2009-12-19T13:04:02.94-08:00",
      "Id": -2147483648
    },
    {
      "Message": "So we have to just pick all the gems down the list to see which is actually the best for the slot?",
      "PostedDate": "2009-12-19T13:07:39.737-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Sorry last comment was a) started forever ago b) unfinished and accidentally clicked to add it. But I was saying. So we have to just pick all the gems down the list to see which is actually the best for the slot? If that is the case, then it makes it really difficult to trust that I've gotten the correct gem because there could be a better one down the list (in theory). Say a nightmare tear. Would it be a possible thing to add or too redundant? I know you can select all the gems from the template and it will show in the gear list the best choice.",
      "PostedDate": "2009-12-19T13:11:40.83-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Err, no, you shouldn't even be using that dialog Astryx, in all but the rarest circumstances. Use the dropdowns and the charts. Those use the Gemming Templates feature to display all the top gemmings. If there's a gem that you typically use that isn't part of the default gemming templates, add it, and let us know what it is. (See the help docs on gemming templates).",
      "PostedDate": "2009-12-19T13:48:25.927-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Okay so from your last statement I may have just been misunderstanding the proper usage of RAWR with the fairly new ability to shift right click and change gems. What I believe, based on your last post, you are trying to say is left click the slot, and find the item that I want to be using. the proper gemming SHOULD be the top one in that list. And the gem select menu is suppose to be used to quickly test other gems, not necessarily find the best gem to use for the slot? ",
      "PostedDate": "2009-12-19T15:36:49.7-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Correct, the custom gemming dialog is for specific scenerios when you want to override what is shown as the top DPS gemmings that are generated by the gemming templates. An example of this would be where the templates don't include a partial hit gem (like an Etched, 10 STR/10 Hit) and you want to put that in a particular slot to get your last 10 points of hit, instead of using a 20 Hit gem or a 20 STR gem, like the templates might be telling you.",
      "PostedDate": "2009-12-19T17:28:19.55-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-12-27T18:44:48.277-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:31:11.967-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:22:52.523-07:00",
      "Id": -2147483648
    }
  ]
}