{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Base.Optimizer",
      "DisplayName": "Rawr.Base.Optimizer"
    },
    "ClosedComment": "Not an actual issue, the Operating system just isn&#39;t assigning a taskbar button until it gets focused, Alt-Tab until you select the result window and the issue resolves itself.",
    "ClosedDate": "2009-12-27T18:55:16.867-08:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "Can someone explain why 75% of the time that I run the \"Build Upgrade List\" feature that it goes and builds the list (takes around 10min), gets to 100% and disappears without showing the results? Only maybe 1 time out of 4 does the list actually open when the computations have completed. I've tried it with a list already open and no list open and it doesn't seem to make a difference.",
    "LastUpdatedDate": "2013-05-16T05:23:39.147-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2009-10-27T12:54:49.813-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Optimizer.UL] Build Upgrade List disappears after finished",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 14551
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "I've never seen anything like that. Can you provide any more details? Exact repro steps would be helpful, including character file if it's character-specific.",
      "PostedDate": "2009-10-27T13:00:36.03-07:00",
      "Id": -2147483648
    },
    {
      "Message": "I only have 1 character I use but the steps are usually 1) Start with just the character window open (no lists, only the main Rawr window open with my character loaded), 2) Select Build Upgrade List (it's starts building, 1 percentage at a time) 3) walk away for about 10 min and come back to see that the building has completed but it's back to only the main Rawr window (no list results), 4) repeat until there's actually a list window open when the building is done.",
      "PostedDate": "2009-10-27T13:35:53.203-07:00",
      "Id": -2147483648
    },
    {
      "Message": "...character file?",
      "PostedDate": "2009-10-27T13:36:56.527-07:00",
      "Id": -2147483648
    },
    {
      "Message": "I apologize if I'm being completely unhelpful... I've had this sometimes happen using the Evaluate Upgrade feature, but haven't been able to reliably reproduce it. Alcapwnd, my only clue has been that mine seems to happen when the results window is not the Windows focus when it completes (ie, I've gone back to WoW while it evaluates, flip back and it's gone); does that have any similarity with your problem? Also, would you happen to be using Vista? Kinda grabbing at straws here.",
      "PostedDate": "2009-11-04T21:44:01.417-08:00",
      "Id": -2147483648
    },
    {
      "Message": "I've seen this happen on Windows 7, sorta.  It's not that the window disappears and you don't see the results, it's that the window is created but not given focus, and it doesn't appear in the taskbar at all until it's given focus.\r\n\r\nSo what I do to fix the problem is minimize/move all my windows until I can see the upgrade list, click on it, and then it appears in my taskbar.\r\n\r\nTry that as a workaround until we figure out what's going on.",
      "PostedDate": "2009-11-05T09:31:43.363-08:00",
      "Id": -2147483648
    },
    {
      "Message": "I've seen something like this also occasionally when running WoW at the same time. The window exists, but doesn't appear in taskbar until you focus on it. The way I get to it is by using Alt-Tab, it always seems to appear in that list even when it's not in taskbar. I don't think it's anything specific to upgrade list window. I've seen it with batch tools also. Even when it was on taskbar already and then for some reason it disappears, usually in presence of heavy processor load.",
      "PostedDate": "2009-11-05T12:56:08.547-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-12-27T18:54:37.07-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-12-27T18:55:16.867-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-09-08T16:06:26.327-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:32:09.673-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:23:39.147-07:00",
      "Id": -2147483648
    }
  ]
}