{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Base",
      "DisplayName": "Rawr.Base"
    },
    "ClosedComment": "",
    "ClosedDate": null,
    "CommentCount": 0,
    "Custom": null,
    "Description": "Could you please make new gemming system with adaptive gemmings. You have a nice place to look for every color best gems there, make some use of it.\n \n(For example, if I open in Comparison -> Gems -> Red (as a cat with my current gear), I get 1. Fractured Cardinal Ruby, 2. Delicate Cardinal Ruby.\nYet there are no default gemming templates with Fractured Cardinal Rubies. Bear gemmings lack expertise entirely... yet in relative stat values I get expertise 129.96, agility 109.27, def 77.54, stam 73.94, which makes it like the best stat possible...)\n \nSo instead of using some statis gemming templates I would like a system, where it uses best gems for every color and best gems overall for all slots.\nSince the \"best stat\" can nowadays change with almost any item swap (due to very many stats being close to caps etc.) such adaptive system would be the best possible solution imho.\n \nOr just make a gemming template category there, where you put all possible (epic) gems in all possible combinations. (which i have done myself atm. ... well not ALL obviously, but gems that made most sense ... and it works actually)",
    "LastUpdatedDate": "2013-02-21T18:29:10.373-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2010-03-24T01:25:59.04-07:00",
    "Status": {
      "Name": "Proposed",
      "Id": 1
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Feature Request.GemTemplates] New Adaptive Gemming System",
    "Type": {
      "Name": "Feature",
      "Id": 1
    },
    "VoteCount": 1,
    "Id": 16945
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "The thing is that the gemming templates are there so what you're asking wouldn't be needed. Having all gems be part of individual choices for gemming, means the optimizer would need to deal with a lot more choices, and thus be considerably slower.\r\n\r\nIt's generally assumed that cappable stats like hit, expertise are capped through gear and enchants without gemming for it.\r\n\r\nI find your remark strange, considering there's definately ArP gems in the default templates.  Did you disable them ?",
      "PostedDate": "2010-03-24T02:27:11.617-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Ahh - now there is the thing - in the last few versions, the ArPen gemmings were there.  In the latest version, we are back to the old days of only Agi gemmings.\r\n\r\nIt would appear that this last version has seen a release with an old version of the gemming templates and and old version of the filters (VoA back in the T7 category).  Not sure what has happened but it is causing a few issues.\r\n\r\n",
      "PostedDate": "2010-03-24T15:02:33.597-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-04-18T10:26:44.37-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-07-02T13:56:53.533-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-07-02T14:50:14.82-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-07-02T15:30:13.337-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Relevant for Rawr4",
      "PostedDate": "2010-11-20T20:14:33.157-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-11-22T18:46:47.923-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-11-22T20:00:47.683-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:29:10.373-08:00",
      "Id": -2147483648
    }
  ]
}