{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Base",
      "DisplayName": "Rawr.Base"
    },
    "ClosedComment": "Not actually an issue worth worrying about.",
    "ClosedDate": "2009-11-17T16:07:35.283-08:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "It was noted on the EJ forums...\n \n\"The hyperaccelerators and pyro-rocket glove enchants put a 10 second cooldown on activated trinkets. This decreases those types of trinkets uptimes slightly and normally ends up making them a bit worse then expected. Looking at the list of recommended upgrades it doesn't seem like Rawr is taking that into account.\"\n \nDo we have a means of modifying trinket uptimes if these enchants are used?",
    "LastUpdatedDate": "2013-05-16T05:23:23.87-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Medium",
      "Severity": 100,
      "Id": 2
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2009-11-16T08:45:08.11-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "Engineering Enchants and Trinket Uptimes - as noted on EJ forum",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 14844
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "umm, no? That would have to be confirmed and specially handled in every model",
      "PostedDate": "2009-11-16T14:33:26.92-08:00",
      "Id": -2147483648
    },
    {
      "Message": "I don't see how it decreases those uptimes slightly.  Use them after you use your activated trinkets.\r\nOr does it add 10secs to the time left on the cooldown?  Because that would be bizarre, I've never seen that before.",
      "PostedDate": "2009-11-16T19:19:05.513-08:00",
      "Id": -2147483648
    },
    {
      "Message": "According to Rouncer the maintainer of the Theorycrafting Think Tank article on EJ Forums for Enhancement Shaman, activating the engineering enchant puts both trinkets on cooldown for 10 seconds, which sounds similar to the effect you see on trinkets when you equip one. Apparently the reverse is true also using a trinket puts the engineering enchant on CD for 10 seconds. \r\n\r\nI've asked for further clarification of the issue. http://elitistjerks.com/f79/t45421-enhancement_rawr_enhance_thread/p13/#post1462495",
      "PostedDate": "2009-11-17T01:49:43.11-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Even if that's the case, it's not really an issue unless you're trying to stack both effects together.  You're still able to use them every 120secs, so long as they're staggered out.",
      "PostedDate": "2009-11-17T07:29:53.19-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-11-17T16:07:35.283-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:31:48.097-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:23:23.87-07:00",
      "Id": -2147483648
    }
  ]
}