{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Base",
      "DisplayName": "Rawr.Base"
    },
    "ClosedComment": "doable with what&#39;s already available",
    "ClosedDate": "2009-11-03T21:01:09.263-08:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "(Copied from incorrect area.)\n \nDescription: The ability to print out gear lists would be very useful for those of us whose setups aren't conducive to alt-tabbing in and out of WoW.\n \nSuggestion: A simple text listing would be sufficient.  Fields should include slot name, item name, gems, and enchants.\n \nHead: Stormrage Coverlet   Relentless Earthsiege Diamond, Delicate Cardinal Ruby  Arcanum of Torment\n \nNeck: Collar of Unending Torment   Delicate Cardinal Ruby\n \nand so on.\n \nAdditionally, a more visual version could literally be a listing of the icons and tooltips for all the slots.\n \nI'm not looking for a list of upgrade items; I simply want a text listing of the current gear setup.\n \nEdit:  Sorry, but I don't seem to be able to change the Type to Feature.",
    "LastUpdatedDate": "2013-05-16T05:23:34.08-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2009-10-31T17:04:28.763-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Feature Request] Print Out of Currently Equipped Gear",
    "Type": {
      "Name": "Feature",
      "Id": 1
    },
    "VoteCount": 1,
    "Id": 14590
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "What are you looking for beyond what's already provided by the exports (such as to CSV)?",
      "PostedDate": "2009-10-31T17:20:13.56-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-10-31T17:35:00.043-07:00",
      "Id": -2147483648
    },
    {
      "Message": "The exports, at least the ones I've found, are all upgrade lists.  I simply want a list of the gear that's listed as equipped; the items that surround the Stats/Talents/Buffs/Options page.  \r\n\r\nThe left side of the screen, not the right side of the screen.\r\n",
      "PostedDate": "2009-11-02T09:16:32.71-08:00",
      "Id": -2147483648
    },
    {
      "Message": "So you want to be able to print out what you currently have on, NOT anything uprade related?",
      "PostedDate": "2009-11-02T09:50:03.573-08:00",
      "Id": -2147483648
    },
    {
      "Message": "What would printing out what you're currently wearing help at all?  You presumably have that gear equipped already, and can see that info in-game.\r\n\r\nRegardless, what you're asking can be achieved through the \"Comparisons > Current Gear / Enchants / Buffs\" list, then selecting the \"Export\" menu (top right - if your window is small, it's a small arrow on the right side, next to \"Filters\").  You can then do a workflow similar to what's explained here: http://www.youtube.com/watch?v=54v0Sq-D1Q0 .  Make sure to clear out the lines that are just buffs, and you're set.",
      "PostedDate": "2009-11-02T13:21:51.317-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Thanks; I hadn't seen the \"Current Gear\" option.  While a bit convoluted, it does give me what I want.\r\n\r\nThe reason for wanting to do this is this:\r\n\r\nMy system frequently crashes when I tab out of WoW.  When I get new gear, I run it through the optimizer, then Load Optimized Gear Setup.  It's this setup that I want to print out and have handy while in game.",
      "PostedDate": "2009-11-03T16:09:57.253-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-11-03T21:01:09.263-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-03-17T19:34:03.147-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:32:04.157-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:23:34.08-07:00",
      "Id": -2147483648
    }
  ]
}