{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "This functionality has been added",
    "ClosedDate": "2010-01-18T20:47:10.133-08:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "It would be great to be able to update item information from the armory and wowhead for only those items that show up in the Comparisons frame.  Right now I have to go through by hand and manually update each one or do the entire 5000+ item update (which takes hours to complete and often bombs out corrupting my item cache).\n \nI'd like to be able to update only those items that my character is interested in.",
    "LastUpdatedDate": "2013-05-16T05:22:34.873-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2010-01-05T10:38:42.953-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "Feature Request: Ability to update item information for character related items only",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 2,
    "Id": 15736
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "You're going to have to be more specific as to how you'd like to determine what 'relevant' means to your character.\r\n\r\nThis is mostly possible by using an \"Import from Wowhead filter\".  Go to Wowhead, select \"Plate\", item level 264, purchased through Emblem of Frost, whatever, and then copy the filter as shown on the dialogue box within Rawr.\r\n\r\nI would appreciate an \"update all items marked as available to the Optimizer\" (undecided on it), or an \"update all items that meet current filters\" (would be VERY nice).",
      "PostedDate": "2010-01-05T17:42:33.167-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Variant: Update all items with no/bad source data",
      "PostedDate": "2010-01-05T19:02:12.287-08:00",
      "Id": -2147483648
    },
    {
      "Message": "The root problem here that I'm trying to resolve is that updating item source data takes a LONG time.  If I try to run a full item update for all ~6,000 items in the database then it runs for hours on my machine and frequently bombs out.  I can see in the Comparisons screen that there is only a small subset of items that are being displayed as appropriate to my character.  \r\n\r\nWhen I'm working on a character what I really want is to update just the items I'm working with in the Comparisons frame ... for each of my equipment slots.  That way I could quickly fix any problems with the item cache being out of date.\r\n\r\nThe \"Import from Wowhead filter\" option is kinda, sorta what I want but still has problems:\r\n\r\n1. It takes multiple steps to update all of my item information.\r\n2. It is not a comprehensive update of all items in my Comparisons frame and inevitably I have to go through the item list for each equipment slot and locate and manually update the items.\r\n3. All of the steps must be repeated EVERY TIME A NEW VERSION OF RAWR IS RELEASED.  I cannot stress how frustrating this is.  It needs to be steamlined as much as possible.\r\n",
      "PostedDate": "2010-01-07T06:43:06.723-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Astrylian gets a new item cache directly from Wowhead for each new release version of Rawr, if I'm not mistaken.  What you're seeing there is directly from Wowhead's data, nothing more, nothing less.  I know for a fact that there are currently a host of issues with different items, both from Wowhead and the Armory.",
      "PostedDate": "2010-01-07T10:37:39.523-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-01-07T16:25:47.12-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-01-18T20:47:10.133-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:30:48.207-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:22:34.873-07:00",
      "Id": -2147483648
    }
  ]
}