{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.TankDK",
      "DisplayName": "Rawr.TankDK"
    },
    "ClosedComment": "Completed&#58; At revision&#58; 37874  Any new issues around these points should be written up as new issues each one individually. But I think I got them all.  Though I&#39;m looking at the whole calculations as there may be some funny business going on.",
    "ClosedDate": "2009-10-28T11:25:57.19-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "The issues i brought up in a previous post remain in V.2.2.23\n \nNamely, the issue with overvaluing STR, possibly overvaluing AGI (unsure if this is incorrect), Hit rating making absolutly no difference in the dks hit % and it remains at 8% regardless of gear, a possible threat inflation (running at 47k tps in BIS), Overvaluing TPS over survivability, \n \nAlthough it should be said that the expertise glitch seems to have been fixed, and expertise is once again functioning as it should.\n \nI have also read somewhere that health is off by 1-3k? i cannot confirm this, but if so is it likely to do with the frost presence change?\n \n-Hoping to see these issues fixed soon, Piro. I have included my test dummy data.",
    "LastUpdatedDate": "2017-11-27T11:04:28.377-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2009-10-21T04:32:02.29-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[TankDK] Issues Remain in 2.2.23",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 14495
  },
  "FileAttachments": [
    {
      "FileId": 2385,
      "FileName": "Mizore - DK Agility Tank.xml",
      "DownloadUrl": ".\\2385"
    }
  ],
  "Comments": [
    {
      "Message": "Some of these should see fixes in 24.  \r\nI agree that Agi does seem over-valued, but I still haven't seen where the formulas are favoring agi in any noticeable way. \r\nI'll look into this to see in my current internal build.",
      "PostedDate": "2009-10-21T08:50:28.877-07:00",
      "Id": -2147483648
    },
    {
      "Message": "I beleive it has to do with the armor per agi. I am not currently on my system with rawr, so i cannot check this.. but 20 points of armor should not give .02% reduced melee damage, should it? I was sure that in previous versions it gave half, if not less than what it does currently.",
      "PostedDate": "2009-10-22T06:06:36.207-07:00",
      "Id": -2147483648
    },
    {
      "Message": "And there's the armor on enchants/trinkets/procs being overvalued issue, but I think Shazear is aware of it :)",
      "PostedDate": "2009-10-23T07:10:58.897-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Just playing with numbers, the over-valuation of agility seems to be related to threat weightings as well. The module seems to indicate that 1 point of agi > 1 point of str in regards to threat numbers. Relative numbers: agi food provides 1424.58 threat, whereas str food provides 1294.46 threat, in addition to the mitigation/survivability numbers from agility that, as far as I can tell, look correct. Any over-valuation of agility in regards to mitigation is not directly agility related, but more of the overall higher-valuation of mitigation stats when incoming damage numbers are increased.",
      "PostedDate": "2009-10-23T09:37:27.177-07:00",
      "Id": -2147483648
    },
    {
      "Message": "ok... the hit issues seems to be because I'm an idiot and some how pulled it out of the combat table while I was re-working things.  I'm going to put in a hack for 24 for now, and a real fix will come once the re-write of the abilities comes into play which I'm working on.",
      "PostedDate": "2009-10-23T12:41:42.267-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Completed: At revision: 37874  \r\n",
      "PostedDate": "2009-10-28T11:25:05.62-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-10-28T11:25:57.19-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-05-20T23:42:14.79-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:32:17.34-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:23:45.397-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2017-11-27T11:04:28.377-08:00",
      "Id": -2147483648
    }
  ]
}