{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Base.Items",
      "DisplayName": "Rawr.Base.Items"
    },
    "ClosedComment": "",
    "ClosedDate": "2011-01-01T02:38:12.477-08:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "After starting rawr (bear) this morning (presumably 4.0.13b was released late last night) two of my currently equipped trinkets ilvl346 are now rated lower than their ilvl316/333 counterparts. Looking at the ilvl346 versions the procs are now missing. \n \nTrinkets are :\n \nKey to the Endless Chamber (item id 56328)\nLeft Eye of Rajh (item id 56427)\n \nWhat I find rather odd is the two procs that are missing are coincidently the exact 2 procs I was looking at on wowhead last night to update classtimers with. Total coincidence I'm sure but still weird. Tried refreshing the items inside rawr from wowhead but no luck.\n \nCharacter export attached.",
    "LastUpdatedDate": "2017-11-27T11:01:16.617-08:00",
    "PlannedForRelease": "Rawr 4.0.13 Beta",
    "ReleaseVisibleToPublic": true,
    "Priority": {
      "Name": "Medium",
      "Severity": 100,
      "Id": 2
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2010-12-30T02:53:59.77-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Items] Some trinkets missing procs",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 19496
  },
  "FileAttachments": [
    {
      "FileId": 4314,
      "FileName": "Fuddy.xml",
      "DownloadUrl": ".\\4314"
    }
  ],
  "Comments": [
    {
      "Message": "I've seen the same thing with Anhuur's Hymnal http://www.wowhead.com/item=56407 (the iLvl 346 version was missing its proc and thus being undervalued) as well as Sorrowsong http://www.wowhead.com/item=56400. The problem with Sorrowsong is that I can't seem to figure out how to enter, \"Equip: Your spells that damage a target below 35% health grant 1710 spell power for 10 sec.  Cannot activate again for 10 sec after bonus expires.\" into the Rawr item editor. It may just be that it's not possible yet, as the 333 version of Sorrowsong has the same problem. ",
      "PostedDate": "2010-12-30T12:24:38.09-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Some of the new proc types don't have a way to be entered yet because we haven't figured out the best way to implement them. More Generic procs like chance on hit to proc strength for x seconds can be entered easily but complicated ones like below 35% health are something we have to discuss.",
      "PostedDate": "2010-12-30T12:45:27.117-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-12-30T12:45:55.197-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Well, I will say this. I currently about about 90 - 95% of all of the Cata trinkets modeled (even questing trinkets and trinkets that appear decent but are worth crap:\r\nhttp://www.wowhead.com/item=63839\r\n). There are some that are not to my liking in how they are modeled (particularly Jar of Ancient Remedies and Heart of Ignacious) that I will take some time to figure out the best course of action for. Others such as Sorrowsong, we just don't have the trigger to model that yet. Finally there are those that we just don't have enough data on to have an accurate model for, such as DMC: Hurricane (is it a percentage base proc with no internal cooldown or is it a Proc-per-minute deal).\r\n\r\nI am currently testing all of the imports to make sure they work correctly and I'll an update later tonight.",
      "PostedDate": "2010-12-30T13:09:42.987-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Thanks! I figured the 35% thing was weird. Could it be modeled similar to an execute, or something?",
      "PostedDate": "2010-12-31T16:01:32.997-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Resolved with changeset 56686.",
      "PostedDate": "2011-01-01T02:38:12.477-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:26:45.193-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:19:19.31-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2017-11-27T11:01:16.617-08:00",
      "Id": -2147483648
    }
  ]
}