{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.ShadowPriest",
      "DisplayName": "Rawr.ShadowPriest"
    },
    "ClosedComment": "By design.",
    "ClosedDate": "2009-05-29T19:03:31.9-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "The ring rankings for Finger 1 & Finger 2 are different.  As an example on Finger 1, Seized Beauty is ranked @ 206.07 (overall), and Band of Channeled Magic is @ 148.25 (overall).  However, on Finger 2, Seized Beauty has increased to 203.89 and Band of Channeled Magic has rocketed up to 256.74.  These are not the only 2 rings where this happens, these are the 2 I was focused on because these are the 2 equipped.  I am not able to look at upgrade options correctly.\n \n(XML file is attached)",
    "LastUpdatedDate": "2013-05-16T05:25:42.74-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2009-04-28T15:35:43.943-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[ShadowPriest] Ring rankings are different between Finger1/Finger2",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 13140
  },
  "FileAttachments": [
    {
      "FileId": 1845,
      "FileName": "Shadow.xml",
      "DownloadUrl": ".\\1845"
    }
  ],
  "Comments": [
    {
      "Message": "Looking into it. But first of all, make sure you apply all the correct raidbuffs you expect to get. It seems like you are getting items that give you extra mana prioritized since Rawr expects you to have problems with mana.",
      "PostedDate": "2009-04-28T16:17:19.503-07:00",
      "Id": -2147483648
    },
    {
      "Message": "I don't get what the issue is. \"The ring rankings for Finger 1 & Finger 2 are different.\" Yes, so? They should be, since they are different.",
      "PostedDate": "2009-04-28T20:17:39.1-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Why would the rank/score of the _same_ ring be different when you select Finger 1 than it is when you select Finger 2?  It shouldn't matter which finger it is, the scores should be the same, no?",
      "PostedDate": "2009-04-28T21:45:20.597-07:00",
      "Id": -2147483648
    },
    {
      "Message": "You're replacing a different ring.",
      "PostedDate": "2009-04-28T21:57:38.573-07:00",
      "Id": -2147483648
    },
    {
      "Message": "I can understand some change in the score because of this.  These slight changes happen in the other modules/toons.  But the massive swings, and the change in relative rankings don't make sense to me.  This only happens in the Shadow module.  I would have thought that whatever the best ring option was would be independant of the finger you put it on.\r\n\r\nI did one test by unequipping both rings.  The scores for Finger1 & Finger2 are identical - this supports your point.  It tells me the Top 5 rings in order would be \"Frozen Loop\", \"Signet of Manifested Pain\", \"Band of Channeled Magic\", \"Shimmering Seal\" and \"Wyrmrest Band\" for either Finger1 or Finger 2.  So I equip \"Band of Channeled Magic\" in finger1 cause thats what I have.  By doing that, this ring has now slid to rank 10 for finger 1, and to 29 for finger 2.  \"Frozen Loop\" is still #1 on finger1, but for finger 2 (which has no ring equipped) it is ranked as #18. \r\n\r\nContrast this to what happens when I change to the Holy Priest.  If I do the same test, no rings equipped, same rankings between finger 1 and 2 (albeit different rings of course).  Equip #2 ranked \"Band\" on finger 1, \"Band\" slides down the ranking for finger 1.  But it is still ranked in the same #2 position on finger 2 as it was when I had both finger1 and finger2 empty.  This makes sense to me.\r\n\r\nAnyway, I appreciate the feedback.  I would be happy to be educated if I am wrong and there is no bug, but I do think there's something to look at here.",
      "PostedDate": "2009-04-29T06:47:05.54-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Its slightly related to being on a haste plateu.  see: http://rawr.codeplex.com/Thread/View.aspx?ThreadId=42386 \r\n\r\nAlso, failing to put in proper expected buffs will give weird results (There is also a Mana (Sustainability) Plateu). Yes, changing gear does sometimes have big impact in your results. Imagine having 0 hit (17% miss) but 100% crit. You will never crit every cast, since 17% will never even hit. By adding 1% more hit, you just gained 1% more crit on each cast as well. Once you reach 17% hit, the next point in hit is useless. This is a hit plateu. For haste there may be several plateus, points where next point in haste isn't worth as much as previous. In reality these plateus are not as hard as Rawr might suggest (Due to you moving, having lag, messing up rotation, etc).",
      "PostedDate": "2009-04-29T07:33:08.823-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-05-29T19:03:31.9-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-09-05T14:19:26.18-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:34:40.523-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:25:42.74-07:00",
      "Id": -2147483648
    }
  ]
}