{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.TankDK",
      "DisplayName": "Rawr.TankDK"
    },
    "ClosedComment": "Closing as there have been no additional traffic on this defect.",
    "ClosedDate": "2010-06-24T10:31:33.43-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "For some reason rawr 2.3.18 seems to be rating the peacekeeper weapon unusually high for my dw dk tank.  Higher than say Bonebreaker Scepter from icc 10.\n \nIt also seems to be not rating any non tanking weapons very high (at least not above peacekeeper).",
    "LastUpdatedDate": "2017-11-27T11:04:40.043-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2010-06-02T21:33:09.583-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[TankDK] correct dw dk weapon rating?",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 17888
  },
  "FileAttachments": [
    {
      "FileId": 3648,
      "FileName": "almorte.xml",
      "DownloadUrl": ".\\3648"
    }
  ],
  "Comments": [
    {
      "Message": "I haven't looked at the character file or debugged it, but my first guess would be to look at the value of expertise to parry-haste. It's very significant, but even that seems extremely high.\r\n\r\nThat said, your comment about non-tanking weapons is a little odd to me. To my knowledge, the only benefits of DPS weapons to Frost Tank DKs are increased threat (which shouldn't matter one bit, since the IT threat buff; if you're losing single target aggro at all, you're really doing something wrong), and less parry haste against the few bosses that parry haste. So why would you expect to see DPS weapons higher than tanking weapons, for tanking?",
      "PostedDate": "2010-06-02T22:05:18.193-07:00",
      "Id": -2147483648
    },
    {
      "Message": "I also thought that maybe it was valuing expertise highly (especially since I was dual wielding).  However 2 things made me think this is not true:  First I changed my gear to pass the 26 expertise cap and didn't see the weapon priority change.  Second, the topmost weapon it lists (Ardent Guard from H toc) has no expertise at all.\r\n\r\nFrom the tankspot guide to dk tanking I also read that the main advantage of slower dps weapons is increased threat.  However, my warrior tank shows several icc dps weapons rated over peacekeeper (like Blood Fury and Hellscream Slicer to just name a few).  Since the dk can turn any weapon into a \"tank weapon\" by using runes (ignoring things like weapon speed), I would have thought there would be more dps weapon options listed.  If I went with the dps weapons on my warr tank I'd have to gem for Defense and lose avoidance which makes them much less appealing.\r\n\r\nI'm not saying that the best choice should be dps weapons, but I would still expect to see more listed above the peacekeeper blade than I do for my warr tank (instead of none).\r\n",
      "PostedDate": "2010-06-03T07:07:40.57-07:00",
      "Id": -2147483648
    },
    {
      "Message": "The 26 expertise cap is against dodges; the parry cap is much higher, which is where a lot of unexpected weight can come from (like I said though, perhaps too much, I haven't looked).\r\n\r\nSounds like that guide you're referencing is out of date. DPS weapons definitely do give DKs more single-target threat, however since the buff to IT threat, increased single-threat is entirely useless. If you have any aggro issues at all, you simply aren't ITing enough.",
      "PostedDate": "2010-06-03T09:13:52.9-07:00",
      "Id": -2147483648
    },
    {
      "Message": "I was agreeing with you on the threat/dps weapons comment.  And I don't have threat issues at all, so that's not a problem :-)",
      "PostedDate": "2010-06-03T09:29:24.173-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-06-03T09:51:25.003-07:00",
      "Id": -2147483648
    },
    {
      "Message": "I'll take a look.  ",
      "PostedDate": "2010-06-03T09:51:52.847-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Yeah, looking at the weapon, and your character, it does very well.  You don't need the def that comes on alot of other \"tanking\" 1-handers, so having dodge, parry, and expertise on the peacekeeper makes it a very nicely itemized weapon.  Additionally, when you have parry-haste enabled, the expertise does help with mitigation, not just threat.  It even shows up reasonably high when looking at my DK's gear (8/12 25-man and 11/12 10-man) if I was to go DW in your spec.  \r\n\r\nSo I don't see anything explicitly wrong w/ the evaluation.  If you have something specific that you believe is out-of-place, let me know.",
      "PostedDate": "2010-06-03T10:32:57.383-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-06-03T10:34:40.187-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-06-24T10:31:33.43-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-05-20T23:39:00.11-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:28:16.41-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:20:32.067-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2017-11-27T11:04:40.043-08:00",
      "Id": -2147483648
    }
  ]
}