{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Rogue",
      "DisplayName": "Rawr.Rogue"
    },
    "ClosedComment": "Should be fixed in the next release.",
    "ClosedDate": "2010-07-30T06:08:38.937-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "The following are my RSVs from Aldriana's Spreadsheet:\n \nStrength 1.1\nAgility 2.017014086\nCrit 1.793815266\nWhite Hit 2.020045913\nSpell Hit 2.737659612\nExpertise 2.352848861\nHaste 1.859625229\nArmor Penetration 2.479492122\n \nThese are the RSVs from iDPS:\n \nAGI     2.02\nHIT     2.05\nCRI     1.79\nHST    1.91\nEXP    2.21\nARP    2.52\n \nThese are the RSVs from RAWR:\n \nArmor Penetration Rating,False,,,,,,,,,2.572266\nHit Rating,False,,,,,,,,,2.068359\nAgility,False,,,,,,,,,2.048695\nHaste Rating,False,,,,,,,,,1.835938\nCrit Rating,False,,,,,,,,,1.787109\nExpertise Rating,False,,,,,,,,,1.154297\nAttack Power,False,,,,,,,,,1.057649\nStrength,False,,,,,,,,,1.057649\n \nThis data shows very similar data between the spreadsheet and rawr. The only difference is that expertise is 1/2 the value as the spreadsheet. As all the other values are the same I will assume they are correct, and assume the one of the expertise values is off. What I'm trying to figure out is which one is right. Can anyone help me out with this?\n \nThanks,\nReap\n \n::edit:: added idps RSVs",
    "LastUpdatedDate": "2013-05-16T05:20:20.44-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2010-07-07T11:01:39.08-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Rogue] Expertise Undervalued",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 18159
  },
  "FileAttachments": [
    {
      "FileId": 3753,
      "FileName": "reapzilla.xml",
      "DownloadUrl": ".\\3753"
    },
    {
      "FileId": 3768,
      "FileName": "REAPZILLA.xml",
      "DownloadUrl": ".\\3768"
    },
    {
      "FileId": 3769,
      "FileName": "REAPZILLA071210.xml",
      "DownloadUrl": ".\\3769"
    },
    {
      "FileId": 3770,
      "FileName": "REAPZILLA071210.xls",
      "DownloadUrl": ".\\3770"
    },
    {
      "FileId": 3773,
      "FileName": "REAPZILLA071310.xml",
      "DownloadUrl": ".\\3773"
    }
  ],
  "Comments": [
    {
      "Message": "I opened your character file to the Relative Stat Values screen, before touching anything, I can see the following:\r\nArP 2.42\r\nExp 2.02 \r\nAGI 2.00\r\n\r\nMeaning that it's not that Expertise is undervalued, it's that you have ArP high enough that it's overtaking everything else. This is a natural occurrence when you are up there in ArP rating and if Rogue had the Stat Graph implemented you could see the curve.\r\n\r\nUnfortunately, I don't know anything about your Tier Bonuses, but if you look at the chart Buffs > Set Bonuses:\r\nT10 4P 201.59\r\nT10 2P 189.29\r\nThe T9 sets are considerably less so I'm not sure how a T9 2P + T10 2P would be better than T10 4P.",
      "PostedDate": "2010-07-07T13:06:32.237-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-07-09T09:09:55.783-07:00",
      "Id": -2147483648
    },
    {
      "Message": "The following are my RSVs from Aldriana's Spreadsheet:\r\n\r\nStrength\t1.1\r\nAgility\t2.017014086\r\nCrit\t1.793815266\r\nWhite Hit\t2.020045913\r\nSpell Hit\t2.737659612\r\nExpertise\t2.352848861\r\nHaste\t1.859625229\r\nArmor Penetration\t2.479492122\r\n\r\nThese are the RSVs from RAWR:\r\n\r\n Armor Penetration Rating,False,,,,,,,,,2.572266\r\n Hit Rating,False,,,,,,,,,2.068359\r\n Agility,False,,,,,,,,,2.048695\r\n Haste Rating,False,,,,,,,,,1.835938\r\n Crit Rating,False,,,,,,,,,1.787109\r\n Expertise Rating,False,,,,,,,,,1.154297\r\n Attack Power,False,,,,,,,,,1.057649\r\n Strength,False,,,,,,,,,1.057649\r\n \r\nThis data shows very similar data between the spreadsheet and rawr.  The only difference is that expertise is 1/2 the value as the spreadsheet.  As all the other values are the same I will assume they are correct, and assume the one of the expertise values is off.  What I'm trying to figure out is which one is right.  Can anyone help me out with this?\r\n\r\nThanks,\r\nReap\r\n",
      "PostedDate": "2010-07-09T14:24:38.193-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Jothay already answered the question about the value of Expertise.\r\n\r\nThe set bonuses are valued correctly but the 2T10 bonus is a bit misleading. If you'd lose the 2T10 bonus using TotT would no longer be optimal for your DPS so the value of the bonus is from a comparison between on the one hand not having 2T10 and not using TotT (as that's optimal for YOUR DPS when you don't have the bonus) and on the other having 2T10 and using TotT (as it increases your personal DPS now).\r\n\r\nThis means that the value you see is from it giving you 15 Energy every 30 seconds (going from 0 cost from not using TotT to -15 cost from using it with 2T10) while in a real raid environment you would be using TotT even without having 2T10 so the 2T10 bonus gives you 30 Energy every 30 seconds (going from 15 cost when using it without to -15 cost using it with 2T10).\r\n\r\nFor most Rogues (the ones who also used TotT before having 2T10) the increase will thus be double that seen in Rawr, putting it way above the 4T10 bonus.\r\n\r\n\n\n** Closed by Fes 7/9/2010 9:09 AM",
      "PostedDate": "2010-07-09T15:45:53.143-07:00",
      "Id": -2147483648
    },
    {
      "Message": "added comments",
      "PostedDate": "2010-07-09T15:45:53.647-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-07-09T15:46:43.44-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-07-09T16:16:03.51-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Please post your Aldriana speadsheet as well, make sure it's the same as the Rawr file though.",
      "PostedDate": "2010-07-10T00:32:19.303-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-07-12T09:56:32.99-07:00",
      "Id": -2147483648
    },
    {
      "Message": "new rawr character file",
      "PostedDate": "2010-07-12T09:56:33.96-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-07-12T09:58:00.103-07:00",
      "Id": -2147483648
    },
    {
      "Message": "added dates",
      "PostedDate": "2010-07-12T09:58:01.11-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-07-12T09:58:36.857-07:00",
      "Id": -2147483648
    },
    {
      "Message": "spreadsheet added",
      "PostedDate": "2010-07-12T09:58:37.803-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-07-12T22:24:18.95-07:00",
      "Id": -2147483648
    },
    {
      "Message": "After updating the Exp calcs the value for Hit now also dropped significantly below Aldriana's value, but as Aldriana's RSVs include quite a high value for spell hit for while the char is poison hit capped I think I'm just going to not trust the spreadsheet's values.\r\nThat is, unless someone can point to a calculation that is actually wrong in Rawr.",
      "PostedDate": "2010-07-13T03:03:23.28-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-07-13T09:53:56.493-07:00",
      "Id": -2147483648
    },
    {
      "Message": "From what I can tell,  the spreadsheet does not account for expertise capping.  However, the expertise is not capped on either my main hand or off hand in either the spreadsheet or in rawr.  I have taken my rawr character page and taken legs which have my expertise and changed the expertise on them to arpen.  What I see when I do that is that expertise goes to the same RSV as arpen, but hit then skyrockets.  I assume this is because of crit capping.  Perhaps the formula for crit capping takes misses into the equation but not dodge?  Also, please note that hit is only over cap for yellow, it is still under cap for poison.",
      "PostedDate": "2010-07-13T09:53:57.55-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Hmm, I'm going to check the Crit capping, you could be right there.\r\nYou are over the hit cap for Poison. Or well, you are once you set up Rawr the same as the spreadsheet, meaning fix the buffs (Squidface, Misery and food are 3 examples of differences).",
      "PostedDate": "2010-07-13T11:08:47.863-07:00",
      "Id": -2147483648
    },
    {
      "Message": "One other thing that I noticed about avoided yellow attacks is that in the rawr it is 1.19% at 92 expertise.  A human with a sword in his main hand should be at .44%  to dodge for his main hand.  I believe yellow attacks are calculated by main hand.",
      "PostedDate": "2010-07-13T11:31:53.773-07:00",
      "Id": -2147483648
    },
    {
      "Message": "That's what I fixed in changeset 52040.",
      "PostedDate": "2010-07-13T11:53:37.22-07:00",
      "Id": -2147483648
    },
    {
      "Message": "The crit capping does take Expertise into account, for white attacks that is.\r\nFor yellow attacks not being hit/exp capped only increases the Energy cost of your attacks as you'll just do the same attack again when it is avoided, only losing 20% of the Energy cost of the attack as Rogues are not GCD capped.",
      "PostedDate": "2010-07-15T01:33:27.3-07:00",
      "Id": -2147483648
    },
    {
      "Message": "There is something wrong with Expertise indeed, I'm going to dive back in :)",
      "PostedDate": "2010-07-15T05:34:09.32-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Found some problems with Hit and Exp: the amount of white attacks was not being lowered when either was not capped and poison application only looked at the poison cap, but the attack that trigger the poison should also not be avoided ofc.\r\nI fixed these problems, but now Exp and Hit seem to be overvalued, let me know if you have more info on this.",
      "PostedDate": "2010-07-15T07:16:05.527-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Is there a nightly build I can look at, I don't have a way to build this myself right now.",
      "PostedDate": "2010-07-15T08:39:09.697-07:00",
      "Id": -2147483648
    },
    {
      "Message": "No, we don't do nightly builds",
      "PostedDate": "2010-07-15T10:23:27.653-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Ok, so my quick summary for expertise and hit: expertise will affect: sinister strike and white damage only to cap(sinister strike only main hand). hit will affect yellow, poison, and melee near 0; until 260, poison and melee are affected by hit; above 260 hit only affects melee.  The value of expertise for most races will become 0 at 132(26), humans and whatever other races with bonuses will have a soft cap from ~110 to 132 where more expertise will only affect offhand melee damage.  At high levels of hit >260 hit only affects melee, where expertise affects both melee and SS, which is why expertise should be valued over hit.  Under poison cap, this is probably a toss up.  Crit capping should increase the value of hit and expertise by the same amount as the both scale percentage-wise the same per point.  I know that arpen will beat out both hit and expertise in the end (if you're not crit capped) but I still think the value of expertise puts it as a priority to get to a 25 or 26 expertise rating.(I would prefer to be right under cap)",
      "PostedDate": "2010-07-15T14:03:13.18-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-07-30T06:08:38.937-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:28:00.98-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:20:20.44-07:00",
      "Id": -2147483648
    }
  ]
}