{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Warlock",
      "DisplayName": "Rawr.Warlock"
    },
    "ClosedComment": "Klandastu stated in the May 28 comment that there was no real issue.Since this post I have verified and accuricized the Nibelung proc.",
    "ClosedDate": "2010-08-18T12:37:33.98-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "I apologize if I upset anyone for posting this as I have run the search feature for this in both the issue and discussion forums and could find no mention of this. My Rawr has my OH items as 0.00 dps value and I recently got a new OH item and ran the optimizer and it did not recommend it as an upgrade or replacement for my current set. It only lists everything in alphabetical order.",
    "LastUpdatedDate": "2013-05-16T05:20:35.79-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2010-05-27T13:06:06.043-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Warlock] Returns 0.00 DPS Value for OH items",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 17839
  },
  "FileAttachments": [
    {
      "FileId": 3605,
      "FileName": "Klan333.xml",
      "DownloadUrl": ".\\3605"
    }
  ],
  "Comments": [
    {
      "Message": "It seems to be working fine for me. When I switch to the Frozen Bonespike and Shriveled Heart OH, the OH is giving me 422.36 DPS. The only thing I can think of that is causing the Nibelung to be better is the proc on the staff. I'm not sure if it's because of Afflictions innate need to constantly refresh dots, or there could be a bug in the Warlock module that is causing it to trigger the proc on all dots (which it shouldn't).",
      "PostedDate": "2010-05-27T15:46:25.523-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-05-27T15:46:42.153-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-05-27T15:51:07.007-07:00",
      "Id": -2147483648
    },
    {
      "Message": "you will see 0 DPS of offhand if you currently have a two-handed item in your Main hand.\r\n\r\nNote your Current DPS or overall score then,\r\n UN-mark all two-handed equipment and even un-equiping the one you currently have.\r\n run Optimize, and compare the NEW DPS / overall score with the old ones.  (ps, since it now should have picked one item for each hand, you should see DPS values in the OT graph as well)\r\nit is very likely that no combination of Main hand w/off hand beats your current Two-handed weapon.",
      "PostedDate": "2010-05-27T16:01:34.043-07:00",
      "Id": -2147483648
    },
    {
      "Message": "I'll leave this open a while for you to respond, Klandastu, but like Fyre said, if you have a two-handed weapon equiped it disables your offhand.  Equip your Frozen Bonespike and you'll see the list of offhand weapons take on real values.\r\n\r\nAnd to Hinalover's point, I get mixed information about what can trigger the Nibelung proc.  I'm unsure whether it's being modelled correctly right now.  I'll post a request for info in the discussion forums to try & straighten it out.",
      "PostedDate": "2010-05-27T22:35:34.31-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-05-28T02:36:20.15-07:00",
      "Id": -2147483648
    },
    {
      "Message": "@Frye\r\nEquipping the Bonespike worked. I had never had to do that previously and would have never thought of it. I don't ever remember having to do that before in past versions. Thank you.\r\n\r\n@Hinalover\r\nNot sure what is going on. I ran my Sims and updated my Lootrank and according to those numbers, the Frozen Bonespike/Shriveled Heart gives me a higher score than the Nibelung.\r\n\r\n@Xemnosyst\r\nThank you.",
      "PostedDate": "2010-05-28T12:19:43.93-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-07-02T13:58:59.03-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Does this issue persist in 2.3.19? Will close on Sunday if no response.",
      "PostedDate": "2010-07-02T13:59:18.083-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-07-02T15:47:52.237-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Is this still an issue?",
      "PostedDate": "2010-08-18T00:07:00.973-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-08-18T12:37:33.98-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-03-17T20:42:11.687-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:28:19.767-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:20:35.79-07:00",
      "Id": -2147483648
    }
  ]
}