{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Mage",
      "DisplayName": "Rawr.Mage"
    },
    "ClosedComment": "",
    "ClosedDate": "2011-01-02T06:25:30.56-08:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "I set up a Mage using the typical raiding Fire build. Gale of Shadows (346) is very low on the DPS list. It has a 17 spell power/dot tick proc that stacks to 20, so I add 340 spell power to it. Its DPS didn't change. The DPS for the 346 with 340 spell power was barely above the value for the 333 version without the extra spell power.",
    "LastUpdatedDate": "2017-11-27T11:02:04.113-08:00",
    "PlannedForRelease": "Rawr 4.0.09 Beta",
    "ReleaseVisibleToPublic": true,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2010-12-15T12:34:56.533-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Mage] Gale of Shadows Item not Modeled",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 2,
    "Id": 19308
  },
  "FileAttachments": [
    {
      "FileId": 4221,
      "FileName": "Pre-Raid Gearset - Frost.xml",
      "DownloadUrl": ".\\4221"
    }
  ],
  "Comments": [
    {
      "Message": "I think there's two problems here. I know that editing items sometimes won't directly reflect in the charts until you restart the application. The other is this specific item, which I'll have to take a look, but it's quite possible that I don't have that specific combination of trigger type modeled at the moment.",
      "PostedDate": "2010-12-15T13:46:51.44-08:00",
      "Id": -2147483648
    },
    {
      "Message": "I would like to point out that this trinket could be useful for frost mages if they spec into Ignite in the Fire tree. Just saying. It wouldn't be as Fire, but it should be up there as well. Also Deja, can you post your saved file (I'll post my frost one, which specs into Ignite, since it should show up in the trinket listing but it is not).",
      "PostedDate": "2010-12-15T16:13:42.76-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-12-15T16:14:43.4-08:00",
      "Id": -2147483648
    },
    {
      "Message": "posted file",
      "PostedDate": "2010-12-15T16:14:44.73-08:00",
      "Id": -2147483648
    },
    {
      "Message": "When you model it, right now it doesn't proc on Ignite or Pyroblast! DoT ticks. It does proc on Living Bomb and hardcast Pyroblast ticks. I'm not sure about FFB or Combustion.",
      "PostedDate": "2010-12-16T09:04:02.243-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-12-16T12:33:34.043-08:00",
      "Id": -2147483648
    },
    {
      "Message": "That didn't come out right. What I meant to say was in game it doesn't proc on Ignite or Pyroblast! DoT.",
      "PostedDate": "2010-12-16T18:54:43.507-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-12-26T22:30:13.38-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Well I got the trinket myself and I know it does proc for either ignite or FFB. I'll have to do some testing on it.",
      "PostedDate": "2010-12-27T08:20:48.383-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Okay, I did some pretty extensive testing into this from a frost and fire perspective and I've come to a few conclusions about this proc:\r\n\r\nFor frost the trinket does not proc unless you spec into Ignite.  Only if you cast FFB whether hard-casted or not. FYI Frostfire orb is able to proc FoF ;)\r\n\r\nFor fire on the other hand, limits which can proc the trinket or not.\r\n- Hard Casting Pyroblast is able to proc the trinket. The non-Ignite DoT of the Pyroblast is what was triggering the trinket.\r\n- Ignite for hard-casted spells for fire DOES NOT proc the trinket. I tried this with FB, Pyro, FBlast, Scorch, FFB, and Flame orb.\r\n- Flame Orb explosion does not proc.\r\n- HS Pyro does NOT proc the trinket even though the extra damage is applied.\r\n- Combustion is unable to proc the trinket\r\n- the DoT tick of Flamestrike is able to proc the trinket but not the base damage.\r\n- Blast Wave and Dragon's Breath doe NOT proc the trinket\r\n- Living bomb of course procs the trinket, but the explosion does not.\r\n\r\nOn a side note Untalented, Flame Orb is able to proc Arcane Missles",
      "PostedDate": "2010-12-27T09:49:46.823-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Correction, FFB is able to proc without ignite just the extra damage it does is what is proccing the trinket.",
      "PostedDate": "2010-12-27T09:51:00.8-08:00",
      "Id": -2147483648
    },
    {
      "Message": "For frost",
      "PostedDate": "2010-12-27T09:51:07.787-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Sorry, it's the Glyph of Frostfire is what is proccing the trinket my bad.",
      "PostedDate": "2010-12-27T09:52:08.3-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-01-02T06:25:30.56-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-05-21T00:00:17.077-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:27:08.99-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:19:37.223-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2017-11-27T11:02:04.113-08:00",
      "Id": -2147483648
    }
  ]
}