{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.ProtPaladin",
      "DisplayName": "Rawr.ProtPaladin"
    },
    "ClosedComment": "roncli fixed this",
    "ClosedDate": "2009-10-01T08:54:08.887-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "v2.2.14 of Rawr is showing wrong Armor value for characters (while my chars actual = 26k, Rawr shows 31k).. also by optimizing I can get my pally to 47k armor, which is unreal.",
    "LastUpdatedDate": "2013-05-16T05:24:37.643-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2009-08-31T12:11:39.75-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[ProtPaladin] Armor value Incorrect",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 2,
    "Id": 14010
  },
  "FileAttachments": [
    {
      "FileId": 2157,
      "FileName": "Gåttsu.xml",
      "DownloadUrl": ".\\2157"
    }
  ],
  "Comments": [
    {
      "Message": "Do you have any proc'g effects that add to armor (or agility, since that also adds armor)? For example, The Black Heart from H ToC? The values for those items are averages and added to the total.",
      "PostedDate": "2009-08-31T13:51:37.01-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Bonus armor on items is being counted double.  For characters such as mine it makes 2.2.14 unusable.",
      "PostedDate": "2009-09-01T02:41:27.3-07:00",
      "Id": -2147483648
    },
    {
      "Message": "For a clarification - it is not any specific item, it is any item with bonus armor.  It is not any specific talent.  It does not reflect in the item stats, it is only the character total, and the stat weight.  Armor is weighed twice what it should be because of this bug.",
      "PostedDate": "2009-09-01T02:43:39.91-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-09-01T02:49:51.08-07:00",
      "Id": -2147483648
    },
    {
      "Message": "OK, testing..\r\nWarr tank with The Black Heart shows 26357 armor, when its 25002. By removing TBH it shows 25001 - so that might be the case of average trinket uptime. \r\nBut Pally is different, cus it has under Options ''Trinket Handling\" - which is now same for Ignore and Average Uptime.\r\nAnd the weird part is, when I load Pallys on the same Rawr, TBH dont show up any armor bonus, not even on tooltip, but on the Warrs it shows up.\r\n\r\nHere is my char attached. Rawr shows 31166 armor without Devo aura, while it actually is 25875. And I have only Furnace Stone as Use armor, but same as like TBH it doesnt show that.. Also by applying Devo aura I should get like 1806 armor increase but in Rawr I get 34961 which is more than twice the amount.",
      "PostedDate": "2009-09-01T03:30:54.93-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-09-01T03:30:55.883-07:00",
      "Id": -2147483648
    },
    {
      "Message": "36406 \r\nby Jothay  Aug 31 at \r\n10:40 PM 10 Rawr.ProtPaladin: Partial Fix for issue 14011, base armor shown incorrectly. Proc Effects for Armor still need work \r\n\r\nThanks for the partial fix, this should make the version useable for me :)",
      "PostedDate": "2009-09-01T03:48:03.457-07:00",
      "Id": -2147483648
    },
    {
      "Message": "How do I use that partial fix? Sry for newb q.. but where do I put all those files?",
      "PostedDate": "2009-09-01T04:53:22.237-07:00",
      "Id": -2147483648
    },
    {
      "Message": "To use unreleased versions of the code, you have to compile and run it yourself. For someone who is completely inexperienced in programming, this isn't easy but there are free tools out there that can do the job. However, I do not know what these are as I use all Microsoft products (Visual Studio) as I have an unrestricted MSDN license.",
      "PostedDate": "2009-09-01T08:16:58.973-07:00",
      "Id": -2147483648
    },
    {
      "Message": "k, ty for reply :) so Ill be w8ing for 2.2.15 than I gues & keep on using 2.2.13 till than.",
      "PostedDate": "2009-09-01T10:05:34.437-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Side-note: Proc handling in ProtPaladin isn't exactly set up the way it needs to be so The Black Heart and similar trinkets aren't modelled yet, which is why you see the armor proc on ProtWarr but not ProtPaladin (I added the proper code to model TBH and similar in ProtWarr)",
      "PostedDate": "2009-09-01T10:22:35.21-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-10-01T08:54:08.887-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-03-17T21:30:24.073-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:33:21.23-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:24:37.643-07:00",
      "Id": -2147483648
    }
  ]
}