{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Base.LoadCharacter",
      "DisplayName": "Rawr.Base.LoadCharacter"
    },
    "ClosedComment": "",
    "ClosedDate": "2009-09-17T11:12:27.537-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "About a month ago I read that the reason you can't load previously saved characters is because Rawr accesses The Armory to check what race and class your character is (or something along those lines). \n \nMy suggestion is to remove this limitation either by giving the option to ignore it, by asking the user to input whatever information Rawr needs or by saving the information needed into the XML character file. I knows this doesn't happen often, but when it does, it is annoying not being able to optimize your character just because Blizzard decided to take down the armory for a few days.",
    "LastUpdatedDate": "2013-05-16T05:24:34.87-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2009-09-02T16:03:22.78-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "Can't load previously saved characters when armory is down",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 14033
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "And by the way, the error message is confusing, it makes you think your profile got corrupted or that it can't and will never be able to open it:\r\n\"There was an error attempting to open this character. Most likely, it was saved with a previous version of Rawr, and isn't upgradable to the new format. Sorry. Please load your character from the armory to begin.\"",
      "PostedDate": "2009-09-02T16:05:54.37-07:00",
      "Id": -2147483648
    },
    {
      "Message": "The data required from the Armory to load a previously saved character is any items that you currently don't have. This should only happen when transferring a character between computers. This isn't feasible to have the user type in.",
      "PostedDate": "2009-09-02T16:50:48.337-07:00",
      "Id": -2147483648
    },
    {
      "Message": "The at least it should just ignore the items it can't retrieve instead of halting the whole process. This happens every time a new version of Rawr is released and the armory is down or inaccessible (I never use the same folder for different versions of Rawr. I found I could avoid weird issues if I don't use the previous folder).",
      "PostedDate": "2009-09-02T23:36:04.62-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-09-17T11:12:27.537-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-09-09T15:35:22.037-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:33:17.607-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:24:34.87-07:00",
      "Id": -2147483648
    }
  ]
}