{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "",
    "ClosedDate": "2010-01-06T11:47:59.53-08:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "Hi, I hope that I am not missing something obvious here as I have been using Rawr for some time with no issues.\n \nWhilst using the optimser in 2.3.5 on my warrior, it equips a Chaotic Skyflare diamond, requiring 2 blues to activate in the headpiece, and with Enforce Gem Requirements both checked and unchecked it recommends a gemming with only 1 blue thus deactivating the Meta. In addition, I have Massacre on both 2H weapons, but know that Beserking is better dps. There is no recommendation to change enchant, and this is also an issue on my mage with hand enchant, where greater spirit is better than Precision but no recommendation is given to upgrade it.\n \nThanks for your advice!",
    "LastUpdatedDate": "2013-05-16T05:22:36.34-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2010-01-04T12:32:45.29-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "Meta Gem Issue with 2.3.5",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 15711
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "You need to mark the extra blue gem or a nightmare tear available.\r\nYou need to mark both Massacre and Berserking as available. However since Zerking will ALWAYS be better, there's no reason to mark Massacre as available so just take it off.",
      "PostedDate": "2010-01-04T12:39:57.36-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Many thanks for your reply and advice - is there any way to optimise including ALL available enchants, gems, and available gear so that pressing optimise will give the very highest dps or overall result? I have the same issue with my mage - for example; I can equip a large number of different gems as a JC which do not show on the templates. It would be a marathon to list all the combinations in the custom gemming section, but surely rawr would know the very best combination of gems/enchants if everything is available? Am I still missing something here? Thanks again :)",
      "PostedDate": "2010-01-06T06:25:16.21-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Whatever you want the optimizer to consider, mark as available. We (VERY INTENTIONALLY) do not have a Mark All option in the program as that would hurt users more than help, considerably. If you want to make a BiS list, you'll have to do it the hard way and walk through each section of the program and mark the top listed items per slot/enchant/gem, the more you mark the longer the optimizer will take.",
      "PostedDate": "2010-01-06T11:47:53.973-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-01-06T11:47:59.53-08:00",
      "Id": -2147483648
    },
    {
      "Message": "One other note, you don't have to add a custom gem template.  You can just mark them as available by clicking the white diamond next to the gem (turns it green) in the Gem Charts",
      "PostedDate": "2010-01-06T12:53:56.867-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:30:50.16-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:22:36.34-07:00",
      "Id": -2147483648
    }
  ]
}