{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.ProtWarrior",
      "DisplayName": "Rawr.ProtWarrior"
    },
    "ClosedComment": "",
    "ClosedDate": "2010-07-04T17:10:15.91-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "Description: With the implementation of this feature, I would like to be able to run an Optimizer pass using the ProtWarr model, in order to optimize specifically for Block. I was looking through some of the available options but did not see one that would allow me to focus on Optimizing for Block (Value and Rating) specifically.\n \nSuggestion for Fix: Adding a Block Rating and Block Value section to the Optimizer for the Rawr.ProtWarr model.",
    "LastUpdatedDate": "2017-11-27T11:00:52.033-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2009-10-30T10:12:24.453-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Feature Request.ProtWarr] Block Value Optimizer Requirement",
    "Type": {
      "Name": "Feature",
      "Id": 1
    },
    "VoteCount": 1,
    "Id": 14585
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Why do you want to optimize for block? Is there already a better way to optimize for that reason?\r\n\r\nie, if you want to optimize your performance while OTing on Anub, you can set the fight parameters appropriately (0.125sec attack speed, ~18000 base damage), then optimize.",
      "PostedDate": "2009-10-30T11:00:04.263-07:00",
      "Id": -2147483648
    },
    {
      "Message": "With the changes coming to Avoidance, mostly with the Chill of the Throne reducing dodge by a significant amount in Icecrown, I'd like to optimize for Block as the Blue Poster stated that hits will be coming much more regularly but for smaller amounts. If there is another way to already optimize for this then it's not very intuitive, as the only drop down for optimization that I saw listed that took block into account was (I think) \"Avoidance + Block\" whereas I would like to ignore avoidance to focus on maximizing Block.",
      "PostedDate": "2009-10-30T13:12:14.147-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Well, that's still what I'm asking. Simply optimizing block would give you a poor gearset. If what you want is to optimize your performance in icecrown, then what you want is to set the attack speed faster, and lower your dodge by 20% (We'll be adding this debuff in the next version of Rawr), and then optimize.\r\n\r\nI'm not saying there shouldn't be an optimizable value for block value, just that that doesn't sound like the best solution to your problem.",
      "PostedDate": "2009-10-30T13:27:18.987-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Intentionally avoiding Avoidance stats through ignoring their existence is a bad approach.  The best method is to set the program properly to account for the expected incoming damage, and then see what the calculations return as the optimal way to gear to perform your best.  My personal prediction is that Defense and Stam will the the go-to stats, but this is so far unsubstantiated mathematically / through experience.",
      "PostedDate": "2009-10-30T15:15:12.627-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-10-31T17:36:30.3-07:00",
      "Id": -2147483648
    },
    {
      "Message": "I will add an optimizer value for BlockValue just for the case of setting requirements, but I doubt you would ever wish to optimize solely based on this since it will likely be a terrible gearset. You are better off setting criteria (e.g. minimum HP, % chance to miss, etc.) then optimizing for either Overall Mitigation % or Burst Time, depending on which you trust more for the given occasion.\r\n\r\nOverall Mitigation % will give better results than trying to optimize for an arbitrary Avoidance % or Block % value, as otherwise things like Bonus Armor will be ignored when they are quite powerful. (With the obvious exception of if you are specifically trying to make an unhittable set--which will be very difficult with -20% dodge.)",
      "PostedDate": "2009-11-02T03:27:31.4-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-01-04T09:22:08.597-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-04-18T10:55:25.37-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-07-02T14:21:59.117-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-07-02T15:47:27.123-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Resolved with changeset 51753.",
      "PostedDate": "2010-07-04T17:10:15.91-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-09-05T16:10:09.783-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-03-17T19:52:23.52-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:32:04.833-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:23:34.617-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2017-11-27T11:00:52.033-08:00",
      "Id": -2147483648
    }
  ]
}