{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "Fixed.",
    "ClosedDate": "2009-01-19T15:22:32.517-08:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "When the program lists possible upgrades, it does so based on current gear sets. (So as you change gear, the 'upgrades' change accordingly)\n \nHowever, that said, it is not taking into consideration meta gem requirements for said upgrades. \n \nExample: My character currently is using spellstrike helm and pants still, and the suggested upgrades lists the Collar of the Aldor with the +crit meta as a good upgrade. However, I currently do not have the required gemmings on other gear to allow me to use that meta gem. \n \nSuggestion for fix: Either make note in the upgrade list that current character does not meet the requirements, or simply not list the item at all. (Suggest the prior, rather than the latter) \n \nExample can be viewed on character: 'Caspien' on the US Blackhand server.\n \nIssue is reproducible currently all the way up to build 18562.",
    "LastUpdatedDate": "2013-05-16T05:27:13.213-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2008-06-09T07:04:35.38-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "Suggested Upgrades not considering current sockets and/or gemmings.",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 10314
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "If you're talking about Direct Upgrades, then no, it does take metagem requirements into consideration if you have Enforce Metagem Requirements checked in the Options tab.\r\n\r\nIf you're talking about Build Upgrades List in the Optimizer, then it still does consider metagem requirements, but not in the same way. The optimizer-built upgrades list is the potential gain of having that item available, to an optimal set. ie, it's including shifting gems around optimally, it's including swapping other pieces with more/less hit as appropriate, etc.",
      "PostedDate": "2008-06-09T08:30:01.05-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Sorry bout that... was half asleep when I typed it up, apparently. Didn't notice the enforce meta gem was there in the options portion of Rawr mage.\r\n\r\nHow this all originated was while viewing the Healadin portion of the program, which does NOT have the 'enforce meta gem' option available with build 18562. I'd thought I'd seen it previously.. and apparently I was correct. \r\n\r\nSo, if you'd like, I'll file this under a separate report, since the actual bug, in question, is limited to the healadin portion.\r\n\r\nThanks.\r\n",
      "PostedDate": "2008-06-09T09:36:18.863-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-01-19T15:22:32.517-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:36:46.94-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:27:13.213-07:00",
      "Id": -2147483648
    }
  ]
}