{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "Fixed for 4.2.1.",
    "ClosedDate": "2011-07-10T13:32:27.607-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "The more of my 359 gear I swap out for 365 or higher gear, the more the program appears to hitch until I reach my final item and it locks up all together.  It doesn't matter which item I'm on; I've changed the order around three or four times and it doesn't appear to be any particular item/slot that's doing it.  I've tried minimizing the number of items I have selected for optimization and unchecking the filter boxes so that as few items as possible are shown; that doesn't appear to help.",
    "LastUpdatedDate": "2013-05-16T05:17:45.347-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2011-06-30T11:00:47.84-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[BearDruid] Gradual slowing down/locking up",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 2,
    "Id": 21055
  },
  "FileAttachments": [
    {
      "FileId": 5095,
      "FileName": "yemana359.xml",
      "DownloadUrl": ".\\5095"
    }
  ],
  "Comments": [
    {
      "Message": "Can you attach your character and describe the exact steps taken to achieve this?",
      "PostedDate": "2011-06-30T12:36:54.72-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-06-30T14:04:32.417-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Here is the file.  As I've tried this several times choosing the gear slots in several different orders with the same result, I'll recreate the problem now going through each piece of gear down the left side (starting with helm and ending with bracers) before moving to the right (starting with gloves and ending with trinket 2).  Main hand weapon and then ranged slot last.\r\n\r\nFirst, in the gear dropdown menu I select Gear -> Head.  I selected the highest rated 378 gear (which in this instance is the Obsidian Arborweave Headpiece slotted with an Austere Shadowspirit Diamond and a Shifting Demonseye with Hit reforged to Dodge) for optimization by checking the diamond icon next to it.  Then, I move to the actual gear slot and change my currently equipped item to the one I've just selected for optimization.\r\n\r\nI continue to do these steps for each piece of gear proceeding in the order I mentioned before.  My choice is always the highest rated 378 item level gear with the exception of the neck slot, which has the Choker of the Vanquished Lord (384) chosen.  No noticeable/objectionable slowdown in the program is noted until I try to select Gear -> Hands from the dropdown menu.  It takes about ten seconds for the program to \"catch up\" and load the available gloves.  Once I've selected a pair of gloves for optimization and move to the actual gear slot to switch it out, I experience another slowdown, during which the title bar at the top reads \"Rawr (Not Responding)\" for approximately twenty seconds before I am able to actually select the gloves for replacing - and then, when I try to select them from the dropdown menu, the program freezes again for another ~twenty seconds.  When trying to select the next list of items (Gear -> Waist), the program locks up for good.\r\n\r\nNo matter which order I try and replace my items in, even when choosing the next slot on a whim, I always begin experiencing severe slowdowns when I have replaced approximately half of my items.  Once or twice I was able to replace all but one of them before the program locked up for good.  I've tried it on two different machines when there have been no other programs running as well.",
      "PostedDate": "2011-06-30T14:04:34.893-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-07-09T13:48:31.35-07:00",
      "Id": -2147483648
    },
    {
      "Message": "I am having the exact same problem to the letter ",
      "PostedDate": "2011-07-09T13:49:00.27-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-07-10T13:32:27.607-07:00",
      "Id": -2147483648
    },
    {
      "Message": "4.2.1 Did not fix this issue the problem is still occurring exactly as described with Prot warrior gearing.  ",
      "PostedDate": "2011-07-11T22:56:44.68-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:24:46.66-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:17:45.347-07:00",
      "Id": -2147483648
    }
  ]
}