{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "Option declined, the benefits do not outweigh the problems that would arise from having this option",
    "ClosedDate": "2009-12-27T18:52:17.047-08:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "I spend WAY WAY too much time clicking on those \"green diamonds\" next to items that I'm evaluating in builds.  I would like a way to Select All and Select None on ALL shown items for the purposes of including them in optimizations.   Select All should set the green diamonds ON for all currently shown items.   Select None should clear the green diamonds on all items(shown or not).",
    "LastUpdatedDate": "2013-05-16T05:23:04.167-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2009-12-11T14:49:02.04-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "Select All/None on <> (diamond) marks next items",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 2,
    "Id": 15369
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "No, we specifically don't want to encourage users to do that, as it would be a disservice to them. If you are in situations where you want such a feature, you're almost certainly misunderstanding how something works. I'm a little confused, because I know you're a long time user, tkb... ",
      "PostedDate": "2009-12-11T15:37:30.88-08:00",
      "Id": -2147483648
    },
    {
      "Message": "(To clarify, you really shouldn't be marking all items or even more than 'several' items available, in any particular slot.",
      "PostedDate": "2009-12-11T15:38:13.19-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Well, there is one situation.  With Kavan's new \"cost\" feature, people may now want to filter only items from Badge vendors, set all their costs, and then mark them all as available and optimize based on cost.  That's my understanding of how Kavan intended the feature to be used (since badge items are technically \"available\", even if they're not sitting in your inventory).  If that's the use case, though, I'd prefer an option that flags all badge items as available to one that flags ALL items available.",
      "PostedDate": "2009-12-11T15:57:41.183-08:00",
      "Id": -2147483648
    },
    {
      "Message": "You don't want to mark them as available (that would actually mean you already have them and they would not cost anything as a result). Optimizer under the hood automatically marks them as \"available\", but you shouldn't mark them yourself with diamond if you're doing cost optimizations.",
      "PostedDate": "2009-12-11T16:15:43.663-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Besides, that's like 4-5 items for each class, far from something you'd want a 'Select All' feature for.",
      "PostedDate": "2009-12-11T16:43:08.807-08:00",
      "Id": -2147483648
    },
    {
      "Message": "I usually use the filters to only show say the Emblem of Frost items and then run a \"Build Upgrade List\".      Not sure if that will work with Kavan's new feature.\r\n\r\n",
      "PostedDate": "2009-12-11T18:20:52.577-08:00",
      "Id": -2147483648
    },
    {
      "Message": "I do three very different things.   1) I optimize the gear that I have (which is a short list for each slot).   2) I optimize all the gear that I can easily get from the 10/25 mans we run.   3) I optimize all the available gear that is or will be available to know what the endgame BiS items are.\r\n\r\nFor 1), it's making the best of what I have.  For 2), it's deciding what I should be spending my DKP on today.   For 3) It's making strategic choices on how I want to evolve both my gear and spec long term.\r\n\r\nFor options 2 and 3, I absolutely want to mark ALL of the stuff that I've filtered as available for the optimizer to select from.\r\n",
      "PostedDate": "2009-12-11T19:14:17.103-08:00",
      "Id": -2147483648
    },
    {
      "Message": "tkb your Option #3 pretty much breaks the optimizer, the more gear you select the less likely it is to find a real BiS. For #3, instead select the top few items from each slot and then let it run that.\r\n\r\nI normally select the following in each slot for a BiS check (Arms Warrior):\r\n1. Top Pure DPS item (No Hit/Exp)\r\n2. 2nd Pure DPS item (No Hit/Exp)\r\n3. Top DPS Item with Hit on it\r\n4. Top DPS Item with Exp on it\r\n\r\nWhat this does is limit the ridiculous overload on the Optimizer while still leaving it plenty of room to fuddle around for the Hit/Exp Caps in whatever slots it chooses to use in them. Items that fill multiple slots (Rings/Trinkets) I'll add another 2 options (total 6 rings, 6 trinkets), just for good measure.",
      "PostedDate": "2009-12-11T19:52:32.737-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-12-11T21:59:52.87-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Yeah, #1 is what the optimizer is for, #2 is what upgrade lists are for (or, when evaluated once at a tier level, the optimizer with a carefully chosen mix of items), and #3 is also the optimizer, with a very carefully chosen mix of items, as Jothay described.\r\n\r\nYou seriously should not overload the optimizer with more than several items in each slot, as it will massively impact its speed and accuracy.",
      "PostedDate": "2009-12-12T00:19:38.263-08:00",
      "Id": -2147483648
    },
    {
      "Message": "It's interesting that youre telling me that it \"cant / shouldnt\" be done, when I do exactly this with good results.  Just a while ago, as a test, I filtered and then selected all items 226+ (normally I would filter it more tightly like 232-266, for example) and ran a FULL optimization (slider to the far left) a handful of times and fairly quickly ( a few minutes ) found optimal or near optimal solutions.  Even repeating it a few times was still in the realm of reasonably good total times (<10 mins).\r\n\r\nWhy would I do this?  Because I interesting combinations of slightly older gear that work well with the \"top few\" supposedly BiS items.  This approach works well for me and isnt any sort of \"abuse\" of the tool or even an unreasonable computational expense.  The ONLY hassle is actually turning on/off the diamonds themselves, which often take just as long to complete as numerous optimization runs.  I dont see any reason not to use the tool this way since it does what I want and fairly quickly.\r\n\r\nTo make the UI point more directly, I would have been much happier if the item list were more like a multiple select listbox where I could quickly & easily select one or more items individually by control-clicking or ranges of items by shift clicking.   The current diamonds are simply too small and tedious to individually click.   If you simply wont make it possible for me to Select All or Select None of the filtered list easily, how about at least makeing the <> symbols larger so they arent so fussy to target.",
      "PostedDate": "2009-12-12T05:04:01.127-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Just curious, you said you repeat the process a few times. Do you usually get the same results? Because I don't have nearly as many items checked as you do, and I find that if I go over a certain amount (not even that much) of items checked, the results are inaccurate and different on repeated optimizations.",
      "PostedDate": "2009-12-12T07:20:36.603-08:00",
      "Id": -2147483648
    },
    {
      "Message": "We haven't said you \"can't\", we've said you *shouldn't*. It significantly degrades the accuracy of the optimizer when you do that, and your tests show exactly that. For that reason, we definitely will not be adding any features that encourage people to use more than a reasonable number of available items per slot.",
      "PostedDate": "2009-12-12T09:20:22.307-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Yes, the results can be different each time because the algorithms they are using only find a \"good\" solution, not the best solution.  Which is exactly why I run this optimization a number of times and only select proposed solutions that are better than my current best one.  In effect, I'm trying to make sure that I get best possible answer for the number of times I'm willing to rerun the optimization passes.\r\n\r\nMaking it more difficult for me to include my chosens set of items in the optimization run is counterproductive imo.   While no one is obliged to implement anything they dont like, you might consider that your users are encumbered by the current UI and that they are not doing anything \"unreasonable\" at all.\r\n",
      "PostedDate": "2009-12-13T18:08:27.68-08:00",
      "Id": -2147483648
    },
    {
      "Message": "I wouldn't be opposed to having some \"obscure\" option somewhere that marks everything available. But it would have to be hidden in some way, because otherwise the common users will just do that (because it's easy) and then complain that it didn't return the optimum (because they don't understand how it works and expect it to be deterministic).",
      "PostedDate": "2009-12-13T18:43:30.413-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-12-27T18:52:17.047-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:31:26.917-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:23:04.167-07:00",
      "Id": -2147483648
    }
  ]
}