{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "",
    "ClosedDate": null,
    "CommentCount": 0,
    "Custom": null,
    "Description": "Edit: I'd like to mention that I am using the ElitistJerks version currently without any issues. \nHello!\n \nI did not see anything like this related to the current release. This has actually been happening to me for a few releases now. \n \nWhen I try to launch Rawr, nothing appears to happen. If I pull up task manager and keep an eye on my processes tab, I'll see Rawr.WPF.exe gradually increase in Memory usage. Eventually it hits about 1.9m K, making my physical memory usage roughly 97% and THEN rawr loads. Once Rawr loads, my usage dips to about 82%. \n \nAfter I'm in, doing simple tasks like un-checking filters, scrolling, resizing windows, hiding filters, changing item slots, can take anywhere from one to two minutes. Overall, interacting with Rawr once it is up is a very slow and painful process. \n \nHere are my computer's specifications:\nOperating System: Windows 7 Ultimate 64 Bit\nRAM: 8GIG DDR3 1600\nCPU: i7 875k @ 3.4GHz\nVideo: GTX 470\nSilverlight Verison 5.06 (I tried on 4.0 with the same results)\n \nAny help with this would be awesome. Rawr is an amazing utility that I just have not been able to take advantage of recently. \nThank you!",
    "LastUpdatedDate": "2013-02-21T18:24:03.087-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2011-12-10T13:52:58.277-08:00",
    "Status": {
      "Name": "Proposed",
      "Id": 1
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "Rawr takes 10+ Minutes to load, very unstable.",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 21895
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Rawr when started should take roughly 200 MB of memory. I'm not sure exactly what you mean by 1.9m K, but with 8 GB ram hitting 97% sounds a bit unreasonable. I haven't seen any similar reports from other users so I would guess there must be something strange on your end. Since you mention that the Silverlight version is working ok for you I would suggest you try reinstalling/repairing .NET Framework on that computer.",
      "PostedDate": "2011-12-11T15:37:35-08:00",
      "Id": -2147483648
    },
    {
      "Message": "At least include your character XML and we can take a look.  It may have something to the default loading of a certain model that doesn't do well when empty.",
      "PostedDate": "2011-12-11T18:43:36.463-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:24:03.087-08:00",
      "Id": -2147483648
    }
  ]
}