{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Cat",
      "DisplayName": "Rawr.Cat"
    },
    "ClosedComment": "",
    "ClosedDate": "2011-11-30T00:34:56.293-08:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "Considering how fluid and balanced secondary stats are for kitties right now, it would be interesting to have 2 options (on the Options tab, that is):\n- Force Hit Cap\n- Force Expertise Cap\n \nThat way, it could make Hit and/or Expertise higher priority until the cap, after that falling back to the usual math. The reasons for this options are:\n- Capping Hit and/or Expertise is considered a personal choice right now\n- For some fight, Hit and Expertise are more important than on others.",
    "LastUpdatedDate": "2013-05-16T05:17:25.29-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2011-09-22T23:00:05.053-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Cat][Feature Request] Option for Hit Cap and Exp Cap",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 21552
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "This is already able to be done via the optimizer, just add \"Avoided attacks < 0\"",
      "PostedDate": "2011-09-23T05:42:34.94-07:00",
      "Id": -2147483648
    },
    {
      "Message": "I know. But that would be hit AND expertise, no possibility for OR.\r\n",
      "PostedDate": "2011-09-23T08:52:01.133-07:00",
      "Id": -2147483648
    },
    {
      "Message": "That may be true, however, this isn't exactly how Rawr is designed.  If hit or expertie will net you the most dps, rawr will go for those stats.  If they are not, rawr will not.  ",
      "PostedDate": "2011-09-23T09:22:15.743-07:00",
      "Id": -2147483648
    },
    {
      "Message": "You know what you said contradicts all the other configurable parameters, right ? Like glyphs, spec, rotation etc. The parameters I'm request are perfectly in line with those already there.",
      "PostedDate": "2011-09-23T10:51:35.28-07:00",
      "Id": -2147483648
    },
    {
      "Message": "This was discussed before and it was decided that there was no point as there is no difference between ;-\r\n\r\n1) 2% chance to miss and 0% chance to be dodged\r\n2) 1% chance to miss and 1% chance to be dodged\r\n3) 0% chance to miss and 2% chance to be dodged\r\n\r\nThey are all exactly the same.   Back in the day when spell interrupts could miss, they added the option for avoidable interrupts (effectively hit capping) which is still there, but it is no longer needed.\r\n\r\nIs there a particular reason you want to cap one and not the other?\r\n\r\n",
      "PostedDate": "2011-09-25T16:19:31.597-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Yes. We sometimes are in front of the boss alot of the time (Ragnaros, and Majordomo are two examples), or never (Beth and Ryloth). The relative value of expertise change on those 2 situations, while hit remains the same.\r\n\r\nIn fights where you send alot of time in front of a boss, parry enters into play. Although you will never try capping exp for parry, expertise becomes more valuable than hit on those cases.",
      "PostedDate": "2011-09-25T17:07:46.963-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-10-01T17:19:55.91-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-10-09T11:09:31.9-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Just an update on this issue.\r\nI'm now setting the optimizer to \"Avoided attacks < 0.4%\", which will put me at Exp cap and close to Hit cap. For that, it will always assign Fluid Death as one of my trinkets, with no +hit gems or enchants (most of the time)\r\nAfter that, I will just replace Fruid Death for another trinket, and replace any +hit gem or enchants manually. That way, I end up with Exp cap, without bothering with Hit cap (although my hit will still be nice).\r\n(My focus for this particular gear setup was Heroic Rag, and it worked great).\r\n\r\nI'm keeping this open cause I would still like to see either Hit and Expertise on the Options tab, or at least separated on the Optimizer.\r\n",
      "PostedDate": "2011-10-25T13:28:23.597-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-10-25T16:04:27.38-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Associated with changeset 63564.",
      "PostedDate": "2011-10-25T16:06:26.53-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-10-25T16:06:45.587-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-11-30T00:34:56.293-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:24:17.49-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:17:25.29-07:00",
      "Id": -2147483648
    }
  ]
}