{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Base.LoadCharacter",
      "DisplayName": "Rawr.Base.LoadCharacter"
    },
    "ClosedComment": "",
    "ClosedDate": "2010-02-22T12:59:46.21-08:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "I have been having trouble getting Rawr to load characters from the Armory (or even load the news upon start-up). I'm using Rawr version 2.3.5. Once I get Rawr installed, it runs fine, just that when I tell it to call a char from armory it returns an error saying 'could not retrieve char information from armory. is armory down?'. I have no issues accessing armory through Firefox. This only happens on my windows gaming login which is set to user privileges (not able to install programs) for security reasons. I can call characters from the armory fine in Rawr when I'm logged in on my superadmin account but I don't want to use my superadmin account for gaming. I've tried setting my gaming account all the way up to admin privileges to see if it would work that way but to no avail. My gaming account does have write / modify privileges for the folder Rawr is in as well as its parent folders. I have even tried shutting down my software firewall to see if that was the culprit but that did not help.\n \nI use Windows 2000 Pro & will not switch OS's unless necessary for a game I may play in the future since 2k pro is the most stable Windows I've used to date. If anyone has any ideas I can try, I would be grateful. If not, oh well, my DPS sucks anyways.",
    "LastUpdatedDate": "2013-05-16T05:22:29.587-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2010-01-09T08:49:59.803-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[LoadCharacter] Can only load from armory when in admin login",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 15811
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Didn't we have a posting somewhere about Rawr not supposed to be working in Win2k period?",
      "PostedDate": "2010-01-09T15:15:09.453-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Yeah, dunno what to tell you. Rawr needs access to the internet. Some permission or firewall is blocking it. Simple as that.",
      "PostedDate": "2010-01-09T18:56:59.867-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-01-18T20:11:42.42-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-02-22T12:59:46.21-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-09-08T16:45:02.777-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:30:40.893-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:22:29.587-07:00",
      "Id": -2147483648
    }
  ]
}