{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Retribution",
      "DisplayName": "Rawr.Retribution"
    },
    "ClosedComment": "",
    "ClosedDate": "2009-12-25T23:05:35.65-08:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "Maybe it's me that isn't getting how it should work, but I did optimize with my current gear and it's giving me a 8004 score configuration over a 8014 configuration.\n \nWhich is basically replacing a hit/crit ring for a haste/crit and replacing 4 strength/crit gems for 4 strength/hit gems which doesn't make any sense to me.\n \nSo obviously I'm discarding that optimization, but I thought I might report it so you can take a look at it, or call me names because I don't get it and the new config would be better, but last time I checked, losing crit for haste has never been a good thing for paladins.\n \nLet's push a little.\n \nReplacing 4x 10 crit / 10 strength\" gems for 4x10 strength/10 hit = loss of 40 crit, gain of 40 hit\nReplacing ring = loss of 4 crit, loss of 44 hit and gain of 50 haste\n \nSo over all, I'd replace 44 crit + 4 hit for 50 haste, I'm not an expert in napkin maths, but it just doesn't seem right to me.",
    "LastUpdatedDate": "2013-05-16T05:23:16.243-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2009-11-26T09:57:55.033-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Retribution] Optimize giving me a lower score",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 15061
  },
  "FileAttachments": [
    {
      "FileId": 2548,
      "FileName": "rawr_opt_err.jpg",
      "DownloadUrl": ".\\2548"
    },
    {
      "FileId": 2549,
      "FileName": "Zurak DPS.xml",
      "DownloadUrl": ".\\2549"
    }
  ],
  "Comments": [
    {
      "Message": "I thought adding the XML might help.",
      "PostedDate": "2009-11-26T10:00:02.697-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-11-26T10:00:04.37-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Don't have a chance yet to look at your character files, but the two obvious explanations which solve in 90% of the time are:\r\nA) Did you mark everything you have equipped as available?\r\nB) Did you use a low thoroughness? The optimizer isn't guaranteed, and will occasionally get it wrong, especially at low thoroughness.",
      "PostedDate": "2009-11-26T12:53:43.08-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Just like to add that I had this happen to me once as well.    No options were changed, no gear was deselected (I think all I did was add an item I had forgotten to mark available) but the optimiser came back with a marginally lower score.  The optimiser was set to maximum thoroughness in all cases.   It was such a small difference that I didn't worry about it but I have seen it happen once (out of many, many, many times optimising).\r\n\r\n",
      "PostedDate": "2009-11-26T13:58:00.447-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-11-26T15:02:40.39-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Everything is marked as available\r\nAnd I always use maximum thoroughness.",
      "PostedDate": "2009-11-27T11:04:10.703-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Only thing I can come up with is that i'm 4 hit points overcapped currently and that would put be exactly at 264 since I'd lose 4 hit points.",
      "PostedDate": "2009-11-27T11:06:31.19-08:00",
      "Id": -2147483648
    },
    {
      "Message": "There isnt a guarantee that the optimizer will find a better gear selection than  the one currently on the user. It does seem like a lot of people get ocnfused by this. When RAWR optimizes gear, while it does look at many combinations its not possible for it to look at them ALL.  \r\n\r\nOne easy fix for this problem is to look at the rating your character has at the bottom of the screen. Then when you go into the optimizer, add a  filter that says Rating >= (your current rating).  It doesnt meant that it will come up with a better rating, but it does mean that it wont recommend a lower score. In fact if it can't beat the current score it will say that one or more conditions you set could not be met.",
      "PostedDate": "2009-12-08T13:07:55.947-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-12-25T23:05:35.65-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:31:42.88-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:23:16.243-07:00",
      "Id": -2147483648
    }
  ]
}