{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.HealPriest",
      "DisplayName": "Rawr.HealPriest"
    },
    "ClosedComment": "Old issue.",
    "ClosedDate": "2009-08-08T06:51:38.173-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "From EJ thread:\n \nI double checked to make sure that Rawr has all of my gemming, enchanting, and items correct. I also double checked the listed values of Spirit and +Heal for all pieces of gear I am wearing to see if they are accurate and they are. With no buffs, Rawr reports my healing as 2418 while I have 2420 on the live server. Rawr lists 615 spirit, WoW lists 622.\n \nChanging my race from Night Elf to Human increases my Spirit to 638 in Rawr. The Human Spirit applies to total spirit and not just base spirit.\n \nUnbuffed, my character sheet lists my Holy spell crit as 11.66% while Rawr lists 12.30%\n \nUnbuffed, I have 10500 mana. Rawr lists 9930.\n \nMy character sheet lists 717 oFSR, 257 iFSR. Rawr lists 711 and 255.\n \nSince the base stats are wrong, all the derived calculations are going to be wrong as well. It also doesn't seem to place all that much emphasis on Regen. The \"Time in FSR\" slider doesn't really do much since time to OOM doesn't seem to be modeled yet. Redeemer's Alchemist Stone is listed as worse than Essence of the Martyr since it doesn't seem to have the regen portion modeled.",
    "LastUpdatedDate": "2013-05-16T05:27:07.423-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2008-07-28T10:22:37.97-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[HealPriest] Calculations Slightly Off",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 10805
  },
  "FileAttachments": [],
  "Comments": []
}