{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.ProtPaladin",
      "DisplayName": "Rawr.ProtPaladin"
    },
    "ClosedComment": "Closing because the issue should be resolved in the latest release.  If there are any further problems, create a new issue.",
    "ClosedDate": "2012-02-21T05:08:56.74-08:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "I have seen a few threads here that comment on a problem with the Prot Pally build.  I am getting a discrepancy between Rawr and my character screen with dodge, parry and block.  Below is a simple comparison;\n \nStat           Character screen            Rawr\nDodge           17.26%                      16.96%\nParry             17.54%                      16.83%\nBlock             62.42%                      61.82%",
    "LastUpdatedDate": "2013-05-16T05:17:04.69-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2012-02-01T12:47:10.387-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "Prot Pally dodge/parry/block discrepancy",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 22148
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Rawr includes diminishing returns and the 0.6% boss-level reduction.",
      "PostedDate": "2012-02-01T12:50:52.52-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Also, Rawr includes procs such as Windwalk and trinkets that are not on-use in its displayed stat totals currently.",
      "PostedDate": "2012-02-01T19:39:52.447-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Thanks, if that's the case wouldn't the % be higher in rawr with the procs?  Meaning I should be hitting ctc coverage in rawr before I hit it in wow's character sheet.",
      "PostedDate": "2012-02-03T04:31:32.84-08:00",
      "Id": -2147483648
    },
    {
      "Message": "It depends on what the average value of the proc comes out to be.  Because of the 0.6% boss-level reduction and diminishing returns, the proc has to be worth a pretty good chunk of avoidance in order for it to increase the value in Rawr versus the in-game stats.",
      "PostedDate": "2012-02-03T07:43:41.99-08:00",
      "Id": -2147483648
    },
    {
      "Message": "set trinket \"on use\" to ignore, take of windwalk, and set the boss level to 85 in the boss options and it will match what it is in the game.  Proc'd trinket effects aren't ignored, I usually just change them to on-use effects to do my CTC capping.",
      "PostedDate": "2012-02-07T00:05:58.843-08:00",
      "Id": -2147483648
    },
    {
      "Message": "I usually just take mine off.  I'm actually currently working on splitting it out so you can optimize based on \"static\" CTC but the procs still have value.  It's a challenging problem.",
      "PostedDate": "2012-02-07T05:11:07.733-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2012-02-08T09:28:32.523-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Thanks for the reply's.  Is it necessary to cover the ctc vs. a level 87 raid boss?  I mean I am currently capped in the game character screen, and if I understand it correctly I am capped against a lvl 85.  Or does the game screen take into account 87 bosses?",
      "PostedDate": "2012-02-08T15:29:25.25-08:00",
      "Id": -2147483648
    },
    {
      "Message": "If you cap against 102.4% combat table coverage, then you are covered against level 88 raid bosses.  Rawr will show you at 100% combat table coverage if you are capped versus whatever level boss you selected in the boss handler, which defaults to a raid boss of level 88.  Again, for the current version, remember to take off any avoidance/mastery procs before you check your combat table coverage.",
      "PostedDate": "2012-02-08T16:36:57.603-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2012-02-21T05:08:56.74-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:23:48.377-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:17:04.69-07:00",
      "Id": -2147483648
    }
  ]
}