{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.ShadowPriest",
      "DisplayName": "Rawr.ShadowPriest"
    },
    "ClosedComment": "This behaviour is normal.The stats weight chart is dynamic, it doesn&#39;t list a specific set of stats, but rather works off all the available &#40;additive&#41; stats that are considered relevant for the model and it calculates DPS difference for each individual one.  The top 10 are listed.If haste &#40;or any other stat for that matter&#41; &#39;falls off&#39;, it simply means that for your specific gearing and fight parameters that particular stat doesn&#39;t make it to the top 10 anymore.Haste is a bit of a special case in this since haste doesn&#39;t guarantee a smooth curve as you get more of it.  Sometimes, more haste will model to being lower DPS because of changes in rotation.Similarly, something like hit is probably going to be on top of everything until you reach the hitcap at which point it becomes 0 value, and likely drops off.",
    "ClosedDate": "2010-04-26T05:25:40.4-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "Hello lovely Rawr staffers,\n \nSo I equipped a Valanar's Other Signet Ring today and then checked my relative stat weights and....my Haste stat on the list had completely disappeared. It was just fine before I equipped the ring (was sitting at: 2.0 spellpower, 1.45 haste, 1.45 crit) and then post-change it's completely gone from the user interface end. It does appear that Rawr is still valuing the haste correctly in the item calculations - I just can't see it in the stat weight lists. I've tried saving and closing, logging back in and no go. What's odd is that if I make a minor change to the haste rating on my gear - i.e, I changed the gem in my neck from a 12 sp/10 haste to a 12 sp/10 hit or 12 sp/10 crit  - haste instantly pops back up on the stat list. If you change the gem BACK to 12 sp/10 haste, haste then disappears again from the list.\n \nI've attached my .xml file - enjoy  ;)  and thank you! I've also tested this on the new Rawr3 and it behaves the same way for my current setup.",
    "LastUpdatedDate": "2013-05-16T05:20:52.977-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2010-04-25T23:54:12.28-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[ShadowPriest] Haste stat sometimes disappears from visible weights",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 17422
  },
  "FileAttachments": [
    {
      "FileId": 3433,
      "FileName": "Coin.xml",
      "DownloadUrl": ".\\3433"
    }
  ],
  "Comments": [
    {
      "Message": "Just want to add that it probably wont directly lower your dps, it just wont directly improve it. And yeah, this happens from time to time.",
      "PostedDate": "2010-04-26T09:48:31.333-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-09-05T14:19:27.693-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-03-17T20:57:46.357-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:28:38.823-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:20:52.977-07:00",
      "Id": -2147483648
    }
  ]
}