{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "",
    "ClosedDate": "2011-06-26T21:19:29.79-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "Don't know if its just me or not, but I can't seem to get the filter by source item filters to work. I've unchecked t11, t12, pvp, baradin hold, and special currency and am still seeing those items in the equipment list. I've even gone so far as to click the uncheck all button at the top which unchecks all filters and should only leave my equipped items in the equipment list, but it still shows everything. The other item filters such as by item type, profession. bind type, drop rate, and item level all seem to work alright.\nI've tried this on two different computers, resetting all caches, and loading several toons from the b.net armory with the same results.\n \nAlso, as a separate issue. I noticed that the few pvp items I've looked at that are purchasable with conquest points seem to have the point type set to honor and point cost set to 0, and then the token field is set to conquest with a token count of however many conquest points are required to buy that item.",
    "LastUpdatedDate": "2013-05-16T05:17:46.983-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2011-06-23T10:21:39.65-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Item Filters] Filter by Source + PvP conquest point items",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 21016
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "As for your second point, there was an update to how we handle PvP tokens and all of the old Tokens were moved to the non-drop down field. I'm in the process right now of updating that (and updating the point costs for 4.2. As for the first part we can probably set it up so that the filtering system does an \"exclusive or\" set up (,meaning if T11 is unchecked but ilvl 359 is checked, we would treat both as turned off). Thoughts on the idea?",
      "PostedDate": "2011-06-23T11:39:39.887-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Actually, I need to brush up on my Logical Connectives.....Just and AND function should work.",
      "PostedDate": "2011-06-23T11:47:25.86-07:00",
      "Id": -2147483648
    },
    {
      "Message": "I can't reproduce this. If I click uncheck all I don't see anything in the list. Can you be a bit more specific about how to reproduce this or provide a character file where this happens? Which version of Rawr are you using?",
      "PostedDate": "2011-06-23T13:33:21.987-07:00",
      "Id": -2147483648
    },
    {
      "Message": "So.. uh.. yeah. Apparently its working just fine now. I did try a fresh reload of the page before I tested today, so maybe I just had old data in my browser cache that wasn't cleared out when I reloaded the rawr caches yesterday.\r\n",
      "PostedDate": "2011-06-24T10:27:20.01-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-06-24T11:46:37.063-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-06-26T21:19:29.79-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:24:48.283-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:17:46.983-07:00",
      "Id": -2147483648
    }
  ]
}