{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Base.Optimizer",
      "DisplayName": "Rawr.Base.Optimizer"
    },
    "ClosedComment": "Feature added in v2.20",
    "ClosedDate": "2009-03-26T10:11:37.61-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "I don't know how exactly Rawr works but obviously it needs to calculate an internal rating of some kind to sort Items in the \"Comparisons\" window. I'd like to see the ratings for all stats on an additional tab (or on the \"Stats\" tab or on any other tab).\n \nWhy?\nI like using Rawr - a lot! It's a great tool to optimize ones gear. But it lacks the possibility to compare items in game. Whenever a raid boss drops an item or whenever I get a new cool quest reward I have to alt-tab to Rawr and look up those items in the gear column.  Whenever I have to decide between two epic items on different slots (i.e. at the emblem vendor) I have to check two different gear columns and have to calculate their respective DPS gain. What I'd like is to compare items in game.\nMy preferred addon to do so is \"Pawn\". Normally I'd just use one of the Elitist Jerk's spreadsheets to generate a character specific rating but since Vontre's spreadsheet isn't up to date any more and since Vontre's Magegraf doesn't work for me (and neither does show any ratings like the spreadsheet did) I - as a mage - am having a hard time to calculate an accurate rating of stats to put into my Pawn string. \n \nI'd like to use the rating Rawr uses for his comparisons as I am convinced that I'm not capable of calculating a nearly as accurate rating as Rawr does. Please display it somewhere in Rawr. (And if you find the time you could copy a Pawn string to the clipboard too.)",
    "LastUpdatedDate": "2013-05-16T05:26:44.713-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2008-12-03T04:38:12.02-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "Show ratings for stats",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 3,
    "Id": 11837
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "As I realize now this is kind of a duplicate entry to http://www.codeplex.com/Rawr/WorkItem/View.aspx?WorkItemId=11226",
      "PostedDate": "2008-12-03T06:23:02.62-08:00",
      "Id": -2147483648
    },
    {
      "Message": "No, Rawr doesn't use internal weight scales, it actually calculates the real value of each item individually. Estimated relative stat values can be calculated for use in addons and wowhead, but keep in mind that they are just estimates, and change drastically with each piece of gear, buff, talent, etc. Most models have a Relative Stat Values or Item Budget or some such chart, to display these values.\r\n\r\nAgain, note that Rawr does not use these internally to calculate values of any items/enchants/etc, these are only a result of those calculations.",
      "PostedDate": "2008-12-03T10:57:37.18-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Ok, Rawr doesn't use internal weight scales (I'm a little bit surprised) but it could calculate some? Would this mean a drastic change in source code? Is it hard to implement such a feature?\r\n\r\nIf not I'd really like to see it (ideally with a \"copy to clipboard\" feature for Pawn strings).\r\nI am well aware that scales in Pawn can only be approximations to what Rawr does and I'm aware that these scales change with every item or buff (or even debuff) I get. But that's the same with Rawr and that's why I like Rawr: cause it calculates as accurate as possibly and much more accurate as I could do it _every time_ an item changes. I'd just like to have a handy way of comparing items in game with each other. And Pawn is the best choice for that as far as I have found out.",
      "PostedDate": "2008-12-04T01:18:34.83-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2008-12-04T02:09:12.753-08:00",
      "Id": -2147483648
    },
    {
      "Message": "No, it's not a big change; like I said, most models already do this. I don't know what model you're using, so don't know if yours has it, but most do. Look in the list of charts, near the bottom, for 'Relative Stat Values' or 'Item Budget', or something like that.\r\n\r\nWe're working on making it a core Rawr feature, so it's standardized across all models, but that'll be a future release.",
      "PostedDate": "2008-12-04T09:30:22.713-08:00",
      "Id": -2147483648
    },
    {
      "Message": "As a mage I'm using the mage model and... well, yeah... I just found the entry \"Item Budget\" in the drop down list. I'm sorry I didn't see that before. This is exactly what I was looking for, thanks! You may close this issue if you want to. :-)\r\n\r\n(The rating is almost identical to the one I'm using right now. I don't understand the hit rating though. But that's probably something to discuss.)",
      "PostedDate": "2008-12-05T02:19:18.737-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-01-09T04:48:01.113-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-03-26T10:11:37.61-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-09-09T16:03:17.383-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:36:10.59-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:26:44.713-07:00",
      "Id": -2147483648
    }
  ]
}