{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Base",
      "DisplayName": "Rawr.Base"
    },
    "ClosedComment": "Closing this for now. If you manage to repro the error, reopen this ticket with the details and the character file",
    "ClosedDate": "2011-06-05T16:37:29.58-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "A rather small thing, but if the BS socket for a belt is not checked, and the equipped belt is indeed gemmed including a buckle, Rawr throws an error over it. If the buckle were checked by default, or an end-user notification given, might help you guys as well as us.\n \nFor now I'll assume (!) that this is an easily reproduced error. I'm happy to throw on my file and error if you wish.",
    "LastUpdatedDate": "2013-05-16T05:17:50.073-07:00",
    "PlannedForRelease": "Rawr 4.1.05.1",
    "ReleaseVisibleToPublic": true,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2011-06-04T00:41:58.827-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Base] Arg_IndexOutOfRangeException",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 20907
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Are you saying you loaded your character in and it didn't flag it? That would be a problem. If you set your character up manually and didn't check it yourself you shouldn't have been able to select the belt like that, which would also be a problem. If you had it set, selected a belt with the additional gem and then unchecked it, that would be you messing with it.\r\n\r\nWhich was it?",
      "PostedDate": "2011-06-04T22:29:30.39-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-06-04T22:29:51.547-07:00",
      "Id": -2147483648
    },
    {
      "Message": "I loaded the toon up with Rawr's addon code (which is awesome, btw). I have two Wind Stalker belts of different suffixes, both socketed and gemmed. I'm not sure which one I was wearing when I loaded the addon code. I do recall that I had to add one as available; the addon didn't pick up on it.\r\n\r\nI didn't change any equipped gear in Rawr before trying to Optimize. It was after the error, coming here to read what might have caused the error, and going back to look over what I had that I noticed the second gem on the belt was faded. Checked the BS socket option, and optimizer ran just fine then.\r\n\r\nNow I wish I'd saved the file that threw the error. I've switched out my gear now and it probably wouldn't come up the same.",
      "PostedDate": "2011-06-05T04:04:32.52-07:00",
      "Id": -2147483648
    },
    {
      "Message": "And of course it won't do it now, when I'm trying. So much for easily reproduced. If it happens again I'll be sure to nail down all the info I can.",
      "PostedDate": "2011-06-05T04:10:29.417-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-06-05T16:37:29.58-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:24:52.943-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:17:50.073-07:00",
      "Id": -2147483648
    }
  ]
}