{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "Import from Wowhead feature now exists in base code.",
    "ClosedDate": "2009-07-20T12:29:45.36-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "I wrote this up while trying to break Rawr, and it worked very well! :-P\n \nThis Excel sheet will allow you to take item lists from http://www.wowhead.com/?items and import them in bulk into Rawr's ItemCache.xml file.  Instructions for use are on the first page of the Excel file, and I've tried to make them as understandable as possible, however some basic computer knowledge will be needed to move the data from Excel to Rawr.\n \nBe very well advised - I have caught no end of crap from Astrylian for using this tool to break Rawr - if you break Rawr with this, you are probably not going to get much sympathy from the developers :-)\n \nAs of this writing, I'm releasing it to the public for use ONLY in importing new items into Rawr when new items are released via WoW patches.  WoWHead has a filter for showing items that are new in the latest patch, so you can use that filter for importing items that Rawr doesn't have in the base list that's released on updates of the beta.  REALLY new items available from boss drops, while in WoWHead, will not be on the Armory - as Rawr uses the Armory for getting updated item information, you will probably need to update item stats by hand for the really juicy items.  This tool will allow you however to bulk-import all of those items (their type, slot, name, and ItemID) into Rawr in the first place, and will reduce the typing considerably.\n \nI will continue working on an excel tool to bulk-import item stats into the database, so you don't need the wow armory for full item validation.",
    "LastUpdatedDate": "2013-05-16T05:27:15.967-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2008-05-21T11:25:19.317-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "Excel Tool for importing WoWHead item search results into Rawr.",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 10220
  },
  "FileAttachments": [
    {
      "FileId": 987,
      "FileName": "wowhead_tool.zip",
      "DownloadUrl": ".\\987"
    }
  ],
  "Comments": []
}