{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Warlock",
      "DisplayName": "Rawr.Warlock"
    },
    "ClosedComment": "",
    "ClosedDate": null,
    "CommentCount": 0,
    "Custom": null,
    "Description": "All theorycrafting on Affliction Warlocks right now says Haste is more valuable than crit and mastery, and is nearly as valuable as hit, at all gear levels.\nBut Rawr seems to insist crit is greater than haste. When normalized against the value of Int, haste in Rawr is worth around half what it should be.\n \nUntil this can be fixed, I would consider Rawr unsafe for gear choices for Affliction Warlocks.\nI know you've got a lot on your plate, and not much time to do it in, with the pet damage, execution phase, cooldowns like Demon Soul and Doomguard, and Bane of Doom imps needing work, but those don't seem like they'd effect gear values nearly as much as this haste issue.\n \nMy hunch is the problem has something to do with the change from Wrath's \"Always let dots fall off before refreshing\" to Cata's \"Never let dots fall off before refreshing\", and maybe the partial ticks from the end of each cast aren't being accumulated properly. All the cast times and durations seem to be correct in the info pane.\n \n[attached: lucifel.xml]",
    "LastUpdatedDate": "2013-02-21T18:24:31.863-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2011-07-27T03:10:45.113-07:00",
    "Status": {
      "Name": "Proposed",
      "Id": 1
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Warlock][4.2.2.0] Affliction; Haste very undervalued",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 21240
  },
  "FileAttachments": [
    {
      "FileId": 5201,
      "FileName": "Lucifel.xml",
      "DownloadUrl": ".\\5201"
    },
    {
      "FileId": 5445,
      "FileName": "dps.png",
      "DownloadUrl": ".\\5445"
    },
    {
      "FileId": 5446,
      "FileName": "Lucifel427.xml",
      "DownloadUrl": ".\\5446"
    }
  ],
  "Comments": [
    {
      "Message": "As of 4.2.7, Haste is still not evaluated right for Affliction warlocks.\r\nLooking at the Stats/DPS graph with my character, haste is way too shallow until about +81 or+82 haste from current; At that point, a single additional Haste point shows a jump of over 600 DPS. There's a similar down-jump at around -200ish from current.\r\nThis isn't how Haste behaves in practice. Compare it to the stats graph SimCraft gave me for the same gear. <dps.png>\r\n\r\nThe lock dev seems like he might be MIA. Can another dev who's smoothed out Haste on other models take a look? Because in its current state, Rawr isn't safe to use for affliction warlocks at all.",
      "PostedDate": "2011-11-17T10:41:45.997-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-11-17T10:42:17.68-08:00",
      "Id": -2147483648
    },
    {
      "Message": "<Adding latest character file>",
      "PostedDate": "2011-11-17T10:42:19.11-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:24:31.863-08:00",
      "Id": -2147483648
    }
  ]
}