{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "",
    "ClosedDate": "2009-05-08T14:11:15.763-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "I find myself creating a half dozen variants of each item I'm interested in to see how all the items for that slot compare when socketed.  This is both fairly tedious and error prone as the combinations/permuation are large and often the right answer is not what you might guess because of shifting weightings on stats and the impact of socket bonuses.\n \nPlease consider auto generating some of the permutations of gear based on the presumed value of each color gem.  I would think less than a dozen permutations should be enough to find the right anwers even considering socket bonuses.  Right now I see there are options for socketing ALL gear with default gems, while that 's a start, its a very blind shotgun approach to finding the right stuff.",
    "LastUpdatedDate": "2013-05-16T05:27:29.813-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2008-03-17T05:02:57.653-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "Variant Gem Socketed Items",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 2,
    "Id": 9681
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "The gem system currently in use by Rawr is fully functional, so you can do whatever you want, with a bit of effort, and it's a balance between cluttering things up with tons of useless gemmings and being hard to compare different gemmings. But, as you said, it's far from ideal. We plan to revamp the gem system to be better in a number of ways, but we don't want to touch it at all until we've got a very clear plan of how to do it, because right now it's not bad, and it'd be really easy to screw up.",
      "PostedDate": "2008-03-17T08:22:05.97-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Fair enough.  It's certainly a very complication solution space with a vast number of options - and that's just on gemming.",
      "PostedDate": "2008-03-18T11:36:27.687-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Agreed. I want this. Probably need some options about conforming to socket rules, how many to generate, etc., but I find myself doing this all the time.",
      "PostedDate": "2008-03-27T13:12:37.5-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2008-03-27T13:12:52.017-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-05-08T14:11:15.763-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:37:08.01-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:27:29.813-07:00",
      "Id": -2147483648
    }
  ]
}