{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "Closing issue for failure to follow the Posting Guidelines",
    "ClosedDate": "2009-11-16T08:13:04.623-08:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "I am new to Rawr, so I probably just need some guidance. After importing my character from the armory, removing all buffs except racial and passive, my base stas do not match my character sheet. Am I doing something wrong? Or, not doing something that I should? Also, a suggestion. When I manually edit gear to add items, it would be nice if those items were automatically checked in the upgrade list, instead of having to add them, then go find them to check off. Any help is appreciated. Thanks for a great program.",
    "LastUpdatedDate": "2013-05-16T05:23:24.833-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2009-11-15T14:35:54.29-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "base stats don'match",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 14828
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "I cannot really help with the second part.\r\n\r\nFor the first part two things are happening.\r\na) The program automatically evaluates what your stats are based again a level 83 boss. if you want to make sure all stats match up set the target level to 80 (since that is what the game calculates against).\r\nb) if you have any trinkets or weapon/cloak/glove procs that add to your base stats (The Black Heart's 7056's Armor proc, Lightweave's Spellpower proc, Greatness \"Highest Stat\" proc, etc) those proc values will be averaged into your total stats. So say you have the Black Heart equipped, it will average that armor proc and add an extra 1k or so armor to your armor stat.",
      "PostedDate": "2009-11-15T20:04:13.2-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-11-16T08:13:04.623-08:00",
      "Id": -2147483648
    },
    {
      "Message": "For the second suggestion that you made, you can go to \"Currently Equipped Items/Buffs/Enchants\" comparison chart and click on them all if you really want to add them.  We don't want to add them willy-nilly, because people may be equipping them temporarily as a \"what-if\" scenario.",
      "PostedDate": "2009-11-16T19:22:35.82-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:31:49.293-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:23:24.833-07:00",
      "Id": -2147483648
    }
  ]
}