{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Base.Optimizer",
      "DisplayName": "Rawr.Base.Optimizer"
    },
    "ClosedComment": "",
    "ClosedDate": "2009-10-31T17:49:15.623-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "I'm trying to look into how to optimize some of the the items that I currently own, have them regemmed and such or re-enchanted; however when I get the results in the new  window my metagem is grayed out because  the way that the program is asking me to re-gem it isn't taking into consideratin my meta requirements.  Am I doing something wrong? I have checked the box on the first page asking to enforce gem requirments but still my metagem isn't taken into account.\n \nAnother problem that I have is that when I go to the Advance tab under the Options menu, there's an option called Arcane Cycles. I understood that this meant that the program was going to come back with some sort of spell rotation for optimal dps but every time I click on it the program crashes. I thought it was my laptop so i've tried it on my desktop but I have gotten the same result.  Will clicking Arcane Cycles advise me on my spell rotation or is it something different and, if it is, is it crashing only for me?\n \nOne last question, pls bear with me. When I did the optimization, another window showed up giving me two ratings: one for my current gear as-is and another cipher for the advised gear changes.  What does that mean?\n \nThanks in advance,\n \nCB",
    "LastUpdatedDate": "2013-05-16T05:24:02.867-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2009-10-04T11:06:05.01-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "[Optimizer] Meta Gem issues, the optimizer and more",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 2,
    "Id": 14331
  },
  "FileAttachments": [
    {
      "FileId": 2343,
      "FileName": "neb elemental.xml",
      "DownloadUrl": ".\\2343"
    }
  ],
  "Comments": [
    {
      "Message": "A) Sounds like you only have gems/items available where it couldn't possibly meet the metagem requirement. See the help topic on optimization for help with that.\r\n\r\nB) Arcane Cycles isn't crashing, it just really takes *that* long. It's not intended for normal users. You want to use the Cycle and Sequence values on the Stats tab.\r\n\r\nC) I guess I don't understand your last question. The optimizer gives you a comparison of before and after optimization, so you know what changed.",
      "PostedDate": "2009-10-04T12:39:07.597-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Astrylian,\r\n\r\nThank you for your quick answer. I went to double check my gear and I have 2 pieces that allowed me to fulfill the metagem requirement (2 blue gems). The new optimized version didn't include any blue gems, nor did it suggest swapping out the current metagem. It just left it gray.\r\n\r\nAbout my last question, I was wondering what the meaning is of the term \"score\" (it isn't \"rating\" --  I got confused). That  word appears before a number in the center of the window that is created after the optimization is completed for both my current  gear and the optimized version. Depending on the options I choose, sometimes the score numbers are close to each other (6900 versus 7000), other times the numbers are widely varied (-25 versus 5,000). That's what I was wondering about.\r\n\r\nI'll be awating any comments, Thanks in advance.\r\n\r\nCB",
      "PostedDate": "2009-10-04T13:38:08.45-07:00",
      "Id": -2147483648
    },
    {
      "Message": "You have blue sockets, but do you have any blue gems available to fill those sockets with?\r\n\r\nScore is whatever you were optimizing. Negative scores mean that you were that far under the optimization requirements.",
      "PostedDate": "2009-10-04T13:42:39.02-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Astrylian ,\r\n\r\nBut I do, my gear is currently gemmed adequatly in order to fulfill the meta. requirment.",
      "PostedDate": "2009-10-04T14:09:19.02-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Post your character file",
      "PostedDate": "2009-10-04T15:50:23.803-07:00",
      "Id": -2147483648
    },
    {
      "Message": "What you have equipped is not what you have available. Those are different things. You need to actually have some blue gems *available*, and items fully available to put them in, for the Optimizer to be able to gem them that way.\r\n\r\nSo yeah, post your character file, and we can point it out specifically to you.",
      "PostedDate": "2009-10-04T16:50:26.99-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-10-13T06:59:37.173-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Actually, when I optimize it suggests taking my blue gems out, inactivating my meta gem.",
      "PostedDate": "2009-10-13T07:02:44.947-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-10-13T07:02:49.347-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Which 99% of the time, that means you don't have Enforce Gem Requirements set",
      "PostedDate": "2009-10-13T08:14:37.39-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Ok, yes.  I had taken that option to enforce individual item gem requirements, not the meta gem.  Thanks much.",
      "PostedDate": "2009-10-13T09:16:10.747-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-10-31T17:49:15.623-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-09-08T16:00:23.65-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-09-09T16:03:17.383-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2011-03-17T20:21:12.76-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:32:39.51-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:24:02.867-07:00",
      "Id": -2147483648
    }
  ]
}