{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Rawr.Base.Optimizer",
      "DisplayName": "Rawr.Base.Optimizer"
    },
    "ClosedComment": "Old issue.",
    "ClosedDate": "2009-08-09T17:29:31.683-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "Here is the attached character I am running optimizer on. Thoroughness is maxed. Regem and reenchant are selected. I editted 1 item, the 180 strength darkmoon card: Greatness to 90strength, 85 agility due to the way feral gear is itemized. The current set is rated at 5539.813 DPS rating. The optimizer picks a set at 5519.471 consistently. Am I doing something wrong?",
    "LastUpdatedDate": "2013-05-16T05:26:19.207-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "Rawr",
    "ReportedDate": "2009-01-29T16:45:46.397-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "Optimizer selecting less than optimized set of gear 2.1.8",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 12506
  },
  "FileAttachments": [
    {
      "FileId": 1647,
      "FileName": "dps.xml",
      "DownloadUrl": ".\\1647"
    }
  ],
  "Comments": [
    {
      "Message": "Could it be because of the belt socket? The optimizer does not currently support that.",
      "PostedDate": "2009-01-29T16:57:11.793-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Does it still end up being the same? The number the Optimizer reports at the end does not include the value of the extra gem slots (ie, extra belt slot). Just a display issue on that message box.",
      "PostedDate": "2009-01-29T16:57:23.59-08:00",
      "Id": -2147483648
    },
    {
      "Message": "It's definitely not the same as it changes the ring to ring of collusion, along with a few other changes I can't remember off the top of my head. One interesting fact to note, though, is that I managed to get a higher score in one premutation after using the optimizer just by switching 2 gems around due to one socket bonus being superior to the other. \r\n\r\nAfter running the optimizer again, I got a score of 5517.416. I changed nothing. All I did was open up rawr and run optimizer. Equipping the set gives a score of 5533.874 to include the extra socket. \r\n\r\nA second run while wearing the gearset from the first optimizer run yielded a score of 5509.413, equipped it scored 5525.791. I have touched nothing between runs. So this is really confusing.",
      "PostedDate": "2009-01-29T22:41:14.683-08:00",
      "Id": -2147483648
    },
    {
      "Message": "A 3rd run with the 2nd run's set equipped yielded a score of 5510.93 equipped. I dont remember what optimizer said it would be. The score keeps going down and down.",
      "PostedDate": "2009-01-29T22:52:33.083-08:00",
      "Id": -2147483648
    },
    {
      "Message": "What happens if you remove any gems from belt buckles, bracers and glvoes before running optimizer?",
      "PostedDate": "2009-01-30T05:22:48.75-08:00",
      "Id": -2147483648
    },
    {
      "Message": "I think we fixed this in 2.1.9.",
      "PostedDate": "2009-01-30T08:40:18.693-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Ok, downloaded 2.1.9.2 and ran optimizer. Says gear found is 5468.757 vs equipped score of 5497.19. Actually equipped the optimized gear set gives a DPS rating of 5468.757. Running the optimizer again with the 5468.757 gear set yields a gear set of 5465.775. The decrease after every optimization run is still there. As a side note, any chance you could get expertise to work like how defense did? What I mean is that it was a stepwise scale with blizzard rounding. And if you could, and I know this has been suggested before, have avoided attacks or something, when hovered over, show the amount of rating away from the cap.",
      "PostedDate": "2009-01-30T18:48:53.15-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Well, it's not actually decreasing after every optimization. It sounds like you're missing something that you have equipped, not marked as available, so that after the first time, that gem/enchant/whatever isn't available anymore, so is lost. Beyond that, there's still some randomness to the optimizer, so I can see it finding a set with a couple less DPS sometimes. I expect if you keep trying it, it'll go up/down a bit more.",
      "PostedDate": "2009-01-30T19:10:58.337-08:00",
      "Id": -2147483648
    },
    {
      "Message": "I triple checked everything in the dropdown. All equipped items have been checked, gems, enchants as well. It should be the same character attached above. The only difference is that it uses the 2.1.9.2 item database so I didn't have to edit the greatness decks.",
      "PostedDate": "2009-01-30T20:07:52.373-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-08-09T17:29:31.683-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-09-09T16:03:17.383-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:35:37.097-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:26:19.207-07:00",
      "Id": -2147483648
    }
  ]
}